	///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает текущее состояние обмена данными для указанного узла плана обмена
//
//Параметры:
//	УзелКорреспондента - ПланОбменаСсылка - узел, для которого нужно получить состояние обмена.
//			 Пустое значение приравнивается к узлу центральной базы в плане обмена СинхронизацияАвтономныхКопий
//
//Возвращаемое значение:
//	Структура - см. НовыйСтуктураСостоянияОбмена()
//
Функция СостояниеОбмена(УзелКорреспондента = Неопределено, ВидТранспорта = Неопределено)  Экспорт
	
	Состояние = НовыйСтуктураСостоянияОбмена(УзелКорреспондента);
	
	// Чтение состояния из регистра
	ЗаполнитьСостояниеИзРегистра(Состояние);
	
	Если ВидТранспорта = Неопределено Тогда
		
		Если Состояние.Режим = "ЦентрМобильных" Тогда
			ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(
						Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
			ИспользоватьДомашнююСеть = Не ПараметрыДомашняяСеть.ЗапретитьИспользование;
				
			СвойстваАккаунта = Неопределено;
			ОблачныйПровайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
			ПараметрыОблачногоХранилищаФайлов = 
						Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(
							Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(ОблачныйПровайдер), 
							Истина);
			
			ИспользоватьФайловыйСервис = Не ПараметрыОблачногоХранилищаФайлов.ЗапретитьИспользование;
			
			Если ИспользоватьДомашнююСеть Тогда
				ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WS;
			ИначеЕсли ИспользоватьФайловыйСервис Тогда
				ВидТранспорта = СинхронизацияАвтономныхКопий.ВидТранспортаПоПровайдеру(ОблачныйПровайдер);
			Иначе
				ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE;
			КонецЕсли;
			
		Иначе
			ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WS;
		КонецЕсли;
		
	КонецЕсли;
	
	Состояние.ТекущийВидТранспорта = ВидТранспорта;
	
	ОбновитьОбщиеСвойстваСостоянияПроцессов(Состояние, Истина);
	
	Возврат Состояние;
	
КонецФункции

Функция НовыйСтуктураСостоянияОбмена(УзелКорреспондента = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Режим", ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения());
	ИмяПланаОбмена =  ?(Результат.Режим = "ЦентрМобильных", "МобильноеПриложение", "СинхронизацияАвтономныхКопий");

	Если Не ЗначениеЗаполнено(УзелКорреспондента) Тогда
		УзелКорреспондента = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы(ИмяПланаОбмена);
	КонецЕсли;

	Результат.Вставить("УзелКорреспондента", УзелКорреспондента);
	СвойстваУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УзелКорреспондента, "Код,НомерПринятого,НомерОтправленного");
	Результат.Вставить("КодУзлаКорреспондента", СвойстваУзла.Код);
	Результат.Вставить("НомерПринятого",        СвойстваУзла.НомерПринятого);
	Результат.Вставить("НомерОтправленного",    СвойстваУзла.НомерОтправленного);
	Результат.Вставить("ИмяПланаОбмена",        ИмяПланаОбмена);
	
	Результат.Вставить("КлючЖурнала",    "Обмен данными." + Метаданные.ПланыОбмена[ИмяПланаОбмена].Синоним + ".");
	
	// состояние этой базы
	ЭтотУзел = СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел(ИмяПланаОбмена);
	Результат.Вставить("ЭтотУзел", ЭтотУзел);
	Результат.Вставить("ТекущийВидТранспорта", Неопределено); // вид транспорта, используемый в текуший момент
	Результат.Вставить("ЭтоЦентральнаяБаза", Результат.Режим = "ЦентрМобильных" Или Результат.Режим = "Разделенный"); 
	
	// Основные параметры обмена
	Результат.Вставить("СценарийОбмена", Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных);
	Результат.Вставить("НомерДляУстановленногоСценария", 0);
	
	// состояние приема данных
	Результат.Вставить("Прием", НовыйСтруктураПроцессаОбмена());

	// состояние передачи данных
	Результат.Вставить("Передача", НовыйСтруктураПроцессаОбмена());
	
	// Статус транспорта
	Результат.Вставить("СтатусТранспорта", Новый Структура);
	Результат.СтатусТранспорта.Вставить("КодСостояния",      0);
	Результат.СтатусТранспорта.Вставить("ТекстОшибки",       "");
	Результат.СтатусТранспорта.Вставить("ПоследняяПроверка", Дата(1,1,1));
	Результат.СтатусТранспорта.Вставить("СоединениеНастроено", Ложь);
	Результат.СтатусТранспорта.Вставить("ОшибкиНастройкиСоединения", "");
	Результат.СтатусТранспорта.Вставить("ДомашняяСетьИспользуется", Ложь);
	Результат.СтатусТранспорта.Вставить("ФайловоеОблакоИспользуется", Ложь);
	Результат.СтатусТранспорта.Вставить("СоединениеСФайловымОблакомНастроено", Ложь);
	Результат.СтатусТранспорта.Вставить("Провайдер", Неопределено);
	
	// состояние сервера
	Если Результат.Режим = "КлиентОблака" Тогда
		Результат.Вставить("СостояниеСервера", Неопределено); // заполняется статусом, полученным с сервера
	КонецЕсли;
	
	// общее состояние процесса
	Результат.Вставить("ПроцессАктивен",            Ложь);
	Результат.Вставить("ТекстСостояния",            НСтр("ru='не выполняется'"));
	Результат.Вставить("ЗавершенСОшибками",         Ложь);
	Результат.Вставить("ЗавершенСПредупреждениями", Ложь);
	Результат.Вставить("ИспользоватьСинхронизацию", ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных"));
	Результат.Вставить("ПриостановитьАвтосинхронизацию", Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить());
	Результат.Вставить("СтруктураПредставления",    Неопределено);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСостояниеИзРегистра(Состояние) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.СостоянияПроцессовОбменаДанными.СостояниеПроцессаДляУзла(Состояние.УзелКорреспондента, 
				Перечисления.ПроцессыОбменаДанными.Прием);
	ЗаполнитьЗначенияСвойств(Состояние.Прием, ЗаписьРегистра);
	
	ЗаписьРегистра = РегистрыСведений.СостоянияПроцессовОбменаДанными.СостояниеПроцессаДляУзла(Состояние.УзелКорреспондента, 
				Перечисления.ПроцессыОбменаДанными.Передача);
	ЗаполнитьЗначенияСвойств(Состояние.Передача, ЗаписьРегистра);

	ЗаписьРегистра = РегистрыСведений.СостоянияПроцессовОбменаДанными.СостояниеПроцессаДляУзла(Состояние.УзелКорреспондента, 
			Перечисления.ПроцессыОбменаДанными.ПустаяСсылка());
	Состояние.СтатусТранспорта.КодСостояния      = ЗаписьРегистра.КодРезультатаДействия;
	Состояние.СтатусТранспорта.ТекстОшибки       = ЗаписьРегистра.ТекстОшибки;
	Состояние.СтатусТранспорта.ПоследняяПроверка = ЗаписьРегистра.ЗавершениеДействия;
	
КонецПроцедуры

Процедура ЗаписатьСостояниеВРегистр(СостояниеОбмена, Процесс = Неопределено) Экспорт
	
	ОбновитьПредставлениеВСостоянииПроцесса(СостояниеОбмена, Процесс);
	
	
	Если Процесс = "Передача" Или Не ЗначениеЗаполнено(Процесс) Тогда
		СостояниеОбмена.Передача.ВидТранспорта = СостояниеОбмена.ТекущийВидТранспорта;
		РегистрыСведений.СостоянияПроцессовОбменаДанными.ОбновитьСостояниеПроцессаДляУзла(
			СостояниеОбмена.УзелКорреспондента, 
			Перечисления.ПроцессыОбменаДанными.Передача, 
			СостояниеОбмена.Передача);
	КонецЕсли;

	Если Процесс = "Прием" Или Не ЗначениеЗаполнено(Процесс) Тогда
		СостояниеОбмена.Прием.ВидТранспорта = СостояниеОбмена.ТекущийВидТранспорта;
		РегистрыСведений.СостоянияПроцессовОбменаДанными.ОбновитьСостояниеПроцессаДляУзла(
				СостояниеОбмена.УзелКорреспондента, 
				Перечисления.ПроцессыОбменаДанными.Прием, 
				СостояниеОбмена.Прием);
	КонецЕсли;
	
	ЗаписатьСтатусТранспортаВРегистр(СостояниеОбмена);
	
	ОбновитьОбщиеСвойстваСостоянияПроцессов(СостояниеОбмена, Ложь);
	
КонецПроцедуры

// Переводит состояние автомата в начальное состояние
//
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//
Процедура СброситьСостояние(СостояниеОбмена, Процесс = Неопределено) Экспорт
	
	ВидТранспорта = ?(ЗначениеЗаполнено(СостояниеОбмена.ТекущийВидТранспорта), СостояниеОбмена.ТекущийВидТранспорта,
				Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	
	Если Не ЗначениеЗаполнено(Процесс) Тогда
		
		СостояниеОбмена = ПроцессыОбменаСлужебный.НовыйСтуктураСостоянияОбмена(СостояниеОбмена.УзелКорреспондента);
		СостояниеОбмена.ТекущийВидТранспорта = ВидТранспорта;
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, Неопределено);
		РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, Неопределено);
	
	ИначеЕсли Процесс = "Прием" Тогда
		
		СостояниеОбмена.Прием = НовыйСтруктураПроцессаОбмена();
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, Неопределено);
		
	ИначеЕсли Процесс = "Передача" Тогда
		
		СостояниеОбмена.Передача = НовыйСтруктураПроцессаОбмена();
		РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, Неопределено);
		
	КонецЕсли;
	
	ЗаписатьСостояниеВРегистр(СостояниеОбмена, Процесс);
	
КонецПроцедуры

// Делает отметку о начале выполнения действия обмена данными. При этом обнуляются результаты действия и 
// обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	НомерПакета - Число - номре отправляемого или получаемого пакета. Если Неопределено - не изменяется
//	КоличествоЧастей - Число - количество частей пакета к получению или отправке. Если Неопределено - не изменяется
//	НомерОбработаннойЧасти - Число - номер последней полученной или отправленной части пакета. Если Неопределено - не изменяется
//
Процедура ОтметитьНачалоДействия(СостояниеОбмена, знач Процесс, знач Действие, знач НомерПакета = Неопределено, 
								знач КоличествоЧастей = Неопределено, знач НомерОбработаннойЧасти = Неопределено, 
								знач ОбъектовВсего = Неопределено, знач ОбъектовОбработано = Неопределено, 
								ВидТранспорта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена(,ВидТранспорта);
	КонецЕсли;
	
	Если ТипЗнч(Действие) = Тип("Строка") Тогда
		Действие = Перечисления.ДействияПроцессовОбмена[Действие];
	КонецЕсли;
	
	СостояниеОбмена[Процесс].ПроцессЗавершен        = Ложь;
	СостояниеОбмена[Процесс].ДействиеПроцесса       = Действие;
	СостояниеОбмена[Процесс].КодРезультатаДействия  = 0;
	СостояниеОбмена[Процесс].НачалоДействия         = ТекущаяДатаСеанса();
	СостояниеОбмена[Процесс].ЗавершениеДействия     = Дата(1,1,1);
	СостояниеОбмена[Процесс].ТекстОшибки            = "";
	СостояниеОбмена[Процесс].ВидТранспорта          = СостояниеОбмена.ТекущийВидТранспорта;
	
	ОбновитьСтатистикуДействия(СостояниеОбмена, Процесс, НомерПакета, 
			КоличествоЧастей, НомерОбработаннойЧасти, ОбъектовВсего, ОбъектовОбработано);
	
	КлючЖР = СостояниеОбмена.КлючЖурнала + Процесс + "." + СостояниеОбмена[Процесс].ДействиеПроцесса;
	
	Если Процесс = "Передача" И Действие = Перечисления.ДействияПроцессовОбмена.Выгрузка
		Или Процесс = "Прием" И Действие = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
		// Отметки в регистрах БСП

		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы",    СостояниеОбмена.УзелКорреспондента);
		Если Процесс = "Передача" И Действие = Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
			СтруктураЗаписи.Вставить("ДействиеПриОбмене",   Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Иначе
			СтруктураЗаписи.Вставить("ДействиеПриОбмене",   Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
		КонецЕсли;
		СтруктураЗаписи.Вставить("ДатаНачала",                СостояниеОбмена[Процесс].НачалоДействия);
		УстановитьПривилегированныйРежим(Истина);
		РегистрыСведений.СостоянияОбменовДанными.ОбновитьЗапись(СтруктураЗаписи);
		
	КонецЕсли;
	
	
	ЗаписьЖурналаРегистрации(КлючЖР, УровеньЖурналаРегистрации.Информация, 
				Неопределено, СостояниеОбмена.УзелКорреспондента,
				СтрШаблон(НСтр("ru='Начало действия ""%1"" процесса ""%2"".
				|Структура состояния: 
				|%3'"), СостояниеОбмена[Процесс].ДействиеПроцесса, Процесс, ПредставлениеСостояния(СостояниеОбмена, " ")));
	
КонецПроцедуры

// Обновляет номера-количества в состоянии процесс и одновременно обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	НомерПакета - Число - номре отправляемого или получаемого пакета. Если Неопределено - не изменяется
//	КоличествоЧастей - Число - количество частей пакета к получению или отправке. Если Неопределено - не изменяется
//	НомерОбработаннойЧасти - Число - номер последней полученной или отправленной части пакета. Если Неопределено - не изменяется
//
Процедура ОбновитьСтатистикуДействия(Состояние, знач Процесс, знач НомерПакета = Неопределено, 
								знач КоличествоЧастей = Неопределено, знач НомерОбработаннойЧасти = Неопределено, 
								знач ОбъектовВсего = Неопределено, знач ОбъектовОбработано = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Состояние = СостояниеОбмена();
	КонецЕсли;
	
	Если НомерПакета <> Неопределено Тогда
		Состояние[Процесс].НомерПакета              = НомерПакета;
	КонецЕсли;
	Если КоличествоЧастей <> Неопределено Тогда
		Состояние[Процесс].Количество         = КоличествоЧастей;
	КонецЕсли;
	Если НомерОбработаннойЧасти <> Неопределено Тогда
		Состояние[Процесс].НомерОбработанного   = НомерОбработаннойЧасти;
	КонецЕсли;
	Если ОбъектовВсего <> Неопределено Тогда
		Состояние[Процесс].ОбъектовВсего   = ОбъектовВсего;
	КонецЕсли;
	Если ОбъектовОбработано <> Неопределено Тогда
		Состояние[Процесс].ОбъектовОбработано   = ОбъектовОбработано;
	КонецЕсли;
	
	ЗаписатьСостояниеВРегистр(Состояние, Процесс);
	
КонецПроцедуры

// Делает отметку о завершении действия обмена данными, устанавливая код состояния, текст ошибки и т.д. 
// При этом обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	КодРезультатаДействия - Число - код, соответствующий результату. см. ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий()
//	Ошибка - Строка - текст ошибки, если таковая возникла
//
Процедура ОтметитьЗавершениеДействия(СостояниеОбмена, знач Процесс, знач Действие, знач КодРезультатаДействия, знач Ошибка = "") Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();	
	Если ТипЗнч(Действие) = Тип("Строка") Тогда
		Действие = Перечисления.ДействияПроцессовОбмена[Действие];
	КонецЕсли;
	
	СостояниеОбмена[Процесс].ДействиеПроцесса       = Действие;
	СостояниеОбмена[Процесс].КодРезультатаДействия  = КодРезультатаДействия;
	СостояниеОбмена[Процесс].ЗавершениеДействия     = ТекущаяДатаСеанса();
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		СостояниеОбмена[Процесс].ТекстОшибки   = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		СостояниеОбмена[Процесс].ТекстОшибки   = Ошибка;
	КонецЕсли;
	
	Если КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
		
		Если Нрег(Процесс) = "прием" Тогда
			// процесс "Прием" всегда завершается после успешной загрузки данных
			СостояниеОбмена[Процесс].ПроцессЗавершен = Действие = Перечисления.ДействияПроцессовОбмена.Загрузка;
			
		ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда 
			// при обмене вручную процесс завершается после успешной выгрузки изменений
			СостояниеОбмена[Процесс].ПроцессЗавершен = Действие = Перечисления.ДействияПроцессовОбмена.Выгрузка;
			
		ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.Dropbox
				Или СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.GoogleDrive
				Или СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.ЯндексДиск Тогда
			 // при обмене через облачные файлохранилища обмен завершается после отправки выгруженного
			СостояниеОбмена[Процесс].ПроцессЗавершен = Действие = Перечисления.ДействияПроцессовОбмена.Отправка;
			
		Иначе
			// при обмене по http процесс завершен когда на сервере выполнена загрузка данных
			СостояниеОбмена[Процесс].ПроцессЗавершен = Действие = Перечисления.ДействияПроцессовОбмена.Загрузка;
			
		КонецЕсли;
		
	Иначе
		// завершение процесса по коду неуспеха
		СостояниеОбмена[Процесс].ПроцессЗавершен = ЗначениеЗаполнено(КодРезультатаДействия)
				И КодРезультатаДействия <> ВсеКоды.ПриемОжидаетЗавершенияПередачи.Код
				И КодРезультатаДействия <> ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код;
		
	КонецЕсли;
	
	ЗаписатьСостояниеВРегистр(СостояниеОбмена, Процесс);
	
	КлючЖР = СостояниеОбмена.КлючЖурнала + Процесс + "." + СостояниеОбмена[Процесс].ДействиеПроцесса;
	
	// Отметки в регистрах БСП
	Если СостояниеОбмена[Процесс].ПроцессЗавершен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
	
		Если Процесс = "Прием" Тогда
			ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
		Иначе
			ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
		КонецЕсли;
		
		Если КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
			РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено;
		ИначеЕсли КодРезультатаДействия = ВсеКоды.ОперацияОтменена.Код Тогда 
			РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Отменено;
		ИначеЕсли КодРезультатаДействия = ВсеКоды.НомерПакетаМеньшеИлиРавен.Код Тогда 
			РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Предупреждение_СообщениеОбменаБылоРанееПринято;
		Иначе
			РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка;
		КонецЕсли;
		
		// Отметка о завершении процесса в регистрах БСП
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("УзелИнформационнойБазы",    СостояниеОбмена.УзелКорреспондента);
		СтруктураЗаписи.Вставить("ДействиеПриОбмене",         ДействиеПриОбмене);
		СтруктураЗаписи.Вставить("РезультатВыполненияОбмена", РезультатВыполненияОбмена);
		СтруктураЗаписи.Вставить("ДатаНачала",                СостояниеОбмена[Процесс].НачалоДействия);
		СтруктураЗаписи.Вставить("ДатаОкончания",             СостояниеОбмена[Процесс].ЗавершениеДействия);
		РегистрыСведений.СостоянияОбменовДанными.ДобавитьЗапись(СтруктураЗаписи);
		
		Если КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
			// Отметка об успешном завершении процесса в регистрах БСП
			РегистрыСведений.СостоянияУспешныхОбменовДанными.ДобавитьЗапись(СтруктураЗаписи);
		КонецЕсли;
		
	КонецЕсли;
	
	Если КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
		УровеньЖР = УровеньЖурналаРегистрации.Информация;
	Иначе
		ОписаниеКода = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(КодРезультатаДействия);
		Если ОписаниеКода.ЯвляетсяОшибкой Тогда
			УровеньЖР = УровеньЖурналаРегистрации.Ошибка;
		Иначе
			УровеньЖР = УровеньЖурналаРегистрации.Предупреждение;
		КонецЕсли;
	КонецЕсли;
	ЗаписьЖурналаРегистрации(КлючЖР, УровеньЖР, 
				Неопределено, СостояниеОбмена.УзелКорреспондента,
				СтрШаблон(НСтр("ru='Завершение с кодом %1 действия ""%2"" процесса ""%3"".
				|Структура состояния: 
				|%4'"), 
				Формат(КодРезультатаДействия, "ЧДЦ=0; ЧГ=;"), СостояниеОбмена[Процесс].ДействиеПроцесса, Процесс, 
						ПредставлениеСостояния(СостояниеОбмена, "  "), ));
	
КонецПроцедуры

// Устанавливает код и текст ошибки для статуса транспорта и записывает информацию в регистр сведений
// 
//Параметры:
//	СостояниеОбмена - Структура с описанием текущего состояния обмена
//	КодСостояния - Число - код, соответствующий состоянию сервера или транспорта. 
//				см. ПроцессыОбменаПовтИсп.ВсеКодыСостоянийСервера()
//	Ошибка - Строка или ИнформацияОбОшибке - ошибка или дополнительная информация, о 
//				которой следует сообщить пользователю
//
Процедура ОтметитьСтатусТранспорта(СостояниеОбмена, КодСостояния, Ошибка) Экспорт
	
	СостояниеОбмена.СтатусТранспорта.КодСостояния = КодСостояния;
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		СостояниеОбмена.СтатусТранспорта.ТекстОшибки = КраткоеПредставлениеОшибки(Ошибка);
	Иначе
		СостояниеОбмена.СтатусТранспорта.ТекстОшибки = Ошибка;
	КонецЕсли;
	СостояниеОбмена.СтатусТранспорта.ПоследняяПроверка = ТекущаяДата();
	ЗаписатьСтатусТранспортаВРегистр(СостояниеОбмена);
	
	Если ЗначениеЗаполнено(КодСостояния) Тогда
		
		ОписаниеСостояния = ПроцессыОбменаПовтИсп.ОписаниеСостоянияПоКоду(КодСостояния);
		КлючЖР = СостояниеОбмена.КлючЖурнала + "Статус транспорта";
		Уровень = Неопределено;
		
		Если ОписаниеСостояния.ЯвляетсяОшибкой Тогда
			Уровень = УровеньЖурналаРегистрации.Ошибка;
		ИначеЕсли Не ОписаниеСостояния.ЯвляетсяУспехом Тогда
			Уровень = УровеньЖурналаРегистрации.Предупреждение;
		КонецЕсли;
		
		Если Уровень <> Неопределено Тогда
			ЗаписьЖурналаРегистрации(КлючЖР, Уровень, , ,
				СтрШаблон(НСтр("ru='Отмечен статус транспорта с кодом %1 - %2
				|Текст ошибки: ""%3""
				|
				|Структура состояния обмена:
				|%4'"), КодСостояния, ОписаниеСостояния.ТекстОписания, 
					СостояниеОбмена.СтатусТранспорта.ТекстОшибки,
					ПредставлениеСостояния(СостояниеОбмена, "  ")));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет загрузку изменений из пакета, записанного в РС ПакетыСинхронизацииПолученные или из указанного
// файла. Выполняет изменение состояния обмена для процесса Прием
//
Процедура ЗагрузитьПакетВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры, НомерПакета, ИмяФайла = Неопределено) Экспорт
	
	Узел         = СостояниеОбмена.УзелКорреспондента;
	ВсеКоды      = ДополнительныеПараметры.ВсеКодыРезультатов;
	ФайлИзЧастей = Не ЗначениеЗаполнено(ИмяФайла);
	
	ОтметитьНачалоДействия(СостояниеОбмена, "Прием", "Загрузка", НомерПакета, 0, 0, 0, 0);
	
	Ключ = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", Узел, Перечисления.ПроцессыОбменаДанными.Прием));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ключ);
	Исключение
		ТекстПредупреждения = СтрШаблон(НСтр("ru='Не удалось заблокировать запись узла ""%1"" для загрузки данных'"), Узел);
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		ВызватьИсключение ТекстПредупреждения;
	КонецПопытки;
	
	Если ФайлИзЧастей Тогда
		// пакет должен быть в РС ПакетыСинхронизацииПолученные
		СписокПакетов = РегистрыСведений.ПакетыСинхронизацииПолученные.ОчередьПакетовДляУзла(
							Узел, НомерПакета);
		Если Не ЗначениеЗаполнено(СписокПакетов) Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код,
					СтрШаблон("В регистре ПакетыСинхронизацииПолученные не найден пакет с номером %1 от узла ""%2""", 
							НомерПакета, Узел));
			РазблокироватьДанныеДляРедактирования(Ключ);
			Возврат;
		КонецЕсли;
		
		// Сборка файла из частей
		Попытка
			Если ИмяФайла = Неопределено Тогда
				ИмяФайла = ФайлПакетаИзЧастей(Узел, СостояниеОбмена.Прием.НомерПакета, СписокПакетов);
			КонецЕсли;
		Исключение
			ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", ВсеКоды.ОшибкаПрограммы.Код, 
					ИнформацияОбОшибке());
			РазблокироватьДанныеДляРедактирования(Ключ);
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	КоличествоОбъектов = 0;
	КодРезультата      = 0;
	ТекстОшибки       = "";
	
	// Проверка блокировки узла методами обмена БСП 
	Если Не СинхронизацияАвтономныхКопий.УзелДоступенДляОбмена(Узел) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Узел плана обмена ""%1"" заблокирован. Возможно, уже выполняется процесс обмена данными'"));
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ТекстОшибки);
		РазблокироватьДанныеДляРедактирования(Ключ);
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	СинхронизацияАвтономныхКопий.ПроверитьПолученныйФайлПередЗагрузкой(ИмяФайла, Узел, Ложь, Отказ, ТекстОшибки, Неопределено);
	Если Отказ Тогда
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", ВсеКоды.ОшибкаЧтенияПакета.Код, 
				ТекстОшибки);
		РазблокироватьДанныеДляРедактирования(Ключ);
		Возврат;
	КонецЕсли;
	
	Попытка
		СинхронизацияАвтономныхКопий.ЗагрузитьИзФайлаЧерезФормат(Узел, ИмяФайла, КоличествоОбъектов, 
					КодРезультата, СостояниеОбмена.Прием.НомерПакета);
		КодРезультата = ?(ЗначениеЗаполнено(КодРезультата), КодРезультата, ВсеКоды.Выполнено.Код);
		ОбновитьСтатистикуДействия(СостояниеОбмена, "Прием", , , , КоличествоОбъектов, КоличествоОбъектов);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КодРезультата = ?(ЗначениеЗаполнено(КодРезультата), КодРезультата, ВсеКоды.ОшибкаЧтенияПакета.Код);
	КонецПопытки;
	
	// Удаление временных файлов
	Если ФайлИзЧастей Тогда
		
		Попытка
			ФайлОбъект = Новый Файл(ИмяФайла);
			УдалитьФайлы(ФайлОбъект.Путь);
		Исключение
			// Обработка не требуется
		КонецПопытки;
		
		// Удаление пакета из загрузки
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(Узел, Неопределено);
		
	КонецЕсли;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", КодРезультата, 
			ТекстОшибки);
			
	РазблокироватьДанныеДляРедактирования(Ключ);
	
КонецПроцедуры

// Выгружает изменения в файл. Если не задано ИмяФайла, файл выгрузки 
// будет разделен на части и записан в РС ПакетыСинхронизацииКОтправке
//
Процедура ВыгрузитьИзмененияВЭтойБазе(Состояние, ДополнительныеПараметры, ИмяФайла = Неопределено) Экспорт
	
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(Состояние.УзелКорреспондента);
	Если Состояние.ЭтоЦентральнаяБаза 
		И (Не ПараметрыОбмена.Активность Или ПараметрыОбмена.СинхронизацияЗапрещена) Тогда
		ОтметитьЗавершениеДействия(Состояние, "Передача", "Выгрузка", ВсеКодыРезультатов.ОбменЗапрещен.Код);
		Возврат;
	КонецЕсли;
	
	НомерПакетаКОтправке = ПараметрыОбмена.НомерОтправленного + 1;
	ОтметитьНачалоДействия(Состояние, "Передача", "Выгрузка", НомерПакетаКОтправке, 0, 0, 0, 0);
	
	// блокировка ключевой записи процесса
	Ключ = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", Состояние.УзелКорреспондента, Перечисления.ПроцессыОбменаДанными.Передача));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ключ);
	Исключение
		ОтметитьЗавершениеДействия(Состояние, "Передача", "Выгрузка", 
				ВсеКодыРезультатов.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		ТекстПредупреждения = СтрШаблон(НСтр("ru='Не удалось заблокировать запись узла ""%1"" для выгрузки данных'"), 
					Состояние.УзелКорреспондента);
		ВызватьИсключение ТекстПредупреждения;
	КонецПопытки;

	// Удаление устаревших пакетов к отправке
	РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(Состояние.УзелКорреспондента, НомерПакетаКОтправке);
	
	// Вырузка в файл
	КоличествоОбъектов      = 0;
	ИмяФайлаСообщенияОбмена = ?(Не ЗначениеЗаполнено(ИмяФайла), ПолучитьИмяВременногоФайла(".xml"), ИмяФайла);
	Попытка
		СинхронизацияАвтономныхКопий.ВыгрузитьВФайлЧерезФормат(Состояние.УзелКорреспондента, ИмяФайлаСообщенияОбмена, КоличествоОбъектов);
		ОбновитьСтатистикуДействия(Состояние, "Передача", , , , КоличествоОбъектов, КоличествоОбъектов);
	Исключение
		ОтметитьЗавершениеДействия(Состояние, "Передача", "Выгрузка", ВсеКодыРезультатов.ОшибкаПрограммы.Код, ИнформацияОбОшибке());
		РазблокироватьДанныеДляРедактирования(Ключ);
		Возврат;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда 
		// Если ИмяФайла не задано, пакет делится на части и сохраняется в регистре
		Попытка
			ПодготовитьОтправкуПоЧастям(ИмяФайлаСообщенияОбмена, Состояние, НомерПакетаКОтправке);
		Исключение
			ОтметитьЗавершениеДействия(Состояние, "Передача", "Выгрузка", ВсеКодыРезультатов.ОшибкаПрограммы.Код, ИнформацияОбОшибке());
			РазблокироватьДанныеДляРедактирования(Ключ);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	ОтметитьЗавершениеДействия(Состояние, "Передача", "Выгрузка", ВсеКодыРезультатов.Выполнено.Код, "");
	РазблокироватьДанныеДляРедактирования(Ключ);
	
КонецПроцедуры

// Выполняет загрузку данных из файла без использования РС ПакетыСинхронизацииПолученные и выгружает в файл ответ
//так же без использования РС ПакетыСинхронизацииКОтправке.
// Используется для ручного обмена, например, когда недоступны никакие транспорты
//
//Параметры:
//	ИмяФайла - Строка - полный путь к файлу
//	Отказ - Булево - Устаналивается в Истина, в случае наличия ошибок загрузки или выгрузки
//	ОписаниеПроблемы - Строка - описание причины отказа (информация об ошибке)
//	ИмяФайлаОтвета - Строка - полное имя файла с ответной выгрузкой
//	
//
Процедура ВыполнитьОбменВРежимеРучногоОбменаФайлами(ИмяФайла, Отказ = Ложь, ОписаниеПроблемы = "", ИмяФайлаОтвета = "") Экспорт
	
	// Поскольку узел неизвестен, состояние будет получено после проверки файла
	Состояние = Неопределено;
	// Проверка файла и загрузка из него
	СообщенияЗагрузки = "";
	ВыполнитьЗагрузкуИзФайлаВРучномРежиме(ИмяФайла, Состояние, Отказ, СообщенияЗагрузки);
	ОписаниеПроблемы = СообщенияЗагрузки;
	Если Отказ Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(СообщенияЗагрузки) Тогда
		СообщенияЗагрузки = СтрШаблон(НСтр("ru='Загрузка файла: %1'"), СообщенияЗагрузки);
	КонецЕсли;
	
	// выгрузка данных в файл
	ОкончаниеФайла = Прав(ИмяФайла, 3);
	Если ОкончаниеФайла = "xml" Тогда
		ИмяФайлаОтвета = Сред(ИмяФайла, 1, СтрДлина(ИмяФайла) - 3) + "repl.xml";
	Иначе
		ИмяФайлаОтвета = ИмяФайла + ".repl.xml";
	КонецЕсли; 
	
	СообщенияВыгрузки = "";
	ВыполнитьВыгрузкуВФайлВРучномРежиме(ИмяФайлаОтвета, Состояние, Отказ, СообщенияВыгрузки);
	Если ЗначениеЗаполнено(СообщенияВыгрузки) Тогда
		СообщенияВыгрузки = СтрШаблон(НСтр("ru='Выгрузка файла: %1'"), СообщенияВыгрузки);
	Иначе
		СообщенияВыгрузки = "";
	КонецЕсли;

	ОписаниеПроблемы = СообщенияЗагрузки + ?(ПустаяСтрока(СообщенияЗагрузки), "",
			?(ПустаяСтрока(СообщенияВыгрузки), "", Символы.ПС)) + СообщенияВыгрузки;
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуИзФайлаВРучномРежиме(ИмяФайла, СостояниеОбмена = Неопределено, Отказ = Ложь, ОписаниеПроблемы = "") Экспорт
	
	// Узел корреспондента может быть не известен - определяется при прверке файла
	Узел = Неопределено;
	Транспорт = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортКаталога();
	СинхронизацияАвтономныхКопий.ПроверитьПолученныйФайлПередЗагрузкой(ИмяФайла, Узел, Истина, Отказ, ОписаниеПроблемы, Транспорт);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Процесс          = "Прием";
	ДействиеПроцесса = "Загрузка";
	
	// Подготовка к обмену
	ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(Узел);
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СостояниеОбмена = СостояниеОбмена(Узел, Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПараметрыПодключения");
	ДопПараметры.Вставить("НастройкиУзла", ПараметрыОбмена);
	ДопПараметры.Вставить("ВсеКодыРезультатов", ВсеКоды);
	
	КлючБлокировки = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", СостояниеОбмена.УзелКорреспондента, 
							Перечисления.ПроцессыОбменаДанными.Передача));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(КлючБлокировки);
	Исключение
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбмена, Процесс, ДействиеПроцесса, 
				ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		ВызватьИсключение ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.ТекстОписания;
	КонецПопытки;
	
	ЭтоСтарыйФормат = ДеньгиКлиентСервер.СравнитьВерсии("2.0", ПараметрыОбмена.ВерсияФорматаОбмена) > 0;
	
	// загрузка данных из файла
	ОтметитьНачалоДействия(СостояниеОбмена, Процесс, ДействиеПроцесса, 0, 0, 0, 0, 0, 
			Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	КоличествоОбъектов = 0;
	
	// Загрузка выполняется в зависимости от версии формата
	КодРезультата    = 0;
	Отказ            = Ложь;
	ОписаниеПроблемы = "";
	Если ЭтоСтарыйФормат Тогда
		// загружается файл в старом формате обмена
		РезультатВыполненияОбмена = Неопределено;
		Ошибка = Неопределено;
		ОбменМобильноеПриложение.ПринятьПакетОбмена(Узел, Отказ, ИмяФайла,
								Неопределено,
								0,
								ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(Узел, Перечисления.ДействияПриОбмене.ЗагрузкаДанных),
								КоличествоОбъектов,
								РезультатВыполненияОбмена, 
								Ошибка);
		Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
			ОписаниеПроблемы = ПодробноеПредставлениеОшибки(Ошибка);
		Иначе
			ОписаниеПроблемы = Ошибка;
		КонецЕсли;
		КодРезультата = ?(Отказ, ВсеКоды.ОшибкаЧтенияПакета.Код, ВсеКоды.Выполнено.Код);
		 
	Иначе
		// теущий формат обмена
		Попытка
			СинхронизацияАвтономныхКопий.ЗагрузитьИзФайлаЧерезФормат(Узел, ИмяФайла, КоличествоОбъектов, КодРезультата);
			КодРезультата = ?(ЗначениеЗаполнено(КодРезультата), КодРезультата, ВсеКоды.Выполнено.Код);
		Исключение
			ОписаниеПроблемы = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КодРезультата = ?(ЗначениеЗаполнено(КодРезультата), КодРезультата, ВсеКоды.ОшибкаЧтенияПакета.Код);
			Отказ = КодРезультата <> ВсеКоды.НомерПакетаМеньшеИлиРавен.Код;
		КонецПопытки; 
		
	КонецЕсли;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, Процесс, ДействиеПроцесса, 
			КодРезультата, ОписаниеПроблемы );
	
	РазблокироватьДанныеДляРедактирования(КлючБлокировки);
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуВФайлВРучномРежиме(ИмяФайла, СостояниеОбмена, Отказ = Ложь, ОписаниеПроблемы = "") Экспорт
	
	Узел                = СостояниеОбмена.УзелКорреспондента;
	ПараметрыОбмена     = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(Узел);
	ЭтоСтарыйФормат     = ДеньгиКлиентСервер.СравнитьВерсии("2.0", ПараметрыОбмена.ВерсияФорматаОбмена) > 0;
	КоличествоОбъектов  = 0;
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	Процесс          = "Передача";
	ДействиеПроцесса = "Выгрузка";
	
	КлючБлокировки = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", СостояниеОбмена.УзелКорреспондента, 
							Перечисления.ПроцессыОбменаДанными.Передача));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(КлючБлокировки);
	Исключение
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбмена, Процесс, ДействиеПроцесса, 
				ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		ВызватьИсключение ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.ТекстОписания;
	КонецПопытки;
	
	ОтметитьНачалоДействия(СостояниеОбмена, Процесс, ДействиеПроцесса, 0, 0, 0, 0, 0, 
			Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	
	КодРезультата    = 0;
	Отказ            = Ложь;
	Если ЭтоСтарыйФормат Тогда
		Ошибка = Неопределено;
		ОбменМобильноеПриложение.СформироватьПакетОбмена(Узел, Отказ, ИмяФайла, Неопределено, 0, 
				ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(Узел, Перечисления.ДействияПриОбмене.ВыгрузкаДанных),
				КоличествоОбъектов, Ошибка);
		Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
			ОписаниеПроблемы = ПодробноеПредставлениеОшибки(Ошибка);
		ИначеЕсли Ошибка <> Неопределено Тогда
			ОписаниеПроблемы = Строка(Ошибка);
		КонецЕсли;
		
	Иначе
		Попытка
			СинхронизацияАвтономныхКопий.ВыгрузитьВФайлЧерезФормат(Узел, ИмяФайла, КоличествоОбъектов, КодРезультата);
			КодРезультата = ?(ЗначениеЗаполнено(КодРезультата), КодРезультата, ВсеКоды.Выполнено.Код);
		Исключение
			Отказ = Истина;
			ОписаниеПроблемы = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КодРезультата = ?(ЗначениеЗаполнено(КодРезультата), КодРезультата, ВсеКоды.ОшибкаПрограммы.Код);
		КонецПопытки; 
		
	КонецЕсли;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, Процесс, ДействиеПроцесса, 
			КодРезультата, ОписаниеПроблемы );
	
	РазблокироватьДанныеДляРедактирования(КлючБлокировки);
	
КонецПроцедуры

// Возвращает Структуру с описанием фонового задания обмена данными, соответствующего регламентному заданию
//
//Параметры
//	РегламентноеЗадание - заание обмена данными
//
Функция ФоновоеЗаданиеОбмена(Знач РегламентноеЗадание) Экспорт
	
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание"), 
				Строка(РегламентноеЗадание.УникальныйИдентификатор), 
				РегламентноеЗадание);
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторРегламентногоЗадания", ИдентификаторРегламентногоЗадания);
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = РегламентныеЗаданияСлужебный.СвойстваФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	Если СвойстваФоновогоЗадания <> Неопределено Тогда

		Результат = ОбщегоНазначенияДеньги.НовыйСтруктураФоновогоЗадания();
		ЗаполнитьЗначенияСвойств(Результат, СвойстваФоновогоЗадания);
		Результат.ИдентификаторЗадания         = СвойстваФоновогоЗадания.Идентификатор;
		Результат.ИдентификаторФоновогоЗадания = СвойстваФоновогоЗадания.Идентификатор;
		Результат.ПодробноеПредставлениеОшибки = СвойстваФоновогоЗадания.ОписаниеИнформацииОбОшибке;
		Если СвойстваФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Результат.Статус = "Выполняется";
		ИначеЕсли СвойстваФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Результат.Статус = "Ошибка";
		ИначеЕсли СвойстваФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Результат.Статус = "Отменено";
		ИначеЕсли СвойстваФоновогоЗадания.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Статус = "Выполнено";
		КонецЕсли;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьСписокЗаданийНаДубли(СписокЗаданий) Экспорт
	
	ЛишниеЗадания = Новый Массив();
	НовыйСписок   = Новый Массив();
	Для Каждого Задание Из СписокЗаданий Цикл
		Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") И Не Задание.Предопределенное Тогда
			ЛишниеЗадания.Добавить(Задание);
		Иначе
			НовыйСписок.Добавить(Задание);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЛишниеЗадания) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Задание Из ЛишниеЗадания Цикл
		РегламентныеЗаданияСервер.УдалитьЗадание(Задание);
	КонецЦикла;
	СписокЗаданий = НовыйСписок;
	
КонецПроцедуры

Процедура ПередЗаписьюИзмененийОбъекта(СохраняемыйОъект, РежимЗаписи = Неопределено) Экспорт
	
	ОбъектПолученПоОбмену = СохраняемыйОъект.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов");
	НоваяКонтрольнаяСумма = КонтрольнаяСуммаОбъекта(СохраняемыйОъект, РежимЗаписи);
	ОбъектИзменен = СохраняемыйОъект.КонтрольнаяСумма <> НоваяКонтрольнаяСумма; 
	
	Если ОбъектИзменен Тогда
		СохраняемыйОъект.КонтрольнаяСумма = НоваяКонтрольнаяСумма;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СохраняемыйОъект.МоментИзменения)
		Или ОбъектИзменен И Не ОбъектПолученПоОбмену Тогда
		СохраняемыйОъект.МоментИзменения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтрольныеСуммыВИБ() Экспорт
	
	Для Каждого ОбъектМД Из Метаданные.Справочники Цикл
		
		Если ОбъектМД.Реквизиты.Найти("КонтрольнаяСумма") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьКонтрольнуюСуммуПоОъектуМД(ОбъектМД);
		
	КонецЦикла;
	
	Для Каждого ОбъектМД Из Метаданные.ПланыВидовХарактеристик Цикл
		
		Если ОбъектМД.Реквизиты.Найти("КонтрольнаяСумма") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьКонтрольнуюСуммуПоОъектуМД(ОбъектМД);
		
	КонецЦикла;
	
	Для Каждого ОбъектМД Из Метаданные.Документы Цикл
		
		Если ОбъектМД.Реквизиты.Найти("КонтрольнаяСумма") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьКонтрольнуюСуммуПоОъектуМД(ОбъектМД);
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Функция НовыйСтруктураПроцессаОбмена()
	
	Результат = Новый Структура;
	Результат.Вставить("ПроцессЗавершен", Ложь); // истина, если весь процесс завершен (выполнен или прекращен)
	Результат.Вставить("ДействиеПроцесса", Неопределено); // последнее дейсвтие, отмеченное в процессе
	Результат.Вставить("КодРезультатаДействия", 0); // код, с которым завершилось действие процесса
	Результат.Вставить("НомерПакета", 0); // номер входящего пакета, с которым работал процесс. Может не совпадать с номером в узле п
	Результат.Вставить("Количество", 0); // количество частей, на которое разделен пакет
	Результат.Вставить("НомерОбработанного", 0); // номер последней обработанной части пакета
	Результат.Вставить("НачалоДействия", Дата(1,1,1)); // начало действия процесса
	Результат.Вставить("ЗавершениеДействия", Дата(1,1,1)); // завершение действия процесса
	Результат.Вставить("ТекстОшибки", ""); // заполняется, только если действие завершилось ошибкой 
	Результат.Вставить("ВидТранспорта", ""); // вид транспорта, которым выполняется/выполнен процесс
	Результат.Вставить("ОбъектовВсего", 0); // количество объектов в пакете
	Результат.Вставить("ОбъектовОбработано", 0); // количество выгруженных/загруженных объектов
	Результат.Вставить("Представление", ""); // пользовательское представление текущего состояния
	
	Возврат Результат;
	
КонецФункции

Функция ФайлПакетаИзЧастей(Узел, НомерПакета, СписокЧастей) 
	
	ВременныйКаталог = "" + Узел.Код + "-" + Формат(НомерПакета, "ЧДЦ=0; ЧГ=") ;
	ВременныйКаталог = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(
			ОбменДаннымиПовтИсп.КаталогВременногоХранилищаФайлов(), ВременныйКаталог);
	
	ФайлыЧастейДляОбъединения = Новый Массив;
	ФайлАрхивирован = Истина;
	Для НомерЧасти = 1 По СписокЧастей.Количество() Цикл
		
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог, 
				СтрШаблон("data.[%1]", Формат(НомерЧасти, "ЧДЦ=0; ЧГ=") ));
				
		Запись = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьМенеджерЗаписи();
		Запись.УзелКорреспондента = Узел;
		Запись.НомерПакетаКПолучению = НомерПакета;
		Запись.НомерЧастиПакета = НомерЧасти;
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru='Ошибка чтения пакета %1 для узла %2: в регистре отсутствует часть #%3'"), 
					НомерПакета, Узел, НомерЧасти);
		КонецЕсли;
		
		Запись.ДанныеПакета.Получить().Записать(ИмяФайла);
		
		ФайлыЧастейДляОбъединения.Добавить(ИмяФайла);
		
		Если ФайлАрхивирован И Запись.ТипПакета <> Перечисления.ТипыПакетовСинхронизации.АрхивированныйФайл Тогда
			ФайлАрхивирован = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ФайлАрхивирован Тогда
		
		ИмяАрхива = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог,  "data.zip");
		ОбъединитьФайлы(ФайлыЧастейДляОбъединения, ИмяАрхива);
		Разархиватор = Новый ЧтениеZipФайла(ИмяАрхива);
		Если Разархиватор.Элементы.Количество() = 0 Тогда
			ВызватьИсключение(СтрШаблон(НСтр("ru='Ошибка чтения пакета %1 для узла %2: в файле архива отсутствуют данные'"), 
						НомерПакета, Узел));
		КонецЕсли;
		Результат = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог, Разархиватор.Элементы[0].Имя);
		Разархиватор.Извлечь(Разархиватор.Элементы[0], ВременныйКаталог);
		Разархиватор.Закрыть();
		
	Иначе
		Результат = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог,  "data.xml");
		ОбъединитьФайлы(ФайлыЧастейДляОбъединения, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ПодготовитьОтправкуПоЧастям(ИмяФайла, Состояние, НомерПакетаКОтправке, РазмерЧасти = 3072) 
	
	// Очистка записей регистра
	Набор = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьНаборЗаписей();
	Набор.Отбор.УзелКорреспондента.Установить(Состояние.УзелКорреспондента);
	Набор.Отбор.НомерПакетаКОтправке.Установить(НомерПакетаКОтправке);
	Набор.Записать(Истина);
	
	// подготовка частей к записи
	КаталогФайлов = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогФайлов);
	
	Архивировать = Не Состояние.УзелКорреспондента.МобильноеУстройство
		И Состояние.УзелКорреспондента.Метаданные().Имя <> "МобильноеПриложение";
	
	Если Не Архивировать Тогда
		// архивирование не поддерживается
		ИмяНеразделенногоФайла = ИмяФайла;
		
	Иначе
		
		// Архивирование файла.
		ИмяНеразделенногоФайла = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогФайлов, "data.zip");
		Архиватор = Новый ЗаписьZipФайла(ИмяНеразделенногоФайла,,,, УровеньСжатияZIP.Максимальный);
		Архиватор.Добавить(ИмяФайла);
		Архиватор.Записать();
		
	КонецЕсли;
	
	// Разделение файла на части.
	КоличествоЧастей = 1;
	Если ЗначениеЗаполнено(РазмерЧасти) Тогда
		ИменаФайлов = РазделитьФайл(ИмяНеразделенногоФайла, РазмерЧасти * 1024);
		КоличествоЧастей = ИменаФайлов.Количество();
	Иначе
		ИменаФайлов = Новый Массив;
		ИменаФайлов.Добавить(ИмяНеразделенногоФайла);
	КонецЕсли;
	
	// Сохранение частей в базе
	СжатиеДанных = Новый СжатиеДанных(9);
	ДатаВыгрузки = ТекущаяДатаСеанса();
	Для НомерЧасти = 1 По КоличествоЧастей Цикл
		
		ИмяФайлаЧасти = ИменаФайлов[НомерЧасти - 1];
		ДанныеФайла = Новый ДвоичныеДанные(ИмяФайлаЧасти);
		ЗаписьНабора = Набор.Добавить();
		ЗаписьНабора.УзелКорреспондента = Состояние.УзелКорреспондента;
		ЗаписьНабора.НомерПакетаКОтправке = НомерПакетаКОтправке;
		ЗаписьНабора.НомерЧастиПакета = НомерЧасти;
		ЗаписьНабора.ДанныеПакета = Новый ХранилищеЗначения(ДанныеФайла, СжатиеДанных);
		ЗаписьНабора.ТипПакета = ?(Архивировать, Перечисления.ТипыПакетовСинхронизации.АрхивированныйФайл, Перечисления.ТипыПакетовСинхронизации.Файл);
		ЗаписьНабора.ВсегоЧастей = КоличествоЧастей;
		ЗаписьНабора.ДатаВыгрузки = ДатаВыгрузки;
		
	КонецЦикла;
	
	Набор.Записать(Истина);
	
	ОбновитьСтатистикуДействия(Состояние, "Передача", , КоличествоЧастей, , , );
	
	// удаление файлов с диска
	Попытка
		
		УдалитьФайлы(ИмяФайла);
		УдалитьФайлы(КаталогФайлов);
		
	Исключение
		КлючЖурнала = ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(
				Состояние.УзелКорреспондента, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
		Ошибка = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(КлючЖурнала, 
				УровеньЖурналаРегистрации.Ошибка,
				Состояние.УзелКорреспондента.Метаданные(), 
				Состояние.УзелКорреспондента, 
				"Ошибка удаления временных файлов выгрузки данных:
				|
				|" + ПодробноеПредставлениеОшибки(Ошибка));
		
	КонецПопытки; 
	
КонецПроцедуры

Функция ПредставлениеСостояния(СтруктураСостояния, Отступ = "")
	
	Результат = "";
	Для Каждого КлючИЗначение Из СтруктураСостояния Цикл
		
		Результат = Результат + ?(ПустаяСтрока(Результат), "", Символы.ПС);
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
			Результат = Результат + Отступ + "-" + КлючИЗначение.Ключ + " (структура):"
					+ ПредставлениеСостояния(КлючИЗначение.Значение, Отступ + "  ");
		Иначе
			Результат = Результат + Отступ + "-" + КлючИЗначение.Ключ + " = " +  Строка(КлючИЗначение.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСтатусТранспортаВРегистр(СостояниеОбмена)
	
	ЗаписьСостоянияСервера = Новый Структура("КодРезультатаДействия,ТекстОшибки,ЗавершениеДействия,ВидТранспорта");
	ЗаписьСостоянияСервера.КодРезультатаДействия = СостояниеОбмена.СтатусТранспорта.КодСостояния;
	ЗаписьСостоянияСервера.ТекстОшибки           = СостояниеОбмена.СтатусТранспорта.ТекстОшибки;
	ЗаписьСостоянияСервера.ЗавершениеДействия    = СостояниеОбмена.СтатусТранспорта.ПоследняяПроверка;
	ЗаписьСостоянияСервера.ВидТранспорта         = СостояниеОбмена.ТекущийВидТранспорта;
	Если СостояниеОбмена.Свойство("УзелКорреспондента") Тогда
		Узел = СостояниеОбмена.УзелКорреспондента;
	Иначе
		Узел = СостояниеОбмена.Узел;
	КонецЕсли;
	РегистрыСведений.СостоянияПроцессовОбменаДанными.ОбновитьСостояниеПроцессаДляУзла(
			Узел, 
			Перечисления.ПроцессыОбменаДанными.ПустаяСсылка(), 
			ЗаписьСостоянияСервера);
	
КонецПроцедуры

Процедура ОбновитьОбщиеСвойстваСостоянияПроцессов(СостояниеОбмена, ОбновлятьСостояниеНастроек = Ложь)
	
	Если ОбновлятьСостояниеНастроек Тогда
		ОбновитьСостояниеНастроек(СостояниеОбмена);
	КонецЕсли;
	СостояниеОбмена.ЗавершенСОшибками         = Ложь;
	СостояниеОбмена.ЗавершенСПредупреждениями = Ложь;
	
	ТекущиеПараметры = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(СостояниеОбмена.УзелКорреспондента);
	СостояниеОбмена.СценарийОбмена                 = ТекущиеПараметры.ЗатребованныйСценарий;
	СостояниеОбмена.НомерДляУстановленногоСценария = ТекущиеПараметры.НомерДляУстановленногоСценария;
	
	СостояниеОбмена.ПроцессАктивен = Не (ЗначениеЗаполнено(СостояниеОбмена.Прием.ДействиеПроцесса) 
					И СостояниеОбмена.Прием.ПроцессЗавершен 
						И ЗначениеЗаполнено(СостояниеОбмена.Передача.ДействиеПроцесса) 
					И СостояниеОбмена.Передача.ПроцессЗавершен);
	
	Если СостояниеОбмена.ПроцессАктивен Тогда
		
		Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
			СостояниеОбмена.ТекстСостояния = НСтр("ru='Синхронизация...'");
		Иначе
			СостояниеОбмена.ТекстСостояния = НСтр("ru='Обмен файлами...'");
		КонецЕсли;
		
	Иначе
		// процесс завершен. Проверяем, есть ли ошибки или предупреждения
		ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
		
		Если ЗначениеЗаполнено(СостояниеОбмена.Прием.КодРезультатаДействия) 
			И СостояниеОбмена.Прием.КодРезультатаДействия <> ВсеКоды.Выполнено.Код
			И СостояниеОбмена.Прием.КодРезультатаДействия <> ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код  Тогда
			ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(СостояниеОбмена.Прием.КодРезультатаДействия);
			Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
				СостояниеОбмена.ЗавершенСОшибками         = Истина;
			Иначе
				СостояниеОбмена.ЗавершенСПредупреждениями = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СостояниеОбмена.Передача.КодРезультатаДействия)
			И СостояниеОбмена.Передача.КодРезультатаДействия <> ВсеКоды.Выполнено.Код
			И СостояниеОбмена.Передача.КодРезультатаДействия <> ВсеКоды.ОтсутствуютДанныеДляВыгрузки.Код Тогда
			ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(СостояниеОбмена.Передача.КодРезультатаДействия);
			Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
				СостояниеОбмена.ЗавершенСОшибками         = Истина;
			Иначе
				СостояниеОбмена.ЗавершенСПредупреждениями = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
			СостояниеОбмена.ТекстСостояния = НСтр("ru='Синхронизация завершена'");
		Иначе
			СостояниеОбмена.ТекстСостояния = НСтр("ru='Обмен файлами завершен'");
		КонецЕсли;

	КонецЕсли;
	
	Если СостояниеОбмена.СтруктураПредставления = Неопределено Тогда
		СостояниеОбмена.СтруктураПредставления = НовыйСтруктураПредставленияСостояния(СостояниеОбмена);
	Иначе
		ОбновитьПредставлениеСостояния(СостояниеОбмена);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСостояниеНастроек(СостояниеОбмена)
	
	СостояниеОбмена.ИспользоватьСинхронизацию = ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных");
	ПараметрыПодключения = Неопределено;
	
	Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
		
		ПараметрыПодключенияЗаполнены = ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Ложь);
		БазаПодключенаКОблаку = ДеньгиВОблакеВызовСервера.ЭтаБазаПодключенаКОблаку(ПараметрыПодключения);
		СостояниеОбмена.СтатусТранспорта.СоединениеНастроено = ПараметрыПодключенияЗаполнены И БазаПодключенаКОблаку;
		Если Не ПараметрыПодключенияЗаполнены Тогда
			СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = НСтр("ru='Не настроено подключение к облачному сервису'");
		ИначеЕсли Не БазаПодключенаКОблаку Тогда
			СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = НСтр("ru='Эта база не подключена к облачному сервису'");
		КонецЕсли;
		
	Иначе
		
		// проверка доступности домашней сети
		ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(
				Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
		СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется = Не ПараметрыДомашняяСеть.ЗапретитьИспользование;
		
		// проверка облачного хранилища файлов
		СвойстваАккаунта = Неопределено;
		ОблачныйПровайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
		Транспорт = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(ОблачныйПровайдер);
		ПараметрыОблачногоХранилищаФайлов = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Транспорт, Истина);
		
		СостояниеОбмена.СтатусТранспорта.ФайловоеОблакоИспользуется = Не ПараметрыОблачногоХранилищаФайлов.ЗапретитьИспользование;
		СостояниеОбмена.СтатусТранспорта.Провайдер = ОблачныйПровайдер;
		
		СостояниеОбмена.СтатусТранспорта.СоединениеСФайловымОблакомНастроено = СвойстваАккаунта <> Неопределено
				И ЗначениеЗаполнено(СвойстваАккаунта.КлючАвторизации);
				
		СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = "";
		Если Не СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется И Не СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется Тогда
			СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = НСтр("ru='Отключены все транспорты обмена файлами'");
		ИначеЕсли Не СостояниеОбмена.СтатусТранспорта.СоединениеСФайловымОблакомНастроено Тогда
			СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = 
					НСтр("ru='Отсутствуют настройки облачного хранилища или авторизация приложения'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОписаниеСостоянияОбмена

Процедура ОбновитьПредставлениеВСостоянииПроцесса(СостояниеОбмена, Процесс = Неопределено, ВсеКоды = Неопределено)
	
	Если Не ЗначениеЗаполнено(ВсеКоды) Тогда
		ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	КонецЕсли;
	Если Процесс = "Прием" Или Не ЗначениеЗаполнено(Процесс) Тогда
		ОбновитьТекстПредставления(СостояниеОбмена.Прием, ВсеКоды);
	КонецЕсли;
	
	Если Процесс = "Передача" Или Не ЗначениеЗаполнено(Процесс) Тогда
		ОбновитьТекстПредставления(СостояниеОбмена.Передача, ВсеКоды);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьТекстПредставления(СтруктураПроцесса, ВсеКоды)
	
	Если Не ЗначениеЗаполнено(СтруктураПроцесса.ДействиеПроцесса) Тогда
		// Процесс не начинался
		СтруктураПроцесса.Представление = "";
		
	ИначеЕсли СтруктураПроцесса.ПроцессЗавершен Тогда
		// Прием или Передача завершены
		Если СтруктураПроцесса.КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
			СтруктураПроцесса.Представление = НСтр("ru='ОК'");
		Иначе
			ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(СтруктураПроцесса.КодРезультатаДействия);
			СтруктураПроцесса.Представление = ОписаниеРезультата.ТекстОписания;
		КонецЕсли;
			
	Иначе
		// процесс не завершен
		СтруктураПроцесса.Представление = Строка(СтруктураПроцесса.ДействиеПроцесса) + "…"; 
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйСтруктураПредставленияСостояния(СостояниеОбмена)
	
	Результат = Новый Структура;
	Результат.Вставить("КартинкаСостояния48", "СинхронизацияНетОбмена48");
	Результат.Вставить("КартинкаСостояния16", "СинхронизацияНетОбмена16");
	Результат.Вставить("Транспорт", ПредставлениеТранспорта(СостояниеОбмена));
	Результат.Вставить("СостояниеТранспорта", ТекстСтатусаСервера(СостояниеОбмена, 
				Результат.КартинкаСостояния48, 
				Результат.КартинкаСостояния16));
	Результат.Вставить("СостояниеПрием", ТекстПредставленияПроцесса(СостояниеОбмена, "Прием"));
	Результат.Вставить("СостояниеПередача", ТекстПредставленияПроцесса(СостояниеОбмена, "Передача"));
	
	Возврат Результат;
	
КонецФункции

Процедура ОбновитьПредставлениеСостояния(СостояниеОбмена, СтруктураПредставления = Неопределено)
	
	Если СтруктураПредставления = Неопределено Тогда
		СтруктураПредставления = СостояниеОбмена.СтруктураПредставления;
	КонецЕсли;
	
	СтруктураПредставления.СостояниеТранспорта = ТекстСтатусаСервера(СостояниеОбмена, 
				СтруктураПредставления.КартинкаСостояния48, 
				СтруктураПредставления.КартинкаСостояния16);
	СтруктураПредставления.СостояниеПрием    = ТекстПредставленияПроцесса(СостояниеОбмена, "Прием");
	СтруктураПредставления.СостояниеПередача = ТекстПредставленияПроцесса(СостояниеОбмена, "Передача");
	
КонецПроцедуры

Функция ПредставлениеТранспорта(СостояниеОбмена)
	
	Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
		Возврат НСтр("ru='сервис'");
		
	ИначеЕсли Не ЗначениеЗаполнено(СостояниеОбмена.ТекущийВидТранспорта) Тогда
		Возврат НСтр("ru='транспорт не задан'");
		
	ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
		Возврат НСтр("ru='вручную через файл'");
		
	ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WS Тогда
		Возврат НСтр("ru='http-сервис'");
		
	Иначе
		
		Возврат Строка(СостояниеОбмена.ТекущийВидТранспорта);
		
	КонецЕсли;
	
КонецФункции

Функция ТекстСтатусаСервера(СостояниеОбмена, КартинкаСостояния48, КартинкаСостояния16) 
	
	КартинкаСостояния48 = "СинхронизацияНетОбмена48"; 
	КартинкаСостояния16 = "СинхронизацияНетОбмена16";
	Ссылка = "http://transport";
	ТекстСостояния = "…";
	ЦветТекстаСостояния = ЦветаСтиля.ЦветТекстаФормы;
	
	Если СостояниеОбмена.Режим = "Автономный" Тогда
		КартинкаСостояния48 = "СинхронизацияОшибка48"; 
		КартинкаСостояния16 = "СинхронизацияОшибка16";
		ТекстСостояния = НСтр("ru='не выбран способ синхронизации'");
			
	ИначеЕсли Не СостояниеОбмена.ИспользоватьСинхронизацию Тогда
		КартинкаСостояния48 = "ОформлениеЗнакКрест"; 
		КартинкаСостояния16 = "ОформлениеЗнакКрест";
		ТекстСостояния = НСтр("ru='синхронизация отключена'");
			
	ИначеЕсли Не СостояниеОбмена.СтатусТранспорта.СоединениеНастроено Тогда
		КартинкаСостояния48 = "ОформлениеЗнакКрест"; 
		КартинкаСостояния16 = "ОформлениеЗнакКрест";
		ТекстСостояния = НСтр("ru='не настроено соединение'");

	ИначеЕсли ЗначениеЗаполнено(СостояниеОбмена.СтатусТранспорта.КодСостояния)  Тогда
		
		ОписаниеСостояния = ПроцессыОбменаПовтИсп.ОписаниеСостоянияПоКоду(
								СостояниеОбмена.СтатусТранспорта.КодСостояния);
		Если ОписаниеСостояния.ЯвляетсяУспехом Тогда
			Если СостояниеОбмена.ПроцессАктивен Тогда
				ТекстСостояния = НСтр("ru='в процессе…'");
			Иначе
				ТекстСостояния = НСтр("ru='ожидание…'");
			КонецЕсли;
			
		Иначе
			ТекстСостояния = ОписаниеСостояния.ТекстОписания;
			Если ОписаниеСостояния.ЯвляетсяОшибкой Тогда
				КартинкаСостояния48 = "СинхронизацияОшибка48"; 
				КартинкаСостояния16 = "СинхронизацияОшибка16";
			Иначе
				КартинкаСостояния48 = "ОформлениеВоcклицательныйЗнак"; 
				КартинкаСостояния16 = "ОформлениеВоcклицательныйЗнак";
			КонецЕсли;
		КонецЕсли;
			
	Иначе
		Если СостояниеОбмена.ПроцессАктивен Тогда
			ТекстСостояния = НСтр("ru='в процессе…'");
		Иначе
			ТекстСостояния = НСтр("ru='ожидание…'");
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Новый ФорматированнаяСтрока(ТекстСостояния, , ЦветТекстаСостояния, , Ссылка);
	
КонецФункции

Функция ТекстПредставленияПроцесса(СостояниеОбмена, ИмяПроцесса)
	
	СтрокиПредставления = Новый Массив;
	ТекстРезультата = "…";
	ЦветРезультата  = ЦветаСтиля.ЦветТекстаФормы;
	
	Если ИмяПроцесса = "Прием" Тогда
		ЗаголовокПроцесса = НСтр("ru='Прием:'");
		Ссылка = "http://receiving";
	Иначе
		ЗаголовокПроцесса = НСтр("ru='Передача:'");
		Ссылка = "http://sending";
	КонецЕсли;
	
	Если СостояниеОбмена = Неопределено Тогда
		СтрокиПредставления.Добавить(" ");
		СтрокиПредставления.Добавить(ЗаголовокПроцесса);
		СтрокиПредставления.Добавить(Новый ФорматированнаяСтрока(ТекстРезультата, , ЦветРезультата, , Ссылка));
		Возврат Новый ФорматированнаяСтрока(СтрокиПредставления);
	КонецЕсли;
	
	СтруктураПроцесса = СостояниеОбмена[ИмяПроцесса];
	КодРезультата     = СтруктураПроцесса.КодРезультатаДействия;
	ЭтоКлиентОблака   = СостояниеОбмена.Режим = "КлиентОблака";
	ВсеКоды           = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	
	// Доабвляем картинку результата и запоминаем текст результата
	Если СтруктураПроцесса.ПроцессЗавершен
		Или КодРезультата = ВсеКоды.ПриемОжидаетЗавершенияПередачи.Код Тогда
		
		ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(КодРезультата);
		Если ОписаниеРезультата.ЯвляетсяУспехом Тогда
			ИмяКартинки = "ОформлениеФлажок";
			ТекстРезультата = "ОК";
		ИначеЕсли ОписаниеРезультата.ЯвляетсяОшибкой Тогда
			ИмяКартинки = "ОформлениеЗнакКрест";
			ТекстРезультата = ОписаниеРезультата.ТекстОписания;
			ЦветРезультата  = ЦветаСтиля.ЦветОтрицательногоЧисла;
		Иначе
			Если КодРезультата = ВсеКоды.ОтсутствуютДанныеДляВыгрузки.Код
				Или КодРезультата = ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код Тогда
				ИмяКартинки = "ОформлениеФлажок";
			Иначе
				ИмяКартинки = "ОформлениеЗнакВоcклицательныйЗнак";
			КонецЕсли;
			ТекстРезультата = ОписаниеРезультата.ТекстОписания;
		КонецЕсли;
		
		Если СостояниеОбмена.Режим <> "Разделенный" И СостояниеОбмена.Режим <> "Неразделенный" Тогда
			СтрокиПредставления.Добавить(БиблиотекаКартинок[ИмяКартинки]);
		КонецЕсли;
		
	Иначе
		
		СтрокиПредставления.Добавить(" ");
		Если ИмяПроцесса = "Прием" 
			И СтруктураПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
			ТекстРезультата = ?(ЭтоКлиентОблака, НСтр("ru='выгрузка на сервере'"), НСтр("ru='выгрузка в моб. приложении'")) + "…";
			
		ИначеЕсли ИмяПроцесса = "Передача" 
			И СтруктураПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
			ТекстРезультата = ?(ЭтоКлиентОблака, НСтр("ru='загрузка на сервере'"), НСтр("ru='загрузка в моб.приложении'")) + "…";
			
		Иначе
			ТекстРезультата = Строка(СтруктураПроцесса.ДействиеПроцесса) + "…";
			
		КонецЕсли;
		
	КонецЕсли;
	СтрокиПредставления.Добавить(" ");
	
	// Добавляем название процесса
	СтрокиПредставления.Добавить(ЗаголовокПроцесса);
	СтрокиПредставления.Добавить(" ");

	СтрокиПредставления.Добавить(Новый ФорматированнаяСтрока(ТекстРезультата, , ЦветРезультата, , Ссылка));
	СтрокиПредставления.Добавить(" ");
	
	Если ЗначениеЗаполнено(КодРезультата) Тогда
		
		Если ЗначениеЗаполнено(СтруктураПроцесса.ЗавершениеДействия) Тогда
			СтрокиПредставления.Добавить("(" + ФорматДатыДействия(СтруктураПроцесса.ЗавершениеДействия) + ")");
		ИначеЕсли ЗначениеЗаполнено(СтруктураПроцесса.НачалоДействия) Тогда
			СтрокиПредставления.Добавить("(начало - " + ФорматДатыДействия(СтруктураПроцесса.НачалоДействия) + ")");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(СтрокиПредставления);
	
КонецФункции

Функция ФорматДатыДействия(Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат НСтр("ru='нет даты'");
	КонецЕсли;
	
	Сегодня = ТекущаяДатаСеанса();
	Если НачалоДня(Дата) = НачалоДня(Сегодня) Тогда
		СтрокаФорматаДаты = "ДФ=HH:mm;";
	ИначеЕсли НачалоГода(Дата) = НачалоГода(Сегодня) Тогда
		СтрокаФорматаДаты = "ДФ='dd MMM, HH:mm';";
	Иначе
		СтрокаФорматаДаты = "ДФ='dd.MM.yyyy, HH:mm';";
	КонецЕсли;
	
	Возврат Формат(Дата, СтрокаФорматаДаты);
	
КонецФункции

Функция КонтрольнаяСуммаОбъекта(Объект, РежимЗаписи)
	
	СтроковоеПредставление = ОбщегоНазначения.ЗначениеВСтрокуXML(Объект);
	Если ЗначениеЗаполнено(Объект.КонтрольнаяСумма) Тогда
		СтроковоеПредставление = СтрЗаменить(СтроковоеПредставление, 
			"<КонтрольнаяСумма>" + Объект.КонтрольнаяСумма + "</КонтрольнаяСумма>", 
			"<КонтрольнаяСумма/>");
	КонецЕсли;
	
	СтроковоеПредставление = СтрЗаменить(СтроковоеПредставление, 
		"<МоментИзменения>" + Формат(Объект.МоментИзменения, "ЧН=0; ЧГ=;") + "</МоментИзменения>", 
		"<МоментИзменения/>");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Объект.Проведен Тогда
		СтроковоеПредставление = СтрЗаменить(СтроковоеПредставление, 
			"<Posted>false</Posted>", 
			"<Posted>true</Posted>");
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И Объект.Проведен Тогда
		СтроковоеПредставление = СтрЗаменить(СтроковоеПредставление, 
			"<Posted>true</Posted>", 
			"<Posted>false</Posted>");
	КонецЕсли;
	
	ПроверятьПредопределенные = ОбщегоНазначения.ЭтоСправочник(Объект.Метаданные())
		Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(Объект.Метаданные()); 
	Если ПроверятьПредопределенные И ЗначениеЗаполнено(Объект.ИмяПредопределенныхДанных) Тогда
		СтроковоеПредставление = СтрЗаменить(СтроковоеПредставление, 
			"<Ref>" + Строка(Объект.Ссылка.УникальныйИдентификатор()) + "</Ref>", 
			"<Ref>" + Объект.ИмяПредопределенныхДанных + "</Ref>");
	КонецЕсли;
	
	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтроковоеПредставление);
	
КонецФункции

Процедура ЗаполнитьКонтрольнуюСуммуПоОъектуМД(ОбъектМД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Таблица
	|ГДЕ
	|	Таблица.КонтрольнаяСумма = """"";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Валюты", ОбъектМД.ПолноеИмя());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если Объект = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			
			Объект.КонтрольнаяСумма = КонтрольнаяСуммаОбъекта(Объект, Неопределено);
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			Объект.Записать();
			
		Исключение
			
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обновление информационной базы.Деньги", УровеньЖурналаРегистрации.Ошибка, 
					ОбъектМД, Выборка.Ссылка,
					СтрШаблон("Ошибка заполнения контрольной суммы для объекта вида %1 по ссылке ""%2"":
					|%3", ОбъектМД.ПолноеИмя(), Выборка.Ссылка, ПодробноеПредставлениеОшибки(Ошибка)));
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти