
#Область ПрограммныйИнтерфейс

// Возвращает начало периода даты.
//
// Параметры:
//   Периодичность - Перечисление.Периодичность - периодичность.
//   Дата - Дата - дата.
//
// Возвращаемое значение:
//   Дата - начало периода даты.
//
Функция НачалоПериода(Периодичность, Дата) Экспорт
	
	Возврат НачалоГода(Дата);
	
	// ДЕНЬГИ код исключен
	
КонецФункции

// Возвращает конец периода.
//
Функция КонецПериода(Периодичность, Дата) Экспорт
	
	Возврат КонецГода(Дата);
	
	// ДЕНЬГИ код исключен
	
КонецФункции

// Добавляет период.
//
Функция ДобавитьПериод(Знач Дата, Периодичность, Знач КоличествоПериодов = 1) Экспорт
	
	Если КоличествоПериодов = 0 Тогда
		КоличествоПериодов = 1;
	КонецЕсли;
	
	
	Возврат ДобавитьМесяц(Дата, 12 * КоличествоПериодов);
	// ДЕНЬГИ код исключен
	
КонецФункции

// Возвращает операции регламентированного отчета с признаками их доступности.
//
// Параметры:
//   ИмяОтчета - Строка - имя регламентированного отчета, например, "РегламентированныйОтчет4ФСС".
//   ИмяФормы - Строка - имя формы регламентированного отчета, например, "ФормаОтчета2017Кв1".
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура - операции с регламентированным отчетом.
//	   * АвтоФормированиеНаСервере - Булево - признак автоматического формирования отчета в тихом режиме на сервере.
//	   * ВыгрузкаНаСервере - Булево - признак выгрузки отчета в тихом режиме на сервере.
//	   * ПечатьСоШтрихкодомPDF417НаСервере - Булево - признак печати отчета со штрихкодом PDF417 в тихом режиме
//													  на сервере.
//	   * ПечатьБезШтрихкодаPDF417НаСервере - Булево - признак печати отчета без штрихкода PDF417 в тихом режиме
//													  на сервере.
//
Функция ОперацииСРегламентированнымОтчетом(ИмяОтчета, ИмяФормы) Экспорт
			    	
	Возврат РегламентированнаяОтчетностьКлиентСервер.ОперацииСРегламентированнымОтчетом(ИмяОтчета, ИмяФормы);
							        		                                                                                                                        						
КонецФункции

#Область ПроцедурыИФункцииСпискаЗадачБухгалтера

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции интерфейса взаимодействия с сервисом "Список задач
// бухгалтера".

// Определяет строковой статус объекта регламентированной отчетности,
// предназначенный для интерактивного изменения пользователем,
// соответствующий финальному статусу.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса, предназначенное для программной обработки.
//
Функция СтатусСданоСтрокой() Экспорт
	
	Возврат "Сдано"; // См. РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе
	
КонецФункции

// Определяет строковой статус объекта регламентированной отчетности,
// предназначенный для интерактивного изменения пользователем,
// соответствующий статусу отчета, находящегося в процессе подготовки.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса, предназначенное для программной обработки.
//
Функция СтатусВРаботеСтрокой() Экспорт
	
	Возврат "В работе"; // См. РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе
	
КонецФункции

// Определяет строковый статус объекта регламентированной отчетности,
// предназначенный для интерактивного изменения пользователем,
// соответствующий статусу подготовленной отчетности.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса, предназначенное для программной обработки.
//
Функция СтатусПодготовленоСтрокой() Экспорт
	
	Возврат "Подготовлено"; // См. РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе
	
КонецФункции

// Пользовательское представление статуса объекта регламентированной отчетности,
// соответствующего статусу по умолчанию.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса пользователю.
//
Функция ПредставлениеСтатусаНеОтправлено() Экспорт
	
	Возврат НСтр("ru = 'Не отправлено'");
	
КонецФункции

// Пользовательское представление строкового статуса объекта регламентированной отчетности,
// предназначенного для интерактивного изменения пользователем,
// соответствующего финальному статусу.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса пользователю.
//
Функция ПредставлениеСтатусаСдано() Экспорт
	
	// См. РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе.
	Возврат НСтр("ru = 'Сдано'");
	
КонецФункции

// Пользовательское представление строкового статуса объекта регламентированной отчетности,
// предназначенного для интерактивного изменения пользователем,
// соответствующего статусу отчета, находящегося в процессе подготовки.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса пользователю.
//
Функция ПредставлениеСтатусаВРаботе() Экспорт
	
	// См. РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе.
	Возврат НСтр("ru = 'В работе'"); 
	
КонецФункции

// Пользовательское представление строкового статуса объекта регламентированной отчетности,
// предназначенного для интерактивного изменения пользователем,
// соответствующего статусу подготовленной отчетности.
// 
// Возвращаемое значение:
//  Строка - строковое представление статуса пользователю.
//
Функция ПредставлениеСтатусаПодготовлено() Экспорт
	
	// См. РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе.
	Возврат НСтр("ru = 'Подготовлено'");
	
КонецФункции

// Конструктор коллекции со сведениями о состоянии передачи в учреждение отчета или иного документа
// - при передаче в электронном виде - состояние отправки;
// - при передаче иным способом - статус, установленный пользователем.
//
// Возвращаемое значение:
//  Структура
//    * Представление - Строка - представление состояния передачи в учреждение.
//    * Статус        - Строка - строковый статус объекта регламентированной отчетности.
//    * Сдано         - Булево - Истина, если отчет сдан любым способом.
//    * Отправлено    - Булево - Истина, если отчет отправлен в учреждение в электронном виде.
//    * ВРаботе       - Булево - Истина, если отчет редактируется и еще не отправлен в учреждение.
//
Функция НовыйСостояниеДокумента() Экспорт
	
	Состояние = Новый Структура;
	Состояние.Вставить("Представление", ПредставлениеСтатусаНеОтправлено());
	Состояние.Вставить("Статус",        "");
	Состояние.Вставить("Сдано",         Ложь);
	Состояние.Вставить("Отправлено",    Ложь);
	Состояние.Вставить("ВРаботе",       Ложь);
	
	Возврат Состояние;
	
КонецФункции

// Определяет, возможна ли отправка отчета в учреждение в виде электронного документа.
//
// Параметры:
//  ИмяОтчета - Строка - Имя отчета (элемента метаданных).
// 
// Возвращаемое значение:
//  Булево - Истина, если отчет может быть отправлен в электронном виде.
//
Функция ВозможнаОтправкаЭлектронногоДокумента(ИмяОтчета) Экспорт
	
	ОтчетыОтправкаОграничена = ОтчетыОтправкаОграничена();
	Возврат (ОтчетыОтправкаОграничена.Найти(ИмяОтчета) = Неопределено);
	
КонецФункции

// Определяет перечень отчетов, отправка которых в учреждение невозможна в виде электронного документа.
//
// В список включены отчеты, из форм которых не вызывается
// ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОтправкойРегламентированногоОтчета()
//
// Внимание!
// При изменении содержимого этого перечня регламентированных отчетов в конфигурации-потребителе
// БРО при обновлении но новую версию необходимо выполнить специальный обработчик обновления,
// который должен выполняться каждый раз при изменени содержимого этого перечня.
//
// Возвращаемое значение:
//  ФиксированныйМассив - имена отчетов (элементов метаданных).
//
Функция ОтчетыОтправкаОграничена() Экспорт
	
	ВариантыОграниченаПередача = // См. также ПредставлениеПолучателяБумажногоДокумента()
	"РегламентированныйОтчетДвижениеСредствПоСчетуВБанкеЗаПределамиРФ
	|РегламентированныйОтчетДеятельностьИнОргВРФ
	|РегламентированныйОтчетПрибыльСколковоРасчетНалоговойБазы
	|РегламентированныйОтчетРасчетПоОплатеЗаВоду
	|РегламентированныйОтчетРасчетЧистыхАктивов
	|РегламентированныйОтчетРеестрСФНаПереработкуБензина
	|РегламентированныйОтчетРеестрСФПоАвиационномуКеросину
	|РегламентированныйОтчетРеестрСФПоБензинуИзДавальческогоСырья
	|РегламентированныйОтчетРеестрСФПоБензинуИзСобственногоСырья
	|РегламентированныйОтчетРеестрСФПоБензолуПараксилолуОртоксилолу
	|РегламентированныйОтчетРеестрСФПоЭтиловомуСпирту
	|РегламентированныйОтчетСведенияОрублевыхСчетах
	|РегламентированныйОтчетСведенияОСчетахвВиностраннойВалюте
	|РегламентированныйОтчетСоответствиеУсловийТруда
	|РегламентированныйОтчетСтатистика1Квотирование
	|РегламентированныйОтчетСтатистикаФорма1ДМ
	|РегламентированныйОтчетСтатистикаФорма2ДМ
	|РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье
	|РегламентированныйОтчетСтатистикаФорма2ДМприл
	|РегламентированныйОтчетСтатистикаФорма4ДМ
	|РегламентированныйОтчетСтатистикаФормаП1Приложение3
	|РегламентированныйОтчетСтраховыеВзносыНСИПЗ";
	
	Возврат Новый ФиксированныйМассив(СтрРазделить(ВариантыОграниченаПередача, Символы.ПС, Ложь));
	
КонецФункции

// Определяет краткое наименование государственного органа - получателя документа, который невозможно отправить ему в электронном виде.
// Следует использовать для отчетов, для которых ВозможнаОтправкаЭлектронногоДокумента() = Ложь.
//
// Параметры:
//  ИмяОтчета - Строка - Имя отчета (элемента метаданных).
// 
// Возвращаемое значение:
//  Строка - представление гос. органа; пустая строка, если неизвестно.
//
Функция ПредставлениеПолучателяБумажногоДокумента(ИмяОтчета) Экспорт
	
	Если ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма1ДМ"
		Или ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма1ДМ"
		Или ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма2ДМ"
		Или ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье"
		Или ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма2ДМприл"
		Или ИмяОтчета = "РегламентированныйОтчетСтатистикаФорма4ДМ" Тогда
		
		Возврат НСтр("ru = 'Гохран'");
		
	ИначеЕсли ИмяОтчета = "РегламентированныйОтчетСтатистика1Квотирование" Тогда
		
		Возврат НСтр("ru = 'Центр занятости'");
		
	Иначе	
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

// Определяет текст для пользователя, кратко, в несколько слов описывающий суть ограничения отправки отчета.
// Такой текст выводится в дополнение к названию отчета и т.п.
//
// Возвращаемое значение:
//  Строка - краткое представление ограничения отправки отчета для пользователя.
//
Функция КраткоеПредставлениеОграниченияОтправкиОтчета() Экспорт
	
	Возврат НСтр("ru = 'сдается в бумажном виде'");
	
КонецФункции

#КонецОбласти

#КонецОбласти