#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает структуру, заполненную свойствами, важними для изменения варианта бюджета
//
//Возвращаемое значение:
//	Структура
//		* ПределПланирования - Дата - значение одноименной константы
//		* ЕстьПлановыеПоказателиБюджета - Булево
//		* МинимальнаяДатаПоказателя - Дата - наименьшая дата, на которую имеется сумма в бюджете
//
Функция СвойстваВариантаБюджета(СсылкаВариантаБюджета) Экспорт

	Результат = Новый Структура("ПределПланирования,ЕстьПлановыеПоказателиБюджета,МинимальнаяДатаПоказателя", 
			Константы.ПределПланирования.Получить(), Ложь, Дата(1,1,1));
			
	Если Не ЗначениеЗаполнено(СсылкаВариантаБюджета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантБюджета", СсылкаВариантаБюджета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ПоказателиБюджета.НачалоПериода) КАК НачалоПериода
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК ПоказателиБюджета
	|ГДЕ
	|	ПоказателиБюджета.ВариантБюджета = &ВариантБюджета
	|	И (ПоказателиБюджета.Сумма <> 0
	|			ИЛИ ПоказателиБюджета.Комментарий <> """")";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.МинимальнаяДатаПоказателя = Выборка.НачалоПериода;
		Результат.ЕстьПлановыеПоказателиБюджета = ЗначениеЗаполнено(Результат.МинимальнаяДатаПоказателя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПредопределенныеЭлементы();
	
	УзлыОбмена = ПланыОбмена.МобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.ВариантыБюджетов);
	КонецЕсли;
	
	УзлыОбмена = ПланыОбмена.СинхронизацияАвтономныхКопий.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.ВариантыБюджетов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПредопределенныеЭлементы() Экспорт
	
	ПроверитьПредопределенный("БазовыйВариант", НСтр("ru='Основной вариант'"), "Базовый вариант");
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	Если Не Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
	// Условие отбора на исключение конкретного варианта бюджета
	Если Параметры.Отбор.Свойство("ИсключаемаяСсылка") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИсключатьКрупнуюДетальность = Параметры.Отбор.Свойство("ИсключатьКрупнуюДетальность")
									И Параметры.Отбор.ИсключатьКрупнуюДетальность;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИсключаемаяСсылка", Параметры.Отбор.ИсключаемаяСсылка);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВариантыБюджетов.Ссылка = &ИсключаемаяСсылка
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок,
		|	ВариантыБюджетов.Ссылка,
		|	ВариантыБюджетов.Представление,
		|	ВЫБОР
		|		КОГДА ВариантыБюджетов.ДетальностьПланирования = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПланирования.Неделя)
		|			ТОГДА 1
		|		КОГДА ВариантыБюджетов.ДетальностьПланирования = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПланирования.Месяц)
		|			ТОГДА 2
		|		КОГДА ВариантыБюджетов.ДетальностьПланирования = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПланирования.Квартал)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК ИндексДетальности
		|ИЗ
		|	Справочник.ВариантыБюджетов КАК ВариантыБюджетов
		|ГДЕ
		|	НЕ ВариантыБюджетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ВариантыБюджетов.Представление";
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		МинимальныйИндексДетальности = 0;
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка = Параметры.Отбор.ИсключаемаяСсылка Тогда
				МинимальныйИндексДетальности = Выборка.ИндексДетальности;
				Продолжить;
			КонецЕсли;
			
			Если ИсключатьКрупнуюДетальность И Выборка.ИндексДетальности > МинимальныйИндексДетальности Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
			
		КонецЦикла;
		 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПроверитьПредопределенный(ИмяПредопределенного, Наименование1, Наименование2) 
	
	Попытка
		Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВариантыБюджетов." + ИмяПредопределенного);
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Ссылка = Справочники.ВариантыБюджетов.НайтиПоНаименованию(Наименование1, Истина);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ссылка) И Наименование1 <> Наименование2 Тогда
		Ссылка = Справочники.ВариантыБюджетов.НайтиПоНаименованию(Наименование2, Истина);
	КонецЕсли;
	
	Если Ссылка = Неопределено 
			Или Не ЗначениеЗаполнено(Ссылка.ИмяПредопределенныхДанных)
			Или Не Ссылка.Активность
			Или Не ЗначениеЗаполнено(Ссылка.Наименование)
			Или Не ЗначениеЗаполнено(Ссылка.Валюта) 
			Или Не ЗначениеЗаполнено(Ссылка.НачалоПланирования) 
			Или Не ЗначениеЗаполнено(Ссылка.ДетальностьПланирования)  Тогда
		
		ОбъектСсылки = ?(Не ЗначениеЗаполнено(Ссылка), Справочники.ВариантыБюджетов.СоздатьЭлемент(), Ссылка.ПолучитьОбъект());
		Если ОбъектСсылки.ЭтоНовый() Тогда
			ОбъектСсылки.Заполнить(Неопределено);
		КонецЕсли;
		ОбъектСсылки.ИмяПредопределенныхДанных  = ИмяПредопределенного;
		Если Не ЗначениеЗаполнено(ОбъектСсылки.Наименование) Тогда
			ОбъектСсылки.Наименование               = Наименование1;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбъектСсылки.Валюта) Тогда
			ОбъектСсылки.Валюта    = Константы.ВалютаУчета.Получить();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбъектСсылки.НачалоПланирования) Тогда
			ТекущаяДата = ТекущаяДатаСеанса();
			ОбъектСсылки.НачалоПланирования    = НачалоГода(?(Месяц(ТекущаяДата) < 2, ДобавитьМесяц(ТекущаяДата, -12), ТекущаяДата));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ОбъектСсылки.ДетальностьПланирования) Тогда
			ОбъектСсылки.ДетальностьПланирования = Перечисления.ПериодичностьПланирования.Месяц;
			ОбъектСсылки.ЧислоМесяца = 1;
			ОбъектСсылки.НомерМесяца = 1;
		КонецЕсли;
		
		ОбъектСсылки.Активность = Истина;
		
		ОбъектСсылки.ДополнительныеСвойства.Вставить("НеПроверятьСостояние", Истина);
		ОбъектСсылки.Записать();
		Ссылка = ОбъектСсылки.Ссылка;
		
		ОбслуживаниеСправочников.ПроверитьДублиНаименованийПредопределенного(Ссылка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПометкаУдаления Тогда
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь, Истина);
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции


#КонецОбласти


#КонецЕсли
