#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет информационные реквизиты по указанному или всем контактам
//	в регистре сведений "СтатистикаСправочников".
//Перед использованием необходимо актуализировать ключи статей.
//
//Параметры:
//	Ссылка - СправочникСсылка или Неопределено 
//
Процедура ОбновитьРегистрСтатистики(Ссылка = Неопределено) Экспорт
	
	РегистрыСведений.СтатистикаСправочников.ОбновитьСтатистикуСправочника("Контакты", Ссылка);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПредопределенныеГруппы();
	
	УзлыОбмена = ПланыОбмена.МобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.Контакты);
	КонецЕсли;
	
	УзлыОбмена = ПланыОбмена.СинхронизацияАвтономныхКопий.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.Контакты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПредопределенныеГруппы() Экспорт
	
	ПроверитьПредопределенный("Магазины", НСтр("ru='Магазины'"), "Магазины");
	ПроверитьПредопределенный("ЧленыСемьи", НСтр("ru='Члены семьи'"), "Семья");

КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	ОбслуживаниеСправочников.ПроверитьСтандартныеПараметрыОтбора(Параметры);
	
	// Если в параметрах есть необходимые ключи/значения будет выполнена расширенная обработка получения данных
	ОбслуживаниеСправочников.ВыполнитьРасширенноеПолучениеДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда 
		
		ОбслуживаниеСправочников.ОбработкаПолученияФормыВыбора(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПредопределенный(ИмяПредопределенного, Наименование1, Наименование2) 
	
	Попытка
		Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Контакты." + ИмяПредопределенного);
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Ссылка = Справочники.Контакты.НайтиПоНаименованию(Наименование1, Истина);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ссылка) И Наименование1 <> Наименование2 Тогда
		Ссылка = Справочники.Контакты.НайтиПоНаименованию(Наименование2, Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка)
		Или Ссылка.Наименование <> Наименование1
		Или Ссылка.ИмяПредопределенныхДанных <> ИмяПредопределенного
		Или Не Ссылка.Активность Тогда
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			СпрОбъект = Ссылка.ПолучитьОбъект();
		Иначе
			СпрОбъект = Справочники.Контакты.СоздатьГруппу();
			СпрОбъект.Заполнить(Неопределено);
		КонецЕсли;
		
		СпрОбъект.ИмяПредопределенныхДанных = ИмяПредопределенного;
		СпрОбъект.Наименование = Наименование1;
		СпрОбъект.Активность = Истина;
		
		СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверятьСостояние", Истина);
		СпрОбъект.Записать();
		Ссылка = СпрОбъект.Ссылка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПометкаУдаления Тогда
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь, Истина);
	КонецЕсли;
	
	ОбслуживаниеСправочников.ПроверитьДублиНаименованийПредопределенного(Ссылка);
	
КонецПроцедуры
 

#КонецОбласти


#КонецЕсли



