////////////////////////////////////////////////////////////////////////////////
//ОбщаяФорма.ПараметрыБюджетирования
//  
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопРеквизитыФормы = Новый Структура;
	ДопРеквизитыФормы.Вставить("ПредопределенныйВариант", Справочники.ВариантыБюджетов.БазовыйВариант);
	ДопРеквизитыФормы.Вставить("ТекущийГод", Год(ТекущаяДатаСеанса()));
	
	НаборКонстант = Константы.СоздатьНабор("ПределПланирования,ОсновнойВариантБюджета");
	НаборКонстант.Прочитать();
	
	ГодПределаПланирования = Год(НаборКонстант.ПределПланирования);
	ОсновнойВариантБюджета = НаборКонстант.ОсновнойВариантБюджета;
	Если Не ЗначениеЗаполнено(ОсновнойВариантБюджета) Тогда
		ОсновнойВариантБюджета = ДопРеквизитыФормы.ПредопределенныйВариант;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПределПланированияПриИзменении(Элемент)
	
	Если ГодПределаПланирования < ДопРеквизитыФормы.ТекущийГод Тогда
		ГодПределаПланирования = ДопРеквизитыФормы.ТекущийГод;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойВариантБюджетаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ОсновнойВариантБюджета) Тогда
		ОсновнойВариантБюджета = ДопРеквизитыФормы.ПредопределенныйВариант;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьСервер();
	Оповестить("Изменены параметры бюджетрования");
	Если Открыта() Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаписатьСервер()
	
	НаборКонстант = Константы.СоздатьНабор("ПределПланирования,ОсновнойВариантБюджета");
	НаборКонстант.ПределПланирования = Дата(ГодПределаПланирования, 12, 31, 23, 59, 59);
	НаборКонстант.ОсновнойВариантБюджета = ОсновнойВариантБюджета;
	НаборКонстант.Записать();
	
КонецПроцедуры

#КонецОбласти


