
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПредопределенныеСчета();
	
КонецПроцедуры

Процедура ПроверитьПредопределенныеСчета() Экспорт
	
	СчетОбъект = ПланыСчетов.РазделыУчета.Деньги.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Деньги'");
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.СвободныеДеньги.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Свободные деньги'");
	СчетОбъект.Родитель     = ПланыСчетов.РазделыУчета.Деньги;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.Накопления.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Накопления'");
	СчетОбъект.Родитель     = ПланыСчетов.РазделыУчета.Деньги;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.Имущество.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Имущество'");
	СчетОбъект.Родитель     = ПланыСчетов.РазделыУчета.ПустаяСсылка();
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.Долги.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Долги'");
	СчетОбъект.Родитель     = ПланыСчетов.РазделыУчета.ПустаяСсылка();
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.ОсновныеСуммыДолгов.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Основные суммы долгов'");
	СчетОбъект.Родитель     = ПланыСчетов.РазделыУчета.Долги;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.ПроцентыПоДолгам.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Проценты по долгам'");
	СчетОбъект.Родитель     = ПланыСчетов.РазделыУчета.Долги;
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);

	СчетОбъект = ПланыСчетов.РазделыУчета.Капитал.ПолучитьОбъект();
	СчетОбъект.Наименование = НСтр("ru = 'Капитал'");
	ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СчетОбъект);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#КонецОбласти



#КонецЕсли
