&НаКлиенте
Перем мПрограммноеЗакрытие;

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОписаниеОшибки) Тогда 
		Элементы.НадписьОписаниеОшибки.Заголовок = Параметры.ОписаниеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыПовторить(Кнопка)
	
	мПрограммноеЗакрытие = Истина;
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыЗакрыть(Команда)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ мПрограммноеЗакрытие Тогда
		мПрограммноеЗакрытие = Истина;
		Отказ = Истина;
		Закрыть(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастроитьПараметрыПроксиСервера(Команда)
	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера");
КонецПроцедуры

#КонецОбласти

мПрограммноеЗакрытие = Ложь;