

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеВСтрокуJSON(Данные) Экспорт
	Возврат ПарсерJSON.ДанныеВСтрокуJSON(Данные);
КонецФункции

Функция ДанныеИзСтрокиJSON(Строка, ИменаПолейТипаДата = "") Экспорт
	Возврат ПарсерJSON.ДанныеИзСтрокиJSON(Строка, ИменаПолейТипаДата);
КонецФункции

// Возвращает строку со структурой, описывающей ссылочный объект
//
//Параметры:
//	Ссылка - ссылочный объект
//
//Возвращаемое значение:
//	Строка - 
//
Функция СсылочныйОбъектВСтрокуJSON(Ссылка) Экспорт
	Перем Результат;
	
	СтруктураОбъекта = СтруктураСсылочногоОбъектаДляЗаписи(Ссылка);
	
	Если ЗначениеЗаполнено(СтруктураОбъекта) Тогда
		Результат = ДанныеВСтрокуJSON(СтруктураОбъекта);
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает объект (структуру, соответствие, массив или данные простого типа), все элементы которого
// подготовленны для записи в json:
// 	- все ссылочные объекты представленны в виде структур (только идентификаторы и поля для поиска)
// 	- все таблицы значений и табличные части представлены массивами структур
// 	- все соответствия представленны в виде структур
// 	- простые типы остаются без изменений
//
Функция ПодготовитьДанныеДляЗаписиВJSON(Знач Данные) Экспорт
	
	Если Данные = Неопределено
		Или Данные = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Неопределено;
	ТипЗначения = ТипЗнч(Данные);
	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
		
		Результат = Новый Массив();
		Для Каждого ЭлементМассива Из Данные Цикл
			Результат.Добавить(ПодготовитьДанныеДляЗаписиВJSON(ЭлементМассива));
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый Структура();
		Для Каждого КлючИЗначение Из Данные Цикл
			Результат.Вставить(КлючИЗначение.Ключ, ПодготовитьДанныеДляЗаписиВJSON(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		КопияДанных = ПарсерJSON.СоответствиеВСтруктуру(Данные);
		Результат = Новый Структура();
		Для Каждого КлючИЗначение Из КопияДанных Цикл
			Результат.Вставить(КлючИЗначение.Ключ, ПодготовитьДанныеДляЗаписиВJSON(КлючИЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
		
		КопияДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(Данные);
		Результат = Новый Массив();
		Для Каждого ЭлементМассива Из КопияДанных Цикл
			Результат.Добавить(ПодготовитьДанныеДляЗаписиВJSON(ЭлементМассива));
		КонецЦикла;
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
		
		Результат = СтруктураСсылочногоОбъектаДляЗаписи(Данные);
		
	Иначе
		
		Результат = Данные;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция СтруктураСсылочногоОбъектаДляЗаписи(Ссылка) Экспорт
	
	СтруктураОбъекта = Неопределено;
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	ТипЗначения = ТипЗнч(Ссылка);
	Если ТипЗначения = Тип("ПланСчетовСсылка.РазделыУчета") Тогда
		СтруктураОбъекта = СчетВСтруктуру(Ссылка);
		
	ИначеЕсли ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта)
		Или ОбщегоНазначения.ЭтоПланВидовХарактеристик(МетаданныеОбъекта) Тогда
		СтруктураОбъекта = СсылкаСправочникаВСтруктуру(Ссылка);
	
	ИначеЕсли ОбщегоНазначения.ЭтоПеречисление(МетаданныеОбъекта) Тогда
		СтруктураОбъекта = СсылкаПеречисленияВСтруктуру(Ссылка);
		
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
		СтруктураОбъекта = СсылкаДокументаВСтруктуру(Ссылка);
		
	ИначеЕсли ОбщегоНазначения.ЭтоПланОбмена(МетаданныеОбъекта) Тогда
		СтруктураОбъекта = СсылкаПланаОбменаВСтруктуру(Ссылка);
		
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции

Функция СчетВСтруктуру(Ссылка)
	
	ПоляРезультата = "Тип,УникальныйИдентификатор,ИмяОбъектаМетаданных,ПустоеЗначение";
	Результат = Новый Структура(ПоляРезультата);
	Результат.Тип = "ПланСчетов";
	Результат.УникальныйИдентификатор = Ссылка.УникальныйИдентификатор();
	Результат.ИмяОбъектаМетаданных = "ПланСчетов.РазделыУчета";
	Результат.ПустоеЗначение = Не ЗначениеЗаполнено(Ссылка);
	Если Не Результат.ПустоеЗначение Тогда
		Результат.Вставить("Предопределенный", Истина);
		Результат.Вставить("ИмяПредопределенныхДанных", Ссылка.ИмяПредопределенныхДанных);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаСправочникаВСтруктуру(Ссылка) 
	
	ПоляРезультата = "Тип,УникальныйИдентификатор,ИмяОбъектаМетаданных,ПустоеЗначение";
	ПоляОбъекта    = "Предопределенный,ИмяПредопределенныхДанных";
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ЕстьКод = Ссылка.Метаданные().ДлинаКода > 0;
		Если ЕстьКод Тогда
			ПоляРезультата = ПоляРезультата + ",Код";
			ПоляОбъекта    = ПоляОбъекта + ",Код";
		КонецЕсли;
		
		ЕстьНаименование = Ссылка.Метаданные().ДлинаНаименования > 0;
		Если ЕстьНаименование Тогда
			ПоляРезультата = ПоляРезультата + ",Наименование";
			ПоляОбъекта    = ПоляОбъекта + ",Наименование";
		КонецЕсли;
		
		Иерархический = Ссылка.Метаданные().Иерархический;
		ЕстьГруппы = Иерархический И Ссылка.Метаданные().ВидИерархии =  Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
		Если Иерархический Тогда
			ПоляРезультата = ПоляРезультата + ",Родитель";
			ПоляОбъекта    = ПоляОбъекта + ",Родитель";
			Если ЕстьГруппы Тогда
				ПоляРезультата = ПоляРезультата + ",ЭтоГруппа";
				ПоляОбъекта    = ПоляОбъекта + ",ЭтоГруппа";
			КонецЕсли;
		КонецЕсли;
		
		ЗначенияПолей = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ПоляОбъекта);
		Если ЗначенияПолей.Предопределенный Тогда
			ПоляРезультата = ПоляРезультата + ",Предопределенный,ИмяПредопределенныхДанных";
		КонецЕсли;
		
		Результат = Новый Структура(ПоляРезультата);
		Результат.ПустоеЗначение = Ложь;
		Для Каждого КлючИЗначение Из ЗначенияПолей Цикл
			
			ПриведенноеЗначение = Неопределено;
			ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
				ПриведенноеЗначение = СтруктураСсылочногоОбъектаДляЗаписи(КлючИЗначение.Значение);
			Иначе
				ПриведенноеЗначение = КлючИЗначение.Значение;
			КонецЕсли;
			Если Результат.Свойство(КлючИЗначение.Ключ) Тогда
				Результат[КлючИЗначение.Ключ] = ПриведенноеЗначение;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Результат = Новый Структура(ПоляРезультата);
		Результат.ПустоеЗначение = Истина;
		
	КонецЕсли;
	
	Результат.Тип = ?(ОбщегоНазначения.ЭтоПланВидовХарактеристик(Ссылка.Метаданные()), 
			"ПланВидовХарактеристик", "Справочник");
	Результат.УникальныйИдентификатор = Ссылка.УникальныйИдентификатор();
	Результат.ИмяОбъектаМетаданных    = Ссылка.Метаданные().ПолноеИмя();
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПеречисленияВСтруктуру(Ссылка)
	
	ПоляРезультата = "Тип,УникальныйИдентификатор,ИмяОбъектаМетаданных,ПустоеЗначение";
	Результат = Новый Структура(ПоляРезультата);
	Результат.Тип = "Перечисление";
	Результат.УникальныйИдентификатор = ОбщегоНазначения.ИмяЗначенияПеречисления(Ссылка);
	Результат.ИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя();
	Результат.ПустоеЗначение = Не ЗначениеЗаполнено(Ссылка);
	Если Не Результат.ПустоеЗначение Тогда
		Результат.Вставить("Предопределенный", Истина);
		Результат.Вставить("ИмяПредопределенныхДанных", Результат.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаДокументаВСтруктуру(Ссылка)
	
	ПоляРезультата = "Тип,УникальныйИдентификатор,ИмяОбъектаМетаданных,ПустоеЗначение";
	Результат = Новый Структура(ПоляРезультата);
	Результат.Тип = "Документ";
	Результат.УникальныйИдентификатор = Ссылка.УникальныйИдентификатор();
	Результат.ИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя();
	Результат.ПустоеЗначение = Не ЗначениеЗаполнено(Ссылка);
	Если Не Результат.ПустоеЗначение Тогда
		
		Результат.Вставить("Дата", Ссылка.Дата);
		
		Если Ссылка.Метаданные().Реквизиты.Найти("ЭтоШаблон") <> Неопределено Тогда
			Результат.Вставить("ЭтоШаблон", Ссылка.ЭтоШаблон);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СсылкаПланаОбменаВСтруктуру(Ссылка)
	
	ПоляРезультата = "Тип,УникальныйИдентификатор,ИмяОбъектаМетаданных,ПустоеЗначение";
	Результат = Новый Структура(ПоляРезультата);
	Результат.Тип = "ПланОбмена";
	Результат.УникальныйИдентификатор = Ссылка.УникальныйИдентификатор();
	Результат.ИмяОбъектаМетаданных = Ссылка.Метаданные().ПолноеИмя();
	Результат.ПустоеЗначение = Не ЗначениеЗаполнено(Ссылка);
	
	Если Не Результат.ПустоеЗначение Тогда
		
		ПоляОбъектв = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ЭтотУзел,Код,Наименование,НомерПринятого,НомерОтправленного");
		Для Каждого КлючИЗначение Из ПоляОбъектв Цикл
			Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
