
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет информационные реквизиты по указанной или всем статьям
//	в регистре сведений "СтатистикаСправочников".
//Перед использованием необходимо актуализировать ключи статей.
//
//Параметры:
//	Ссылка - СправочникСсылка или Неопределено 
//
Процедура ОбновитьРегистрСтатистики(Ссылка = Неопределено) Экспорт
	
	РегистрыСведений.СтатистикаСправочников.ОбновитьСтатистикуСправочника("СтатьиДоходов", Ссылка);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПредопределенныеЭлементы();
	
	УзлыОбмена = ПланыОбмена.МобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.СтатьиДоходов);
	КонецЕсли;
	
	УзлыОбмена = ПланыОбмена.СинхронизацияАвтономныхКопий.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.СтатьиДоходов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПредопределенныеЭлементы() Экспорт
	
	Прочие = ПроверитьПредопределенный("ПрочиеДоходы", НСтр("ru='Прочие доходы'"), "Прочие доходы", Неопределено);
	ПроверитьПредопределенный("ИзменениеОстатка", НСтр("ru='Увеличение остатка'"), "Изменение остатка", Прочие);
	ПроверитьПредопределенный("ОбменВалюты", НСтр("ru='Поступление валюты'"), "Обмен валюты", Прочие);
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	ОбслуживаниеСправочников.ПроверитьСтандартныеПараметрыОтбора(Параметры);
	
	// Если в параметрах есть необходимые ключи/значения будет выполнена расширенная обработка получения данных
	ОбслуживаниеСправочников.ВыполнитьРасширенноеПолучениеДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда 
		
		ОбслуживаниеСправочников.ОбработкаПолученияФормыВыбора(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПроверитьПредопределенный(ИмяПредопределенного, Наименование1, Наименование2, РодительскаяСтатья) 
	
	Попытка
		Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтатьиДоходов." + ИмяПредопределенного);
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Ссылка = Справочники.СтатьиДоходов.НайтиПоНаименованию(Наименование1, Истина);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ссылка) И Наименование1 <> Наименование2 Тогда
		Ссылка = Справочники.СтатьиДоходов.НайтиПоНаименованию(Наименование2, Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка)
		Или Ссылка.Наименование <> Наименование1
		Или Ссылка.ИмяПредопределенныхДанных <> ИмяПредопределенного
		Или Не Ссылка.Активность
		Или Ссылка.Родитель <> РодительскаяСтатья Тогда
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			СпрОбъект = Ссылка.ПолучитьОбъект();
		Иначе
			СпрОбъект = Справочники.СтатьиДоходов.СоздатьЭлемент();
			СпрОбъект.Заполнить(Неопределено);
		КонецЕсли;
		
		СпрОбъект.ИмяПредопределенныхДанных = ИмяПредопределенного;
		СпрОбъект.Наименование = Наименование1;
		СпрОбъект.Родитель = РодительскаяСтатья;
		СпрОбъект.Активность = Истина;
		
		СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверятьСостояние", Истина);
		СпрОбъект.Записать();
		Ссылка = СпрОбъект.Ссылка;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПометкаУдаления Тогда
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь, Истина);
	КонецЕсли;

	ОбслуживаниеСправочников.ПроверитьДублиНаименованийПредопределенного(Ссылка);
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти



#КонецЕсли
