
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	
	
#Область ПрограммныйИнтерфейс

// Выполняет проверку корректности записей, исправляет ошибки
Процедура ПроверитьЗаписи(БылиОшибки = Ложь) Экспорт
	
	ОчиститьЗаписиСНесущесвтующимиСсылками(БылиОшибки);
	
	ПроверитьСтатьиИРазделы(БылиОшибки);
	
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСлужебный.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "ПоказателиБюджета", Загрузка);
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьЗаписиСНесущесвтующимиСсылками(БылиОшибки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.ВариантБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.ВариантБюджета.Ссылка ЕСТЬ NULL
	|;
	|
	|//// 1 /////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.РазделБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.РазделБюджета <> Значение(Справочник.ФинансовыеЦели.ПустаяСсылка) И Показатели.РазделБюджета.Ссылка ЕСТЬ NULL
	|;
	|
	|//// 2 /////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.ГрафаБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.ГрафаБюджета <> Значение(Справочник.ГрафыБюджета.ПустаяСсылка) И Показатели.ГрафаБюджета.Ссылка ЕСТЬ NULL
	|;
	|
	|//// 3 /////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Показатели.СтатьяБюджета КАК Ссылка
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК Показатели
	|ГДЕ
	|	Показатели.СтатьяБюджета <> Значение(Справочник.ФинансовыеЦели.ПустаяСсылка) 
	|	И Показатели.СтатьяБюджета <> Неопределено 
	|	И Показатели.СтатьяБюджета.Ссылка ЕСТЬ NULL
	|";
	
	РезульатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Очитска вариантов бюджета
	Выборка = РезульатыЗапроса[0].Выбрать();
	ОчиститьНаборыПоВыборке(Выборка, "ВариантБюджета", БылиОшибки, Неопределено);
	
	// Очитска разделов бюджета
	Выборка = РезульатыЗапроса[1].Выбрать();
	ДопустимыеЗначения = Новый Массив();
	ДопустимыеЗначения.Добавить(Справочники.ФинансовыеЦели.ПустаяСсылка());
	ДопустимыеЗначения.Добавить(Справочники.ФинансовыеЦели.ОбщиеНакопления);
	ОчиститьНаборыПоВыборке(Выборка, "РазделБюджета", БылиОшибки, ДопустимыеЗначения);
	
	// Очитска граф бюджета
	Выборка = РезульатыЗапроса[2].Выбрать();
	ОчиститьНаборыПоВыборке(Выборка, "ГрафаБюджета", БылиОшибки, Неопределено);
	
	// Очитска статей бюджета
	Выборка = РезульатыЗапроса[3].Выбрать();
	ДопустимыеЗначения.Добавить(Неопределено);
	ДопустимыеЗначения.Добавить(Справочники.ГрафыБюджета.ПустаяСсылка());
	ОчиститьНаборыПоВыборке(Выборка, "СтатьяБюджета", БылиОшибки, ДопустимыеЗначения);
	
КонецПроцедуры

Процедура ОчиститьНаборыПоВыборке(Выборка, ИмяИзмерения, БылиОшибки, ДоступныеЗначения = Неопределено)
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) 
			Или ДоступныеЗначения <> Неопределено И ДоступныеЗначения.Найти(Выборка.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура(ИмяИзмерения, Выборка.Ссылка));
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Бюджетирование", УровеньЖурналаРегистрации.Ошибка, , Выборка.Ссылка,
				СтрШаблон("Не удалось очистить набор показателей бюджета по измерению ""%1"" со значением ""%2"" (%3):
				|%4", ИмяИзмерения, Выборка.Ссылка, ТипЗнч(Выборка.Ссылка), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСтатьиИРазделы(БылиОшибки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Различные
		|	ПоказателиБюджета.ВариантБюджета КАК ВариантБюджета,
		|	ПоказателиБюджета.НачалоПериода КАК НачалоПериода,
		|	ПоказателиБюджета.РазделБюджета КАК РазделБюджета,
		|	ПоказателиБюджета.ГрафаБюджета КАК ГрафаБюджета,
		|	ПоказателиБюджета.СтатьяБюджета КАК СтатьяБюджета,
		|	ПоказателиБюджета.ТипПоказателя КАК ТипПоказателя,
		|	ПоказателиБюджета.ГрафаБюджета.ТипПоказателя КАК ТипПоказателяИзГрафы,
		|	ПоказателиБюджета.Сумма КАК Сумма,
		|	ПоказателиБюджета.Порядок КАК Порядок,
		|	ПоказателиБюджета.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.ПоказателиБюджета КАК ПоказателиБюджета
		|ГДЕ
		|	ПоказателиБюджета.ТипПоказателя.Ссылка ЕСТЬ NULL
		|	ИЛИ ПоказателиБюджета.СтатьяБюджета = Неопределено
		|	ИЛИ (ПоказателиБюджета.РазделБюджета = ЗНАЧЕНИЕ(Справочник.ФинансовыеЦели.ПустаяСсылка) 
		|		И ПоказателиБюджета.СтатьяБюджета.Ссылка ЕСТЬ NULL) ";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	КэшСсылок = Новый Соответствие();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Запись = РегистрыСведений.ПоказателиБюджета.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Попытка
				Запись.Удалить();
			Исключение
				БылиОшибки = Истина;
				Ошибка = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Бюджет", УровеньЖурналаРегистрации.Ошибка, , ,
					СтрШаблон("Не удалось удалить запись показателей бюджета:
					|%1
					|по причине:
					|%2", ЗаписьРегистраВJSON(ВыборкаДетальныеЗаписи), ПодробноеПредставлениеОшибки(Ошибка)));
			КонецПопытки;
		КонецЕсли;
		
		Если Не ОбщегоНазначенияДеньги.СсылочныйОбъектСуществует(ВыборкаДетальныеЗаписи.ВариантБюджета, КэшСсылок)
			Или Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НачалоПериода) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Если Не ЗначениеЗаполнено(Запись.СтатьяБюджета) Тогда
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РазделБюджета) И
				(ВыборкаДетальныеЗаписи.ГрафаБюджета = Справочники.ГрафыБюджета.СвободныеДеньгиВозвратИзНакопления
					Или ВыборкаДетальныеЗаписи.ГрафаБюджета = Справочники.ГрафыБюджета.СвободныеДеньгиПереводВНакопление) Тогда
				
				Запись.СтатьяБюджета = ВыборкаДетальныеЗаписи.ГрафаБюджета;
				
			ИначеЕсли Запись.СтатьяБюджета = Неопределено Тогда
				Запись.СтатьяБюджета = Справочники.ФинансовыеЦели.ПустаяСсылка();

			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ТипПоказателя) Тогда
			Запись.ТипПоказателя = ВыборкаДетальныеЗаписи.ТипПоказателяИзГрафы;
		КонецЕсли;
		
		Попытка
			Запись.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Бюджет", УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон("Не удалось записать запись показателей бюджета:
				|%1
				|по причине:
				|%2", ЗаписьРегистраВJSON(ВыборкаДетальныеЗаписи), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписьРегистраВJSON(ДанныеЗаписи)
	
	СтруктураЗаписи = Новый Структура("ВариантБюджета,НачалоПериода,РазделБюджета,ТипПоказателя,ГрафаБюджета,СтатьяБюджета");
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ДанныеЗаписи);
	Для Каждого КлючИЗначение Из СтруктураЗаписи Цикл
		Если ТипЗнч(КлючИЗначение.Значение) <> Тип("Дата") Тогда
			СтруктураЗаписи[КлючИЗначение.Ключ] = "" + КлючИЗначение.Значение + " (" + ТипЗнч(КлючИЗначение.Значение) + ")";
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПарсерJSON.ДанныеВСтрокуJSON(СтруктураЗаписи);
	
КонецФункции

#КонецОбласти
	




#КонецЕсли