
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьСсылкуНаОбучение = ОбщегоНазначенияВызовСервера.ХранилищеСистемныхНастроекЗагрузить("Общее/ПросмотрКраткихПодсказок", "ПоказыватьОбучениеНаНачальнойСтранице", Истина);
	ТекстПояснения = НСтр("ru = 'Страницу обучения всегда можно открыть из меню <Сервис> - <Обучение>'");
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	ОкНаСервере(ПоказыватьСсылкуНаОбучение);
	Оповестить("Изменение индикатора ссылки на обучение");
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОкНаСервере(ПоказыватьСсылкуНаОбучение)

	ОбщегоНазначенияВызовСервера.ХранилищеСистемныхНастроекСохранить(
		"Общее/ПросмотрКраткихПодсказок", 
		"ПоказыватьОбучениеНаНачальнойСтранице", 
		ПоказыватьСсылкуНаОбучение);

КонецПроцедуры
 