///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает узел плана обмена, соответствующий центральной базе
//
//Параметры:
//	ИмяПланаОбмена - наименование плана обмена, в котором нужно найти узел ЦБ.
//					по умолчанию используется "СинхронизацияАвтономныхКопий"
//
//Возвращаемое значение:
//	ПланОбменаСсылка
//
Функция УзелЦентральнойБазы(ИмяПланаОбмена = "СинхронизацияАвтономныхКопий") Экспорт
	Возврат СинхронизацияАвтономныхКопийПовтИсп.УзелЦентральнойБазы(ИмяПланаОбмена);
КонецФункции

// Возвращает код центральной базы
//
//Параметры:
//	ИмяПланаОбмена - наименование плана обмена, в котором нужно найти узел ЦБ.
//					по умолчанию используется "СинхронизацияАвтономныхКопий"
//
//Возвращаемое значение:
//	Строка
//
Функция КодЦентральнойБазы(ИмяПланаОбмена = "СинхронизацияАвтономныхКопий") Экспорт

	Возврат СокрЛП(УзелЦентральнойБазы(ИмяПланаОбмена).Код);

КонецФункции

// Обновляет код центральной базы в планах обмена
//
//Параметры:
//	НовыйКод - Строка - код, который нужно установить для "центральной базы" в планах обмена
//
Процедура ЗаменитьКодЦентральнойБазы(НовыйКод) Экспорт
	
	Узел = УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	Если Узел.Код <> НовыйКод Тогда
		УзелОбъект = Узел.ПолучитьОбъект();	
		УзелОбъект.Код = НовыйКод;
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();
	КонецЕсли;
	
	Узел = УзелЦентральнойБазы("МобильноеПриложение");
	Если Узел.Код <> НовыйКод Тогда
		УзелОбъект = Узел.ПолучитьОбъект();	
		УзелОбъект.Код = НовыйКод;
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает ссылку на этот узел указанного плана обмена
//
//Параметры:
//	ИмяПланаОбмена - наименование плана обмена, в котором нужно найти узел ЦБ.
//					по умолчанию используется "СинхронизацияАвтономныхКопий"
//
//Возвращаемое значение:
//	Строка
//
Функция ЭтотУзел(ИмяПланаОбмена = "СинхронизацияАвтономныхКопий") Экспорт

	МенеджерПланаОбмена = ПланыОбмена[ИмяПланаОбмена];
	Результат = МенеджерПланаОбмена.ЭтотУзел();
	Если СтрДлина(СокрП(Результат.Код)) < 30 Тогда
		Если ЭтоЦентральнаяБаза() Тогда
			ИмяУзла = НСтр("ru='Центральная база'"); 
		Иначе
			ИмяУзла = НСтр("ru='Эта информационная база'"); 
		КонецЕсли;
		ОбновитьИнформациюЭтогоУзла(Результат, ИмяУзла);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает код центральной базы
//
//Параметры:
//	ИмяПланаОбмена - наименование плана обмена, в котором нужно найти узел ЦБ.
//					по умолчанию используется "СинхронизацияАвтономныхКопий"
//
//Возвращаемое значение:
//	Строка
//
Функция КодЭтогоУзла(ИмяПланаОбмена = "СинхронизацияАвтономныхКопий") Экспорт

	Возврат СокрЛП(ЭтотУзел(ИмяПланаОбмена).Код);

КонецФункции

// Определяет, является текущая база центральной по отношении к другим базам
//
//Параметры:
//	нет
//
//Возвращаемое значение:
//	Булево
//
Функция ЭтоЦентральнаяБаза() Экспорт
	Возврат СинхронизацияАвтономныхКопийПовтИсп.ЭтоЦентральнаяБаза();
КонецФункции

// Определяет, является текущая база автономной копией базы в облаке
//
//Параметры:
//	нет
//
//Возвращаемое значение:
//	Булево
//
Функция ЭтоАвтономнаяКопия() Экспорт
	Возврат СинхронизацияАвтономныхКопийПовтИсп.ЭтоАвтономнаяКопия();
КонецФункции

// Определяет, является ли мобильным приложением узел с указаннмы кодом
//
//Параметры:
//	КодУзла - строка - код проверяемого узда плана обмена "СинхронизацияАвтономныхКопий"
//
//Возвращаемое значение:
//	Булево - Истина, если узел является мобильным приложением
//
Функция ЭтоМобильноеПриложение(ИмяПланаОбмена, КодУзла) Экспорт
	
	Если НРег(ИмяПланаОбмена) = "мобильноеприложение" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Узел = СинхронизацияАвтономныхКопий.УзелПланаОбменаПоКоду(ИмяПланаОбмена, КодУзла, Ложь);
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Нет узла с кодом ""%1"" в пдане обмена %2'"), КодУзла, ИмяПланаОбмена);
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Узел, "МобильноеУстройство", Ложь);
	
КонецФункции 

// Записывает информацию об ошибке в журнал регистрации и отмечает результат обмена в регистрах сведений
//
//Параметры:
//	Ошибка - Строка или ИнформацияОбОшибке - то, что нужно зафиксировать
//	Узел - ПланОбменаСсылка - узел, при обмене с которым произошла ошибка
//	ДействиеПриОбмене - Строка - "ЗагрузкаДанных" или "ВыгрузкаДанных"
//	ОписаниеПроблемы - Строка - выходной параметр - сюда помещается подготовленное описание проблемы
//
Процедура ЗарегистрироватьОшибкуОбменаСУзлом(Ошибка, Узел, ДействиеПриОбмене, ОписаниеПроблемы = "") Экспорт
	Перем НачалоТекстаОшибки, ПредставлениеОшибки, ПодробностиОшибки;
	
	// Формирование представления ошибки
	Если ДействиеПриОбмене = "ЗагрузкаДанных" Тогда
		НачалоТекстаОшибки = НСтр("ru = 'Ошибка загрузки данных от %1'");
		ДействиеСсылка = Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
	ИначеЕсли ДействиеПриОбмене = "ВыгрузкаДанных" Тогда
		НачалоТекстаОшибки = НСтр("ru = 'Ошибка отправки данных на %1'");
		ДействиеСсылка = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
	Иначе
		НачалоТекстаОшибки = НСтр("ru = 'Ошибка обмена данными с %1'");
		ДействиеСсылка = Перечисления.ДействияПриОбмене.ПустаяСсылка();
	КонецЕсли;
	НачалоТекстаОшибки = СтрШаблон(НачалоТекстаОшибки, ?(ЗначениеЗаполнено(Узел), """" + Узел + """", НСтр("ru='<неизвестный узел>'")));
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ПредставлениеОшибки = НачалоТекстаОшибки + Символы.ПС + КраткоеПредставлениеОшибки(Ошибка);
		ПодробностиОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ПредставлениеОшибки = НачалоТекстаОшибки + Символы.ПС +  Ошибка;
		ПодробностиОшибки = "";
	КонецЕсли; 
	
	ОписаниеПроблемы = ПредставлениеОшибки + ?(ПодробностиОшибки = "", "", Символы.ПС) + ПодробностиОшибки;
	
	// запись журнала регистрации
	ЗаписьЖурналаРегистрации(КлючСообщенияОбмена(ДействиеСсылка, Узел), 
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ОписаниеПроблемы); 
		
	// Запись в регистре БСП
	Если ЗначениеЗаполнено(ДействиеСсылка) И ЗначениеЗаполнено(Узел)
		И Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		ЗаписьОтметки = Новый Структура;
		ЗаписьОтметки.Вставить("УзелИнформационнойБазы", Узел);
		ЗаписьОтметки.Вставить("ДействиеПриОбмене", ДействиеСсылка);
		ЗаписьОтметки.Вставить("РезультатВыполненияОбмена", Перечисления.РезультатыВыполненияОбмена.Ошибка);
		ЗаписьОтметки.Вставить("ДатаОкончания", ТекущаяДатаСеанса());
		
		РегистрыСведений.СостоянияОбменовДанными.ДобавитьЗапись(ЗаписьОтметки);
		
	КонецЕсли;
	
КонецПроцедуры


// Определяет необходимость сжатия файла при обмене
//
//Параметры:
//	ИмяПланаОбмена - Строка - Наименование плана обмена
//	КодУзла - Строка - код узла обмена информационной базы
//
//Возвращаемое значение:
//	Булево - Истина, если файлы сообщения нужно сжимать
//
Функция ИспользоватьСжатиеФайлаДляУзла(ИмяПланаОбмена, КодУзла) Экспорт
	
	Если НРег(ИмяПланаОбмена) = "мобильноеприложение" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		ОбменСМобильным = ЭтоМобильноеПриложение(ИмяПланаОбмена, КодУзла);
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Не ОбменСМобильным;
	
КонецФункции 

// Проверяет возможность выполнить указанную операцию, 
//	Вызывает исключение в случае недоступности услуги
//
//Параметры:
//	ДейсвтиеПриОбмене - ПеречсилениеСсылка.ДействияПриОбмене
//
Процедура ПроверитьДоступностьОбмена(Узел, ДейсвтиеПриОбмене) Экспорт
	
	ИмяПланаОбмена = Узел.Метаданные().Имя;
	
	Если ИмяПланаОбмена = "СинхронизацияАвтономныхКопий" 
		И ЭтоЦентральнаяБаза() И ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег.Биллинг") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Модуль.ПроверитьДоступностьОбменаНаСервере(Узел, ДейсвтиеПриОбмене, ИмяПланаОбмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


// Возвращает ключ сообщения в журнал регистрации для указанного в параметрах узла
//	с учетом пустого значения
Функция КлючСообщенияОбмена(Знач ДействиеПриОбмене, Узел = Неопределено) Экспорт

	Если ТипЗнч(ДействиеПриОбмене) = Тип("Строка") Тогда
		ДействиеПриОбмене = Перечисления.ДействияПриОбмене[ДействиеПриОбмене];
	КонецЕсли;
	
	Если Узел = Неопределено Тогда
		Возврат "Обмен данными.Синхронизация автономных копий." + ДействиеПриОбмене;
	Иначе
		Возврат ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(Узел, ДействиеПриОбмене);
	КонецЕсли;
	
КонецФункции

Процедура ОбновитьИнформациюЭтогоУзла(Узел, ИмяПоУмолчанию) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Модуль.ОбновитьИнформациюЭтогоУзла(Узел, ИмяПоУмолчанию);
		
	Иначе
		
		УзелОбъект = Узел.ПолучитьОбъект();
		УзелОбъект.Код          = СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы();
		УзелОбъект.Наименование = ИмяПоУмолчанию;
		Если Не ЗначениеЗаполнено(УзелОбъект.ВерсияФорматаОбмена) Тогда
			УзелОбъект.ВерсияФорматаОбмена = СинхронизацияАвтономныхКопийКлиентСервер.ТекущаяВерсияФормата();
		КонецЕсли;
		УзелОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#КонецОбласти