#Область ГосударственныеОрганы

// Получает реквизиты государственного органа по коду этого органа.
// Реквизиты выбираются из справочника Контрагенты, а если там нет - из открытых данных.
//
// Параметры:
//  ВидОргана			 - ПеречислениеСсылка.ВидыГосударственныхОрганов - вид органа, реквизиты которого нужно получить
//  КодОргана			 - Строка - код государственного органа
// 
// Возвращаемое значение:
//  Строка - наименование государственного органа, реквизиты которого получены
//
Функция РеквизитыГосударственногоОрганаПоКоду(Знач ВидОргана, Знач КодОргана) Экспорт
	
	// Возвращает наименование, а реквизиты может записывать в справочник Контрагенты.
	// ДЕНЬГИ код исключен
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДаннымиЕГР

// Запрашивает из открытых данных сведения об организации.
//
// Параметры:
//  Запрос	- см. НовыйЗапросДанныхЕГР() - сведения, позволяющие идентифицировать организацию
// 
// Возвращаемое значение:
//  см. НовыйОтветДанныхЕГР()
//
Функция ЗапроситьДанныеЕГР(Знач Запрос) Экспорт
	
	Ответ = ОрганизацииФормыДляОтчетностиКлиентСервер.НовыйОтветДанныхЕГР(Запрос);
	
	ЭтоЮрЛицо = (Запрос.ЮридическоеФизическоеЛицо <> Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ИНН       = СокрЛП(Запрос.ИНН);
	
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИНН, ЭтоЮрЛицо);// ИНН не соответствующий ЭтоЮрЛицо считается соответствующим требованиям
	
	Если Не РезультатПроверки.СоответствуетТребованиям Тогда
		Ответ.Ошибка.Код = "НеСоответствуетТребованиям";
		Возврат Ответ;
	КонецЕсли;
	
	// ДЕНЬГИ код исключен
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СтандартныеКлассификаторы

// Определяет наименование элемента общегосударственного классификатора,
// данные которых хранятся в справочнике Организации.
//
// Параметры:
//  Классификатор		 - Строка - имя классификатора: ОКФС, ОКОПФ, ОКВЭД, ОКВЭД2
//  КодПоКлассификатору	 - Строка - код по классификатору
// 
// Возвращаемое значение:
//  Строка       - наименование по классификатору
//  Неопределено - код не найден в классификаторе
//
Функция НаименованиеПоКлассификатору(Знач Классификатор, Знач КодПоКлассификатору) Экспорт

	Классификатор = Деньги3НДФЛВызовСервера.ПолучитьКлассификатор(Классификатор); // ДЕНЬГИ 
	
	Возврат Классификатор.Получить(КодПоКлассификатору);

КонецФункции

#КонецОбласти
