///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПроверитьВычетДоходПередЗаписью(ФормаВычетаДохода) Экспорт
	
	Если ФормаВычетаДохода.ПроверитьЗаполнение() Тогда
		Возврат Истина;
	КонецЕсли;
	
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Некоторые реквизиты не заполнены или содержат ошибки. 
		|Пока замечания не будут устранены, заполнить декларацию невозможно.
		|
		|Сохранить изменения с неправильными значениями?'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ОбработкаЗаписиПослеПроверки", ФормаВычетаДохода, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Сохранить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да);
	#КонецОбласти
	
	Возврат Ложь;
	
КонецФункции

Процедура ОткрытьЗаполнениеРеквизитовНалогоплательщика(Налогоплательщик, РедактируемыеГруппы = Неопределено, ОбязательныеГруппы = Неопределено, ОбработчикЗакрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Налогоплательщик);
	ПараметрыФормы.Вставить("ТолькоНеЗаполненное", Истина);
	ПараметрыФормы.Вставить("РедактируемыеГруппы", 
			?(типЗнч(РедактируемыеГруппы) = Тип("Строка"), СтрРазделить(РедактируемыеГруппы, ",", Ложь), РедактируемыеГруппы));
	ПараметрыФормы.Вставить("ОбязательныеГруппы", 
			?(типЗнч(ОбязательныеГруппы) = Тип("Строка"), СтрРазделить(ОбязательныеГруппы, ",", Ложь), ОбязательныеГруппы));
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы, , Налогоплательщик, , , ОбработчикЗакрытия, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти