
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьПредопределенныеЭлементы();
	
	УзлыОбмена = ПланыОбмена.СинхронизацияАвтономныхКопий.ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.ПланыВидовХарактеристик.ВидыАналитик);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПредопределенныеЭлементы() Экспорт
	
	Сслыка = ПроверитьПредопределенный("Важность", 
			НСтр("ru = 'Важность'"), 
			Новый ОписаниеТипов("СправочникСсылка.ДополнительныеЗначенияВидовАналитик"));
	
	Сслыка = ПроверитьПредопределенный("ГеографияСделки", 
			НСтр("ru = 'География сделки'"), 
			Новый ОписаниеТипов("СправочникСсылка.ДополнительныеЗначенияВидовАналитик"));
	
	Сслыка = ПроверитьПредопределенный("Имущество", 
			НСтр("ru = 'Имущество'"), 
			Новый ОписаниеТипов("СправочникСсылка.Имущество"));
	
	Сслыка = ПроверитьПредопределенный("КарточкаСкидок", 
			НСтр("ru = 'Карточка скидок'"), 
			Новый ОписаниеТипов("СправочникСсылка.ДополнительныеЗначенияВидовАналитик"));
	
	Сслыка = ПроверитьПредопределенный("Кредит", 
			НСтр("ru = 'Кредит'"), 
			Новый ОписаниеТипов("СправочникСсылка.Долги"));
	
	Сслыка = ПроверитьПредопределенный("МестоПолученияДохода", 
			НСтр("ru = 'Плательщик дохода'"), 
			Новый ОписаниеТипов("СправочникСсылка.Контакты"),
			"Место получения дохода");
	
	Сслыка = ПроверитьПредопределенный("МестоТраты", 
			НСтр("ru = 'Магазин, продавец'"), 
			Новый ОписаниеТипов("СправочникСсылка.Контакты"),
			"Место траты (магазин, кафе)");
	
	Сслыка = ПроверитьПредопределенный("НаправлениеИспользования", 
			НСтр("ru = 'На что использовано?'"), 
			Новый ОписаниеТипов("СправочникСсылка.ДополнительныеЗначенияВидовАналитик"),
			"Где будет использоваться");
	
	Сслыка = ПроверитьПредопределенный("Пометка", 
			НСтр("ru = 'Пометка'"), 
			Новый ОписаниеТипов("СправочникСсылка.ДополнительныеЗначенияВидовАналитик"));
	
	Сслыка = ПроверитьПредопределенный("Проект", 
			НСтр("ru = 'Проект'"), 
			Новый ОписаниеТипов("СправочникСсылка.ДополнительныеЗначенияВидовАналитик"));
	
	Сслыка = ПроверитьПредопределенный("ФинансоваяЦель", 
			НСтр("ru = 'Финансовая цель'"), 
			Новый ОписаниеТипов("СправочникСсылка.ФинансовыеЦели"));
	
	Сслыка = ПроверитьПредопределенный("ЧленыСемьи", 
			НСтр("ru = 'Члены семьи'"), 
			Новый ОписаниеТипов("СправочникСсылка.Контакты"),
			"Члены семьи (назначение затрат, источники доходов)");

КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПроверитьПредопределенный(ИмяПредопределенного, Наименование1, Тип, Наименование2 = Неопределено) 
	
	Попытка
		Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ВидыАналитик." + ИмяПредопределенного);
	Исключение
		Ссылка = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Ссылка = ПланыВидовХарактеристик.ВидыАналитик.НайтиПоНаименованию(Наименование1, Истина);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(Наименование2) И Наименование1 <> Наименование2 Тогда
		Ссылка = ПланыВидовХарактеристик.ВидыАналитик.НайтиПоНаименованию(Наименование2, Истина);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка)
		Или Ссылка.ИмяПредопределенныхДанных <> ИмяПредопределенного
		Или Ссылка.ТипЗначения <> Тип
		Или Ссылка.Наименование <> Наименование1 Тогда
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			СпрОбъект = Ссылка.ПолучитьОбъект();
			
		Иначе
			
			СпрОбъект = ПланыВидовХарактеристик.ВидыАналитик.СоздатьЭлемент();
			СпрОбъект.Заполнить(Неопределено);
			
		КонецЕсли;
		
		СпрОбъект.ИмяПредопределенныхДанных = ИмяПредопределенного;
		СпрОбъект.Наименование = Наименование1;
		СпрОбъект.ТипЗначения = Тип;
		
		СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверятьСостояние", Истина);
		СпрОбъект.Записать();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) И Ссылка.ПометкаУдаления Тогда
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
	КонецЕсли;
	
	ОбслуживаниеСправочников.ПроверитьДублиНаименованийПредопределенного(Ссылка);
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти



#КонецЕсли
