
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтложеннаяЗапись = ДополнительныеСвойства.Свойство("ОтложеннаяЗапись");
	
	// Проверки перед записью
	ОбслуживаниеСправочников.ПроверкаИзмененияПредопределенныхЭлементовПередЗаписью(ЭтотОбъект, Отказ, "");
	Если Не Отказ И Не ОтложеннаяЗапись 
		И (ЭтоНовый() Или Ссылка.ПометкаУдаления = ПометкаУдаления) Тогда
		ОбслуживаниеСправочников.ПроверкаНаименованияСправочникаПередЗаписью(ЭтотОбъект, Отказ);
	КонецЕсли;
	ОбслуживаниеСправочников.СогласованиеПометкиИАктивностиПередЗаписью(ЭтотОбъект, Отказ);
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПроцессыОбменаСлужебный.ПередЗаписьюИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка 
		ИЛИ ДополнительныеСвойства.Свойство("НеПроверятьСостояние") И ДополнительныеСвойства.НеПроверятьСостояние = Истина Тогда
		Возврат
	КонецЕсли; 
	
	АналитикаСтатей.ПроверитьОбновитьИспользованиеАналитики();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ТипЗнч(ЗначениеАналитикиДохода) = Тип("СправочникСсылка.ДополнительныеЗначенияВидовАналитик") Тогда
		ЗначениеАналитикиДохода = Справочники.ДополнительныеЗначенияВидовАналитик.ПустаяСсылка();
	КонецЕсли;
	Если ТипЗнч(ЗначениеАналитикиРасхода) = Тип("СправочникСсылка.ДополнительныеЗначенияВидовАналитик") Тогда
		ЗначениеАналитикиРасхода = Справочники.ДополнительныеЗначенияВидовАналитик.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

