////////////////////////////////////////////////////////////////////////////////
//Обработка.УправлениеПодписками.Форма.СостояниеПодписок
//  Показывает доступность лицензий, предоставляет возможность добавить лицензии или 
//отключить лишнюю ИБ от облака
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////
&НаКлиенте 
Перем НастройкиЗапуска;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КодЭтогоУзла = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла();
	ПроверитьПодключение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодключениеКОблакуИзменено" Тогда
		
		//ОтменитьФоновоеЗаданиеКлиент();
		ПроверитьПодключение();
		ОбновитьИнформацию();
		
	ИначеЕсли ИмяСобытия = "ОформленаПодписка" Тогда
		
		ОбновитьИнформацию();
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_АктивныеПодписки


&НаКлиенте
Процедура АктивныеПодпискиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "АктивныеПодпискиПродлить" Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаПодписки = АктивныеПодписки.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ОткрытьОплатуПодписки(СтрокаПодписки.КоличествоЛицензий, КонецДня(СтрокаПодписки.ОкончаниеДействия) + 1);
	КонецЕсли;
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПодключенныеБазы

&НаКлиенте
Процедура ПодключенныеБазыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПодключенныеБазыСостояние" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПоказатьДиалогИзмененияСостояния(ВыбраннаяСтрока)
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьОжидание(Команда)
	ОтменитьФоновоеЗаданиеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОчиститьСообщения();
	ОбновитьИнформацию();
КонецПроцедуры

&НаКлиенте
Процедура Купить(Команда)
	
	ОчиститьСообщения();
	Если РежимПокупки = Неопределено Тогда
		ОткрытьОплатуПодписки(1, ТекущаяДатаКлиентСервер(), Неопределено);
	Иначе
		ОткрытьОплатуПодписки(РежимПокупки.Количество, РежимПокупки.Начало, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УлучшитьТариф(Команда)
	
	ОчиститьСообщения();
	ОткрытьОплатуПодписки(-111, ТекущаяДатаКлиентСервер(), Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВПоддержку(Команда)
	
	ОчиститьСообщения();
	ОтправитьСообщениеВПоддержку();
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключитьКОблаку(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеСервисомАвтосинхронизации");
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключение()

	ПодключениеВыполнено = ДеньгиВОблакеВызовСервера.ЭтаБазаПодключенаКОблаку();
	Если Не ПодключениеВыполнено Тогда
		
		Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаНетПодключения;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибкеФоновогоЗадания(СообщениеПользователю, Ошибка, ТекстЗаголовка = Неопределено)

	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОшибка;
	
	Если ЗначениеЗаполнено(ТекстЗаголовка) И Элементы.ДекорацияОшибка.Заголовок <> ТекстЗаголовка Тогда
		Элементы.ДекорацияОшибка.Заголовок = ТекстЗаголовка;
	КонецЕсли;
	
	ТекстПользователю = ?(ЗначениеЗаполнено(СообщениеПользователю), СообщениеПользователю, 
				НСтр("ru='Не удалось получить информацию из облака.
						|Пожалуйста, поробуйте выполнить эту операцию позже. '"));
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = ?(ЗначениеЗаполнено(Ошибка), Ошибка, "");
	КонецЕсли;
	Элементы.ГруппаИнформацияДляТехПоддержки.Видимость = ЗначениеЗаполнено(ТекстОшибки);
	Если Элементы.ГруппаИнформацияДляТехПоддержки.Видимость Тогда
		ТекстПользователю = ТекстПользователю + НСтр("ru='Если проблема сохранится, передайте информацию в нашу службу поддержки. Постараемся исправить ситуацию как можно быстрей'");
	КонецЕсли;

	Если Элементы.ПредставлениеОшибки.Заголовок <> ТекстПользователю Тогда
		Элементы.ПредставлениеОшибки.Заголовок = ТекстПользователю;
	КонецЕсли;
	
КонецПроцедуры



#Область Обновление_информации_в_фоне

&НаКлиенте
Процедура ИзменитьСвойстваБазы(Код, НовыеСвойства)
	
	ОчиститьИнформацию(ЭтотОбъект);
	Если Не ПодключениеВыполнено Тогда
		Возврат;
	КонецЕсли;
	
	Действие = "Изменение свойств базы: " + Код;
	
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Изменение свойств базы в облаке");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ОбновитьСвойстваБазыВОблакеВФоне");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне");
	
	НастройкиЗапуска.ПараметрыМетода = Новый Структура;
	НастройкиЗапуска.ПараметрыМетода.Вставить("КодИБ", Код);
	НастройкиЗапуска.ПараметрыМетода.Вставить("СвойстваБазы", НовыеСвойства);
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 0.7, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформацию()
	
	ОчиститьИнформацию(ЭтотОбъект);
	Если Не ПодключениеВыполнено Тогда
		Возврат;
	КонецЕсли;
	
	Действие = "Получение информации о подписках из облака";
	
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Получение информации о подписках");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне");
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 0.7, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьФоновоеЗадание()
	ДеньгиКлиент.ВыполнитьЭтапФоновогоЗадания(ЭтотОбъект, НастройкиЗапуска, РезультатЗапускаФоновогоЗадания);
	НастройкиЗапуска = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФоновоеЗаданиеКлиент()
	
	ОчиститьСообщения();
	ДеньгиКлиент.ОтменитьФоновоеЗадание(РезультатЗапускаФоновогоЗадания);
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаИнформация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибкиФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.ФоновоеЗадание.Статус = "Ошибка" Тогда
		
		Обращение = "";
		Ошибка = Результат.ФоновоеЗадание.ПодробноеПредставлениеОшибки;
		
	Иначе
		Обращение = НСтр("ru='Запрос к облаку был отменен пользователем.
				|Пожалуйста, еще раз запустите обновление и дождитесь его окончания'");
		Ошибка = "";
		
	КонецЕсли;
	
	СообщитьОбОшибкеФоновогоЗадания(Обращение, Ошибка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне" Тогда
		ОбновитьСостояниеПодписок(Результат, ДополнительныеПараметры);
		Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаИнформация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьИнформацию(Форма)

	Форма.АктивныеПодписки.Очистить();
	Форма.ПодключенныеБазы.Очистить();
	
	Форма.Действие           = "";
	Форма.ТекстОшибки        = "";
	Форма.ДоступноЛицензий   = 0;
	Форма.ПодключеноБаз      = 0;
	
	Форма.ЛицензийПослеИзменений = 0;
	Форма.ДатаИзменений          = Дата(1,1,1);
	Форма.РежимПокупки           = Неопределено;
	Форма.СписокТарифов          = Неопределено;
	
	Форма.Элементы.ЛицензииКоличество.Заголовок  = "??";
	Форма.Элементы.ПрограммыКоличество.Заголовок = "??";
	Форма.Элементы.ТекстРекомендации.Заголовок   = "Нет информации о подписках";

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеПодписок(Результат, ДополнительныеПараметры)
	
	ОтветСервера = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	Сегодня = НачалоДня(ТекущаяДатаКлиентСервер());
	
	// Активные подписки
	ДоступноЛицензий       = ОтветСервера.ЛицензийСейчас;
	ЛицензийПослеИзменений = ОтветСервера.ЛицензийПослеИзменения;
	ДатаИзменений          = ОтветСервера.БлижайшаяДатаИзменения;
	НеиспользованнаяСумма  = ОтветСервера.НеиспользованнаяСумма;
	СписокТарифов          = ОтветСервера.СписокТарифов;
	Элементы.ЛицензииКоличество.Заголовок = ?(ДоступноЛицензий = -111, "∞", Формат(ДоступноЛицензий, "ЧДЦ=0; ЧН=0; ЧГ=") );
	Для каждого Подписка Из ОтветСервера.АктуальныеПодписки Цикл
		
		Строка = АктивныеПодписки.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Подписка);
		Строка.КоличествоЛицензий = ?(Подписка.БезлимитныхЛицензий <> 0, -111, Подписка.ШтучныхЛицензий);
		Строка.ОсталосьДней = Макс(0, Цел((Строка.ОкончаниеДействия -Сегодня) / 86400));
		Если Строка.НачалоДействия > Сегодня Тогда
			Строка.ПредставлениеСрока = СтрШаблон(НСтр("ru='с %1 по %2'"), 
						Формат(Строка.НачалоДействия, "ДФ='дд МММ'"), Формат(Строка.ОкончаниеДействия, "ДФ='дд МММ гггг'"));
		Иначе
			Строка.ПредставлениеСрока = СтрШаблон(НСтр("ru='до %1 (%2 дн.)'"), Формат(Строка.ОкончаниеДействия, "ДФ='дд МММ гггг'") , Строка.ОсталосьДней);
		КонецЕсли;
		
		Если Строка.НачалоДействия < Сегодня Тогда
			Строка.Продлить = НСтр("ru='Продлить'"); 
		КонецЕсли;
		
	КонецЦикла;
	Элементы.ДекорацияНетПодписок.Видимость = АктивныеПодписки.Количество() = 0;
	Элементы.АктивныеПодписки.Видимость     = Не Элементы.ДекорацияНетПодписок.Видимость;
	
	
	// Список баз
	ПодключеноБаз = ОтветСервера.ПодключеноБаз;
	Элементы.ПрограммыКоличество.Заголовок = Формат(ПодключеноБаз, "ЧДЦ=0; ЧН=0; ЧГ=");
	Для каждого База Из ОтветСервера.ПодключенныеБазы Цикл
		
		Строка = ПодключенныеБазы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, База);
		
		Если Строка.МобильноеУстройство Тогда
			Строка.ПредставлениеПрограммы = Строка.Наименование + " (Миниденьги)"; 
		Иначе
			Строка.ПредставлениеПрограммы = Строка.Наименование + " (1С:Деньги 8)"; 
		КонецЕсли;
		
		Если Строка.ИБЗапрещена Тогда
			Строка.Состояние = НСтр("ru='Запрещена'"); 
		ИначеЕсли Строка.ИБУстаревшая Тогда
			Строка.Состояние = НСтр("ru='Отключена'"); 
		Иначе
			Строка.Состояние = НСтр("ru='Подключена'"); 
		КонецЕсли;
		
	КонецЦикла;
	ПодключенныеБазы.Сортировать("ИБЗапрещена Убыв,ИБУстаревшая Убыв,Наименование");
	
	
	// Текст рекомендации и кнопки покупки
	ТекстРекомендации = НСтр("ru='Услуги облака доступны в полном объеме'");
	ТекстКнопки       = НСтр("ru='Добавить лицензии или продлить подписку'");
	ЦветНадпсии       = WebЦвета.Черный;
	Если ДоступноЛицензий <> -111 И ДоступноЛицензий < ПодключеноБаз Тогда
		// Лицензий недостаточно для продолжения работы
		НужноЛицензий = ПодключеноБаз - ДоступноЛицензий;
		ЦветНадпсии        = WebЦвета.Красный;
		ТекстРекомендации = СтрШаблон(НСтр("ru='Чтобы работать с облаком, нужно купить не менее %1'"), ДеньгиВОблакеКлиентСервер.КоличествоЛицензийСтрокой(НужноЛицензий, "Т"));
		ТекстКнопки = СтрШаблон(НСтр("ru='Купить подписку на %1'"), ДеньгиВОблакеКлиентСервер.КоличествоЛицензийСтрокой(НужноЛицензий, "Р"));
		РежимПокупки = Новый Структура("Количество,Начало", ПодключеноБаз - ДоступноЛицензий, Сегодня);
		
	ИначеЕсли ЗначениеЗаполнено(ДатаИзменений) И ЛицензийПослеИзменений <> -111 И ЛицензийПослеИзменений < ПодключеноБаз Тогда 
		// Изменения скоро наступят и в результате лицензий станет недостаточно для продолжения работы
		ДатаПродления = Формат(ДатаИзменений, "Л=ru_RU; ДФ=dd.MM.yyyy"); 
		ТекстРекомендации = СтрШаблон(НСтр("ru='Рекомендуется продлить подписку с %1'"), ДатаПродления);
		ТекстКнопки = СтрШаблон(НСтр("ru='Продлить подписку с %1'"), ДатаПродления); 
		РежимПокупки = Новый Структура("Количество,Начало", ?(ЛицензийПослеИзменений = -111, -111, ПодключеноБаз - ЛицензийПослеИзменений), 
							ДатаИзменений);
		
	КонецЕсли;
	
	Элементы.Купить.Заголовок              = ТекстКнопки;
	Элементы.ТекстРекомендации.Заголовок   = ТекстРекомендации;
	Элементы.ТекстРекомендации.ЦветТекста  = ЦветНадпсии;
	Элементы.ЛицензииКоличество.ЦветТекста = ЦветНадпсии;
	Элементы.УлучшитьТариф.Видимость       = ДоступноЛицензий <> -111;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогИзмененияСостояния(ВыбраннаяСтрока)

	СтрокаБазы = ПодключенныеБазы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокКоманд = Новый СписокЗначений;
	Если СтрокаБазы.Код = КодЭтогоУзла Тогда
		
		Если СтрокаБазы.ИБУстаревшая Тогда
			СписокКоманд.Добавить("Подключить", НСтр("ru='Подключить'"));
		Иначе
			ПоказатьПредупреждение(, НСтр("ru='Невозможно отключить программу, из которой выполняется управление подписками'"));
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если СтрокаБазы.ИБЗапрещена Тогда
			СписокКоманд.Добавить("Разрешить", НСтр("ru='Разрешить соединение'"));
		Иначе
			СписокКоманд.Добавить("Запретить", НСтр("ru='Запретить соединение'"));
		КонецЕсли;
		
		Если СтрокаБазы.ИБУстаревшая Тогда
			СписокКоманд.Добавить("Подключить", НСтр("ru='Подключть к облаку'"));
		Иначе
			СписокКоманд.Добавить("Отключить", НСтр("ru='Отключить от облака'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокКоманд.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьДиалогИзмененияСостоянияЗавершение", ЭтотОбъект, ВыбраннаяСтрока);
	ПоказатьВыборИзМеню(Оповещение, СписокКоманд);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогИзмененияСостоянияЗавершение(Ответ, ВыбраннаяСтрока) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаБазы = ПодключенныеБазы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = "Подключить" Тогда
		
		НужноЛицензий = ПодключеноБаз + 1;
		Если ДоступноЛицензий <= НужноЛицензий Тогда
			ПоказатьПредупреждение(, СтрШаблон(НСтр("ru='Для подключения программы нужно не менее %1'"), ДеньгиВОблакеКлиентСервер.КоличествоЛицензийСтрокой(НужноЛицензий, "Р")));
		Иначе
			ИзменитьПодключениеБазы(СтрокаБазы.Код, Ответ.Значение);
		КонецЕсли;
		
	ИначеЕсли Ответ.Значение = "Отключить" Тогда
		ИзменитьПодключениеБазы(СтрокаБазы.Код, Ответ.Значение);
		
	ИначеЕсли Ответ.Значение = "Разрешить" Или Ответ.Значение = "Запретить" Тогда
		
		// Запрос подтверждения
		#Область ПоказатьВопрос
		Если Ответ.Значение = "Разрешить" Тогда
			ТекстВопроса = НСтр("ru='Разрешить подключение для ""%1""?
					|После разрешения все данные облака станут доступны для этой программы'");
			ТекстКнопки = НСтр("ru='Разрешить'"); 
		Иначе
			ТекстВопроса = НСтр("ru='Запретить подключение для ""%1""?
					|После запрета программа не сможет подкючаться к облаку'");
			ТекстКнопки = НСтр("ru='Запретить'"); 
		КонецЕсли;
		ТекстВопроса = СтрШаблон(ТекстВопроса, СтрокаБазы.ПредставлениеПрограммы);
		
		ДополнительныеПараметры = Новый Структура("Команда,ВыбраннаяСтрока", Ответ.Значение, ВыбраннаяСтрока);
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеЗапретаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     ТекстКнопки);
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
		#КонецОбласти
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗапретаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	СтрокаБазы = ПодключенныеБазы.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);
	Если СтрокаБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыеЗначения = Новый Структура;
	Если ДополнительныеПараметры.Команда = "Запретить" Тогда
		НовыеЗначения.Вставить("СинхронизацияЗапрещена", Истина);
		НовыеЗначения.Вставить("Активность", Ложь);
	Иначе
		НовыеЗначения.Вставить("СинхронизацияЗапрещена", Ложь);
	КонецЕсли;
	
	ИзменитьСвойстваБазы(СтрокаБазы.Код, НовыеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПодключениеБазы(Код, Команда)

	НовыеЗначения = Новый Структура;
	НовыеЗначения.Вставить("Активность", Команда = "Подключить");
	ИзменитьСвойстваБазы(Код, НовыеЗначения);

КонецПроцедуры
 

&НаКлиенте
Процедура ОткрытьОплатуПодписки(КоличествоЛицензий, ДатаНачала, Вариант = Неопределено)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоличествоЛицензий",    КоличествоЛицензий);
	ПараметрыФормы.Вставить("ДатаНачала",            ДатаНачала);
	ПараметрыФормы.Вставить("Вариант",               Вариант);
	ПараметрыФормы.Вставить("НеиспользованнаяСумма", НеиспользованнаяСумма);
	ПараметрыФормы.Вставить("СписокТарифов",         СписокТарифов);
	
	ОткрытьФорму("Обработка.УправлениеПодписками.Форма.ОплатаПодписки", ПараметрыФормы, ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеВПоддержку()

	Состояние(НСтр("ru='Подготовка технологической информации...'"));
	
	ПараметрыФормы = ПараметрыСообщения();
	ПараметрыФормы.Тема = "Ошибка получения информации о подписках";
	
	ПараметрыФормы.Тело = "Форма ""Текущее состояние подписок"".
		|Выполняемое действие: " + Действие + " 
		|Ошибка: " + ТекстОшибки + ", 
		|	
		|	* дата: " + ТекущаяДатаКлиентСервер();
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВСлужбуПоддержки", ПараметрыФормы, ЭтотОбъект, Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыСообщения()

	Возврат ПоддержкаПользователейДеньги.НоваяСтруктураСообщения();

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяДатаКлиентСервер()
	#Если Сервер Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли 
КонецФункции 

#КонецОбласти
