

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФинЦельПоУмолчанию = Справочники.ФинансовыеЦели.ОбщиеНакопления;
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Кошелек,Сумма,ФинансоваяЦель,КомментарийСтроки");
	ОбновитьПараметрыКошелька(Кошелек, ВалютаКошелька, ВидимостьФинансовойЦели);
	Элементы.ФинансоваяЦель.Доступность = ВидимостьФинансовойЦели;
	Если НЕ ВидимостьФинансовойЦели Тогда
		ФинансоваяЦель = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = ФинЦельПоУмолчанию;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОк(Команда)
	
	Результат = Новый Структура("Кошелек,Валюта,Сумма,КомментарийСтроки,ФинансоваяЦель,ВидимостьФинансовойЦели",
		Кошелек, ВалютаКошелька, Сумма, КомментарийСтроки, ФинансоваяЦель, ВидимостьФинансовойЦели);
	Закрыть(Результат);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ОбновитьПараметрыКошелька(Знач Кошелек, Валюта, ФлагНакоплений)

	Если ЗначениеЗаполнено(Кошелек) Тогда
		Валюта = Кошелек.Валюта;
		ФлагНакоплений = Кошелек.ИспользоватьДляНакоплений;
	Иначе
		Валюта = Константы.ВалютаУчета.Получить();
		ФлагНакоплений = Ложь;
	КонецЕсли; 

КонецПроцедуры


&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	
	ОбновитьПараметрыКошелька(Кошелек, ВалютаКошелька, ВидимостьФинансовойЦели);
	Элементы.ФинансоваяЦель.Доступность = ВидимостьФинансовойЦели;
	Если НЕ ВидимостьФинансовойЦели Тогда
		ФинансоваяЦель = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = ФинЦельПоУмолчанию;
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ФинансоваяЦельПриИзменении(Элемент)
	
	Если НЕ ВидимостьФинансовойЦели Тогда
		ФинансоваяЦель = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ФинансоваяЦель) Тогда
		ФинансоваяЦель = ФинЦельПоУмолчанию;
	КонецЕсли; 
	
КонецПроцедуры
 