////////////////////////////////////////////////////////////////////////////////
// ПоддержкаПользователейДеньгиКлиентСервер
//
// 
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет правильность записи регистрационного номера программы
//
//Параметры:
//	Номер	- Строка - проверяемый регистрационный номер
//
//Возвращаемое значение:
//	Булево - Истина, если номер записан правлильно, и ЛОЖЬ в ином случае
//
Функция РегистрационныйНомерСоответствуетМаске(Знач Номер) Экспорт

	Если ТипЗнч(Номер) <> Тип("Строка") Или  ПустаяСтрока(Номер)
		Или СтрДлина(Номер) < 10 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Номер) 

КонецФункции


Функция ТекстОписанияСостоянияОбмена(СостояниеОбмена, ИмяПроцесса = "") Экспорт
	
	ШаблонHTMLДокумента = ШаблонHTMLДокумента(Истина, Истина);
	ШаблонHTMLДокумента = СтрЗаменить(ШаблонHTMLДокумента, 
			"<!-- ДополнительнаяТаблицаСтилей -->", 
			ДополнительнаяТаблицаСтилей() + Символы.ПС + "<!-- ДополнительнаяТаблицаСтилей -->");
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		ТелоДокумента = ТекстПустогоСостояния();
	Иначе
		
		ТелоДокумента = ТекстЗаголовкаСостояния(СостояниеОбмена);
		Если Нрег(ИмяПроцесса) = "транспорт" Или Не ЗначениеЗаполнено(ИмяПроцесса) Тогда
			ТелоДокумента = ТелоДокумента + ?(ТелоДокумента = "", "", "<br>" + Символы.ПС)
				+ ТекстСостоянияТранспорта(СостояниеОбмена);
		КонецЕсли;
		Если Нрег(ИмяПроцесса) = "передача" Или Не ЗначениеЗаполнено(ИмяПроцесса) Тогда
			ТелоДокумента = ТелоДокумента + ?(ТелоДокумента = "", "", "<br>" + Символы.ПС)
				+ ТекстСостоянияПроцесса(СостояниеОбмена, "Передача");
		КонецЕсли;
		Если Нрег(ИмяПроцесса) = "прием" Или Не ЗначениеЗаполнено(ИмяПроцесса) Тогда
			ТелоДокумента = ТелоДокумента + ?(ТелоДокумента = "", "", "<br>" + Символы.ПС)
				+ ТекстСостоянияПроцесса(СостояниеОбмена, "Прием");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрЗаменить(ШаблонHTMLДокумента, 
			"<!-- ТелоДокумента -->", 
			ТелоДокумента);
			
КонецФункции

Функция СостояниеСодержитОшибки(СостояниеОбмена, ИмяПроцесса) Экспорт
	
	ЕстьОшибки = Ложь;
	Если НРег(ИмяПроцесса) = "транспорт" Или Не ЗначениеЗаполнено(ИмяПроцесса) Тогда
		Если ЗначениеЗаполнено(СостояниеОбмена.СтатусТранспорта.КодСостояния) Тогда
			
			Если СостояниеОбмена.СтатусТранспорта.Кодсостояния < 10000 Тогда
				ЕстьОшибки = Истина;
			Иначе
				ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеСостоянияПоКоду(СостояниеОбмена.СтатусТранспорта.Кодсостояния);
				Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
						ЕстьОшибки = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЕстьОшибки И (НРег(ИмяПроцесса) = "прием" Или Не ЗначениеЗаполнено(ИмяПроцесса)) Тогда
		Если ЗначениеЗаполнено(СостояниеОбмена.Прием.КодРезультатаДействия) Тогда
			ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеРезультатаПоКоду(СостояниеОбмена.Прием.КодРезультатаДействия);
			Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
					ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЕстьОшибки И (НРег(ИмяПроцесса) = "передача" Или Не ЗначениеЗаполнено(ИмяПроцесса)) Тогда
		Если ЗначениеЗаполнено(СостояниеОбмена.Передача.КодРезультатаДействия) Тогда
			ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеРезультатаПоКоду(СостояниеОбмена.Передача.КодРезультатаДействия);
			Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
					ЕстьОшибки = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьОшибки;
	
КонецФункции

Функция ТекстСостоянияДляТехподдержки(СостояниеОбмена, ПредставлениеОшибки) Экспорт
	
	ПредставлениеОшибки = "";
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		Возврат "состояние обмена неизвестно";
	КонецЕсли;
	
	Результат =
	"==Состояние обмена данными==
	|
	|Транспорт: %1
	|	* последнее обращение: %2
	|	* статус: %3
	|	%4
	|
	|Передача данных:
	|	* время: %5
	|	* статус: %6
	|	%7
	|
	|Прием данных:
	|	* время: %8
	|	* статус: %9
	|	%10
	|";
	
	п1_Транспорт = ИмяТранспорта(СостояниеОбмена);
	п2_Дата = ?(ЗначениеЗаполнено(СостояниеОбмена.СтатусТранспорта.ПоследняяПроверка), 
						ДатаПолностью(СостояниеОбмена.СтатусТранспорта.ПоследняяПроверка), 
						НСтр("ru='нет данных'"));
	п4_Подробности = "";
	п3_Статус = СтатусТранспорта(СостояниеОбмена, п4_Подробности, ПредставлениеОшибки);
	
	СтруктураПроцесса = СостояниеОбмена.Передача;
	п5_Время = СтрШаблон("%1 - %2%3",
			ДатаПолностью(СтруктураПроцесса.НачалоДействия),
			ДатаПолностью(СтруктураПроцесса.ЗавершениеДействия),
			Длительность(СтруктураПроцесса.НачалоДействия, СтруктураПроцесса.ЗавершениеДействия));
	п7_Подробности = "";
	п6_статус = СтатусПроцесса(СтруктураПроцесса, "Передача", п7_Подробности, ПредставлениеОшибки);
	
	СтруктураПроцесса = СостояниеОбмена.Прием;
	п8_Время = СтрШаблон("%1 - %2%3",
			ДатаПолностью(СтруктураПроцесса.НачалоДействия),
			ДатаПолностью(СтруктураПроцесса.ЗавершениеДействия),
			Длительность(СтруктураПроцесса.НачалоДействия, СтруктураПроцесса.ЗавершениеДействия));
	п10_Подробности = "";
	п9_статус = СтатусПроцесса(СтруктураПроцесса, "Прием", п10_Подробности, ПредставлениеОшибки);
	
	
	Возврат СтрШаблон(Результат,
		п1_Транспорт,
		п2_Дата,
		п3_Статус,
		п4_Подробности,
		п5_Время,
		п6_статус,
		п7_Подробности,
		п8_Время,
		п9_статус,
		п10_Подробности
		);
	
КонецФункции


Функция ШаблонHTMLДокумента(ВставитьТаблицуСтилей = Истина, ВставитьСкриптПоказатьСкрытьКонтент = Ложь) Экспорт
	
	ШаблонHTMLДокумента = 
	"<HTML>
	|<HEAD>
	|<META charset=""utf-8"">
	|<META name=viewport content=""text/html, width=device-width, initial-scale=1"" http-equiv=Content-Type>
	|<!-- СкриптПоказатьСкрытьКонтент -->
	|<!-- ТаблицаСтилейПоУмолчанию -->
	|<!-- ДополнительнаяТаблицаСтилей -->
	|</HEAD>
	|<BODY>
	|<!-- ТелоДокумента -->
	|</BODY>
	|</HTML>";
	
	Если ВставитьТаблицуСтилей Тогда
		ШаблонHTMLДокумента = СтрЗаменить(ШаблонHTMLДокумента, "<!-- ТаблицаСтилейПоУмолчанию -->", 
					ТаблицаСтилейПоУмолчанию());
	КонецЕсли;
	
	Если ВставитьСкриптПоказатьСкрытьКонтент Тогда
		ШаблонHTMLДокумента = СтрЗаменить(ШаблонHTMLДокумента, "<!-- СкриптПоказатьСкрытьКонтент -->", 
					ТекстСкриптаПоказатьСкрытьКонтент());
	КонецЕсли;
	
	Возврат ШаблонHTMLДокумента;
	
КонецФункции

Функция ШаблонСвертываемогоКонтента(НачальноеОтображениеСвернутое = Истина) Экспорт
	
	Если НачальноеОтображениеСвернутое Тогда
		ОтображениеЗаголовкаСвернутого = "inline";
		ОтображениеЗаголовкаРазвернутого = "none";
		ОтображениеСвертываемогоКонтента = "none";
	Иначе
		ОтображениеЗаголовкаСвернутого = "none";
		ОтображениеЗаголовкаРазвернутого = "inline";
		ОтображениеСвертываемогоКонтента = "block";
	КонецЕсли;
	
	Возврат 
		"<SPAN class=hiddenContentWithTitle id=hCT<!-- Идентификатор -->>
		|<!-- ТекстПередГиперссылкой --><A class=hiddenContentHRef id=hca<!-- Идентификатор --> onclick=""ShowHideContent('<!-- Идентификатор -->')"" href=""javascript:void(0)""> 
		|<SPAN class=titleWhenHidden id=tHidden<!-- Идентификатор --> style=""DISPLAY: " + ОтображениеЗаголовкаСвернутого + """><!-- ЗаголовокСвернутого --></SPAN><SPAN class=titleWhenVisible id=tVisible<!-- Идентификатор --> style=""DISPLAY: " + ОтображениеЗаголовкаРазвернутого + """><!-- ЗаголовокРазвернутого --></SPAN>
		|</A><!-- ТекстПослеГиперссылки -->
		|<DIV class=hiddenContent id=hC<!-- Идентификатор --> style=""DISPLAY: " + ОтображениеСвертываемогоКонтента + """>
		|<!-- СвертываемыйКонтент -->
		|</DIV></SPAN>";
	
КонецФункции

Функция СвертываемыйКонтент(Идентификатор, Контент, ЗаголовокРазвернутого, ЗаголовокСвернутого = Неопределено, НачальноеОтображениеСвернутое = Истина) Экспорт
	
	Если ЗаголовокСвернутого = Неопределено Тогда
		ЗаголовокСвернутого = ЗаголовокРазвернутого;
	КонецЕсли;
	
	ТекстHTML = ШаблонСвертываемогоКонтента(НачальноеОтображениеСвернутое);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<!-- Идентификатор -->", Идентификатор);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<!-- ЗаголовокРазвернутого -->", ЗаголовокРазвернутого);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<!-- ЗаголовокСвернутого -->", ЗаголовокСвернутого);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<!-- СвертываемыйКонтент -->", Контент);
	
	Возврат ТекстHTML;
	
КонецФункции

Функция МногострочныйТекстВСписокHTML(МногострочныйТекст, ВидСписка = "Маркированный") Экспорт
	
	Если ВидСписка <> "Маркированный" И ВидСписка <> "Нумерованный" Тогда
		ВызватьИсключение НСтр("ru = 'Неверный параметр ВидСписка.'");
	КонецЕсли;
	
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(МногострочныйТекст, Символы.ПС);
	
	СписокHTML = "";
	Для каждого Строка Из Массив Цикл
		СписокHTML = СписокHTML + "<li>" + Строка + "</li>" + Символы.ПС;
	КонецЦикла;
	
	Если ВидСписка = "Маркированный" Тогда
		СписокHTML = "<ul>" + СписокHTML + "</ul>";
	Иначе  // Если ВидСписка = "Нумерованный" Тогда
		СписокHTML = "<ol>" + СписокHTML + "</ol>";
	КонецЕсли;
	
	Возврат СписокHTML;
	
КонецФункции

Функция ТекстСсылки(Адрес, Представление) Экспорт

	Возврат "<a href=""" + Адрес + """>" + Представление + "</a>";

КонецФункции

Функция ТаблицаСтилейОписанияСостоянияОбмена() Экспорт
	
	Возврат
	"<STYLE>
	// Чтобы первый заголовок прилегал к верхней границе окна без отступа
	|BODY {
	|	PADDING-TOP: 0;
	|}
	// Фон заголовков версий
	|H2 {
	// 0.5 / 1.45 = 0.344
	|	MARGIN: .5em -.344em .2em -.344em;
	|	PADDING: 1em .344em .2em .344em;
	|	BACKGROUND: #F4ECC5;  /* ЦветаСтиля.ФонШапкиОтчета */
	|}
	// Ссылка сворачивамого контента
	|A.hiddenContentHRef, A.hiddenContentHRef:visited {
	|	COLOR: #413003;
	|}
	|</STYLE>";
	
КонецФункции


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Функция ТекстПустогоСостояния()
	
	Результат =  
	"
	|<div>
	|<h2>Текущее состояние обмена данными</h2>
	|</div>
	|
	|<div>
	|<p>
	|Извините, в данный момент состояние обмена данными недоступно.
	|</p>
	|
	|<p>
	|Попробуйте повторить попытку через несколько минут.
	|</p>
	|
	|</div>
	|";
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЗаголовкаСостояния(СостояниеОбмена)
	
	ТекстЗаголовка = "";
	Если СостояниеОбмена.ТекущийВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE") Тогда
		ТекстЗаголовка = НСтр("ru='Обмен файлами вручную'");
	ИначеЕсли СостояниеОбмена.Режим = "КлиентОблака" Тогда
		ТекстЗаголовка = НСтр("ru='Синхронизация с облачным сервисом 1С:Деньги'");
	ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.WS") Тогда
		ТекстЗаголовка = НСтр("ru='Синхронизация в домашней сети'");
	Иначе
		ТекстЗаголовка = СтрШаблон(НСтр("ru='Обмен через облачное хранилище файлов %1'"), 
				СостояниеОбмена.СостояниеТранспорта.Провайдер);
	КонецЕсли;
	
	Возврат СтрШаблон(
	"
	|<h1>%1</h1>
	|
	|", ТекстЗаголовка);
	
КонецФункции

Функция ТекстСостоянияТранспорта(СостояниеОбмена)
	
	ВсеКодыСостояния    = ПроцессыОбменаВызовСервера.ВсеКодыСостоянияСервера();
	СостояниеТранспорта = СостояниеОбмена.СтатусТранспорта;
	ЭтоОшибка           = Ложь;
	ТекущееСостояние    = "";
	МоментОпроса        = "";
	РезультатОпроса     = "";
	ТекстРекомендации   = "";
	
	Если Не СостояниеОбмена.ИспользоватьСинхронизацию Тогда
		ТекущееСостояние = НСтр("ru='На устройстве выключена синхронизация'");
		ТекстРекомендации = НСтр("ru='Выберите способ синхронизации и настройте соединение с сервером или настольной программой'");
		
	ИначеЕсли Не СостояниеТранспорта.СоединениеНастроено Тогда
		
		Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
			ТекущееСостояние = НСтр("ru='Не настроено подключение к серверу'");
			ТекстРекомендации = НСтр("ru='Откройте настройки подключения к облачному сервису, укажите корректные логин "
			+"и пароль и подключите это приложение.
			|Если в облачном сервисе еще нет учетной записи, зарегистрируйтесь'");
			
		Иначе
			ТекущееСостояние = НСтр("ru='Не настроено соединение с настольной программой'");
			ТекстРекомендации = НСтр("ru='В настройках настольной программы выберите домашнюю сеть и (или) облачное хранилище файлов, "
			+"укажите нужные параметры и нажмите кнопку ""Проверить"". 
			|После этого выполните обмен файлами заново'");
			
		КонецЕсли;
	
	Иначе
		
		#Если Клиент Тогда
			СвойстваФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
		#Иначе
			СвойстваФЗ = ПроцессыОбменаВызовСервера.ФоновоеЗаданиеОбмена();
		#КонецЕсли
		
		Если СвойстваФЗ = Неопределено Или СвойстваФЗ.Статус = "Выполнено" Тогда
			
			ТекущееСостояние = СостояниеОбмена.СтруктураПредставления.СостояниеТранспорта;
			
		ИначеЕсли СвойстваФЗ.Статус = "Выполняется" Тогда 
			ТекущееСостояние = НСтр("ru='выполняется обмен данными в фоновом задании'");
			
		ИначеЕсли СвойстваФЗ.Статус = "Отменено" Тогда 
			ТекущееСостояние = НСтр("ru='оменено фоновое задание обмена данными'");
			
		ИначеЕсли СвойстваФЗ.Статус = "Ошибка" Тогда 
			ТекущееСостояние = СтрШаблон(
					НСтр("ru='фоновое задание обмена данными было завершено с ошибкой:
					|%1'"),
					СвойстваФЗ.КраткоеПредставлениеОшибки);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СостояниеТранспорта.Кодсостояния) Тогда
			
			МоментОпроса = СтрШаблон(НСтр("ru='Последнее обращение: %1'"), ?(ЗначениеЗаполнено(СостояниеТранспорта.ПоследняяПроверка), 
						ДатаПолностью(СостояниеТранспорта.ПоследняяПроверка), 
						НСтр("ru='дата-время неизвестны'")));
			
			Если СостояниеТранспорта.Кодсостояния = ВсеКодыСостояния.Готов.Код Тогда
				Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
					РезультатОпроса = НСтр("ru='сервер готов к работе'");
				ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE") Тогда 
					РезультатОпроса = НСтр("ru='к обмену файлом все готово'");
				ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.WS") Тогда 
					РезультатОпроса = НСтр("ru='домашляя сеть готова к работе'");
				Иначе
					РезультатОпроса = НСтр("ru='облачное хранилище готово к работе'");
				КонецЕсли;
				
			ИначеЕсли СостояниеТранспорта.Кодсостояния < 10000 Тогда
				ЭтоОшибка = Истина;
				РезультатОпроса = "<span class=err>" + СтрШаблон(НСтр("ru='возникла ошибка с кодом %1<br>
				|%2'"), 
					СостояниеТранспорта.Кодсостояния,
					?(ЗначениеЗаполнено(СостояниеТранспорта.ТекстОшибки), 
							ТекстДляHTML(СостояниеТранспорта.ТекстОшибки), 
							НСтр("ru='дополнительной информации нет'"))) + "</span>";
							
				Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
					ТекстРекомендации = НСтр("ru='Причиной могли стать временные проблемы со связью или доступностью сервера.
					|Попробуйте повторить через несколько минут. Если ошибка будет повторяться, отправьте сообщение "
					+"в нашу поддержку, посторяемся разобраться с проблемой как можно быстрей'");
					
				Иначе
					ТекстРекомендации = НСтр("ru='Причиной могли стать временные проблемы со связью или доступность "
					+"облачного хранилища файлов. Проверьте настройки облачного хранилища, авторизацию в нем, наличие свободного места там.
					|После - повторите попытку. Если ошибка будет повторяться, отправьте сообщение "
					+"в нашу поддержку, посторяемся разобраться с проблемой как можно быстрей'");
						
				КонецЕсли;
					
			Иначе
				ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеСостоянияПоКоду(СостояниеТранспорта.Кодсостояния);
				ЭтоОшибка = ОписаниеРезультата.ЯвляетсяОшибкой;
				Если ЭтоОшибка Тогда
					ШаблонРезультата = "<span class=err>" + НСтр("ru='произошла ошибка с кодом: %1 - <b>%2</b><br>
						|%3'") + "</span>";
				Иначе
					ШаблонРезультата = НСтр("ru='получен результат с кодом: %1 - <b>%2</b><br>
						|%3'");
				КонецЕсли;
				РезультатОпроса = СтрШаблон(ШаблонРезультата, 
					СостояниеТранспорта.Кодсостояния, ТекстДляHTML(ОписаниеРезультата.ТекстОписания),
					?(ЗначениеЗаполнено(СостояниеТранспорта.ТекстОшибки), 
							ТекстДляHTML(СостояниеТранспорта.ТекстОшибки), 
							НСтр("ru='дополнительной информации нет'")));
				ТекстРекомендации = ТекстДляHTML(ОписаниеРезультата.ТекстРекомендации);
				
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЕсли;
	
	Возврат СтрШаблон("
	|<div>
	|<h2>Информация о транспорте</h2>
	|
	|<p>
	|Текущее состояние: %1<br>
	|%2 %3
	|</p>
	|<hr>
	|%4
	|</div>
	|",
		ТекущееСостояние, 
		МоментОпроса + ?(МоментОпроса = "", "", ": "),
		РезультатОпроса + ?(РезультатОпроса = "", "", "<br>"),
		?(ТекстРекомендации = "", "", "<p><span class=example>" + ТекстРекомендации + "</span></p>")
		);
	
	
	
КонецФункции

Функция ТекстСостоянияПроцесса(СостояниеОбмена, ИмяПроцесса)
	
	ЗаголовокПроцесса  = "";
	ДатаСостояния      = "";
	ТекстСостояния     = "";
	ТекстОшибки        = "";
	ТекстРекомендации  = "";

	Если НРег(ИмяПроцесса) = "прием" Тогда
		ЗаголовокПроцесса = НСтр("ru='⇘ Прием данных'");
		ТекстСостояния = ТекстДляHTML(СостояниеОбмена.СтруктураПредставления.СостояниеПрием);
	Иначе
		ЗаголовокПроцесса = НСтр("ru='⇖ Передача данных'");
		ТекстСостояния = ТекстДляHTML(СостояниеОбмена.СтруктураПредставления.СостояниеПередача);
	КонецЕсли;
	
	СтруктураПроцесса = СостояниеОбмена[ИмяПроцесса];
	
	Если Не ЗначениеЗаполнено(СтруктураПроцесса.КодРезультатаДействия)
		И Не ЗначениеЗаполнено(СтруктураПроцесса.ДействиеПроцесса) Тогда
		
		ТекстСостояния     = НСтр("ru='процесс не начинался или его состояние было очищено'");
		Если СостояниеОбмена.Режим = "КлиентОблака" Тогда
			ТекстРекомендации = НСтр("ru='Дождитесь автоматического запуска синхронинизации или выполните синхронизацию вручную'");
		Иначе
			ТекстРекомендации = НСтр("ru='Выполните обмен с настольной программой'");
		КонецЕсли;
		
	Иначе
		
		ТекстСостояния = СтрШаблон("%1 - <b>%2</b>", СтруктураПроцесса.КодРезультатаДействия, ТекстСостояния);
		
		Если ЗначениеЗаполнено(СтруктураПроцесса.ТекстОшибки) Тогда
			htmlТекстОшибки = "<div class=details><code>" + ТекстДляHTML(СтруктураПроцесса.ТекстОшибки) + "</code></div>";
			ТекстОшибки = ?(ЗначениеЗаполнено(СтруктураПроцесса.ТекстОшибки), 
					ТекстСвертки("ТекстОшибки" + ИмяПроцесса, НСтр("ru='подробности…'"), htmlТекстОшибки), 
					"");
		КонецЕсли;
		
		ДатаСостояния = ?(СтруктураПроцесса.ПроцессЗавершен, 
				СтрШаблон(НСтр("ru='(%1)'"), 
						ДатаПолностью(СтруктураПроцесса.ЗавершениеДействия)), 
				СтрШаблон(НСтр("ru='(начало: %1)'"), 
						ДатаПолностью(СтруктураПроцесса.НачалоДействия)));
		
		Если ЗначениеЗаполнено(СтруктураПроцесса.КодРезультатаДействия) Тогда
			
			ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеРезультатаПоКоду(СтруктураПроцесса.КодРезультатаДействия);
			Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
				ТекстСостояния = "<span class=err>" 
						+ ТекстСостояния + "</span>";
			КонецЕсли;
			
			Если Не ОписаниеРезультата.ЯвляетсяУспехом Тогда
				ТекстРекомендации = ТекстДляHTML(ОписаниеРезультата.ТекстРекомендации);
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(СтруктураПроцесса.ДействиеПроцесса) Тогда
			
			ТекстРекомендации = НСтр("ru='Некоторые процессы обмена могут выполняться достаточно долго. 
			|Это зависит от выбранного сценария и количества записей, помеченных для обмена.<br>
			|Дождитесь завершения процесса. Если процесс был остановлен - нажмите кнопку ""Продолжить"" 
			|и подождите, пока он не завершится'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат СтрШаблон("
	|<div>
	|<h2>%1</h2>
	|
	|<p>
	|%2 %3
	|</p><br>
	|%4<br>
	|<hr>
	|%5
	|</div>
	|",
		ЗаголовокПроцесса,
		ТекстСостояния,
		ДатаСостояния,
		?(ТекстОшибки = "", "", ТекстОшибки + "<br>"),
		?(ТекстРекомендации = "", "", "<p><span class=example>" + ТекстРекомендации + "</span></p>")
		);
	
	
КонецФункции



Функция ДополнительнаяТаблицаСтилей() 
	
	Возврат
	"<STYLE>
	// Ссылка сворачивамого контента
	|A.hiddenContentHRef, A.hiddenContentHRef:visited {
	|	COLOR: #413003;
	|}
	|H1 {
	|	FONT-SIZE: 1.45em;
	|}
	|H2 {
	|	FONT-SIZE: 1.2em;
	|}
	|H3 {
	|	FONT-SIZE: 1.10em;
	|}
	|H4 {
	|	FONT-SIZE: 1.0em;
	|	font-weight: 550;
	|	PADDING: 1px;
	|}
	|.err {
	|	font-weight: 400;
	|	color: #F00000
	|}
	|.details {
	|	FONT-SIZE: 0.8em;
	|	font-weight: 400;
	|	background-color: #F2F2F2;
	|	PADDING: 3px;
	|}
	|</STYLE>";
	
КонецФункции

Функция ТекстСвертки(Идентификатор, ЗаголовокСвертки, Содержимое)
	
	ЗаголовокСвернутого   = "<H4>+ " + ЗаголовокСвертки + "</H4>";
	ЗаголовокРазвернутого = "<H4>&#8211; " + ЗаголовокСвертки + "</H4>";
	Возврат СвертываемыйКонтент(Идентификатор, Содержимое + "<br>", 
			ЗаголовокРазвернутого, ЗаголовокСвернутого, Истина);
	
КонецФункции

Функция ТекстДляHTML(знач Текст)
	
	Результат = СтрЗаменить(
					СтрЗаменить(
						СтрЗаменить(Текст, Символы.ПС, "<br>"), 
					"  ", "&nbsp;&nbsp;"), 
				Символы.Таб, "&nbsp;&nbsp;");
	
	Возврат Результат;
	
КонецФункции



Функция ИмяТранспорта(СостояниеОбмена)
	
	ТекстЗаголовка = "";
	Если СостояниеОбмена.ТекущийВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE") Тогда
		ТекстЗаголовка = НСтр("ru='ручной обмен файлами'");
	ИначеЕсли СостояниеОбмена.Режим = "КлиентОблака" Тогда
		ТекстЗаголовка = НСтр("ru='сервис 1С:Деньги'");
	ИначеЕсли СостояниеОбмена.ТекущийВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.WS") Тогда
		ТекстЗаголовка = НСтр("ru='домашняя сеть'");
	Иначе
		ТекстЗаголовка = СтрШаблон(НСтр("ru='облачное хранилище файлов %1'"), 
				СостояниеОбмена.СтатусТранспорта.Провайдер);
	КонецЕсли;
	
	Возврат ТекстЗаголовка;
	
КонецФункции

Функция СтатусТранспорта(СостояниеОбмена, Подробности, ПредставлениеОшибки)
	
	СтатусСервера = СостояниеОбмена.СтатусТранспорта;
	Подробности   = ?(ЗначениеЗаполнено(СтатусСервера.ТекстОшибки), СтатусСервера.ТекстОшибки, "---");
	
	Если Не СостояниеОбмена.ИспользоватьСинхронизацию Тогда
		Возврат НСтр("ru='На устройстве выключена синхронизация'");
		
	ИначеЕсли Не СостояниеОбмена.СтатусТранспорта.СоединениеНастроено Тогда
		Возврат НСтр("ru='Не настроено соединение'");
	
	ИначеЕсли Не ЗначениеЗаполнено(СтатусСервера.Кодсостояния) Тогда
		Возврат НСтр("ru='не определен'");
	
	ИначеЕсли СтатусСервера.Кодсостояния < 10000 Тогда
		ПредставлениеОшибки = ПредставлениеОшибки 
				+ ?(ПредставлениеОшибки = "", Символы.Таб, Символы.ПС + Символы.Таб)
				+ "Транспорт: " + Формат(СтатусСервера.Кодсостояния, "ЧДЦ=0; ЧГ=;");
		Возврат СтрШаблон("ru='сервер вернул ответ с кодом %1'", СтатусСервера.Кодсостояния);
	
	Иначе
		ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеСостоянияПоКоду(СтатусСервера.Кодсостояния);
		Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
			ПредставлениеОшибки = ПредставлениеОшибки 
					+ ?(ПредставлениеОшибки = "", Символы.Таб, Символы.ПС + Символы.Таб)
					+ "Транспорт: " + Формат(СтатусСервера.Кодсостояния, "ЧДЦ=0; ЧГ=;") 
					+ " - " + ОписаниеРезультата.ТекстОписания;
		КонецЕсли;
		Возврат СтрШаблон("%1%2 - %3", 
				Формат(СтатусСервера.Кодсостояния, "ЧДЦ=0; ЧГ=;"),
				?(ОписаниеРезультата.ЯвляетсяОшибкой, " (ошибка)", ""),
				ОписаниеРезультата.ТекстОписания);
		
	КонецЕсли;
	
КонецФункции

Функция СтатусПроцесса(СтруктураПроцесса, ИмяПроцесса, Подробности, ПредставлениеОшибки)
	
	Подробности   = ?(ЗначениеЗаполнено(СтруктураПроцесса.ТекстОшибки), СтруктураПроцесса.ТекстОшибки, "---");
	
	Если Не ЗначениеЗаполнено(СтруктураПроцесса.КодРезультатаДействия) Тогда
		Возврат НСтр("ru='нет данных'");
	
	Иначе
		
		ОписаниеРезультата = ПроцессыОбменаВызовСервера.ОписаниеРезультатаПоКоду(СтруктураПроцесса.КодРезультатаДействия);
		Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
			ПредставлениеОшибки = ПредставлениеОшибки 
					+ ?(ПредставлениеОшибки = "", Символы.Таб, Символы.ПС + Символы.Таб)
					+ "" + ИмяПроцесса + ": "
					+ Формат(СтруктураПроцесса.КодРезультатаДействия, "ЧДЦ=0; ЧГ=;") 
					+ " - " + ОписаниеРезультата.ТекстОписания;
		КонецЕсли;
		
		Возврат СтрШаблон("%1%2 - %3", 
				Формат(СтруктураПроцесса.КодРезультатаДействия, "ЧДЦ=0; ЧГ=;"),
				?(ОписаниеРезультата.ЯвляетсяОшибкой, " (ошибка)", ""),
				ОписаниеРезультата.ТекстОписания);
		
	КонецЕсли;
	
КонецФункции

Функция ДатаПолностью(Дата)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		Возврат Формат(Дата, "Л=ru_RU; ДФ='dd.MM.yyyy HH:mm:ss';")
	Иначе
		Возврат "<н/д>";
	КонецЕсли;
	
КонецФункции

Функция Длительность(Начало, Конец)
	
	Если Не ЗначениеЗаполнено(Начало) 
		Или Не ЗначениеЗаполнено(Конец) Тогда
		Возврат "";
	КонецЕсли;
	
	Секунд = Конец - Начало;
	Если Секунд >= 60 Тогда
		
		Минут = Цел(Секунд / 60);
		Секунд = Секунд - Минут*60;
		Если Минут >= 60 Тогда
			
			Часов = Цел(Минут / 60);
			Минут = Минут - Часов*60;
			Возврат " (" + Формат(Часов, "ЧДЦ=0; ЧГ=;") + "ч. " + Минут + "м. " + Секунд + "с.)";
			
		Иначе
			Возврат " (" + Минут + "м. " + Секунд + "с.)";
		КонецЕсли;
		
	Иначе
		Возврат " (" + Секунд + "с.)";
		
	КонецЕсли;
	
КонецФункции

Функция ТаблицаСтилейПоУмолчанию()
	
	Возврат
	"<STYLE>
	|BODY {
	|	MAX-WIDTH: 80%;
	|	MARGIN: 0 auto;
	|	PADDING: .5em;
	|	FONT-FAMILY: Arial, sans-serif;
	|	FONT-SIZE: 10pt;
	|	LINE-HEIGHT: 1.25;
	|}
	|H1, H2, H3, H4, H5, H6 {
	|	COLOR: #413003;  /* ЦветаСтиля.ЦветТекстаФормы */
	|}
	|H1 {
	|	FONT-SIZE: 1.90em;
	|	MARGIN: 1.5em 0 0 0;
	|}
	|H2 {
	|	FONT-SIZE: 1.45em;
	|	MARGIN: 1em 0 0 0;
	|}
	|H3 {
	|	FONT-SIZE: 1.18em;
	|	MARGIN: .7em 0 0 0;
	|}
	|H4 {
	|	FONT-SIZE: 1em;
	|	MARGIN: .6em 0 0 0;
	|}
	|P  {
	|	MARGIN: .5em 0 0 0;
	|}
	|H5 {
	|	FONT-SIZE: .9em;
	|	MARGIN: .6em 0 0 0;
	|	TEXT-DECORATION: underline;
	|}
	|H6 {
	|	FONT-SIZE: .8em;
	|	MARGIN: .6em 0 0 0;
	|	FONT-STYLE: italic;
	|}
	|OL, UL {
	|	PADDING: 4pt;
	|	MARGIN: 0 0 0 17px;
	|}
	|LI {
	|	MARGIN: .12em 0;
	|}
	|A {
	|	COLOR: #1C55AE; /* Цвет обычной ссылки. Как в ЭлементыСтиляКлиентСервер.ГиперСсылкаЦвет() */
	|}
	|A:visited {
	|	COLOR: #800080; /* Цвет посещенной ссылки */
	|}
	// Примечание, комментарий
	|DIV.comment {
	|	MARGIN: 0;
	|	PADDING: .5em;
	|	FONT-STYLE: italic;
	|	BACKGROUND: #F4F4F4;
	|	COLOR: #444;
	|}
	|span.button {
	|	MARGIN: 0;
	|	PADDING: 1px;
	|	font-weight: 600;
	|	COLOR: #009642;
	|}
	|span.example {
	|	MARGIN: 0;
	|	PADDING: 1px;
	|	FONT-STYLE: italic;
	|	font-weight: 400;
	|}
	|span.important {
	|	MARGIN: 0;
	|	PADDING: 1px;
	|	font-weight: 600;
	|	color: #9E5F20
	|}
	|.addinfo {
	|	FONT-STYLE: italic;
	|	font-weight: 300;
	|	color: #3C3C3C;
	|}
	|</STYLE>";
	
КонецФункции

Функция ТекстСкриптаПоказатьСкрытьКонтент()
	
	Возврат
	"<SCRIPT type=text/javascript>
	|	function ShowHideContent(id) 
	|	{
	|		hiddenContentWithTitle = document.getElementById('hCT' + id)
	|		hiddenContent = document.getElementById('hC' + id)
	|		titleWhenHidden = document.getElementById('tHidden' + id)
	|		titleWhenVisible = document.getElementById('tVisible' + id)
	|		
	|		newStateIsHidden = (hiddenContent.style.display != 'none');
	|		
	|		if (newStateIsHidden) 
	|		{
	|			titleWhenHidden.style.display = 'inline';
	|			titleWhenVisible.style.display = 'none';
	|		}
	|  	 	else 
	|		{
	|			titleWhenHidden.style.display = 'none';
	|			titleWhenVisible.style.display = 'inline';
	|		}
	|		
	|		if (newStateIsHidden) 
	|		{
	|			hiddenContent.style.display = 'none';
	|		}
	|    	else 
	|		{
	|			hiddenContent.style.display = 'block';
	|			hiddenContentWithTitle.scrollIntoView(true);
	|		}
	|	}
	|</SCRIPT>";
	
КонецФункции


#КонецОбласти