///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыСоединенияСОблаком() Экспорт

	Результат = ДеньгиВОблаке.НовыйПараметрыСоединенияСОблаком();
	СохраненныеНастройки = РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединения(), Неопределено);
	Если ЗначениеЗаполнено(СохраненныеНастройки) Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, СохраненныеНастройки);
		Результат.УзелСервера = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
		
	КонецЕсли;
	
	Результат.АдресСервисаСинхронизации = ДеньгиВОблаке.АдресСервисаСинхронизации();
	
	// Дополнительные параметры, необходимые для контроля соединения с сервером
	Результат.Вставить("ИмяПланаОбмена",     "СинхронизацияАвтономныхКопий");
	Результат.Вставить("КодЦентральнойБазы", СинхронизацияАвтономныхКопийВызовСервера.КодЦентральнойБазы(Результат.ИмяПланаОбмена));

	Результат.Вставить("ЭтотУзел", СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел(Результат.ИмяПланаОбмена));
	СвойстваЭтогоУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Результат.ЭтотУзел, "Наименование,Код");
	Результат.Вставить("КодЭтогоУзла", СвойстваЭтогоУзла.Код);
	Если ЗначениеЗаполнено(СвойстваЭтогоУзла.Наименование) Тогда
		Результат.Вставить("ИмяЭтойБазы",  СвойстваЭтогоУзла.Наименование);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

