///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ЗначениеЗаполнено(ЮридическоеФизическоеЛицо) Тогда
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Гражданство) Тогда
		Гражданство = Справочники.СтраныМира.Россия;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтранаРегистрации) Тогда
		СтранаРегистрации = Справочники.СтраныМира.Россия;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КатегорияПлательщикаНДФЛ) Тогда
		КатегорияПлательщикаНДФЛ = Перечисления.КатегорииНалогоплательщикаНДФЛ.НеПредприниматель;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) 
		Или Не ЗначениеЗаполнено(НаименованиеПолное) Тогда
		Наименование = СокрЛП(СокрЛП(СокрЛП(ФамилияИП) + " " 
				+ СокрЛП(ИмяИП) + " " + СокрЛП(ОтчествоИП)));
		НаименованиеПолное = Наименование;
		НаименованиеСокращенное = СокрЛП(ФамилияИП) 
				+ ?(ПустаяСтрока(ИмяИП), "", " " + Врег(Лев(СокрЛП(ИмяИП), 1)) + "."
						+ ?(ПустаяСтрока(ОтчествоИП), "", Врег(Лев(СокрЛП(ОтчествоИП), 1))) + ".");
		Если КатегорияПлательщикаНДФЛ <> ПредопределенноеЗначение("Перечисление.КатегорииНалогоплательщикаНДФЛ.НеПредприниматель") Тогда
			НаименованиеПолное = "ИПбОЮЛ " + НаименованиеПолное;
			НаименованиеСокращенное = "ИП " + НаименованиеСокращенное;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьПодчиненныеОбъекты();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура УдалитьПодчиненныеОбъекты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка,
		|	РегистрацииВНалоговомОргане.Представление КАК Представление
		|ИЗ
		|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|ГДЕ
		|	РегистрацииВНалоговомОргане.Владелец = &Организация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегламентированныйОтчет.Ссылка,
		|	РегламентированныйОтчет.Представление
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.Организация = &Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СвязанныйОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Если СвязанныйОбъект = Неопределено Или Не ЗначениеЗаполнено(СвязанныйОбъект.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			СвязанныйОбъект.Удалить();
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = СтрШаблон(НСтр("ru='Невозможно удалить налогоплательщика ""%1"", потому что не удлаяется связанный объект ""%2""'"),
					Наименование, ВыборкаДетальныеЗаписи.Представление)
					+ символы.ПС + КраткоеПредставлениеОшибки(Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

//
#КонецЕсли