
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Константы.ДеньгиИспользуетсяОбменСМобильными.Получить() Тогда
		Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыборОблака;
		Элементы.СинхронизацияСОблаком1.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВыборВарианта;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбменСМобильными(Команда)
	
	ВключитьОбменНаСервере(Ложь);
	ОбновитьИнтерфейс();
	Оповестить("ИзмененаСинхронизация");
	ОткрытьФорму("Обработка.МониторСинхронизацииСМобильнымиУстройствами.Форма.Монитор");
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизацияСОблаком(Команда)
	
	ВключитьОбменНаСервере(Истина);
	ОбновитьИнтерфейс();
	Оповестить("ИзмененаСинхронизация");
	ОткрытьФорму("ОбщаяФорма.УправлениеСервисомАвтосинхронизации");
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСинхронизацию(Команда)
	ОтключитьОбменНаСервере();
	ОбновитьИнтерфейс();
	Оповестить("ИзмененаСинхронизация");
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПодробнейОСервисеНажатие(Элемент)
	ОткрытьСправку("Подсистема.СправкаПоКонфигурации.Подсистема.ОблакоДенег");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ВключитьОбменНаСервере(СОблаком)

	Если Не ОбщегоНазначения.РазделениеВключено() Тогда 
		Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
	КонецЕсли;

	// Выбор способа устанавливает функциональные опции
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(
		?(СОблаком, Перечисления.СпособыСинхронизацииДанных.СинхронизацияССервисом, 
			Перечисления.СпособыСинхронизацииДанных.ОбменФайлами));
	ОбновитьПовторноИспользуемыеЗначения();
	ДеньгиВОблаке.ПроверитьСценарииАвтономногоКлиента();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтключитьОбменНаСервере()

	Если Не ОбщегоНазначения.РазделениеВключено() Тогда 
		Константы.ИспользоватьСинхронизациюДанных.Установить(Ложь);
	КонецЕсли;

	// Выбор способа устанавливает функциональные опции
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

#КонецОбласти
