&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НастройкиПоказателей = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(КлючОбъектаНастроекПользователя(), "НастройкиИндикаторов");
	Если НастройкиПоказателей = Неопределено Тогда
		НастройкиПоказателей = Обработки.НачальнаяСтраница.НовыеНастройкиИндикаторов();
		ЗаписатьНастройкиПользователя();
	КонецЕсли;
	
	ВалютаОтчета             = НастройкиПоказателей.ВалютаОтчета;
	ВариантБюджета           = НастройкиПоказателей.ВариантБюджета;
	ОтключитьАнимацию        = НастройкиПоказателей.ОтключитьАнимацию;
	НеОбновлятьАвтоматически = НастройкиПоказателей.НеОбновлятьАвтоматически;
	СуммыСКопейками          = НастройкиПоказателей.СуммыСКопейками;
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	ОсновнойВариантБюджета = Константы.ОсновнойВариантБюджета.Получить();
	
КонецПроцедуры



&НаКлиенте
Процедура ВалютаОтчетаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ВалютаОтчета) Тогда
		ВалютаОтчета = ВалютаУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантБюджетаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ВариантБюджета) Тогда
		ВалютаОтчета = ОсновнойВариантБюджета;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьНастройкиПользователя();
	Закрыть(Истина);
	
КонецПроцедуры


// Сохраняет настройки индикаторов в хранилище общих настроек
&НаСервере
Процедура ЗаписатьНастройкиПользователя()

	НастройкиПоказателей = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(КлючОбъектаНастроекПользователя(), "НастройкиИндикаторов");
	НастройкиПоказателей.ВалютаОтчета    = ВалютаОтчета;
	НастройкиПоказателей.ВариантБюджета  = ВариантБюджета;
	НастройкиПоказателей.СуммыСКопейками = СуммыСКопейками;
	
	НастройкиПоказателей.ОтключитьАнимацию        = ОтключитьАнимацию;
	НастройкиПоказателей.НеОбновлятьАвтоматически = НеОбновлятьАвтоматически;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(КлючОбъектаНастроекПользователя(), "НастройкиИндикаторов", НастройкиПоказателей);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючОбъектаНастроекПользователя()

	Возврат "Обработка/НачальнаяСтраница/Обзор";

КонецФункции


