#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//
#Область ПрограммныйИнтерфейс

// Возвращает структуру состояния процесса обмена данными для указанного узла плана обмена
Функция СостояниеПроцессаДляУзла(Узел, Знач Процесс) Экспорт
	
	Менеджер = ТекущийИлиНовыйМенеджерЗаписи(Узел, Процесс);

	Результат = Новый Структура();
	Для Каждого Поле Из Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными.Измерения Цикл
		Результат.Вставить(Поле.Имя, Менеджер[Поле.Имя]);
	КонецЦикла;
	Для Каждого Поле Из Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными.Ресурсы Цикл
		Результат.Вставить(Поле.Имя, Менеджер[Поле.Имя]);
	КонецЦикла;
	Для Каждого Поле Из Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными.Реквизиты Цикл
		Результат.Вставить(Поле.Имя, Менеджер[Поле.Имя]);
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Процедура ОбновитьСостояниеПроцессаДляУзла(Узел, Процесс, знач НовыеЗначения) Экспорт
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат;
	КонецЕсли;
	
	НовыеЗначения.Вставить("Узел",  Узел);
	НовыеЗначения.Вставить("Процесс", ?(ЗначениеЗаполнено(Процесс), Процесс, Перечисления.ПроцессыОбменаДанными.ПустаяСсылка()));
	ОбновитьЗапись(НовыеЗначения);
	
КонецПроцедуры


#КонецОбласти




#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостоянияПроцессовОбменаДанными.СоздатьНаборЗаписей();
	Для Каждого КлючИЗначение Из СтруктураЗаписи Цикл		
		ЭлементОтбора = НаборЗаписей.Отбор.Найти(КлючИЗначение.Ключ);
		Если ЭлементОтбора <> Неопределено Тогда
			ЭлементОтбора.Установить(КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновитьЗапись(СтруктураЗаписи) Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.СостоянияПроцессовОбменаДанными; // ОбъектМетаданныхРегистрСведений
	МенеджерЗаписи = РегистрыСведений.СостоянияПроцессовОбменаДанными.СоздатьМенеджерЗаписи();
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		ИмяИзмерения = Измерение.Имя;
		Если СтруктураЗаписи.Свойство(ИмяИзмерения) Тогда
			МенеджерЗаписи[ИмяИзмерения] = СтруктураЗаписи[ИмяИзмерения];
		КонецЕсли;
		
	КонецЦикла;
	
	МенеджерЗаписи.Прочитать();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ТекущийИлиНовыйМенеджерЗаписи(Узел, Процесс)
	
	Процесс = ?(ЗначениеЗаполнено(Процесс), Процесс, Перечисления.ПроцессыОбменаДанными.ПустаяСсылка());
	Менеджер = РегистрыСведений.СостоянияПроцессовОбменаДанными.СоздатьМенеджерЗаписи();
	Менеджер.Узел = Узел;
	Менеджер.Процесс = Процесс;
	Менеджер.Прочитать();
	
	Если Не Менеджер.Выбран() Тогда
		Менеджер.Узел = Узел;
		Менеджер.Процесс = Процесс;
		ЗаполнитьЗаписьЗначениямиПоУмолчанию(Менеджер);
		Менеджер.Записать(Истина);
	КонецЕсли;
	
	Возврат Менеджер;
	
КонецФункции

Процедура ЗаполнитьЗаписьЗначениямиПоУмолчанию(Запись)
	
	Запись.ДействиеПроцесса          = Перечисления.ДействияПроцессовОбмена.ПустаяСсылка();
	Запись.КодРезультатаДействия     = 0;
	Запись.НомерПакета               = 0;
	Запись.Количество                = 0;
	Запись.НомерОбработанного        = 0;
	Запись.НачалоДействия            = Неопределено;
	Запись.ЗавершениеДействия        = Неопределено;
	Запись.ТекстОшибки               = "";
	Запись.ОбъектовВсего                  = 0;
	Запись.ОбъектовОбработано        = 0;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли