////////////////////////////////////////////////////////////////////////////////
// РаботаСФормамиДокументовПовтИсп - содержит функционал для оформления документов
//  
////////////////////////////////////////////////////////////////////////////////

#Если Не ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает иконку для указанных счета и дополнительных параметров
Функция ПолучитьИконкуПоСчету(СчетДляИконки, ТипЭлементаАналитики = Неопределено, ЭтоНакопления = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(СчетДляИконки) Тогда
		Возврат Новый Картинка;
	КонецЕсли; 
	
	Если СчетДляИконки = ПланыСчетов.РазделыУчета.Деньги
		ИЛИ СчетДляИконки.Родитель = ПланыСчетов.РазделыУчета.Деньги Тогда
		Если ЭтоНакопления Тогда
			Возврат БиблиотекаКартинок.МенюНакопление16х16;
		ИначеЕсли ТипЭлементаАналитики = Перечисления.ТипыСчетов.БанковскаяКартаДебетовая Тогда
			Возврат БиблиотекаКартинок.БанковскаяКартаСиняя16;
		ИначеЕсли ТипЭлементаАналитики = Перечисления.ТипыСчетов.БанковскаяКартаКредитная Тогда
			Возврат БиблиотекаКартинок.БанковскаяКартаСиняя16;
		ИначеЕсли ТипЭлементаАналитики = Перечисления.ТипыСчетов.БанковскаяКартаУниверсальная Тогда
			Возврат БиблиотекаКартинок.БанковскаяКартаСиняя16;
		ИначеЕсли ТипЭлементаАналитики = Перечисления.ТипыСчетов.БанковскийСчет Тогда
			Возврат БиблиотекаКартинок.СейфСМонетами16;
		ИначеЕсли ТипЭлементаАналитики = Перечисления.ТипыСчетов.Наличность Тогда
			Возврат БиблиотекаКартинок.КошелекСМонетами16;
		ИначеЕсли ТипЭлементаАналитики = Перечисления.ТипыСчетов.ЭлектронныйКошелек Тогда
			Возврат БиблиотекаКартинок.КошелекЭлектронный16;
		Иначе
			Возврат БиблиотекаКартинок.Кошелек16;
		КонецЕсли; 
	ИначеЕсли СчетДляИконки = ПланыСчетов.РазделыУчета.Имущество Тогда
		Возврат БиблиотекаКартинок.Имущество16;
	ИначеЕсли СчетДляИконки = ПланыСчетов.РазделыУчета.Долги 
		ИЛИ СчетДляИконки = ПланыСчетов.РазделыУчета.ОсновныеСуммыДолгов Тогда
		Если ТипЭлементаАналитики = Перечисления.ТипыДолгов.ПолученныйКредит Тогда
			Возврат БиблиотекаКартинок.ПолученныйКредит16;
		Иначе
			Возврат БиблиотекаКартинок.ВыданныйЗаем16;
		КонецЕсли;
	ИначеЕсли СчетДляИконки = ПланыСчетов.РазделыУчета.ПроцентыПоДолгам Тогда
		Если ТипЭлементаАналитики = Перечисления.ТипыДолгов.ПолученныйКредит Тогда
			Возврат БиблиотекаКартинок.ПроцентыПоПолученнымКредитам16;
		Иначе
			Возврат БиблиотекаКартинок.ПроцентыПоВыданнымЗаймам16;
		КонецЕсли;
	Иначе
		Возврат Новый Картинка;
	КонецЕсли; 

КонецФункции

// Возвращает иконку по указанному виду объекта
Функция ПолучитьИконкуПоВидуОбъектаУчета(ВидОбъекта, ВыданныеЗаймы = Ложь) Экспорт

	Если ВидОбъекта = "КошелькиИСчета" Или ВидОбъекта = Тип("СправочникСсылка.КошелькиИСчета") Тогда
		Возврат БиблиотекаКартинок.Кошелек16;
	ИначеЕсли ВидОбъекта = "Имущество" Или ВидОбъекта = Тип("СправочникСсылка.Имущество") Тогда
		Возврат БиблиотекаКартинок.Имущество16;
	ИначеЕсли ВидОбъекта = "Долги" Или ВидОбъекта = Тип("СправочникСсылка.Долги") Тогда
		Если ВыданныеЗаймы = Истина Тогда
			Возврат БиблиотекаКартинок.ВыданныйЗаем16;
		Иначе
			Возврат БиблиотекаКартинок.ПолученныйКредит16;
		КонецЕсли;
	ИначеЕсли ВидОбъекта = "СтатьиДоходов" Или ВидОбъекта = Тип("СправочникСсылка.СтатьиДоходов") Тогда
		Возврат БиблиотекаКартинок.СтатьиДоходов16;
	ИначеЕсли ВидОбъекта = "СтатьиРасходов" Или ВидОбъекта = Тип("СправочникСсылка.СтатьиРасходов") Тогда
		Возврат БиблиотекаКартинок.СтатьиРасходов16;
	ИначеЕсли ВидОбъекта = "ФинансовыеЦели" Или ВидОбъекта = Тип("СправочникСсылка.ФинансовыеЦели") Тогда
		Возврат БиблиотекаКартинок.МенюНакопление16х16;
	Иначе
		Возврат Новый Картинка;
	КонецЕсли;

КонецФункции

// Возвращает иконку для указанных счета и активности/пассивности его аналитики
Функция ПолучитьИконку32ПоСчету(СчетДляИконки, СторонаРазделаУчета) Экспорт

	Если СчетДляИконки = ПланыСчетов.РазделыУчета.Деньги Тогда
		Возврат БиблиотекаКартинок.Кошелек32;
	ИначеЕсли СчетДляИконки = ПланыСчетов.РазделыУчета.Имущество Тогда
		Возврат БиблиотекаКартинок.Имущество32;
	ИначеЕсли СчетДляИконки = ПланыСчетов.РазделыУчета.Долги 
		ИЛИ СчетДляИконки = ПланыСчетов.РазделыУчета.ОсновныеСуммыДолгов Тогда
		Если СторонаРазделаУчета = Перечисления.СтороныРазделовУчета.Актив Тогда
			Возврат БиблиотекаКартинок.ВыданныйЗаем32;
		Иначе
			Возврат БиблиотекаКартинок.ПолученныйКредит32;
		КонецЕсли;
	ИначеЕсли СчетДляИконки = ПланыСчетов.РазделыУчета.ПроцентыПоДолгам Тогда
		Если СторонаРазделаУчета = Перечисления.СтороныРазделовУчета.Актив Тогда
			Возврат БиблиотекаКартинок.ПроцентыПоВыданнымЗаймам32;
		Иначе
			Возврат БиблиотекаКартинок.ПроцентыПоПолученнымКредитам32;
		КонецЕсли;
	Иначе
		Возврат Новый Картинка;
	КонецЕсли; 

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти



#КонецЕсли
