
#Область ПрограммныйИнтерфейс

// Обрабочтик события формы справочника "ПриОткрытии()
//
//Параметры:
//	Форма - Управляемая форма объекта справочника
//	Отказ - Булево
//	ЕстьПрикрепленныеФайлы - Булево - Истина, если в форме используются прикрепленные файлы
//	ЕстьПодключаемыеКоманды - Булево - Истина, если в форме используются подключаемые команды
//	ЕстьСвойства - Булево - Истина, если в форме используются дополнительные реквизиты и свойства
//
Процедура ФормаОбъектаПриОткрытии(Форма, Отказ, ЕстьПрикрепленныеФайлы, ЕстьПодключаемыеКоманды, ЕстьСвойства) Экспорт
	
	Если ЕстьПодключаемыеКоманды Тогда
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(Форма);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	КонецЕсли;
	
	Если ЕстьСвойства Тогда
		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(Форма);
		// Конец СтандартныеПодсистемы.Свойства
	КонецЕсли;
	
КонецПроцедуры

// Обрабочтик события формы справочника "ПриОткрытии()
//
//Параметры:
//	Форма - Управляемая форма объекта справочника
//	ПараметрыЗаписи - Структура
//	ЕстьПрикрепленныеФайлы - Булево - Истина, если в форме используются прикрепленные файлы
//	ЕстьПодключаемыеКоманды - Булево - Истина, если в форме используются подключаемые команды
//	ЕстьСвойства - Булево - Истина, если в форме используются дополнительные реквизиты и свойства
//
Процедура ФормаОбъектаПослеЗаписи(Форма, ПараметрыЗаписи, ЕстьПрикрепленныеФайлы, ЕстьПодключаемыеКоманды, ЕстьСвойства) Экспорт
	
	Если ПараметрыЗаписи.Свойство("ЗакрытьПослеЗаписи") И Форма.Открыта() Тогда
		Форма.Закрыть(Форма.Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти