#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Процедура обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// сгенерировать Наименование по названиям видов и значений свойств
	НовоеНаименование = "";
	Для Каждого ТекущаяСтрока Из ВидыИЗначенияАналитики Цикл
		Если ПустаяСтрока(НовоеНаименование) Тогда
			НовоеНаименование = СокрЛП(ТекущаяСтрока.ЗначениеАналитики);
		Иначе
			НовоеНаименование = НовоеНаименование + "; " + СокрЛП(ТекущаяСтрока.ЗначениеАналитики);
		КонецЕсли;
	КонецЦикла;

	Если СокрЛП(Наименование)<>СокрЛП(НовоеНаименование) Тогда
		Наименование = СокрЛП(НовоеНаименование);
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = "<Пусто>";
	КонецЕсли;

	Если Не Отказ Тогда
		ПроцессыОбменаСлужебный.ПередЗаписьюИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли