
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ПараметрыФормы.Отбор.Вставить("Кошелек", ПараметрКоманды);
	КонецЕсли;
	ПараметрыФормы.Вставить("КлючВарианта", "ИсточникиДенег");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", ЗначениеЗаполнено(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ОтчетПоПоступлениямДенег.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
