&НаСервере
Функция ПолучитьКлючЗаписи(Узел)
	Если Узел.ЭтотУзел Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат РегистрыСведений.ПараметрыСинхронизацииАвтономныхКопий.СоздатьКлючЗаписи(Новый Структура("Узел", Узел));
КонецФункции 


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Ключ = ПолучитьКлючЗаписи(ПараметрКоманды);
	Если Ключ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Ключ", Ключ);
	Попытка
		ОткрытьФорму("РегистрСведений.ПараметрыСинхронизацииАвтономныхКопий.ФормаЗаписи", 
				ПараметрыФормы, 
				ПараметрыВыполненияКоманды.Источник, 
				ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Исключение
		Сообщить(НСтр("ru='Не найдены параметры для данного узла'"));
	КонецПопытки;
	
КонецПроцедуры
