
#Область ПрограммныйИнтерфейс


Процедура ВыбратьКартинку(Форма, Теги, Обработчик = Неопределено) Экспорт
	
	ПараметрыОбработчика = Новый Структура("Форма,Обработчик", Форма, Обработчик);
	Оповещение = Новый ОписаниеОповещения("ВыбратьКартинкуЗавершение", ЭтотОбъект, ПараметрыОбработчика);
	
	ПараметрыФормы = Новый Структура("Теги,РежимВыбора", Теги, Истина);
	ОткрытьФорму("Справочник.КартинкиПриложения.ФормаВыбора", ПараметрыФормы, , Истина, , , Оповещение, );
	
КонецПроцедуры

Функция ВыбратьФайлКартинки(Обработчик  = Неопределено, ДопустимыйРазмерФайлаВКб = Неопределено) Экспорт
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = НСтр("ru='Файл картинки'");
	ДиалогВыбора.ПредварительныйПросмотр = Истина;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбора.Фильтр = "Изображения|*.gif;*.jpeg;*.jpg;*.png;*.svg;*.emf;*.ico;*.icon|Все файлы|*.*";
	
	ПараметрыВыбора = Новый Структура("ДопустимыйРазмерФайла,Обработчик", ДопустимыйРазмерФайлаВКб, Обработчик);
	Оповещение = Новый ОписаниеОповещения("ВыбратьФайлКартинкиЗавершение", ОформлениеПриложенияКлиент, ПараметрыВыбора);
	ДиалогВыбора.Показать(Оповещение);;
	
	Возврат Неопределено;
	
КонецФункции


#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыбратьКартинкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Если Форма <> Неопределено 
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОформлениеУстановленное") Тогда	
		
		ОформлениеПриложенияВызовСервера.ОбновитьКартинкуВСтруктуреОформления(Форма.ОформлениеУстановленное, Результат);
		Форма.АдресКартинки = ?(ПустаяСтрока(Форма.ОформлениеУстановленное.АдресКартинки),
					Форма.ОформлениеПоУмолчанию.АдресКартинки,
					Форма.ОформлениеУстановленное.АдресКартинки);
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Обработчик <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Обработчик, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьФайлКартинкиЗавершение(ВыбранныеФайлы, ПараметрыВыбора) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйФайл = ВыбранныеФайлы[0];
	Если ЗначениеЗаполнено(ПараметрыВыбора.ДопустимыйРазмерФайла) Тогда
		Файл = Новый Файл(ВыбранныйФайл);
		Если Файл.Существует() И Файл.Размер()/1024 > ПараметрыВыбора.ДопустимыйРазмерФайла Тогда
			ВызватьИсключение СтрШаблон( НСтр("ru='Размер файла не должен превышать %1 Kb'"), ПараметрыВыбора.ДопустимыйРазмерФайла);
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыВыбора.Обработчик <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПараметрыВыбора.Обработчик, ВыбранныйФайл);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
