#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПараметрыСобытийОтчета() Экспорт
	
	ВерсияСобытийОтчета = "1";  // номер версии универсального механизма, с которой совместим отчет
	ПараметрыСобытийОтчета = ОтчетыКлиентСервер.ПараметрыСобытийОтчетаПоУмолчанию(ВерсияСобытийОтчета);
	
	ПараметрыСобытийОтчета.ВыполнятьПриСозданииФормыНаСервере = Истина;
	ПараметрыСобытийОтчета.ВыполнятьПриОбработкеПараметраФормыОтбор = Истина;
	
	Возврат ПараметрыСобытийОтчета;
	
КонецФункции

// Вызывается из обработчика события ПриСозданииНаСервере.
//
Процедура ПриСозданииФормыНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, СтандартнаяОбработкаВФорме) Экспорт
	
	// Всегда выключаем расчет суммы выделенных ячеек
	ЭтаФорма.ПараметрыРаботыФормы.ВыводитьСуммуВыделенныхЯчеек = Ложь;
	ЭтаФорма.Элементы.ГруппаСумма.Видимость = Ложь;
	ЭтаФорма.Элементы.ОтчетТабличныйДокумент.УстановитьДействие("ПриАктивизацииОбласти", "");
	
КонецПроцедуры

// Вызывается один раз после создания формы, когда уже заполнен Отчет.КомпоновщикНастроек.
//
Процедура ПриОбработкеПараметраФормыОтбор(Отбор, ЭтаФорма) Экспорт
	
	Перем КомпоновщикНастроек;
	
	Параметры = ЭтаФорма.Параметры;
	КомпоновщикНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек;
	
	Если ЭтаФорма.КлючНазначенияИспользования = "ПользовательскиеНастройкиПоУмолчанию" Тогда  
		
		ОтчетыКлиентСервер.СброситьПользовательскиеНастройки(КомпоновщикНастроек);
		
		Если Параметры.Свойство("ВывестиРазделОсновныеНастройки") И Параметры.ВывестиРазделОсновныеНастройки <> Неопределено Тогда
			
			Для каждого ЭлементСтруктуры Из КомпоновщикНастроек.Настройки.Структура Цикл
				Если ЭлементСтруктуры.Имя = "ОсновныеНастройки" Тогда
					ЭлементПользовательскихНастроек = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементСтруктуры.ИдентификаторПользовательскойНастройки);
					ЭлементПользовательскихНастроек.Использование = Параметры.ВывестиРазделОсновныеНастройки;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
