

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ВидимостьКоличестваИЦены,ВидимостьФинансовойЦели,ВалютаКошелька,Сумма,
			|Цена,Количество,ФинансоваяЦель,КомментарийСтроки,КоличественныйУчет");
	Элементы.ГруппаКоличествоИЦена.Видимость = ВидимостьКоличестваИЦены И КоличественныйУчет <> 0;
	Элементы.ФинансоваяЦель.Видимость = ВидимостьФинансовойЦели;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОк(Команда)
	
	Результат = Новый Структура("Количество,Цена,Сумма,КомментарийСтроки,ФинансоваяЦель",
		Количество, Цена, Сумма, КомментарийСтроки, ФинансоваяЦель);
	Закрыть(Результат);
	
КонецПроцедуры


&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Количество) Тогда
		Сумма = Количество * Цена;
	ИначеЕсли ЗначениеЗаполнено(Сумма) И ЗначениеЗаполнено(Цена) Тогда
		Количество = Окр(Сумма / Цена, 15, 3);
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Количество) Тогда
		Сумма = Количество * Цена;
	ИначеЕсли ЗначениеЗаполнено(Сумма) И ЗначениеЗаполнено(Количество) Тогда
		Цена = Окр(Сумма / Количество, 14, 2);
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Если КоличественныйУчет <> 0 Тогда
		
		Если ЗначениеЗаполнено(Количество) И ЗначениеЗаполнено(Сумма) Тогда
			Цена = Окр(Сумма / Количество, 14, 2);
		ИначеЕсли ЗначениеЗаполнено(Цена) И ЗначениеЗаполнено(Сумма) Тогда
			Количество = Окр(Сумма / Цена, 15, 3);
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

