&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Перем ОбъектЭтогоОтчета;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ДЕНЬГИ
	АвтоЗаголовок = Ложь;
	Элементы.ПроверитьВИнтернете.Видимость = Ложь;
	Элементы.ОтправитьВКонтролирующийОрган.Видимость = Ложь;
	Элементы.ПодменюОтправка.Видимость = Ложь;
	Элементы.ГруппаПанельОтправки.Видимость = Ложь;
	// Конец ДЕНЬГИ
	
	Параметры.мДатаКонцаПериодаОтчета = Параметры.мДатаКонцаПериодаОтчета;
	Параметры.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	Параметры.мВыбраннаяФорма = "ФормаОтчета2015кв1";
	
	// Обход ошибки платформы Параметр сеанса отсутствует или удален
	ТабличныйДокумент.Очистить();
	
	// Заполняем обязательными ключами реквизит формы "СтруктураРеквизитовФормы"
	СформироватьСтруктуруРеквизитовФормы();
	
	// Заполняем СтруктуруРеквизитовФормы нужными значениями
	СтруктураРеквизитовФормы.ТекстДляЗаголовочнойЧасти = "";
	СтруктураРеквизитовФормы.СписокПечатаемыхЛистов = Новый СписокЗначений; 
	СтруктураРеквизитовФормы.мСоставПоказателей = "СоставПоказателей2015кв1"; // Наименование макета с описанием состава показателей
	СтруктураРеквизитовФормы.мВерсияФормы = "10/01/2015"; // Версия формы
	СтруктураРеквизитовФормы.мКодОтчета = "1151020"; // Код отчета, равен КНД
	
	// Обработка параметров формы
	СтруктураРеквизитовФормы.мВыбраннаяФорма          = Параметры.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета  = Параметры.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета = Параметры.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мПериодичность           = Параметры.мПериодичность;
	СтруктураРеквизитовФормы.мСкопированаФорма        = Параметры.мСкопированаФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок          = Параметры.мСохраненныйДок;
	СтруктураРеквизитовФормы.Организация              = ?(ЗначениеЗаполнено(Параметры.Организация), Параметры.Организация, Справочники.Организации.ПустаяСсылка());
	// Печать РеглОтчетности С Двухмерным Штрихкодом PDF417 в этой форме пока не доступна
	СтруктураРеквизитовФормы.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417 = Параметры.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417;
	СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически = Параметры.СформироватьФормуОтчетаАвтоматически;
	
	СтруктураРеквизитовФормы.СправочникиВидыКонтактнойИнформацииФактАдресОрганизации = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
	
	// Определение ИП (организации) и его реквизитов
	ДатаПодписи							= ТекущаяДатаСеанса();
	СтруктураРеквизитовФормы.НаимОрг 	= Неопределено;
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ДатаПодписи, "НаимЮЛПол").Свойство("НаимЮЛПол", СтруктураРеквизитовФормы.НаимОрг);
	СтруктураРеквизитовФормы.НаимОрг 	= ?(СведенияОбОрганизации, СтруктураРеквизитовФормы.НаимОрг, "");
	
	// Список версий форматов, в которых допускается выгрузка отчета
	СтруктураРеквизитовФормы.ВариантыФорматовВыгрузки = Новый СписокЗначений;
	СтруктураРеквизитовФормы.ВариантыФорматовВыгрузки.Добавить(СтруктураРеквизитовФормы.мСоставПоказателей, "Формат 5.09", Истина);
	
	СтруктураРеквизитовФормы.мПечатныеформы     = Новый СписокЗначений;
	СтруктураРеквизитовФормы.мПечатаемыеРазделы = Новый СписокЗначений;
	
	// ОПИСАНИЕ ПАРАМЕТРОВ МНОГОСТРОЧНЫХ ГРУПП
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.мРазмерНеоблогаемойСуммыДохода = 4000.00;
	
	СтруктураРеквизитовФормы.мИдГруппыА 			= "П000300001";
	СтруктураРеквизитовФормы.мИдГруппыБ 			= "П000400001";
	
	
	// Установка значения прочих реквизитов
	мСтатусНалогоплательщика = 0;
	
	// количество строк многострочных разделов по "бумажной" форме отчета
	// (минимальное количество строк, которое должно присутствовать всегда)
	КолИсхСтрокИдГруппыА = 1;
	КолИсхСтрокИдГруппыБ = 1;
	
	МаксКолКолонокИдГруппыА = 3;
	МаксКолКолонокИдГруппыБ = 2;
	
	КолКолонокИдГруппыА = 10;
	КолКолонокИдГруппыБ = 13;
	
	// Структуры для работы с показателями уникальныз страниц отчета 
	//	(не многострочных и не многостраничных)
	СтруктураДанныхТитульный  			= Новый Структура;
	СтруктураДанныхЛистД2 				= Новый Структура;
	СтруктураДанныхЛистЕ1 				= Новый Структура;
	СтруктураДанныхЛистГ 				= Новый Структура;
	СтруктураДанныхЛистЗ 				= Новый Структура;
	СтруктураДанныхЛистЗПродолжение 	= Новый Структура;
	СтруктураДанныхЛистЗПродолжение2 	= Новый Структура;
	СтруктураДанныхЛистЗПродолжение3 	= Новый Структура;
	СтруктураДанныхЛистЗПродолжение4 	= Новый Структура;
	СтруктураДанныхЛистИ 				= Новый Структура;
	СтруктураДанныхЛистИПродолжение 	= Новый Структура;
	
	// Добавляем первые страницы в многостраничные разделы
	ИнициализацияМногостраничныхРазделов();
	
	// Ключи с именами реквизитов формы, соответствующих таблицам многострочных разделов
	мСтруктураМногострочныхРазделов = Новый Структура;
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыА, СтруктураРеквизитовФормы.мИдГруппыА);
	мСтруктураМногострочныхРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыБ, СтруктураРеквизитовФормы.мИдГруппыБ);
	
	// Структура содержит данные дополнительных страниц:
	//	Ключ - имя раздела, значение - имя таблицы, каждая строка которой соответствует странице раздела
	мСтруктураМногостраничныхРазделов = Новый Структура;
	мСтруктураМногостраничныхРазделов.Вставить("Раздел1",   "ТаблицаСтраницыРаздел1");
	мСтруктураМногостраничныхРазделов.Вставить("Раздел2",   "ТаблицаСтраницыРаздел2");
	мСтруктураМногостраничныхРазделов.Вставить("ЛистА",     "ТаблицаСтраницыЛистА");
	мСтруктураМногостраничныхРазделов.Вставить("ЛистБ",     "ТаблицаСтраницыЛистБ");
	мСтруктураМногостраничныхРазделов.Вставить("ЛистВ",     "ТаблицаСтраницыЛистВ");
	мСтруктураМногостраничныхРазделов.Вставить("ЛистД1",    "ТаблицаСтраницыЛистД1");
	мСтруктураМногостраничныхРазделов.Вставить("ЛистЕ2",    "ТаблицаСтраницыЛистЕ2");
	мСтруктураМногостраничныхРазделов.Вставить("ЛистЖ",     "ТаблицаСтраницыЛистЖ");

	// Структура с описанием обязательного количества строк в многострочных разделах формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыА, КолИсхСтрокИдГруппыА);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыБ, КолИсхСтрокИдГруппыБ);
	
	// Структура с описанием количества колонок в многострочных разделах формы
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыА, КолКолонокИдГруппыА);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыБ, КолКолонокИдГруппыБ);
	
	мСтруктураМаксКолвоКолонокРазделов = Новый Структура;
	мСтруктураМаксКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыА, МаксКолКолонокИдГруппыА);
	мСтруктураМаксКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыБ, МаксКолКолонокИдГруппыБ);
	
	// Установка цветов для оформления ячеек отчета
	ЦветЗаполняетсяТолькоВручную     = Новый Цвет(255, 255, 225);
	ЦветЗаполняетсяАвтоКорректир     = Новый Цвет(255, 240, 200);
	ЦветЗаполняетсяАвтоБезКорректир  = Новый Цвет(230, 240, 220);
	СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика = Новый Цвет(192, 220, 192); // ЗЕЛЕНЫЙ
	ЦветЗаполняетсяОднозначноВручную = Новый Цвет(255, 255, 192); // ЖЕЛТЫЙ
	ЦветЗаполняетсяАвтоматически     = Новый Цвет(255, 255, 255); // Белый, Ввод запрещен
	
	// структура цветов раскраски автозаполняемых ячеек
	мСтруктураЦветовРаскраски = Новый Структура;
	мСтруктураЦветовРаскраски.Вставить("_1", ЦветЗаполняетсяТолькоВручную);
	мСтруктураЦветовРаскраски.Вставить("_2", ЦветЗаполняетсяАвтоКорректир);
	мСтруктураЦветовРаскраски.Вставить("_3", ЦветЗаполняетсяАвтоБезКорректир);
	мСтруктураЦветовРаскраски.Вставить("_4", СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика);
	мСтруктураЦветовРаскраски.Вставить("_0", ЦветЗаполняетсяОднозначноВручную);
	мСтруктураЦветовРаскраски.Вставить("_5", ЦветЗаполняетсяАвтоматически);
	
	мСтруктураВариантыЗаполнения       = Новый Структура;
	мСтруктураВариантыЗаполненияЭталон = Новый Структура;
	
	// Способы округления показателей отчета
	ПорядкиОкругленияОтчетности = Новый Структура;
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1",       Перечисления.ПорядкиОкругленияОтчетности.Окр1);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000",    Перечисления.ПорядкиОкругленияОтчетности.Окр1000);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000000", Перечисления.ПорядкиОкругленияОтчетности.Окр1000000);
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// Установка начального раздела декларации
	ИмяРаздела = "Титульный";
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела));
	
	Инициализация(Параметры.БезОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СтрНайти(Заголовок, СтруктураРеквизитовФормы.СтрПериодОтчета) = 0 Тогда
		Заголовок = "Декларация 3-НДФЛ " + СтруктураРеквизитовФормы.СтрПериодОтчета;
	КонецЕсли;
	
	ОргСтр = " (" + СтруктураРеквизитовФормы.НаимОрганизации + ")";
	Если СтрНайти(Заголовок, ОргСтр) = 0 Тогда
		Заголовок = Заголовок + ОргСтр;
	КонецЕсли;
	СтруктураРеквизитовФормы.ТекстДляЗаголовочнойЧасти = Заголовок;
	
	ПодключитьОбработчикОжидания("ВыполнитьПроверкуПередОткрытием", 0.1, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
				
		Возврат;
		
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	// ДЕНЬГИ 	
	// Удален вызов другой подсистемы
	Возврат;
	// Конец Деньги
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтаФорма, "ФНС");
	Протокол = Неопределено;
	// Конец ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтаФорма, "ФНС");
	// Конец ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаименованиеЭтапаНажатие(Элемент)
	
	ПараметрыИзменения = Новый Структура;
	ПараметрыИзменения.Вставить("Форма", ЭтаФорма);
	ПараметрыИзменения.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
	ПараметрыИзменения.Вставить("КонтролирующийОрган",
		ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));
	
	РегламентированнаяОтчетностьКлиент.ИзменитьСтатусОтправки(ПараметрыИзменения);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийНавигацииПоРазделам

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено
		ИЛИ Элемент.ТекущаяСтрока = СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокРаздела = Элемент.ТекущиеДанные.ПолучитьРодителя() = Неопределено;
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = Элемент.ТекущаяСтрока;
	
	Элементы.ОчиститьТекущуюСтраницу.Доступность = Истина;
	
	Если СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере Тогда
		
		Если Элемент.ТекущиеДанные.РазделМногостраничный Тогда
			
			Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = ?(Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = Неопределено
			ИЛИ Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = 0, 1, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета);
			
		КонецЕсли;
		
		ВывестиМакетСтраницыВТабличныйДокументНаСервере(Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, Элемент.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета, ЗаголовокРаздела);
		
	Иначе
		
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
		
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.РазделМногостраничный Тогда
		
		Элемент.Развернуть(Элемент.ТекущаяСтрока);
		
		Элементы.ДобавитьСтраницу.Видимость   = Истина;
		Элементы.УдалитьСтраницу.Видимость    = Истина;
		
		Если ЗаголовокРаздела Тогда
			
			Элементы.ОчиститьТекущуюСтраницу.Доступность = Ложь;
			
			Элементы.УдалитьСтраницу.Видимость = Ложь;
						
		ИначеЕсли Элемент.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы().Количество() = 1 Тогда
			
			Элементы.УдалитьСтраницу.Видимость    = Ложь;
			
		КонецЕсли;
	Иначе
		
		Элементы.ДобавитьСтраницу.Видимость   = Ложь;
		Элементы.УдалитьСтраницу.Видимость    = Ложь;
		
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Титульный" Тогда
		Элементы.Обновить.Доступность                  = Истина;
	Иначе
		Элементы.Обновить.Доступность                  = Ложь;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "ЛистА"
		ИЛИ Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "ЛистБ" Тогда
		
		Элементы.ТабличныйДокументКонтекстноеМенюГруппаСтроки.Видимость = Истина;
		
	Иначе
		Элементы.ТабличныйДокументКонтекстноеМенюГруппаСтроки.Видимость = Ложь;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел1"
		ИЛИ Элемент.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда

		Элементы.СобратьДанные.Видимость = Истина;
		
	Иначе
		
		Элементы.СобратьДанные.Видимость = Ложь;

	КонецЕсли;
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийТабличногоДокумента

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтаФорма, Область, СтандартнаяОбработка) Тогда
		Если СтрЧислоВхождений(Область.Имя, "ДобавитьСтраницу") > 0 Тогда
			
			ДобавитьСтраницу("");
			
		ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 И Область.Гиперссылка Тогда
			
			УдалитьСтраницу("");
			
		ИначеЕсли СтрЧислоВхождений(Область.Имя, "ДобавитьСтроку") > 0 Тогда
			
			ДобавитьСтроку("");
			
		ИначеЕсли СтрЧислоВхождений(Область.Имя, "УдалитьСтроку") > 0 И Область.Гиперссылка Тогда
			
			УдалитьСтроку("");
			
		ИначеЕсли СтрЧислоВхождений(Область.Имя, "СобратьДанные") > 0 И Область.Гиперссылка Тогда
			
			СобратьДанные("");
			
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	ИмяЯчейки = Область.Имя;
	
	//специальная обработка некоторых областей
	Если Лев(Область.Имя, 7) = "КодИМНС" Тогда
		СтандартнаяОбработка = Ложь;
		Модифицированность   = Истина;
		ОбработкаВыбораИФНС();
		Возврат;
	КонецЕсли;
		
	Если (Лев(ИмяЯчейки,13) = "П000400001010") ИЛИ ИмяЯчейки = "КодСтраны" Тогда //Лист Б Код ОКСМ
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = ПолучитьФорму("Справочник.СтраныМира.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтаФорма);
		ФормаВыбора.Заголовок = "Выбор кода страны";
		
		ДополнительныеПараметры = Новый Структура("ИмяРаздела, ИмяЯчейки, Область, СтандартнаяОбработка, Элемент", ИмяРаздела, ИмяЯчейки, Область, СтандартнаяОбработка, Элемент);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраныМираЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.Открыть();
		Возврат;
		
	ИначеЕсли (Лев(ИмяЯчейки,13) = "П000400001030") Тогда //Лист Б информация о валюте
		СтандартнаяОбработка = Ложь;
		ФормаВыбора = ПолучитьФорму("Справочник.Валюты.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтаФорма);
		ФормаВыбора.Заголовок = "Выбор кода валюты";
		
		ДополнительныеПараметры = Новый Структура("ИмяРаздела, ИмяЯчейки, Область, СтандартнаяОбработка, Элемент", ИмяРаздела, ИмяЯчейки, Область, СтандартнаяОбработка, Элемент);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораКодаВалютыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.Открыть();
		Возврат;
		
	ИначеЕсли (ИмяЯчейки = "Индекс")
		ИЛИ (ИмяЯчейки = "Регион") 
		ИЛИ (ИмяЯчейки = "Район") 
		ИЛИ (ИмяЯчейки = "Город") 
		ИЛИ (ИмяЯчейки = "НаселенныйПункт") 
		ИЛИ (ИмяЯчейки = "Улица")
		ИЛИ (ИмяЯчейки = "Дом") 
		ИЛИ (ИмяЯчейки = "Корпус") 
		ИЛИ (ИмяЯчейки = "Квартира") 
		ИЛИ (ИмяЯчейки = "П000700001050_Индекс")
		ИЛИ (ИмяЯчейки = "П000700001050_Регион") 
		ИЛИ (ИмяЯчейки = "П000700001050_Район") 
		ИЛИ (ИмяЯчейки = "П000700001050_Город") 
		ИЛИ (ИмяЯчейки = "П000700001050_НаселенныйПункт") 
		ИЛИ (ИмяЯчейки = "П000700001050_Улица")
		ИЛИ (ИмяЯчейки = "П000700001050_Дом") 
		ИЛИ (ИмяЯчейки = "П000700001050_Корпус") 
		ИЛИ (ИмяЯчейки = "П000700001050_Квартира") 
		
		Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Префикс = "";
		ПозицияРазделителя = СтрНайти(ИмяЯчейки, "_");
		
		Если ПозицияРазделителя > 0 Тогда
			
			Префикс = Лев(ИмяЯчейки, ПозицияРазделителя);
			
		КонецЕсли;
		
		РоссийскийАдрес = Новый Соответствие;
		
		РоссийскийАдрес.Вставить("Индекс",	        ТабличныйДокумент.Области[Префикс + "Индекс"].Значение);
		РоссийскийАдрес.Вставить("Регион",          ТабличныйДокумент.Области[Префикс + "Регион"].Значение);
		РоссийскийАдрес.Вставить("КодРегиона",      ТабличныйДокумент.Области[Префикс + "Регион"].Значение);
		РоссийскийАдрес.Вставить("Район",           ТабличныйДокумент.Области[Префикс + "Район"].Значение);
		РоссийскийАдрес.Вставить("Город",           ТабличныйДокумент.Области[Префикс + "Город"].Значение);
		РоссийскийАдрес.Вставить("НаселенныйПункт", ТабличныйДокумент.Области[Префикс + "НаселенныйПункт"].Значение);
		РоссийскийАдрес.Вставить("Улица",           ТабличныйДокумент.Области[Префикс + "Улица"].Значение);
		РоссийскийАдрес.Вставить("Дом",             ТабличныйДокумент.Области[Префикс + "Дом"].Значение);
		РоссийскийАдрес.Вставить("Корпус",          ТабличныйДокумент.Области[Префикс + "Корпус"].Значение);
		РоссийскийАдрес.Вставить("Квартира",        ТабличныйДокумент.Области[Префикс + "Квартира"].Значение);
		
		Если Регионы.Количество() = 0 Тогда
			ЗаполнитьРегионыНаСервере();
		КонецЕсли;
		
		Регион = Регионы.НайтиСтроки(Новый Структура("Код", СокрЛП(РоссийскийАдрес["Регион"])));
		
		Если Регион.Количество() > 0 Тогда
			
			РоссийскийАдрес["Регион"] = Регион[0].Наим;
			
		КонецЕсли;
		
		ЗначенияПолей = Новый СписокЗначений;
		
		ЗначенияПолей.Добавить(РоссийскийАдрес["Индекс"],          "Индекс");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Регион"],          "Регион");
		ЗначенияПолей.Добавить(РоссийскийАдрес["КодРегиона"],      "КодРегиона");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Район"],           "Район");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Город"],           "Город");
		ЗначенияПолей.Добавить(РоссийскийАдрес["НаселенныйПункт"], "НаселенныйПункт");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Улица"],           "Улица");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Дом"],             "Дом");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Корпус"],          "Корпус");
		ЗначенияПолей.Добавить(РоссийскийАдрес["Квартира"],        "Квартира");
		
		ПредставлениеАдреса = РегламентированнаяОтчетностьКлиентСервер.ПредставлениеАдресаВФормате9Запятых("643," + РоссийскийАдрес["Индекс"] + ","
		+ РоссийскийАдрес["Регион"] + ","
		+ РоссийскийАдрес["Район"] + ","
		+ РоссийскийАдрес["Город"] + ","
		+ РоссийскийАдрес["НаселенныйПункт"] + ","
		+ РоссийскийАдрес["Улица"] + ","
		+ РоссийскийАдрес["Дом"] + ","
		+ РоссийскийАдрес["Корпус"] + ","
		+ РоссийскийАдрес["Квартира"]);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок",               "Ввод адреса");
		ПараметрыФормы.Вставить("ЗначенияПолей", 		   ЗначенияПолей);
		ПараметрыФормы.Вставить("Представление", 		   ПредставлениеАдреса);
		ПараметрыФормы.Вставить("ВидКонтактнойИнформации", СтруктураРеквизитовФормы.СправочникиВидыКонтактнойИнформацииФактАдресОрганизации);
				
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("РоссийскийАдрес", РоссийскийАдрес);
		ДополнительныеПараметры.Вставить("Префикс", Префикс);
			
		ТипЗначения = Тип("ОписаниеОповещения");
		ПараметрыКонструктора = Новый Массив(3);
		ПараметрыКонструктора[0] = "ОткрытьФормуКонтактнойИнформацииЗавершение";
		ПараметрыКонструктора[1] = ЭтаФорма;
		ПараметрыКонструктора[2] = ДополнительныеПараметры;
			
		Оповещение = Новый (ТипЗначения, ПараметрыКонструктора);
	
		ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеКонтактнойИнформациейКлиент").ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, , Оповещение);
		
	КонецЕсли;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, ИмяЯчейки);
	
	//создание динамического списка выбора
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений <> Неопределено Тогда
		//обработка таблицы значений - удаление вариантов, не проходящих по условиям
		КодПоказателя = ПараметрВводаПоля.Показатель;
		
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ПараметрВводаПоля.ТаблицаЗначений, СтандартнаяОбработка);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область)
	
	Модифицированность = Истина;
	
	ПараметрВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", Область.Имя));
	
	Если ПараметрВводаПоля.Количество() > 0 Тогда
		
		ПараметрВводаПоля = ПараметрВводаПоля[0];
		
		Если ПараметрВводаПоля.Тип = "КБК" И ЗначениеЗаполнено(Область.Значение) Тогда
			Область.Значение = СтрЗаменить(Область.Значение," ","");
		КонецЕсли;
			
		Если СтрДлина(СокрЛП(Область.Значение)) <> 0 И ПараметрВводаПоля.Длина <> 0 И СтрДлина(СокрЛП(Область.Значение)) <> ПараметрВводаПоля.Длина Тогда
			
			// ДЕНЬГИ
			//Сообщение = Новый СообщениеПользователю;
			//
			//Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Длина значения показателя должна быть равна %1!'"), ПараметрВводаПоля.Длина);
			//
			//Сообщение.Сообщить();
			// Конец ДЕНЬГИ
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяПоказателя = Область.Имя;
	ЗначПоказателя = Область.Значение;
	ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	
	//Изменение "по месту нахождения (учета) (код)" на Титульном листе
	Если СтрНайти(ИмяПоказателя, "ПоМесту") > 0 Тогда
		
		НовыйПоМесту = РегламентированнаяОтчетностьКлиентСервер.ВернутьЗначениеПараметраСЛиста(ЭтаФорма, "Титульный", "ПоМесту");
		
		СтруктураРеквизитовФормы.мПоМесту = НовыйПоМесту;
		РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область);
	// ДЕНЬГИ
	ИначеЕсли ИмяПоказателя = "ИНН" Тогда
		
		СтруктураДанныхТитульный.Вставить("ИНН", ЗначПоказателя);
	// Конец ДЕНЬГИ
	ИначеЕсли ИмяПоказателя = "ДатаПодписи" Тогда
		
		ДатаПодписи = ЗначПоказателя;
		
	ИначеЕсли ИмяПоказателя = "НомерКорректировки" Тогда
		
		НомерКорректировки = ЗначПоказателя;
		СтруктураРеквизитовФормы.ВидДокумента = ?(НомерКорректировки > 0, 1, 0);
		
	Иначе
		РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ТабличноеПолеИмя = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	
	Элементы.УдалитьСтроку.Доступность = Ложь;
	
	Если ТабличноеПолеИмя = "ЛистА" ИЛИ ТабличноеПолеИмя = "ЛистБ" Тогда
		
		ДлинаИмени = СтрДлина(Элемент.ТекущаяОбласть.Имя) - 2;
		
		Если НЕ ТабличныйДокумент.Области.Найти(Лев(Элемент.ТекущаяОбласть.Имя, ДлинаИмени) +"_2") = Неопределено Тогда
			Элементы.УдалитьСтроку.Доступность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗагрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчет(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСведенияОбОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанные(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Тогда
		
		СобратьДанныеВРаздел1();
		
	ИначеЕсли Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
		
		СобратьДанныеВРаздел2();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	ВставитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Удалить текущую страницу?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	Перем МаксимальноеКоличествоСтрокГруппы, СтруктураГруппы;
	
	ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// Исходное количество строк группы
	мСтруктураМаксКолвоКолонокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);
	
	мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = ЭтаФорма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	Если КолСтрок = МаксимальноеКоличествоСтрокГруппы Тогда
		ТекстВопроса = НСтр(СтрЗаменить("ru = 'Количество строк на странице не может превышать #МаксимальноеКоличествоСтрокГруппы#. Добавить новую страницу?'","#МаксимальноеКоличествоСтрокГруппы#",МаксимальноеКоличествоСтрокГруппы));
		ДополнительныеПараметры = Новый Структура("Команда", Команда);
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСтрокуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	Иначе
		#Если ВебКлиент Тогда
			
			ДобавитьСтрокуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
			
		#Иначе
			
			ДобавитьСтрокуНаКлиенте(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
			
		#КонецЕсли
		
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтаФорма["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	ИмяГруппы      = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтаФорма, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?%1'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтаФорма, "ОчиститьВесьОтчет");
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТекущуюСтраницуЗавершение", ЭтотОбъект);
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(
		ЭтаФорма, "ОчиститьТекущийЭкземплярМногостраничногоРаздела"
		+ Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСДвухмернымШтрихкодомPDF417(Команда) Экспорт
	
	РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФорму(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда)
	
	Отказ = Ложь;
	
	РегламентированнаяОтчетностьКлиентПереопределяемый.ПроверитьВозможностьАвтоЗаполненияРеглОтчета(ИмяФормы, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьАвтоЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗаполнениемРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",							СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета",			СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",				СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	
	ИДИменПоказателей = Новый Массив();
	ИДИменПоказателей.Добавить(Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя);
	
	РегламентированнаяОтчетностьКлиент.ОткрытьРасшифровкуОтчета(Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7), Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") + 7), ИДИменПоказателей, ПараметрыОтчета)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезПредставителя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЧерезПредставителяЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВИнтернетеЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтаФорма, "ФНС");
	Протокол = Неопределено;
	// ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтаФорма, "ФНС");
	Протокол = Неопределено;
	// Конец ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОтправкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте(, Новый ОписаниеОповещения("ЗаписатьИЗакрытьПродолжение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы(Команда)
	
	РегламентированнаяОтчетностьКлиент.СохранитьОтчетИОткрытьФормуПрисоединенныеФайлы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуСДвухмернымШтрихкодомPDF417(Команда) Экспорт
	
	РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФорму(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразу(Команда)
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПечататьСразуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Формирование структуры и начальное заполнение отчета
#Область ИнициализацияОтчета

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	// Заполняем показатели отчета из макета "Состав показателей"
	ЗаполнитьНачальныеНастройки();
	
	// Настройки показа и вывода на печать каждой страницы отчета
	ФормироватьСтруктуруСтраницОтчета();
	
	// Настройки свойств каждого раздела: многострочности, многостраничности, количества строк и страниц, параметров автозаполнения и т.д.
	ФормироватьСтруктуруСвойствСтраниц();
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	УстановитьМаскиВПоляхВвода(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ТабличныйДокумент.Области.НомерКорректировки.Значение = 0;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	
	СтруктураРеквизитовФормы.мАвтоВыборКодов = Ложь;
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
	Если НЕ БезОткрытияФормы Тогда
		
		СформироватьСпискиВыбора();
		
	КонецЕсли;
	
	// Заполняем многострочные разделы нужным количеством строк
	НачальныеОперацииСМногострочнымиБлоками();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		
		Если СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда // документ скопирован
			ВосстановитьСохраненныеДанные();
		Иначе // новый документ
			
			СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
			КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
			
			СтруктураРеквизитовФормы.мПоМесту = "214";
			ТабличныйДокумент.Области.ПоМесту.Значение = СтруктураРеквизитовФормы.мПоМесту;
			
		КонецЕсли;
		
		ЗаполнитьДатуПодписи(ЭтаФорма);
		Модифицированность = Истина;

		Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено
		 ИЛИ ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма)
		 ИЛИ СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда
			ЗаполнитьСведенияОбОрганизации();
		КонецЕсли;
		
	Иначе
		
		ЗаполнитьПустыеСтруктурыДанных();
		ВосстановитьСохраненныеДанные();
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
			Модифицированность = Истина;
		КонецЕсли;
		
		Если НЕ БезОткрытияФормы
			И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
			
			ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);
			
		КонецЕсли;
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтаФорма);
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить Тогда
		Элементы.Заполнить.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать Тогда
		Элементы.Расшифровать.Видимость = Ложь;
		Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Видимость = Ложь;
	КонецЕсли;
	
	ПоказатьПериод();
	
	// формируем список элементов подменю, связанное с кнопкой <Печать>
	Если НЕ БезОткрытияФормы Тогда
		РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтаФорма);
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.Организация <> Неопределено Тогда
		СтруктураРеквизитовФормы.НаимОрганизации = СтруктураРеквизитовФормы.Организация.Наименование;
	КонецЕсли; 
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	// ДЕНЬГИ РегламентированнаяОтчетность.ДобавитьКнопкуПрисоединенныеФайлы(ЭтаФорма);
	
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтаФорма);
	
	Если СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда
		
		ЗаполнитьАвтоНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру "СтруктураРеквизитовФормы" обязательными ключами
&НаСервере
Процедура СформироватьСтруктуруРеквизитовФормы()
	
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("ВариантыФорматовВыгрузки");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("мАвтоВыборКодов");
	СтруктураРеквизитовФормы.Вставить("мБезОткрытияФормы");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мВерсияФормы");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДокументПредставителя");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мЗаписьЗапрещена");
	
	// Идентификаторы многострочных групп
	СтруктураРеквизитовФормы.Вставить("мИдГруппыА");
	СтруктураРеквизитовФормы.Вставить("мИдГруппыБ");
	
	СтруктураРеквизитовФормы.Вставить("мИмяПредставителя");
	СтруктураРеквизитовФормы.Вставить("мКодОтчета");
	СтруктураРеквизитовФормы.Вставить("мНазваниеПредставителя");
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповЧислоЕ");
	
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(Тип("Булево"));
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповБулево", Новый ОписаниеТипов(МассивБулево)); // для быстрого получения описания типа
	
	СтруктураРеквизитовФормы.Вставить("мОтчествоПредставителя");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мПечатаемыеРазделы");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("мПечатьБезШтрихкодаРазрешена", Истина); //ДЕНЬГИ //Ложь); // Конец ДЕНЬГИ
	СтруктураРеквизитовФормы.Вставить("мПредставительФизЛицо");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСоставПоказателей");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("мСтрокаФормата");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мФамилияПредставителя");
	СтруктураРеквизитовФормы.Вставить("НаимОрганизации");
	СтруктураРеквизитовФормы.Вставить("НаимОрг");
	СтруктураРеквизитовФормы.Вставить("ФлажокОтклАвтоРасчет", Ложь);
	СтруктураРеквизитовФормы.Вставить("ЦветЗаполняетсяАвтоАрифметика");
	СтруктураРеквизитовФормы.Вставить("мПолноеИмяФайлаВнешнейОбработки");
	СтруктураРеквизитовФормы.Вставить("мПоМесту");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("СтрПериодОтчета");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("НомерТекущейСтраницы");
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповЧислоДНБ");
	СтруктураРеквизитовФормы.Вставить("СправочникиВидыКонтактнойИнформацииФактАдресОрганизации");
	СтруктураРеквизитовФормы.Вставить("НужноРассчитатьОтчетНаСервере", Ложь);
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуЗаполнить", Истина);
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуРасшифровать", Ложь);
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417");
	СтруктураРеквизитовФормы.Вставить("мРазмерНеоблогаемойСуммыДохода");
	СтруктураРеквизитовФормы.Вставить("мСтатусНалогоплательщика");
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", Ложь);
	СтруктураРеквизитовФормы.Вставить("ТекстДляЗаголовочнойЧасти");
	СтруктураРеквизитовФормы.Вставить("СформироватьФормуОтчетаАвтоматически");
	СтруктураРеквизитовФормы.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	СтруктураРеквизитовФормы.Вставить("ОКТМО");
	
КонецПроцедуры

// Добавляет в таблицы многостраничных отчетов строки, соответствующие 1-й странице
&НаСервере
Процедура ИнициализацияМногостраничныхРазделов()
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыРаздел1.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыРаздел2.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыЛистА.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыЛистБ.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыЛистД1.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыЛистЕ2.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыЛистЖ.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	СтрПерваяСтраница = ЭтаФорма.ТаблицаСтраницыЛистВ.Добавить();
	СтрПерваяСтраница.Представление               = "Новая страница";
	СтрПерваяСтраница.АктивнаяСтраница            = Истина;
	СтрПерваяСтраница.АвтоматическоеПредставление = Истина;
	
	
КонецПроцедуры

// Выполняет начальные настройки параметров отчета.
// По данным макета "СоствПоказателей" формирует:
//   - состав показателей отчета;
//   - варианты заполнения показателей отчета;
//   - дерево выводимых на печать листов отчета.
//
&НаСервере
Процедура ЗаполнитьНачальныеНастройки()
	
	МакетСоставаПоказателей = ОтчетОбъект().ПолучитьМакет(СтруктураРеквизитовФормы.мСоставПоказателей);
	
	МассивТиповТаблицаЗначений = Новый Массив; 
	МассивТиповТаблицаЗначений.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТиповТаблицаЗначений = Новый ОписаниеТипов(МассивТиповТаблицаЗначений);
	
	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
		
		ТекОбласть    = МакетСоставаПоказателей.Области[Инд];
		ИмяСтраницы   = ТекОбласть.Имя;
		
		ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы].Добавить();
		
		// Таблица значений содержит информацию о вариантах заполнения показателя отчета.
		// В колонках таблицы значений отображается следующая информация:
		//   - имя ячейки (код показателя);
		//   - вариант заполнения ячейки;
		//   - вычисленное по данным ИБ значение ячейки;
		//   - величина автокорректировки значения ячейки;
		//   - примечание к ячейке.
		//
		
		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			// перебираем строки макета
			
			// Код показателя (по составу показателей) определяется по первой колонке макета
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			ИмяПоказателя = КодПоказателя;
			
			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;
			
			Если КодПоказателя = "###" Тогда
				Прервать;
			КонецЕсли;
			
			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;
			
			// код показателя по форме отчете (имя ячейки в полях табличного документа формы)
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			// признак многострочности определяется по третьей колонке макета
			ПризнМногострочность = СокрЛП(МакетСоставаПоказателей.Область(Ном, 3).Текст);
			// по четвертой колонке определяется тип данных реквизита
			ТипДанныхРеквизита   = СокрЛП(МакетСоставаПоказателей.Область(Ном, 4).Текст);
			// по колонке 5 определяется исходное количество строк многострочного раздела
			стрКолСтрокИсходный  = СокрЛП(МакетСоставаПоказателей.Область(Ном, 5).Текст);
			// вариант заполнения ячейки определяется по колонке 6 макета
			стрВариантЗаполнения = РегламентированнаяОтчетность.ПолучитьВариантЗаполненияПоказателяРегОтчета(МакетСоставаПоказателей, Ном);
			// код показателя из структуры, берется из колонки 9
			КодПоказателяПоСтруктуре = СокрЛП(МакетСоставаПоказателей.Область(Ном, 9).Текст);
			
			чКолСтрокИсходный    = ? (ПустаяСтрока(стрКолСтрокИсходный),  0, Число(стрКолСтрокИсходный));
			чВариантЗаполнения   = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
			
			// формируем таблицу значений, содержащей состав показателей отчета
			НоваяСтрока = мТаблицаСоставПоказателей.Добавить();
			НоваяСтрока.ИмяПоляТаблДокумента   = ИмяСтраницы;
			НоваяСтрока.КодПоказателяПоСоставу = КодПоказателя;
			НоваяСтрока.КодПоказателяПоФорме   = КодПоказателяПоФорме;
			НоваяСтрока.ПризнМногострочности   = ПризнМногострочность;
			НоваяСтрока.ТипДанныхПоказателя    = ТипДанныхРеквизита;
			НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяпоСтруктуре;
			
			Если чВариантЗаполнения <> 0 Тогда
				// Если в колонке 6 задан вариант заполнения показателя, 
				// то его значение может определяться по данным ИБ.
				// Дополняем таблицу значений вариантов заполнения
				НоваяСтрока = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Добавить();

				НоваяСтрока.КодПоказателя      = КодПоказателя;
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
				НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяПоСтруктуре;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Количество() > 0 Тогда
			// имеются автоматически заполняемые ячейки
			// Создаем структуру, содержащей варианты заполнения показателей отчета.
			//
			// В качестве ключа используется имя страницы основной панели формы, содержащей
			//   табличный документ с автоматически заполняемыми показателями.
			// В качестве значения принимаем Массив из таблицы значений - вариантов заполнения
			//   показателей по каждой странице многостраничного раздела.
			//
			мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, ИмяСтраницы);
			мСтруктураВариантыЗаполненияЭталон.Вставить(ИмяСтраницы, ИмяСтраницы);
			
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки показа страниц, вывода на печать и выгрузки в ИМНС.
//
&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	// Дерево содержит коллекцию страниц отчета.
	// В колонках дерева хранятся следующие данные:
	//    - представление листа;
	//    - имя страницы основной панели формы, содержащей выводимый на печать лист;
	//    - имя поля табличного документа;
	//    - имя области ячеек табличного документа (используется в случае вывода
	//      на печать отдельных страниц титульного листа);
	//    - ориентация страницы при печати;
	//    - число, метка вывода страницы на печать;
	//    - число, метка показа страницы на основной панели формы;
	//    - число, метка выгрузки данных страницы в ИМНС.
	//
	
	мДеревоСтраницОтчета.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Титульный";
	СтрокаУровня1.Представление            = "Титульный лист";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
		
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел1";
	СтрокаУровня1.Представление            = "Раздел 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "Раздел2";
	СтрокаУровня1.Представление            = "Раздел 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистА";
	СтрокаУровня1.Представление            = "Лист А";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;

	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистБ";
	СтрокаУровня1.Представление            = "Лист Б";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистВ";
	СтрокаУровня1.Представление            = "Лист В";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистГ";
	СтрокаУровня1.Представление            = "Лист Г";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистД1";
	СтрокаУровня1.Представление            = "Лист Д1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистД2";
	СтрокаУровня1.Представление            = "Лист Д2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЕ1";
	СтрокаУровня1.Представление            = "Лист Е1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЕ2";
	СтрокаУровня1.Представление            = "Лист Е2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЖ";
	СтрокаУровня1.Представление            = "Лист Ж";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
		
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЗ";
	СтрокаУровня1.Представление            = "Лист З";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЗПродолжение";
	СтрокаУровня1.Представление            = "Лист З" + Символы.ПС + "продолжение 1";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЗПродолжение2";
	СтрокаУровня1.Представление            = "Лист З" + Символы.ПС + "продолжение 2";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЗПродолжение3";
	СтрокаУровня1.Представление            = "Лист З" + Символы.ПС + "продолжение 3";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистЗПродолжение4";
	СтрокаУровня1.Представление            = "Лист З" + Символы.ПС + "продолжение 4";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистИ";
	СтрокаУровня1.Представление            = "Лист И";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
	СтрокаУровня1 = мДеревоСтраницОтчета.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы              = "ЛистИПродолжение";
	СтрокаУровня1.Представление            = "Лист И" + Символы.ПС + "продолжение";
	СтрокаУровня1.ОриентацияСтраницы       = "Портрет";
	СтрокаУровня1.ВыводНаПечать            = 1;
	СтрокаУровня1.ПоказатьСтраницу         = 1;
	СтрокаУровня1.ВыгрузитьСтраницу        = 2;
	
КонецПроцедуры

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки многострочности, многостраничности, количества строк и страниц, параметров автозаполнения.
//
&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	мСвойстваРазделовДекларации.ПолучитьЭлементы().Очистить();
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Титульный";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Ложь;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 9;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "Раздел2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 9;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы									= "ЛистА";
	СтрокаУровня1.СохранятьМногострКакТЗ						= Истина;
	СтрокаУровня1.МногостраничностьВРазделе						= Истина;
	СтрокаУровня1.МаксКолвоЭкз									= 999;
	СтрокаУровня1.ОчищатьРаздел									= Истина;
	СтрокаУровня1.ИмяПредставления								= "";
	СтрокаУровня1.ПредставлениеДанных							= Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки					= Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым					= Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста	= Истина;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице		= Истина;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппыА;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 16;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистБ";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 999;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Истина;
	
	НовСтр = СтрокаУровня1.МногострочностьВРазделе.Добавить();
	НовСтр.ИдГруппы = СтруктураРеквизитовФормы.мИдГруппыБ;
	НовСтр.Область = "МногострочнаяЧасть";
	НовСтр.ВысотаСтроки = 15;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистВ";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Ложь;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 999;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Истина;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Истина;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистГ";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистД1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 2;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Истина;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистД2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 2;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЕ1";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЕ2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 999;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Истина;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЖ";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Истина;
	СтрокаУровня1.МаксКолвоЭкз						   = 2;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Истина;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЗ";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЗПродолжение";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЗПродолжение2";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЗПродолжение3";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;

	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистЗПродолжение4";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистИ";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Истина;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
	СтрокаУровня1 = мСвойстваРазделовДекларации.ПолучитьЭлементы().Добавить();
	СтрокаУровня1.ИмяСтраницы                          = "ЛистИПродолжение";
	СтрокаУровня1.СохранятьМногострКакТЗ               = Неопределено;
	СтрокаУровня1.МногостраничностьВРазделе            = Ложь;
	СтрокаУровня1.МаксКолвоЭкз						   = 0;
	СтрокаУровня1.ОчищатьРаздел                        = Истина;
	СтрокаУровня1.ИмяПредставления                     = "";
	СтрокаУровня1.ПредставлениеДанных                  = Ложь;
	СтрокаУровня1.РазделОбязателенДляВыгрузки          = Неопределено;
	СтрокаУровня1.РазделЯвляетсяАвтозаполняемым        = Ложь;
	СтрокаУровня1.ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Ложь;
	СтрокаУровня1.ПоказыватьИтогиТолькоНаПоследнейСтранице  = Ложь;
	
КонецПроцедуры

// Заполняет списки выбора для отдельных показателей отчета
&НаСервере
Процедура СформироватьСпискиВыбора()
	
	МакетСоставаПоказателей = ОтчетОбъект().ПолучитьМакет("Списки2015кв1");
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить("Код",,, МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("Название",,, МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("РезультатПроверки",,, 0);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
					НовСтрока.РезультатПроверки = СокрП(МакетСоставаПоказателей.Область(НомСтр, 3).Текст);
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;
	
	СвойстваПоказателей.Очистить();
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПоМесту", 3, , "Выбор места представления", КоллекцияСписковВыбора["МестаПредставления"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "СтатусНалогоплательщика", 1, , "Статус налогоплательщика", КоллекцияСписковВыбора["СтатусНалогоплательщика"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "МестоЖительства", 1, , "Выбор вида места жительства", КоллекцияСписковВыбора["МестаЖительства"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "КодВидаДокумента", 2, , "Выбор вида документа, удостоверяющего личность", КоллекцияСписковВыбора["КодВидаДокумента"]);
	
	// Титульный
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПрПодп", 0, , "Выбор подписанта", КоллекцияСписковВыбора["ВидПодписанта"]);
	
	//Итоги
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000100001010", 1, , "Выбор кода строки 010", КоллекцияСписковВыбора["КодСтроки010"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000100001020", 20, "КБК", "Выбор КБК", КоллекцияСписковВыбора["КБК2012"]);
	
	// Раздел2
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000200001001", 0, , "Выбор налоговой ставки", КоллекцияСписковВыбора["СтавкаНалога"]);
	ЭтаФорма.мСтавкиНалога.Загрузить(КоллекцияСписковВыбора["СтавкаНалога"]);
	
	//Лист А
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000300001010", 0, , "Выбор налоговой ставки", КоллекцияСписковВыбора["СтавкаНалога"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000300001020", 0, , "Выбор вида дохода", КоллекцияСписковВыбора["КодыВидовДоходов"]);
	
	// Лист Б
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000400001001", 0, , "Выбор налоговой ставки", КоллекцияСписковВыбора["СтавкаНалога"]);
	
	//Лист В
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000500001010", 1, , "Выбор вида деятельности", КоллекцияСписковВыбора["ВидДеятельности"]);
	
	//Лист Ж
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П001100001001", 1, , "Выбор места нахождения источника доходов", КоллекцияСписковВыбора["ИсточникДоходов"]);
	
	//Лист Д1
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001010", 1, , "Выбор кода наименования объекта",    КоллекцияСписковВыбора["КодНаименованияОбъекта"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001020", 1, , "Выбор вида собственности на объект", КоллекцияСписковВыбора["ВидСобственности"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001030", 2, , "Выбор признака налогоплательщика",   КоллекцияСписковВыбора["ПризнакНалогоплательщикаПоИмуществу"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001040", 1, , "Вычет заявлен в соответствии с п. 10 статьи 220 НК РФ", КоллекцияСписковВыбора["ВычетСтатьи220"]);
	
КонецПроцедуры

// Добавляет нужное количество строк в таблицы (П000300001 и П000400001), 
//	с помощью которых многострочные разделы редактируются в табличном документе
&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтаФорма[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
			
			СтруктураГруппы.Добавить();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Обслуживание ДереваРазделов и обработка его событий
#Область ДеревоРазделов

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтаФорма);
	
КонецПроцедуры

// Формирует дерево для навигации по разделам и страницам отчета
&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
			ЭлементРазделовОтчета.КолонкаРазделыОтчета         = ЭлементДереваСтраницОтчета.Представление;
			ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
			ЭлементРазделовОтчета.ИндексКартинки               = 1;
			ЭлементРазделовОтчета.РазделМногостраничный        = Ложь;
			ЭлементРазделовОтчета.РазделМногострочный          = Ложь;
			
			НайденноеЗначение = Неопределено;
			
			Если Форма["мСтруктураМногостраничныхРазделов"].Свойство(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, НайденноеЗначение) Тогда
				
				Если НЕ НайденноеЗначение = Неопределено Тогда
					
					НайденноеЗначение = Форма[НайденноеЗначение];
					
					ЭлементРазделовОтчета.ИндексКартинки        = 0;
					ЭлементРазделовОтчета.РазделМногостраничный = Истина;
					
					Для НомерСтраницы = 1 По НайденноеЗначение.Количество() Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим;
						СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
						СтраницаРазделаОтчета.ИндексКартинки                    = 1;
						СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти


// Обслуживание реквизита и элемента формы ТабличныйДокумент:
//	заполнение ячеек, перерисовка, добавление / удаление элементов
#Область ТабличныйДокумент

&НаСервере
Процедура УстановитьМаскиВПоляхВвода(ИмяТекРаздела)
	
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Число15_2 = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	
	Для каждого Область Из ТабличныйДокумент.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение И Не ЗначениеЗаполнено(Область.Формат) Тогда
			Если Область.ТипЗначения = ТипЧисло Тогда
				Область.ТипЗначения = Число15_2;
			ИначеЕсли Область.ТипЗначения = ТипДата Тогда
				Область.Формат = "ДФ=dd.MM.yyyy";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Раздел1
	Если ИмяТекРаздела = "Раздел1" Тогда
		
		ТабличныйДокумент.Области.П000100001010.Формат = "ЧЦ=1; ЧДЦ=0";
		ТабличныйДокумент.Области.П000100001030.Маска = "99999999999";
		ТабличныйДокумент.Области.П000100001020.Маска = "999999999999999999999";
		
		//Расчет по ставке
	ИначеЕсли ИмяТекРаздела = "Раздел2" Тогда
		
		ТабличныйДокумент.Области.П000200001001.Формат = "ЧЦ=2; ЧДЦ=0";
		
		//Лист А
	ИначеЕсли ИмяТекРаздела = "ЛистА" Тогда

		Для Сч = 1 По ЭтотОбъект.П000300001.Количество() Цикл
			
			ТабличныйДокумент.Области["П000300001020_" + Сч].Формат = "ЧЦ=2; ЧДЦ=0";
			ТабличныйДокумент.Области["П000300001030_" + Сч].Маска = "999999999999";
			ТабличныйДокумент.Области["П000300001040_" + Сч].Маска = "999999999";
			ТабличныйДокумент.Области["П000300001050_" + Сч].Маска = "99999999999";
			
		КонецЦикла;
		
		// Лист Б
	ИначеЕсли ИмяТекРаздела = "ЛистБ" Тогда
		//
		ТабличныйДокумент.Области.П000400001001.Формат = "ЧЦ=2; ЧДЦ=0";
		
		Для Сч = 1 По ЭтотОбъект.П000400001.Количество() Цикл
			ТабличныйДокумент.Области["П000400001010_" + Сч].Маска = "999";
			ТабличныйДокумент.Области["П000400001030_" + Сч].Маска = "999";
		КонецЦикла;
		
	ИначеЕсли ИмяТекРаздела = "ЛистЕ2" Тогда

		ТабличныйДокумент.Области["П001000001010" + Сч].Маска = "999999999999";
		ТабличныйДокумент.Области["П001000001020" + Сч].Маска = "999999999";
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает формат, цвет, доступность и прочие свойства областей табличного документа на 
//	основании таблицы "мТаблицаСоставПоказателей". Таблица "мТаблицаСоставПоказателей" 
//	собирается по макету "СоставПоказателей..." при инициализации отчета
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФорматВыводаВПоляхВвода(Форма, НаимРаздела) Экспорт
	Перем СтруктураГруппы;
	
	Если Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 0";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 3";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 6";
	КонецЕсли;
	
	Для Каждого СтрПоказатели Из Форма.мТаблицаСоставПоказателей Цикл
		
		Если НЕ НаимРаздела = СтрПоказатели.ИмяПоляТаблДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		КодПоказателя				= СокрП(СтрПоказатели.КодПоказателяПоСоставу);
		ПризнМногострочность		= СокрП(СтрПоказатели.ПризнМногострочности);
		КодПоказателяПоСтруктуре	= СокрП(СтрПоказатели.КодПоказателяПоСтруктуре);
		КодПоказателяПоФорме		= СокрП(СтрПоказатели.КодПоказателяПоФорме);
		ТипДанныхПоказателя			= СокрП(СтрПоказатели.ТипДанныхПоказателя);
		ИмяПоказателя				= ?(ПустаяСтрока(СтрПоказатели.КодПоказателяПоФорме), КодПоказателя, КодПоказателяПоФорме);
		
		Если ПустаяСтрока(КодПоказателя) ИЛИ КодПоказателя = "===" ИЛИ КодПоказателя = "###" ИЛИ Лев(КодПоказателя, 2) = "//" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипДанныхПоказателя = "Е" И ПустаяСтрока(КодПоказателяПоСтруктуре) Тогда
			ТекТабличноеПоле = Форма.ТабличныйДокумент;
			Если ПризнМногострочность <> "/" Тогда
				ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя];
				ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
				ЧислоЕЗнак = Форма.СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ;
				
				Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
					ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
				КонецЕсли;
				ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
				ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
			Иначе
				// определяем кол-во строк многострочного раздела и применяем процедуру форматирования к данной графе по всем строкам
				НСтр = 1;
				Пока ТекТабличноеПоле.Области.Найти(ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")) <> Неопределено Цикл
					ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")];
					ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
					ЧислоЕЗнак = Форма.СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ;
					Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
						ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
					КонецЕсли;
					ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
					ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
					НСтр = НСтр + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиЗначениямиПоУмолчаниюНаСервере(ИмяРаздела)
	
	ЗаполнитьПоказателиЗначениямиПоУмолчанию(ЭтотОбъект, ИмяРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьПоказателиЗначениямиПоУмолчанию(Форма, ИмяРаздела)
	
	Если ИмяРаздела = "Титульный" Тогда
		
		Форма.СтруктураДанныхТитульный.Период  = "34";
		Если Не ЗначениеЗаполнено(Форма.СтруктураДанныхТитульный.ПоМесту) Тогда
			Форма.СтруктураДанныхТитульный.ПоМесту = "720";
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = "ЛистВ" Тогда
		
		Если Форма.ТабличныйДокумент.Области.Найти("П000500001010") <> Неопределено И Форма.ТабличныйДокумент.Области["П000500001010"].Значение = 0 Тогда
			
			Форма.ТабличныйДокумент.Области["П000500001010"].Значение = 1;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001010", 1);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, ЗаголовокРаздела = Ложь)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета,,,ЗаголовокРаздела);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = НомерСтраницыРазделаОтчета;
	
	РасчетНаСервере(ИмяТекРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, УдалениеСтраницы = Ложь, ИндексУдаляемойСтраницы = Неопределено, ЗаголовокРаздела = Ложь)
	
	ТабличныйДокумент.Очистить();
	
	ЭтоПоследняяСтраница = Истина;
	ЭтоПерваяСтраница = Истина;
	
	КоличествоПодобныхСтраниц = 0;
	
	Если РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекРаздела, "МногостраничностьВРазделе") = Истина 
		И РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекРаздела, "ПоказыватьИтогиТолькоНаПоследнейСтранице") = Истина Тогда
		Если ИмяТекРаздела = "ЛистБ" Тогда
			//Для листов Б итоги выводятся в разрезе ставок налога
			ТаблицаРаздела = ЭтаФорма["ТаблицаСтраницы" + ИмяТекРаздела];
			ТекСтраница = ТаблицаРаздела[НомерСтраницыРазделаОтчета - 1];
			ТекСтавкаНалога = ТекСтраница.Данные[0].Значение.П000400001001;
			ИндексТекСтраницы = ТаблицаРаздела.Индекс(ТекСтраница);
			
			// Если найдется страница удовлетворяющая условиям:
			//  - Это не Текущая страница
			//  - Это не удаляемая страница
			//  - Ставка налога на этой странице такая же как и в текущей
			//  - Индекс этой страницы больше индекса текущей
			// Это означает что текущая страница не последняя
			Для Каждого Страница Из ТаблицаРаздела Цикл
				ИндексСтраницы = ТаблицаРаздела.Индекс(Страница);
				Если Страница <> ТекСтраница
					И ИндексСтраницы <> ИндексУдаляемойСтраницы
					И Страница.Данные[0].Значение.П000400001001 = ТекСтавкаНалога Тогда
					КоличествоПодобныхСтраниц = КоличествоПодобныхСтраниц + 1;
					Если ИндексСтраницы > ИндексТекСтраницы Тогда
						ЭтоПоследняяСтраница = Ложь;
					Иначе
						ЭтоПерваяСтраница = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		// У Листа А в отличии от других многострочных и моногостаничных разделов НЕТ итогов на странице вовсе
		// поэтому для него не нужно различать первую и последнюю станицы, поэтому пропускаем его здесь
		ИначеЕсли ИмяТекРаздела <> "ЛистА" Тогда
			
			КоличествоСтраницРаздела = ЭтаФорма["ТаблицаСтраницы" + ИмяТекРаздела].Количество();
			Если УдалениеСтраницы И ИндексУдаляемойСтраницы + 1 = КоличествоСтраницРаздела Тогда
				ЭтоПоследняяСтраница = Истина;
			Иначе
				ЭтоПоследняяСтраница = КоличествоСтраницРаздела - НомерСтраницыРазделаОтчета = 0;
			КонецЕсли;
		
			ЭтоПерваяСтраница =  НомерСтраницыРазделаОтчета = 1;
			КоличествоПодобныхСтраниц = ЭтаФорма["ТаблицаСтраницы" + ИмяТекРаздела].Количество() - ?(УдалениеСтраницы ,1,0);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоПерваяСтраница И УдалениеСтраницы И КоличествоПодобныхСтраниц = 0 Тогда
		
		ЭтоПоследняяСтраница = Истина;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + ИмяТекРаздела + ?(ЭтоПоследняяСтраница,"","_Без_Итога")));
			
	// Многостраничные разделы.
	//
	Если ИмяТекРаздела = "ЛистД1"
		ИЛИ ИмяТекРаздела = "ЛистВ" 
		ИЛИ ИмяТекРаздела = "ЛистЕ2"
		ИЛИ ИмяТекРаздела = "ЛистЖ"
		ИЛИ ИмяТекРаздела = "Раздел1"
		ИЛИ ИмяТекРаздела = "Раздел2"
		Тогда
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[ИмяТекРаздела];
		
		// Управление видимостью гиперссылки "Удалить страницу"
		КоличествоСтраницРаздела = ЭтаФорма[НаимТаблицыСтраницы].Количество() - ?(УдалениеСтраницы,1,0);
		Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
			Если КоличествоСтраницРаздела = 1 ИЛИ ЗаголовокРаздела Тогда
				Для Каждого Область Из ТабличныйДокумент.Области Цикл
					Если СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 Тогда
						Область.Текст = "";
						Область.Гиперссылка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных = Новый Структура;
		
		СписокДанных = ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		// Сбрасываем активность всех страниц, активность новой выведенной страницы будет установлена ниже
		// Если выводится предыдущая страница перед удалением, то сбрасывать активность не нужно
		// Активная страница будет удалена, а активность перемещена на предыдущую страницу, которая уже выведена
		Если НЕ УдалениеСтраницы Тогда
			Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
				ТаблицаСтраницы.АктивнаяСтраница = Ложь;
			КонецЦикла;
		КонецЕсли;
		// Устанавливаем признак активной страницы только если это не удаление страницы
		// При удалении страницы все происходит по другому, сначала мы показываем предыдущую
		// не активную страницу, и только затем удаляем активную, поэтому в режиме удаления страницы
		// не устанавливаем активность на выведенной странице, активность будет перемещена 
		// на выведенную сейчас страницу после удаления активной страницы (которую удаляем)
		ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = ?(ИндексУдаляемойСтраницы = 0 ,Истина ,НЕ УдалениеСтраницы);
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли; 
		КонецЦикла;
		
		// Многостраничные и многострочные разделы.
		//
	ИначеЕсли ИмяТекРаздела = "ЛистА" или ИмяТекРаздела = "ЛистБ" Тогда
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[ИмяТекРаздела];
		
		// Управление видимостью гиперссылки "Удалить страницу"
		КоличествоСтраницРаздела = ЭтаФорма[НаимТаблицыСтраницы].Количество() - ?(УдалениеСтраницы,1,0);
		Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
			Если КоличествоСтраницРаздела = 1 ИЛИ ЗаголовокРаздела Тогда
				Для Каждого Область Из ТабличныйДокумент.Области Цикл
					Если СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 Тогда
						Область.Текст = "";
						Область.Гиперссылка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных = Новый Структура;
		
		НомерСтраницыРазделаОтчета = Мин(ЭтаФорма[НаимТаблицыСтраницы].Количество(), НомерСтраницыРазделаОтчета);
		
		СписокДанных = ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		// Сбрасываем активность всех страниц, активность новой выведенной страницы будет установлена ниже
		// Если выводится предыдущая страница перед удалением, то сбрасывать активность не нужно
		// Активная страница будет удалена, а активность перемещена на предыдущую стрнаицу, которая уже выведена
		Если НЕ УдалениеСтраницы Тогда
			Для каждого ТаблицаСтраницы Из ЭтаФорма[НаимТаблицыСтраницы] Цикл
				ТаблицаСтраницы.АктивнаяСтраница = Ложь;
			КонецЦикла;
		КонецЕсли;
	
		// Устанавливаем признак активной страницы только если это не удаление страницы
		// При удалении страницы все происходит по другому, сначала мы показываем предыдущую
		// не активную страницу, и только затем удаляем активную, поэтому в режиме удаления страницы
		// не устанавливаем активность на выведенной странице, активность будет перемещена 
		// на выведенную сейчас страницу после удаления активной страницы (которую удаляем)
		ЭтаФорма[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = ?(ИндексУдаляемойСтраницы = 0 ,Истина ,НЕ УдалениеСтраницы);
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли; 
			
		КонецЦикла;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ИмяТекРаздела, ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		// Устанавливаем признак активной страницы только если это не удаление страницы
		СтрСледующаяСтраница.АктивнаяСтраница = ?(ИндексУдаляемойСтраницы = 0 ,Истина ,НЕ УдалениеСтраницы);
		
		ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(ЭтаФорма, ИмяТекРаздела);
		
		КолМногострочныхЧастей = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекРаздела, "МногострочностьВРазделе").Количество();
		
		Если КолМногострочныхЧастей > 0 Тогда
			
			НовДанныеДопСтрокРаздела = СтрСледующаяСтраница.ДанныеДопСтрок;
			
			Если (ТипЗнч(НовДанныеДопСтрокРаздела) = Тип("СписокЗначений"))
				И (НовДанныеДопСтрокРаздела.Количество() > 0)
				И (НовДанныеДопСтрокРаздела[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела") Тогда
				
				НовДанныеДопСтрокРаздела = НовДанныеДопСтрокРаздела[0].Значение;
				
			Иначе
				
				НовДанныеДопСтрокРаздела = Неопределено;
				
			КонецЕсли;
			
			// Способ хранения многострочных частей
			СохранятьМногострКакТЗ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекРаздела, "СохранятьМногострКакТЗ");
			
		Иначе
			
			НовТаблицаДопСтрокРаздела = Неопределено; // Многострочности нет
			ИмяГруппыДопСтрок = Неопределено; // Имя группы строк неопределено
			
		КонецЕсли;
		
		Если НовДанныеДопСтрокРаздела <> Неопределено Тогда
			
			// В случае, если многострочных частей больше 1, то хранится структура, иначе, таблица значений с данными
			Если (КолМногострочныхЧастей > 0) И (НЕ СохранятьМногострКакТЗ) Тогда
				
				Для Каждого ГруппаСтрок Из НовДанныеДопСтрокРаздела Цикл
					ИмяГруппыДопСтрок = ГруппаСтрок.Ключ;
					ДанныеГруппыСтрок = ГруппаСтрок.Значение;
					
					ПромТаблицаГруппыСтрок = ЭтаФорма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
					
					КопироватьДанныеФормы(ДанныеГруппыСтрок, ПромТаблицаГруппыСтрок);
					
					// Заменяем таблицу значений с данными текущей страницы.
					КопироватьДанныеФормы(ПромТаблицаГруппыСтрок, ЭтаФорма[ИмяГруппыДопСтрок]);
					
					ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаГруппыСтрок);
					ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппыДопСтрок);
					
				КонецЦикла;
				
			ИначеЕсли (КолМногострочныхЧастей > 0) И (СохранятьМногострКакТЗ) Тогда
				
				ИмяГруппыДопСтрок = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
				
				ПромТаблицаДопСтрокРаздела = ЭтаФорма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
				
				КопироватьДанныеФормы(НовДанныеДопСтрокРаздела, ПромТаблицаДопСтрокРаздела);
				
				// Заменяем таблицу значений с данными текущей страницы.
				КопироватьДанныеФормы(ПромТаблицаДопСтрокРаздела, ЭтаФорма[ИмяГруппыДопСтрок]);
				
				// Выводим в табличный документ данные группы дополнительных строк и обновляем структуру многострочного раздела
				ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаДопСтрокРаздела);
				ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппыДопСтрок);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОтрисоватьЗначкиУдаленияСтрок(ТабличныйДокумент);
		
	Иначе
		
		Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьМаскиВПоляхВвода(ИмяТекРаздела);
	
	ЗаполнитьПоказателиЗначениямиПоУмолчаниюНаСервере(ИмяТекРаздела);
	
	УстановитьФорматВыводаВПоляхВводаНаСервере(ИмяТекРаздела);
	
	УстановитьЦветФонаЯчейкиНаСервере(,, ИмяТекРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтрисоватьЗначкиУдаленияСтрок(ТабДок)
	
	МассивОбластейСДопСтроками = Новый Массив;
	
	Для Каждого ОбластьТД Из ТабДок.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				МассивОбластейСДопСтроками.Добавить(Лев(ОбластьТД.Имя, 26));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОбластьТД Из ТабДок.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			Если МассивОбластейСДопСтроками.Найти(Лев(ОбластьТД.Имя, 26)) = Неопределено Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
			Иначе
				ОбластьТД.Гиперссылка = Истина;
				ОбластьТД.Текст = "х";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветФонаЯчейкиНаКлиенте(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

// Процедура управляет цветом фона автозаполняемых ячеек при:
//  а) автозаполнении;
//  б) ручном выборе другого варианта заполнения;
//  в) добавлении/удалении и листании дополнительных страниц.
//
// Цвет фона устанавливается в зависимости от варианта заполнения ячейки.
//
// Параметры:
//  ИмяЯчейки                - строка, имя ячейки, для которой устанавливаем цвет фона;
//  ВариантЗаполнения        - число,  вариант заполнения ячейки;
//  ИмяТекущейСтраницыПанели - строка, имя страницы основной панели, на которой для всех автозаполняемых
//                             ячеек табличного документа следует установить цвет фона.
//
&НаСервере
Процедура УстановитьЦветФонаЯчейкиНаСервере(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	УстановитьЦветФонаЯчейки(ЭтаФорма, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

// Процедура управляет цветом фона автозаполняемых ячеек при:
//  а) автозаполнении;
//  б) ручном выборе другого варианта заполнения;
//  в) добавлении/удалении и листании дополнительных страниц.
//
// Цвет фона устанавливается в зависимости от варианта заполнения ячейки.
//
// Параметры:
//  ИмяЯчейки                - строка, имя ячейки, для которой устанавливаем цвет фона;
//  ВариантЗаполнения        - число,  вариант заполнения ячейки;
//  ИмяТекущейСтраницыПанели - строка, имя страницы основной панели, на которой для всех автозаполняемых
//                             ячеек табличного документа следует установить цвет фона.
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЦветФонаЯчейки(Форма, ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	Перем ЦветФона;
	Перем Комментарий;
	
	// Не нужно разукрашивать табличные поля, если открывается без открытия формы (например печать или просмотр)
	Если Форма.СтруктураРеквизитовФормы.мБезОткрытияФормы ИЛИ Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИмяЯчейки = Неопределено Тогда
		// устанавливаем цвет фона конкретной ячейки
		#Если НаКлиенте Тогда
			ИмяСтраницыПанели = РегламентированнаяОтчетностьКлиент.ОпределитьСтраницуПанелиПоКодуПоказателяНаКлиенте(Форма, ИмяЯчейки);
		#Иначе
			ИмяСтраницыПанели = РегламентированнаяОтчетностьВызовСервера.ОпределитьСтраницуПанелиПоКодуПоказателяНаСервере(Форма, ИмяЯчейки);
		#КонецЕсли
		Если ИмяСтраницыПанели = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяПоляТаблДокумента = "ТабличныйДокумент";
		
		Ключ = "_" + ВариантЗаполнения;
		Форма.мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);
		
		// КодПоказателяПоСтруктуре
		ЗначениеВКвадратах = РегламентированнаяОтчетностьКлиентСервер.ОбластьЯвляетсяЯчейкойСоставногоПоля(Форма, ИмяЯчейки);
		
		Если ВариантЗаполнения = 4 ИЛИ ВариантЗаполнения = 5 Тогда
			
			Если ЗначениеВКвадратах Тогда
				// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
				РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "УстановитьЗащиту");
			Иначе
				Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].Защита = Истина;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеВКвадратах Тогда
				// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
				РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "СнятьЗащиту");
			Иначе
				Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].Защита = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		// установим цвет ячейки
		Если ЗначениеВКвадратах Тогда
			РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "ПроставитьЦветРаскраски", ЦветФона);
		Иначе
			Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].ЦветФона = ЦветФона;
		КонецЕсли;
		
	Иначе
		// устанавливаем цвет фона всех автозаполняемых ячеек активной страницы
		
		#Если НаКлиенте Тогда
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьКлиент.ПолучитьТаблицуВариантовЗаполненияНаКлиенте(Форма, ИмяТекущейСтраницыПанели);
		#Иначе
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(Форма, ИмяТекущейСтраницыПанели);
		#КонецЕсли
		
		Если ТаблицаВариантыЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаВариантыЗаполнения Цикл
			ИмяПоказателя            =  Строка.КодПоказателя;
			ВариантЗаполнения        =  Строка.ВариантЗаполнения;
			Комментарий              =  Строка.Комментарий;
			КодПоказателяПоСтруктуре =  Строка.КодПоказателяПоСтруктуре;
			
			КолвоСтрокВМногострочнойЧасти = РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(Форма, ИмяПоказателя);

			ИмяГруппы = Сред(ИмяПоказателя, 1, 10);
			ПоказательМногострочный = Ложь;
			Если Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы) Тогда
				Для Каждого СтруктураГруппы Из Форма[ИмяГруппы] Цикл
					ПоказательМногострочный = СтруктураГруппы.Свойство(ИмяПоказателя);
					Прервать;
				КонецЦикла;
			КонецЕсли;
			
			Если КолвоСтрокВМногострочнойЧасти > 0 И ПоказательМногострочный Тогда
				Многострочность = Истина;
				БазоваяЧасть = ИмяПоказателя;
				ОписанияБлоков = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "МногострочностьВРазделе");
				
				Если ТипЗнч(ОписанияБлоков) = Тип("Число") Тогда
					ВБлокеВсеПоказателиЗаполняются = Истина;
				ИначеЕсли ТипЗнч(ОписанияБлоков) = Тип("ДанныеФормыКоллекция") Тогда
					ИмяГруппы = Сред(ИмяПоказателя, 1, 10);
					ВБлокеВсеПоказателиЗаполняются = НЕ ОписанияБлоков.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].НезаполняемыеПоказателиЕсть;
				КонецЕсли;
				
			Иначе
				Многострочность = Ложь;
				ВБлокеВсеПоказателиЗаполняются = Истина;
				КолвоСтрокВМногострочнойЧасти = 1;
			КонецЕсли;
			
			Для Инд = 1 по КолвоСтрокВМногострочнойЧасти Цикл
				
				Если Многострочность Тогда
					ИмяПоказателя = БазоваяЧасть + "_" + Формат(Инд, "ЧГ=0");
				КонецЕсли;
				
				Если Форма.ТабличныйДокумент.Области.Найти(ИмяПоказателя) <> Неопределено Тогда
					
					ТекОбластьЯчеек = Форма.ТабличныйДокумент.Области[ИмяПоказателя];
					Если (Не ПустаяСтрока(Комментарий)) ИЛИ (Не ПустаяСтрока(ТекОбластьЯчеек.Примечание.Текст)) Тогда
						ТекОбластьЯчеек.Примечание.Текст = Комментарий;
					КонецЕсли;
					
					Ключ = "_" + ВариантЗаполнения;
					Форма.мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);
					
					ЗначениеВКвадратах = ?(ПустаяСтрока(КодПоказателяПоСтруктуре), Ложь, Истина);
					
					Если ВариантЗаполнения = 4 ИЛИ ВариантЗаполнения = 5 Тогда
						
						Если ЗначениеВКвадратах Тогда
							// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
							РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяПоказателя, "УстановитьЗащиту");
						Иначе
							Форма.ТабличныйДокумент.Области[ИмяПоказателя].Защита = Истина;
						КонецЕсли;
						
					Иначе
						
						Если ЗначениеВКвадратах Тогда
							// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
							РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяПоказателя, "СнятьЗащиту");
						Иначе
							Форма.ТабличныйДокумент.Области[ИмяПоказателя].Защита = Ложь;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеВКвадратах Тогда
						РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяПоказателя, "ПроставитьЦветРаскраски", ЦветФона);
					Иначе
						Форма.ТабличныйДокумент.Области[ИмяПоказателя].ЦветФона = ЦветФона;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСодержимогоВПолеТабличногоДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИмяПоказателя = ДополнительныеПараметры.ИмяПоказателя;
	ИмяРаздела = ДополнительныеПараметры.ИмяРаздела;
	НовыйПоМесту = ДополнительныеПараметры.НовыйПоМесту;
	Область = ДополнительныеПараметры.Область;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		//Пользователь отказался очистить отчет - возврат к старому значению
		ТабличныйДокумент.Области.ПоМесту.Значение = СтруктураРеквизитовФормы.мПоМесту;
		Возврат;
	Иначе 
		//Пользователь согласился очистить отчет
		СтруктураРеквизитовФормы.мПоМесту = НовыйПоМесту;	
		
		ОчиститьНаСервере();
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
		СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
		
	КонецЕсли;
	РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДатуПодписи(Форма)

	Форма.ТабличныйДокумент.Области.ДатаПодписи.Значение = Форма.ДатаПодписи;
	Форма.СтруктураДанныхТитульный.ДатаПодписи = Форма.ДатаПодписи;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область)
	
	Если (Лев(ИмяПоказателя,13) = "П000400001040") Тогда //Лист Б информация о дате получения дохода в валюте, нужно перечитать курс
		Курс = ПолучитьКурсВалютыНаДату(ТабличныйДокумент.Области["П000400001030" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"))].Значение, Область.Значение);
		ИмяПоказателяКурса = "П000400001050" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"));
		ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
		СохранитьЗначениеПоказателяВСтруктуре(ЭтаФорма, ИмяРаздела, ИмяПоказателяКурса, Курс);
	КонецЕсли;
	
	Если (Лев(ИмяПоказателя,13) = "П000400001080") Тогда //Лист Б информация о дате уплаты налога в валюте, нужно перечитать курс
		Курс = ПолучитьКурсВалютыНаДату(ТабличныйДокумент.Области["П000400001030" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"))].Значение, Область.Значение);
		ИмяПоказателяКурса = "П000400001090" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"));
		ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
		СохранитьЗначениеПоказателяВСтруктуре(ЭтаФорма, ИмяРаздела, ИмяПоказателяКурса, Курс);
	КонецЕсли;
	
	////действия, связанные с показателями, обладающими списками выбора,
	////на элементы которых наложены условия (макет "Списки...")

	Если ИмяПоказателя = "СтатусНалогоплательщика" Тогда
		ОбновитьПеременныеМодуляНаКлиенте("СтатусНалогоплательщика",Область.Значение);
	КонецЕсли;
	
	//расчет выполняется в структуре, обновляем каждое значение после ввода
	
	Если ИмяРаздела = "Титульный"
		И ИмяПоказателя = "Фамилия"
		Или ИмяПоказателя = "Имя"
		Или ИмяПоказателя = "Отчество"
		Или ИмяПоказателя = "ИНН"
		Тогда
		СохранитьЗначениеПоказателяВСтруктуреНаСервере(ИмяРаздела, ИмяПоказателя, Область.Значение);
	Иначе
		СохранитьЗначениеПоказателяВСтруктуре(ЭтаФорма, ИмяРаздела, ИмяПоказателя, Область.Значение);
	КонецЕсли;

	Если НЕ ИмяРаздела = "Титульный" Тогда
		
		РасчетНаКлиенте(ИмяРаздела, ИмяПоказателя);
		
		СтруктураРеквизитовФормы.НужноРассчитатьОтчетНаСервере = Истина; //Сделаем пересчет на сервере всех разделов
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	КопияТекущиеДанные = ТекущиеДанные;
	
	ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСтраницТекущегоРаздела = ТекущиеДанные.ПолучитьЭлементы().Количество();
	
	Если КоличествоСтраницТекущегоРаздела = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтраницаРазделаПослеУдаления = Неопределено;
	Если КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = КоличествоСтраницТекущегоРаздела Тогда
		ТекущаяСтраницаРазделаПослеУдаления = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(ТекущиеДанные.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета - 1);
		СтруктураРеквизитовФормы.НомерТекущейСтраницы = ТекущаяСтраницаРазделаПослеУдаления.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	НаимРаздела = КопияТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	//Для многостраничных разделов и разделов с итогами не на каждой странице, может понадобиться другой макет
	Если НаимРаздела = "Раздел1"
		Или НаимРаздела = "Раздел2"
		Или НаимРаздела = "ЛистА"
		Или НаимРаздела = "ЛистБ" 
		Или НаимРаздела = "ЛистВ" 
		Или НаимРаздела = "ЛистД1"
		Или НаимРаздела = "ЛистЕ2"
		Или НаимРаздела = "ЛистЖ"
		Тогда
		
		НомерВыводимойСтраницы = СтруктураРеквизитовФормы.НомерТекущейСтраницы;
		Если ТекущаяСтраницаРазделаПослеУдаления = Неопределено Тогда
			НомерВыводимойСтраницы = ?(СтруктураРеквизитовФормы.НомерТекущейСтраницы = КоличествоСтраницТекущегоРаздела, КоличествоСтраницТекущегоРаздела, СтруктураРеквизитовФормы.НомерТекущейСтраницы + 1);
		КонецЕсли;
	
		ВывестиМакетВТаблДокНаСервере(НаимРаздела, НомерВыводимойСтраницы, Истина, ТекущиеДанные.ПолучитьЭлементы().Индекс(КопияТекущиеДанные));
		РасчетНаКлиенте(НаимРаздела);
	КонецЕсли;
	
	ИндексУдаляемойСтраницы = ТекущиеДанные.ПолучитьЭлементы().Индекс(КопияТекущиеДанные);
	
	УдалитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, ИндексУдаляемойСтраницы);
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ИндексУдаляемойСтраницы);
	
	НомерСтраницы = 1;
	
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если НЕ ТекущаяСтраницаРазделаПослеУдаления = Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = ТекущаяСтраницаРазделаПослеУдаления.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Команда = ДополнительныеПараметры.Команда;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДобавитьСтраницу(Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		УдалитьДополнительнуюСтрокуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		
	#Иначе
		
		УдалитьДополнительнуюСтрокуНаКлиенте(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

// Функция определяет поле табличного документа формы, содержащее 
// многострочный раздел.по имени ИдГруппы.
//
// Параметры:
//  ИдГруппы - строка, имя многострочного раздела.
//
// Возвращаемое значение:
//  Поле табличного документа.
//
&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппыА Тогда
		ТекТабличноеПоле = "ЛистА";
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппыБ Тогда
		ТекТабличноеПоле = "ЛистБ";
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

// Функция определяет многострочный раздел табличного документа
// на активной странице основной панели формы.
//
// Параметры:
//  Нет;
//
// Возвращаемое значение:
//  строка, имя многострочного раздела.
//
&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "ЛистА" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппыА;
	ИначеЕсли ИмяТекущейСтраницыПанели = "ЛистБ" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппыБ;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	
	ВывестиРазделВТабличныйДокумент(ЭтаФорма, ИмяГруппы, СтруктураГруппы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
		ОтрисоватьЗначкиУдаленияСтрок(ТекТабличноеПоле);
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВФормеТаблицы, "ЧГ=0");
		
		Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл

			КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=") + "0";
			
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки           = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки                = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицыСтр;
				
				ОбластьЯчейкиТаблицы          = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
					ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
				Иначе
					ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВыводаВПоляхВводаНаСервере(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, НаимРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматВыводаВПоляхВводаНаКлиенте(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтаФорма, НаимРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
	Если ВыбТабличноеПолеИмя = "ЛистА" ИЛИ ВыбТабличноеПолеИмя = "ЛистБ" Тогда
		ОтрисоватьЗначкиУдаленияСтрок(ЭтаФорма.ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтаФорма, ВыбТабличноеПолеИмя);
	
	Если ВыбТабличноеПолеИмя = "ЛистА" ИЛИ ВыбТабличноеПолеИмя = "ЛистБ" Тогда
		ОтрисоватьЗначкиУдаленияСтрок(ЭтаФорма.ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает содержимое редактируемых и вычисляемых ячеек
// поля табличного документа, переданного параметром ВыбТабличноеПоле.
//
// Параметры:
//  ВыбТабличноеПоле - поле табличного документа.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			
			ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы);
			
			УдалятьсяВсеДопЭкземпляры = Истина;
			
		Иначе
			
			ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
			
		КонецЕсли;
		
		СформироватьДеревоРазделовОтчетаНаСервере();
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;

	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеСпец(ИмяСтраницы);
		
	КонецЕсли;
	
	Если ИмяСтраницы = "Титульный" Тогда
		Если Элементы.Найти("ДатаПодписи") = Неопределено Тогда
			Область = ТабличныйДокумент.Области.Найти("ДатаПодписи");
			Если НЕ Область = Неопределено Тогда
				Если ТипЗнч(Область.Значение) = Тип("Строка") Тогда
					ДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
				ИначеЕсли ТипЗнч(Область.Значение) = Тип("Дата") Тогда
					Если ЗначениеЗаполнено(Область.Значение) Тогда
						ДатаПодписи = Лев(СтрЗаменить(Формат(Область.Значение, "ДФ = ""дд.ММ.гггг 'г.'"""), ".", ""), 8);
					Иначе
						ДатаПодписи = "        ";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			
			РегламентированнаяОтчетностьКлиентСервер.ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтаФорма, ИмяСтраницы);
			
			УдалятьсяВсеДопЭкземпляры = Истина;
			
		Иначе
			
			ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
			
		КонецЕсли;
		
	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеСпец(ИмяСтраницы);
		
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтаФорма, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
	
	СформироватьДеревоРазделовОтчетаНаКлиенте();
	
КонецПроцедуры

// СпециальныеОперацииПослеОчисткиЛистаНаСервере
// Процедура вызывается из модуля РО. При удалении листа любого раздела отчета.
// Вызов происходит в том случае, если в св-вах раздела установлен реквизит ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина
// если в св-вах такого реквизита нет, то после удаления листа запускается расчет этого листа.
//
// В подобных процедурах должны выполняться действия, которые следуют за удалением доп. страниц. пересчет номеров, закрашивание ячеек и т.д.
// Если в разделе в св-вах нет ключа СпециальныеОперацииПослеОчисткиЛиста = Ложь или нет для многостраничного раздела
// тогда не вызывается эта процедура.
//
// Параметры:
//  ИмяСтраницы    - имся страницы раздела декларации
//  УдалениДопЭкз  - Булево. Имеет смысл только для многостраничных разделов. Если Истина, то выбрана очистка всего раздела "насквозь" включая
//                 удаление всех доп страниц. Если Ложь - то очистка только текущего табличного поля.
//
&НаСервере
Процедура СпециальныеОперацииПослеОчисткиЛистаНаСервере(ИмяСтраницы) Экспорт
		
	РасчетНаСервере(ИмяСтраницы);
	
КонецПроцедуры

// СпециальныеОперацииПослеОчисткиЛистаНаКлиенте(
// Процедура вызывается из модуля РО. При удалении листа любого раздела отчета.
// Вызов происходит в том случае, если в св-вах раздела установлен реквизит ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина
// если в св-вах такого реквизита нет, то после удаления листа запускается расчет этого листа.
//
// В подобных процедурах должны выполняться действия, которые следуют за удалением доп. страниц. пересчет номеров, закрашивание ячеек и т.д.
// Если в разделе в св-вах нет ключа СпециальныеОперацииПослеОчисткиЛиста = Ложь или нет для многостраничного раздела
// тогда не вызывается эта процедура.
//
// Параметры:
//  ИмяСтраницы    - имся страницы раздела декларации
//  УдалениДопЭкз  - Булево. Имеет смысл только для многостраничных разделов. Если Истина, то выбрана очистка всего раздела "насквозь" включая
//                 удаление всех доп страниц. Если Ложь - то очистка только текущего табличного поля.
&НаКлиенте
Процедура СпециальныеОперацииПослеОчисткиЛистаНаКлиенте(ИмяСтраницы) Экспорт
		
	РасчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьЯчейку(Ячейка) Экспорт
	
	РегламентированнаяОтчетностьКлиент.АктивизироватьЯчейку(ЭтаФорма, Ячейка);
	
КонецПроцедуры

#КонецОбласти


#Область ДиалогиВыбораДляВводаЗначений

&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено ИЛИ СтруктураРеквизитовФормы.мАвтоВыборКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	//если показатель входит в состав многострочной части, тогда имя области не будет совпадать с переданным кодом показателя
	//необходимо это учесть
	//считаем, что в многострочной части не может быть показателя, состоящего из нескольких ячеек
	Если Область.Имя = КодПоказателя ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтаФорма, КодПоказателя) > 0 Тогда
		
		ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);
	Иначе
		Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
		ИндексОбласти = 1;
		ИсходноеЗначение = "";
		Пока ЭтаФорма[ТекущийЭлемент.Имя].Области.Найти(КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
			ИсходноеЗначение = ИсходноеЗначение + Строка(ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
			ИндексОбласти = ИндексОбласти + 1;
		КонецЦикла;
		ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	
	
	ДополнительныеПараметры = Новый Структура("ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент", ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти = ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя = ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область = ДополнительныеПараметры.Область;
	Разделитель = ДополнительныеПараметры.Разделитель;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.Имя = КодПоказателя ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтаФорма, КодПоказателя) > 0 Тогда
		Область.Значение = РезультатВыбора[КолонкаПоиска];
	Иначе
		СтрокаРезультатВыбора = Строка(РезультатВыбора[КолонкаПоиска]);
		Для Инд = СтрДлина(СтрокаРезультатВыбора) + 1 По ИндексОбласти - 1 Цикл
			СтрокаРезультатВыбора = " " + РезультатВыбора[КолонкаПоиска];
		КонецЦикла;
		Для Инд = 1 По ИндексОбласти - 1 Цикл
			ЭтаФорма[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(Инд, "ЧГ=")].Значение = СокрЛП(Сред(РезультатВыбора[КолонкаПоиска], Инд, 1));
		КонецЦикла;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКодаВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяРаздела			 = ДополнительныеПараметры.ИмяРаздела;
	ИмяЯчейки			 = ДополнительныеПараметры.ИмяЯчейки;
	Область				 = ДополнительныеПараметры.Область;
	СтандартнаяОбработка = ДополнительныеПараметры.СтандартнаяОбработка;
	Элемент 			 = ДополнительныеПараметры.Элемент;
			
	Если Результат <> Неопределено Тогда
		
		КодЭлементаСправочника = КодЭлементаСправочника(Результат);
		
		Если Область.Значение <> КодЭлементаСправочника Тогда
			
			Область.Значение = КодЭлементаСправочника;
			
			Если ЗначениеЗаполнено(ТабличныйДокумент.Области["П000400001040" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение) Тогда
				
				Курс = ПолучитьКурсВалютыНаДату(Область.Значение, ТабличныйДокумент.Области["П000400001040" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение);
				
				ИмяПоказателяКурса = "П000400001050" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"));
				ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
				
			КонецЕсли; 

			Если ЗначениеЗаполнено(ТабличныйДокумент.Области["П000400001080" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение) Тогда
				
				Курс = ПолучитьКурсВалютыНаДату(Область.Значение, ТабличныйДокумент.Области["П000400001080" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение);
				
				ИмяПоказателяКурса = "П000400001090" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"));
				ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
				
			КонецЕсли; 

			СохранитьДанныеРаздела("ЛистБ", Ложь, Ложь);
			РасчетНаКлиенте(ИмяРаздела, ИмяПоказателяКурса);
			
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, ИмяЯчейки);
	
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений <> Неопределено Тогда
		
		КодПоказателя = ПараметрВводаПоля.Показатель;
		
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ПараметрВводаПоля.ТаблицаЗначений, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраныМираЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяРаздела 			 = ДополнительныеПараметры.ИмяРаздела;
	ИмяЯчейки 			 = ДополнительныеПараметры.ИмяЯчейки;
	Область				 = ДополнительныеПараметры.Область;
	СтандартнаяОбработка = ДополнительныеПараметры.СтандартнаяОбработка;
	Элемент 			 = ДополнительныеПараметры.Элемент;
		
	Если Результат <> Неопределено Тогда
		
		КодЭлементаСправочника = КодЭлементаСправочника(Результат);
		
		Если Область.Значение <> КодЭлементаСправочника Тогда
			
			Область.Значение = КодЭлементаСправочника;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтаФорма, ИмяЯчейки);
	
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений <> Неопределено Тогда
		
		КодПоказателя = ПараметрВводаПоля.Показатель;
		
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ПараметрВводаПоля.ТаблицаЗначений, СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КодЭлементаСправочника(Результат)
	
	Возврат Результат.Код;
	
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбораИФНСЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		ВыбранныйКодНО = РезультатВыбора.КодНО;
		ДлинаКодаНО = СтрДлина(ВыбранныйКодНО);
		
		Для Инд = ДлинаКодаНО + 1 По 4 Цикл
			ВыбранныйКодНО = "0" + ВыбранныйКодНО;
		КонецЦикла;
		
		ТабличныйДокумент.Области["КодИМНС"].Значение = ВыбранныйКодНО;
		
		ЗаполнитьСведенияОПодписантах();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонтактнойИнформацииЗавершение(Результат, Параметры) Экспорт
	
	ОбновитьАдресВТабличномДокументе(Результат, Параметры.РоссийскийАдрес, Параметры.Префикс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАдресВТабличномДокументе(Результат, РоссийскийАдрес, Префикс)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		// Обход ошибки платформы: в веб-клиенте, в результате выполнения процедуры "СформироватьАдрес"
		// общего модуля "РегламентированнаяОтчетностьВызовСервера", не изменяются значения ключей
		// соответствия "РоссийскийАдрес", передаваемого в качестве параметра.
		РоссийскийАдрес_ = РоссийскийАдрес;
		
		РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.КонтактнаяИнформация, РоссийскийАдрес_);
		
		ТабличныйДокумент.Области[Префикс + "Индекс"].Значение          = РоссийскийАдрес_["Индекс"];
		ТабличныйДокумент.Области[Префикс + "Регион"].Значение          = РоссийскийАдрес_["КодРегиона"];
		ТабличныйДокумент.Области[Префикс + "Район"].Значение 		    = РоссийскийАдрес_["Район"];
		ТабличныйДокумент.Области[Префикс + "Город"].Значение           = РоссийскийАдрес_["Город"];
		ТабличныйДокумент.Области[Префикс + "НаселенныйПункт"].Значение = РоссийскийАдрес_["НаселенныйПункт"];
		ТабличныйДокумент.Области[Префикс + "Улица"].Значение  	 	    = РоссийскийАдрес_["Улица"];
		ТабличныйДокумент.Области[Префикс + "Дом"].Значение             = РоссийскийАдрес_["Дом"];
		ТабличныйДокумент.Области[Префикс + "Корпус"].Значение          = РоссийскийАдрес_["Корпус"];
		ТабличныйДокумент.Области[Префикс + "Квартира"].Значение        = РоссийскийАдрес_["Квартира"];
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегионыНаСервере()
	
	РегламентированнаяОтчетность.ЗаполнитьРегионы(Регионы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИФНС()
	
	КодИМНС = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	
	ЗначенияДляОтбора = Новый Массив;
	ЗначенияДляОтбора.Добавить(Новый Структура("КодНО, КПП", КодИМНС));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("ЗначенияДляОтбора", ЗначенияДляОтбора);
	
	ФормаВыбораНалоговогоОргана = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВыбораНалоговогоОргана", ПараметрыФормы, ЭтаФорма);
	
	Если ФормаВыбораНалоговогоОргана.ТаблицаНО.Количество() <> 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораИФНСЗавершение", ЭтотОбъект);
		ФормаВыбораНалоговогоОргана.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбораНалоговогоОргана.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбораНалоговогоОргана.Открыть();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(КодИМНС) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru = 'В реквизитах организации не указан налоговый орган'");
		
		Сообщение.КлючДанных = СтруктураРеквизитовФормы.Организация;
		
		Сообщение.Сообщить();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Для выбора инспекции, необходимо завести соответствующую запись в справочнике ""Регистрации в налоговом органе"".'");
		
		Сообщение.КлючДанных = СтруктураРеквизитовФормы.Организация;
		
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныйФункционал

&НаКлиенте
Процедура ВыполнитьПроверкуПередОткрытием()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОткрытиемФормыРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Модифицированность = Ложь;
		Закрыть();
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину.
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     - для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат.
//     - если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//
//
// Возвращаемое значение:
//  Массив - массив строк.
//
// Примеры:
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",") - возвратит массив из 5 элементов, три из которых  - пустые строки;
//  РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина) - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок(" один   два  ", " ") - возвратит массив из двух элементов;
//  РазложитьСтрокуВМассивПодстрок("") - возвратит пустой массив;
//  РазложитьСтрокуВМассивПодстрок("",,Ложь) - возвратит массив с одним элементом "" (пустой строкой);
//  РазложитьСтрокуВМассивПодстрок("", " ") - возвратит массив с одним элементом "" (пустой строкой);
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	// для обеспечения обратной совместимости
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	Позиция = СтрНайти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
//Функция раскладывает строку с данными о месте рождения на элементы структуры
//
Функция РазложитьМестоРождения(Знач СтрокаМестоРождения, ВерхнийРегистр = Истина) Экспорт

	Особое = 0;НаселенныйПункт	= "";Район	= "";Область	= "";Страна	= "";
	
	МассивМестоРождения	= РазложитьСтрокуВМассивПодстрок(?(ВерхнийРегистр, Врег(СтрокаМестоРождения), СтрокаМестоРождения));
	
	ЭлементовВМассиве = МассивМестоРождения.Количество();   
	Если ЭлементовВМассиве	>	0	тогда
		Если СокрЛП(МассивМестоРождения[0]) = "1" тогда
			Особое	=	1;
		КонецЕсли;	 
	КонецЕсли;
	Если ЭлементовВМассиве	>	1	тогда
		НаселенныйПункт	=	СокрЛП(МассивМестоРождения[1]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	2	тогда
		Район	=	СокрЛП(МассивМестоРождения[2]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	3	тогда
		Область	=	СокрЛП(МассивМестоРождения[3]);
	КонецЕсли;
	Если ЭлементовВМассиве	>	4	тогда
		Страна	=	СокрЛП(МассивМестоРождения[4]);
	КонецЕсли;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Особое",Особое);
	СтруктураВозврата.Вставить("НаселенныйПункт",НаселенныйПункт);
	СтруктураВозврата.Вставить("Район",Район);
	СтруктураВозврата.Вставить("Область",Область);
	СтруктураВозврата.Вставить("Страна",Страна);
	Возврат СтруктураВозврата;
	
КонецФункции	 

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации(ВПрограммеИзмененаДатаПодписи = Ложь)
	
	Форма = ЭтаФорма;
	
	мТитульный = Форма.СтруктураДанныхТитульный;
	
	Если НЕ ВПрограммеИзмененаДатаПодписи Тогда
	
		СтрокаСведений = "ИННФЛ, НаимЮЛПол, КодНО, НаимНО, ТипНП, ТелОрганизации, ФИО, 
						|ДатаРожд, МестоРожд, КодУдЛичн, ОрганВыданУдЛичн, СерияУдЛичн,
						|НомерУдЛичн, ДатаУдЛичн, ИндексМЖ, КодСубъектМЖ, РайонМЖ,
						|ГородМЖ, НПунктМЖ, УлицаМЖ, ДомМЖ, КорпусМЖ, КвартираМЖ,ИндивидуальныйПредпринимательИНН,ФИОРук,ОКТМО";
		СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Форма.СтруктураРеквизитовФормы.Организация, Форма.ДатаПодписи, СтрокаСведений);
		
		Если СведенияОбОрганизации = Неопределено ИЛИ СведенияОбОрганизации.Количество() = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		// заполняем ИНН
		мТитульный.ИНН = СокрЛП(СведенияОбОрганизации.ИННФЛ);
		
		// заполняем код ИФНС
		КодНО = СведенияОбОрганизации.КодНО;
		Для Инд = СтрДлина(СведенияОбОрганизации.КодНО) + 1 По 4 Цикл
			КодНО = " " + КодНО;
		КонецЦикла;
		
		мТитульный.КодИМНС = КодНО;
		
		СтруктураРеквизитовФормы.ОКТМО = СведенияОбОрганизации.ОКТМО;
		
		// заполняем ФИО
		ДанныеФЛ = РегламентированнаяОтчетность.РазложитьФИО(СведенияОбОрганизации.ФИО);
		Если ДанныеФЛ.Количество() > 0 Тогда
			мТитульный.Фамилия = СокрЛП(ДанныеФЛ.Фамилия);
			мТитульный.Имя = СокрЛП(ДанныеФЛ.Имя);
			мТитульный.Отчество = СокрЛП(ДанныеФЛ.Отчество);
		КонецЕсли;
		
		// заполняем телефон организации
		мТитульный.ТелОрганизации = СокрЛП(СведенияОбОрганизации.ТелОрганизации);
		
		//Код категории
		мТитульный.ПоМесту 				= "720";
		
		мТитульный.Период 				= "34";
		мТитульный.ОтчетГод 			= Год(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		мТитульный.ДатаРождения = СведенияОбОрганизации.ДатаРожд;

		СтруктураМестоРождения = РазложитьМестоРождения(СведенияОбОрганизации.МестоРожд);
		мТитульный.МестоРождения = 
			?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.НаселенныйПункт),		"",	"  "	+	СокрЛП(СтруктураМестоРождения.НаселенныйПункт))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Район),	"",	"  "	+	СокрЛП(СтруктураМестоРождения.Район))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Область),	"",	"  "	+	СокрЛП(СтруктураМестоРождения.Область))
			+?(НЕ ЗначениеЗаполнено(СтруктураМестоРождения.Страна),	"",	"  "	+	СокрЛП(СтруктураМестоРождения.Страна));
		
		//Удостоверение личности
		мТитульный.КодВидаДокумента = СокрЛП(СведенияОбОрганизации.КодУдЛичн);
		мТитульный.СерияИНомерДокумента = СокрЛП(СведенияОбОрганизации.СерияУдЛичн) + " " + СокрЛП(СведенияОбОрганизации.НомерУдЛичн);
		мТитульный.КемВыданДокумент = СокрЛП(СведенияОбОрганизации.ОрганВыданУдЛичн);
		
		мТитульный.СтатусНалогоплательщика = "1";
		Форма.СтруктураРеквизитовФормы.мСтатусНалогоплательщика = 1;
		
		мТитульный.КодСтраны = "643";
		
		мТитульный.ДатаВыдачиДокумента = СведенияОбОрганизации.ДатаУдЛичн;
		
		//Адрес
		мТитульный.МестоЖительства 	= 1;
		мТитульный.Индекс 			= СокрЛП(СведенияОбОрганизации.ИндексМЖ);
		мТитульный.Регион 			= СокрЛП(СведенияОбОрганизации.КодСубъектМЖ);
		мТитульный.Район 			= СокрЛП(СведенияОбОрганизации.РайонМЖ);
		мТитульный.Город 			= СокрЛП(СведенияОбОрганизации.ГородМЖ);
		мТитульный.НаселенныйПункт 	= СокрЛП(СведенияОбОрганизации.НПунктМЖ);
		мТитульный.Улица 			= СокрЛП(СведенияОбОрганизации.УлицаМЖ);
		мТитульный.Дом 				= СокрЛП(СведенияОбОрганизации.ДомМЖ);
		мТитульный.Корпус 			= СокрЛП(СведенияОбОрганизации.КорпусМЖ);
		мТитульный.Квартира 		= СокрЛП(СведенияОбОрганизации.КвартираМЖ);
		
		Если Этотобъект.СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
			
			Для Каждого РеквизитТабличногоДокумента Из ТабличныйДокумент.Области Цикл
				
				Если НЕ РеквизитТабличногоДокумента.Защита Тогда
					
					мТитульный.Свойство(РеквизитТабличногоДокумента.Имя, РеквизитТабличногоДокумента.Значение);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаполнитьСведенияОПодписантах();
			
		КонецЕсли;
			
	Иначе
		Если СокрЛП(мТитульный.ПрПодп) = "1" Тогда
			мТитульный.ОргПодписантФамилия = "";
			мТитульный.ОргПодписантИмя = "";
			мТитульный.ОргПодписантОтчество = "";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПодписантах() Экспорт
	
	ТипПодписанта = "1";
	Подписант = "";
	НаименованиеОрганизацииПредставителя = "";
	ДокументПредставителя = "";
	
	ТабличныйДокумент.Области.ОргПодписантФамилия.Значение = "";
	ТабличныйДокумент.Области.ОргПодписантИмя.Значение = "";
	ТабличныйДокумент.Области.ОргПодписантОтчество.Значение = "";
	ТабличныйДокумент.Области.ДокУпПред.Значение = "";
	
	//выясним, есть ли представитель
	КодНО = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	
	СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(СтруктураРеквизитовФормы.Организация, КодНО);
	
	ТипПодписанта = СведенияОПредставителе.ТипПодписанта;
	
	Если ТипПодписанта = "1" Тогда
		//представителя нет
		Если РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(СтруктураРеквизитовФормы.Организация) Тогда
			//подписант - руководитель
			СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ДатаПодписи, "ФИОРук, ФИО");
			Подписант = СокрЛП(?(ЗначениеЗаполнено(СведенияОбОрганизации.ФИОРук), СведенияОбОрганизации.ФИОРук, СведенияОбОрганизации.ФИО));	
		КонецЕсли;
	Иначе
		//есть представитель, подписант - он
		Подписант 								= СведенияОПредставителе.ФИОПредставителя;
		НаименованиеОрганизацииПредставителя 	= СведенияОПредставителе.НаименованиеОрганизацииПредставителя;
		ДокументПредставителя 					= СведенияОПредставителе.ДокументПредставителя;
		
		ФИОПодписанта = РазложитьСтрокуВМассивПодстрок(Подписант, " ", Истина);
		Если ФИОПодписанта.Количество() > 0 Тогда
			
			ТабличныйДокумент.Области.ОргПодписантФамилия.Значение = ФИОПодписанта[0];
			
			Если ФИОПодписанта.Количество() = 2 Тогда
				ТабличныйДокумент.Области.ОргПодписантИмя.Значение = ФИОПодписанта[1];
			ИначеЕсли ФИОПодписанта.Количество() > 2 Тогда
				ТабличныйДокумент.Области.ОргПодписантИмя.Значение = ФИОПодписанта[1];
				ТабличныйДокумент.Области.ОргПодписантОтчество.Значение = ФИОПодписанта[2];
			КонецЕсли;
			
		КонецЕсли;
		
		ТабличныйДокумент.Области.ДокУпПред.Значение = ДокументПредставителя;
		
	КонецЕсли;
	
	ТабличныйДокумент.Области.ПрПодп.Значение = ТипПодписанта;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоКодамСведенияОПредставителе(Организация, КодНО, КПП = Неопределено) Экспорт
		
	Возврат Новый Структура("ТипПодписанта, флПредставительЮрЛицо, НаименованиеОрганизацииПредставителя, ФИОПредставителя, ПредставительСсылка, ДокументПредставителя");
	
КонецФункции

&НаСервере
Функция ОбновитьПеременныеМодуляНаСервере(ИмяПоказателя, ЗначениеПоказателя) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	ПеременныеМодуля.Вставить("мСтатусНалогоплательщика", СтруктураРеквизитовФормы.мСтатусНалогоплательщика);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	СтруктураРеквизитовФормы.мСтатусНалогоплательщика = ПеременныеМодуля.мСтатусНалогоплательщика;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиенте
Функция ОбновитьПеременныеМодуляНаКлиенте(ИмяПоказателя, ЗначениеПоказателя) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	ПеременныеМодуля.Вставить("мСтатусНалогоплательщика", СтруктураРеквизитовФормы.мСтатусНалогоплательщика);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	СтруктураРеквизитовФормы.мСтатусНалогоплательщика = ПеременныеМодуля.мСтатусНалогоплательщика;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля)
	
	ИзмененияПроизошли = Ложь;
	
	Если Лев(ИмяПоказателя, 1) = "_" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяПоказателя = "ПредставительФизЛицо" Тогда
		ПеременныеМодуля.мПредставительФизЛицо = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "НазваниеПредставителя" Тогда
		ПеременныеМодуля.мНазваниеПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ДокументПредставителя" Тогда
		ПеременныеМодуля.мДокументПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ФамилияПредставителя" Тогда
		ПеременныеМодуля.мФамилияПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ИмяПредставителя" Тогда
		ПеременныеМодуля.мИмяПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ОтчествоПредставителя" Тогда
		ПеременныеМодуля.мОтчествоПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "СтатусНалогоплательщика" Тогда
		Если ЗначениеПоказателя = "1" Тогда
			ПеременныеМодуля.мСтатусНалогоплательщика = 1;
		ИначеЕсли ЗначениеПоказателя = "2" Тогда
			ПеременныеМодуля.мСтатусНалогоплательщика = 2;
		Иначе
			ПеременныеМодуля.мСтатусНалогоплательщика = 0;
		КонецЕсли;
	КонецЕсли;

	Возврат ИзмененияПроизошли;
	
КонецФункции

//Преобразовывает некоторые значения структуры из посимвольного представления в одно поле
//предназначена для совместимости с формами сохраненными в версии 2.0
&НаСервере
Процедура ПреобразоватьПосимвольныеДанныеВЗначения(Данные)
	
	Если Данные.Свойство("ИНН_1") Тогда
		
		ИНН = "";
		Для Поз = 1 По 12 Цикл
			ИНН = ИНН + Данные["ИНН_" + Поз];
			Данные.Удалить("ИНН_" + Поз);
		КонецЦикла;	
		Данные.Вставить("ИНН",ИНН);
	КонецЕсли;
	
	Если Данные.Свойство("ДатаПодписи1") Тогда
		
		мДатаПодписи = "" + Данные["ДатаПодписи5"]
		+ Данные["ДатаПодписи6"]
		+ Данные["ДатаПодписи7"]
		+ Данные["ДатаПодписи8"]
		+ Данные["ДатаПодписи3"]
		+ Данные["ДатаПодписи4"]
		+ Данные["ДатаПодписи1"]
		+ Данные["ДатаПодписи2"];
		
		Для Поз = 1 По 8 Цикл
			Данные.Удалить("ДатаПодписи" + Поз);
		КонецЦикла;
		
		Данные.Вставить("ДатаПодписи", ?(ЗначениеЗаполнено(мДатаПодписи), Дата(мДатаПодписи), РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"))));
		
	КонецЕсли;
	Если Данные.Свойство("НомСтр1_1") Тогда
			
		Для Поз = 1 По 3 Цикл
			Данные.Удалить("НомСтр1_" + Поз);
		КонецЦикла;	
		
	КонецЕсли;
	Если Данные.Свойство("НомерКорректировки1") Тогда	
		
		НомКорр = "";
		Для Поз = 1 По 3 Цикл
			НомКорр = НомКорр + Данные["НомерКорректировки" + Поз];
			Данные.Удалить("НомерКорректировки" + Поз);
		КонецЦикла;
		НомКорр = СтрЗаменить(НомКорр, "-", "");
		Данные.Вставить("НомерКорректировки", НомКорр);
		НомерКорректировки = ?(ЗначениеЗаполнено(НомКорр), Число(НомКорр), 0);
	
	КонецЕсли;
	Если Данные.Свойство("ОтчетГод1") Тогда
		
		ОтчетГод = "";
		Для Поз = 1 По 4 Цикл
			ОтчетГод = ОтчетГод + Данные["ОтчетГод" + Поз];
			Данные.Удалить("ОтчетГод" + Поз);
		КонецЦикла;	
		Данные.Вставить("ОтчетГод", ОтчетГод);
		
	КонецЕсли;
	Если Данные.Свойство("КодИМНС1") Тогда
		
		КодИМНС = "";
		Для Поз = 1 По 4 Цикл
			КодИМНС = КодИМНС + Данные["КодИМНС" + Поз];
			Данные.Удалить("КодИМНС" + Поз);
		КонецЦикла;	
		Данные.Вставить("КодИМНС", КодИМНС);
		
	КонецЕсли;
	Если Данные.Свойство("ПоМесту1") Тогда
		
		ПоМесту = "";
		Для Поз = 1 По 3 Цикл
			ПоМесту = ПоМесту + Данные["ПоМесту" + Поз];
			Данные.Удалить("ПоМесту" + Поз);
		КонецЦикла;	
		Данные.Вставить("ПоМесту", ПоМесту);
		
	КонецЕсли;
	Если Данные.Свойство("Период1") Тогда
		
		Период = "";
		Для Поз = 1 По 2 Цикл
			Период = Период + Данные["Период" + Поз];
			Данные.Удалить("Период" + Поз);
		КонецЦикла;	
		Данные.Вставить("Период", Период);
		
	КонецЕсли;
	Если Данные.Свойство("СоставленаНа1") Тогда
		
		СоставленаНа = "";
		Для Поз = 1 По 3 Цикл
			СоставленаНа = СоставленаНа + Данные["СоставленаНа" + Поз];
			Данные.Удалить("СоставленаНа" + Поз);
		КонецЦикла;	
		Данные.Вставить("СоставленаНа", СоставленаНа);
		
	КонецЕсли;
	Если Данные.Свойство("ДатаВыдачиДокумента1") Тогда	
		
		ДатаВыдачиДокумента = "" + Данные["ДатаВыдачиДокумента5"]
		+ Данные["ДатаВыдачиДокумента6"]
		+ Данные["ДатаВыдачиДокумента7"]
		+ Данные["ДатаВыдачиДокумента8"]
		+ Данные["ДатаВыдачиДокумента3"]
		+ Данные["ДатаВыдачиДокумента4"]
		+ Данные["ДатаВыдачиДокумента1"]
		+ Данные["ДатаВыдачиДокумента2"];

		Для Поз = 1 По 8 Цикл
			Данные.Удалить("ДатаВыдачиДокумента" + Поз);
		КонецЦикла;	
		
		Данные.Вставить("ДатаВыдачиДокумента", ?(ЗначениеЗаполнено(ДатаВыдачиДокумента), Дата(ДатаВыдачиДокумента), РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"))));
		
	КонецЕсли;
	Если Данные.Свойство("ДатаРождения1") Тогда
		
		ДатаРождения = "" + Данные["ДатаРождения5"]
		+ Данные["ДатаРождения6"]
		+ Данные["ДатаРождения7"]
		+ Данные["ДатаРождения8"]
		+ Данные["ДатаРождения3"]
		+ Данные["ДатаРождения4"]
		+ Данные["ДатаРождения1"]
		+ Данные["ДатаРождения2"];
		
		Для Поз = 1 По 8 Цикл
			Данные.Удалить("ДатаРождения" + Поз);
		КонецЦикла;	
		Данные.Вставить("ДатаРождения", ?(ЗначениеЗаполнено(ДатаРождения) , Дата(ДатаРождения), РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"))));
		
	КонецЕсли;	

КонецПроцедуры

// Процедура управляет показом в форме периода построения отчета.
//
&НаСервере
Процедура ПоказатьПериод()
	
	ПолеТабличногоДокументаТитульный = ТабличныйДокумент;
	
	Если СокрЛП(ПолеТабличногоДокументаТитульный.Области.Период.Значение) = "" ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
				
		// выводим признак периода на титульный лист
		КодОтчетногоПериода = "34";
		ПолеТабличногоДокументаТитульный.Области.Период.Значение = КодОтчетногоПериода;
	КонецЕсли; 
	
	// выводим год на титульный лист
	ОтчетныйГод = Формат(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ЧГ=");
	ПолеТабличногоДокументаТитульный.Области.ОтчетГод.Значение = ОтчетныйГод;
	
	// задаем заголовок формы
	СтруктураРеквизитовФормы.СтрПериодОтчета = ПредставлениеПериода(НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыЕдИзмеренияИТочности()
	
	ПроверитьТочность();
	
	УстановитьФорматВыводаВПоляхВводаНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РасчетНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура контролирует корректность установленной точности указания
// суммовых (денежных) показателей при выборе единицы измерения.
//
&НаКлиенте
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в рублях точность не может превышать 2 знака'"), ЭтаФорма.Заголовок);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в тысячах рублей точность не может превышать 3 знака'"), ЭтаФорма.Заголовок);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в миллионах рублей точность не может превышать 6 знаков'"), ЭтаФорма.Заголовок);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалютыНаДату(КодВалюты,ДатаКурса)
	
	 Валюта 	= Справочники.Валюты.НайтиПоКоду(КодВалюты);
	 Если Валюта <> Неопределено Тогда
		 Результат 	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта,ДатаКурса);	
		 Возврат Результат.Курс;
	 Иначе
		 Возврат 0;
	 КонецЕсли;
	 
КонецФункции

&НаСервере
Процедура СохранитьДеревоНастройкиСтраниц(Знач мСохраненныйДок)
	
	Если мСохраненныйДок <> Неопределено Тогда
		
		Если ТипЗнч(мСохраненныйДок) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			мСохраненныйДок = мСохраненныйДок.ПолучитьОбъект();
		КонецЕсли;
		
		Если Не мСохраненныйДок.ЭтоНовый() Тогда
			// Сохраняем выбранные листы для печати в хранилище
			ХранилищеДанных = Новый ХранилищеЗначения(РеквизитФормыВЗначение("мДеревоСтраницОтчета"));
			мСохраненныйДок.ДеревоНастройкиСтраниц = ХранилищеДанных;
			Попытка
				мСохраненныйДок.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
Конецпроцедуры
 
&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтаФорма, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтаФорма);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	Для Индекс = 0 По мДеревоСтраницОтчета.ПолучитьЭлементы().Количество() - 1 Цикл
		
		Если НЕ мДеревоСтраницОтчета.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу = мДеревоВыбранныхСтраниц.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу Тогда
			флЗначенияИдентичны = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеАвторасчета <> СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
		
		#Если ВебКлиент Тогда
			ИзменитьТаблицуВариантовЗаполненияНаСервере();
		#Иначе
			РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(ЭтаФорма, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
		#КонецЕсли	
		
	КонецЕсли;
	
	Если ЗначениеЕдИзм <> СтруктураРеквизитовФормы.ЕдиницаИзмерения
		ИЛИ ЗначениеЗпт <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		ПослеСменыЕдИзмеренияИТочности();
	КонецЕсли;
	
	// Управляем видимостью страниц основной панели формы
	РегламентированнаяОтчетностьКлиент.ПоказатьСтраницыОтчетаНаКлиенте(ЭтаФорма);
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтаФорма);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.Проверить(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаголовокРегламентированногоОтчета(ДатаНач, ДатаКон, Периодичность = Неопределено) Экспорт
		
	СтрПериодОтчета = ПредставлениеПериода( НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" );
		
	Если СтрНайти(ЭтаФорма.Заголовок, СтрПериодОтчета) = 0 Тогда
		Возврат ЭтаФорма.Заголовок + " за " + СтрПериодОтчета;
	Иначе
		Возврат ЭтаФорма.Заголовок;
	КонецЕсли;
	
КонецФункции


&НаСервере
Функция ОтчетОбъект()

	Если ОбъектЭтогоОтчета = Неопределено Тогда
		ОбъектЭтогоОтчета = РеквизитФормыВЗначение("Отчет");
	КонецЕсли; 
	
	Возврат ОбъектЭтогоОтчета;

КонецФункции
 

#КонецОбласти


// Четние/запись данных в структуру отчета, пересчеты значений
#Область РаботаСДаннымиВСтруктуреОтчета


&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если НЕ Раздел.МногостраничностьВРазделе
			И (ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы].Количество() = 0) Тогда
			
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
			
		ИначеЕсли Раздел.МногостраничностьВРазделе
			И (ЭтаФорма[мСтруктураМногостраничныхРазделов[Раздел.ИмяСтраницы]][0].Данные.Количество() = 0) Тогда
			
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, "ФормаОтчета")) + "_" + Раздел.ИмяСтраницы));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность, ИзменятьАктивнуюСтраницу = Истина)
	
	// Многостраничные разделы.
	//
	Если НаимРаздела = "ЛистД1" 
		ИЛИ НаимРаздела = "ЛистВ" 
		ИЛИ НаимРаздела = "ЛистЕ2"
		ИЛИ НаимРаздела = "ЛистЖ"
		ИЛИ НаимРаздела = "Раздел1"
		ИЛИ НаимРаздела = "Раздел2"
		Тогда
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Область Из ТабличныйДокумент.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение Тогда
				СтруктураДанных.Вставить(Область.Имя, Область.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[НаимРаздела];
		
		АктивныеСтраницы = ЭтаФорма[НаимТаблицыСтраницы].НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если АктивныеСтраницы.Количество() > 0 Тогда
			
			АктивнаяСтраница = АктивныеСтраницы[0];
			АктивнаяСтраница.Данные.Очистить();
			АктивнаяСтраница.Данные.Добавить(СтруктураДанных);
			
			Для каждого Страница Из АктивныеСтраницы Цикл
				Страница.АктивнаяСтраница = Ложь;
			КонецЦикла;
			
			Страница.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли; 
		
		// Многостраничные и многострочные разделы.
		//
	ИначеЕсли НаимРаздела = "ЛистА" ИЛИ НаимРаздела = "ЛистБ" Тогда
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(НаимРаздела, ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		
		СтрТаблицыСтраниц = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицыСтраниц.Количество() > 0 Тогда
			
			СтрТаблицаСтраницы = СтрТаблицыСтраниц[0];
			
			// Сохраним данные активной страницы, с присвоением Представления страницы и с очистной многострочных частей (Истина)
			РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(ЭтаФорма, НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность);
			
			Для каждого СтрТаблица Из СтрТаблицыСтраниц Цикл
				СтрТаблица.АктивнаяСтраница = Ложь;
			КонецЦикла;
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	Иначе
		
		ЭтаФорма["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтаФорма, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиенте
Функция СобратьДанныеТекущегоТаблПоляНаКлиенте(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтаФорма, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		
		Если ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьДополнительныеСтрокиВСтруктуре(Форма, ИмяРаздела, Очищать = Ложь)

	Если ИмяРаздела = "ЛистА" ИЛИ ИмяРаздела = "ЛистБ" Тогда
		// Сохраним данные активной страницы, с присвоением Представления страницы и с очистной многострочных частей (Истина)
		РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(Форма, ИмяРаздела, Очищать);
	КонецЕсли; 

КонецПроцедуры
 
// Обновляет структуру многострочнго раздела, заданного
// уникальным идентификатором. Заполняет таблицу значений
// многострочного раздела значениями соответствующих ячеек.
//
// Параметры:
//  ИмяГруппы - строка - идентификатор многострочного раздела.
//
&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем СтруктураГруппы;

	мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = ЭтотОбъект[СтруктураГруппы];
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = ЭтотОбъект[ТекТабличноеПолеИмя];
	
	Для НСтр = 1 По СтруктураГруппы.Количество() Цикл
		ТекСтрокаТаблицы = СтруктураГруппы[НСтр - 1];
		НСтрСтр = Формат(НСтр, "ЧГ=0");
		
		Для НомерГрафы = 1 По ЭтотОбъект.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
			ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=") + "0";
		
			Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
				
				ИмяЯчейки		= ИмяКолонки + "_" + НСтрСтр;
				ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяЯчейки];
				
				Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
					ЗначениеЯчейки = ОбластьЯчейки.Значение;
				Иначе
					ЗначениеЯчейки = ОбластьЯчейки.Текст;
				КонецЕсли;
				
				ТекСтрокаТаблицы[ИмяКолонки] = ЗначениеЯчейки;
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруМногострочногоРазделаНаКлиенте(ИмяГруппы) Экспорт
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтаФорма, ИмяГруппы);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
			
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
						
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Строка(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1);
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено)
	
	Перем ТаблицаСтраницРаздела;
	Перем СтруктураДанныхДопСтрокРаздела;
	
	Если ИмяТекущейСтраницыПанели = Неопределено Тогда
		ИмяТекущейСтраницыПанели = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	Иначе
		МаксКолвоЭкз = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтаФорма, ИмяТекущейСтраницыПанели, "МаксКолвоЭкз", 0);
		Если МаксКолвоЭкз <> 0 И ЭтаФорма[мСтруктураМногостраничныхРазделов[ИмяТекущейСтраницыПанели]].Количество() >= МаксКолвоЭкз Тогда
			ЗаголовокСтраницы = ИмяТекущейСтраницыПанели;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В разделе ""%1"" максимальное количество экземпляров страниц равно %2.'"), ЗаголовокСтраницы, МаксКолвоЭкз);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	ИмяТекТабличногоПоля     = "ТабличныйДокумент";
	ТекТабличноеПоле         = ЭтаФорма[ИмяТекТабличногоПоля];
	
	СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
	
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	
	// Найдем активную страницу
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура ("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		
		// Убираем активность у текущей страницы
		СтрТаблицаСтраницы.АктивнаяСтраница = Ложь;
		
	КонецЕсли;
	
	// Добавляем новую страницу
	СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
	
	// Присваиваем представление по умолчанию
	СтрНоваяСтраница.Представление      = "Страница N " + ТаблицаСтраницРаздела.Количество();
	СтрНоваяСтраница.АвтоматическоеПредставление      = Истина;
	
	// Ставим признак активной страницы
	СтрНоваяСтраница.АктивнаяСтраница = Истина;
	
	ПослеДобавленияДопСтрНаСервере(ИмяТекТабличногоПоля, ИмяТекущейСтраницыПанели);
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела.Индекс(СтрНоваяСтраница) + 1);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияДопСтрНаСервере(ИмяТекТабличногоПоля, ИмяТекущейСтраницыПанели)
	
	ОчиститьТабличноеПолеНаСервере(ИмяТекущейСтраницыПанели);
	
	СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
	
	ПослеВставкиДополнительнойСтраницыНаСервере(ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВставкиДополнительнойСтраницыНаСервере(ИмяТекущейСтраницы)
	
	РасчетНаСервере(ИмяТекущейСтраницы);
	
	РегламентированнаяОтчетность.ПослеВставкиДополнительнойСтраницыНаСервере(ЭтаФорма, ИмяТекущейСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели)
	
	//итоговые ячейки не очистились - необходимо провести расчет
	//для этого сохраним данные страницы
	РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(ЭтаФорма, ИмяТекущейСтраницыПанели, Истина);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено, НомерУдаляемойСтраницы = Неопределено)
	
	Перем ТаблицаСтраницРаздела;
	Перем МассивВариантовЗаполненияСтраниц;
	
	РегламентированнаяОтчетность.УдалитьДополнительнуюСтраницуНаСервере(ЭтаФорма, ИмяТекущейСтраницыПанели);
	
	Если НомерУдаляемойСтраницы <> Неопределено
		И мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела)
		И мСтруктураВариантыЗаполнения.Свойство(ИмяТекущейСтраницыПанели, МассивВариантовЗаполненияСтраниц) Тогда
		
		ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
		МассивВариантовЗаполненияСтраниц = ЭтаФорма["ТаблицаВариантыЗаполнения" + ИмяТекущейСтраницыПанели];
		
		МассивВариантовЗаполненияСтраниц.Удалить(НомерУдаляемойСтраницы);
		
		КолСтраниц = ТаблицаСтраницРаздела.Количество();
		КолВариантов = МассивВариантовЗаполненияСтраниц.Количество();
		
		Для Инд = КолСтраниц + 1 По КолВариантов Цикл
			
			МассивВариантовЗаполненияСтраниц.Удалить(МассивВариантовЗаполненияСтраниц.Количество() - 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РасчетНаСервере();
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере(КолонкаРазделыОтчетаСокрНаим)
	
	ВставитьДополнительнуюСтроку(ЭтаФорма, КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуНаКлиенте(КолонкаРазделыОтчетаСокрНаим)
	
	ВставитьДополнительнуюСтроку(ЭтаФорма, КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ТекущаяСтраница)
	Перем СтруктураГруппы;
	Перем МаксимальноеКоличествоСтрокГруппы;
	
	// Сначала выполним проверку на активную страницу панели формы,
	// которая содержит многострочный раздел
	
	#Если НаКлиенте Тогда
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ТекущаяСтраница);
	#Иначе
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ТекущаяСтраница);
	#КонецЕсли
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Не выбран многострочный раздел, в который необходимо добавить строку.'");
		
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, МаксимальноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	КолСтрокСтр = Формат(КолСтрок, "ЧГ=0");
	КолСтрокСтр1 = Формат(КолСтрок + 1, "ЧГ=0");
	ИмяПервойЯчейкиПоследнейСтроки = ИмяГруппы + "010_" + КолСтрокСтр;
	
	// область первой ячейки последней строки многострочного раздела
	ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиПоследнейСтроки];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх - 1;
	НомерНижнЯчейкиОбласти = НомерВерхЯчейкиОбласти + ВысотаСтроки - 1;
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;
	
	РегламентированнаяОтчетностьВызовСервера.СпециальногоДобавленияСтроки(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИмяГруппы, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
	
	Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
	
	Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
		
		ИмяКолонки = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=") + "0";
		
		// переопределяем имена вставленной области
		Если СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
			
			ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
			ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтр1;
			
			ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяОбластиЯчейки];
			ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
			
			// определяем границы ячейки исходной области
			НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
			НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
			
			НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
			НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
			
			// Назначаем имя ячейки исходной области,
			// (т.к. в результате вставки новой области оно было очищено)
			ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
			ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
			
			Если Прав(ИмяКолонки, 3) = "010" Тогда
				
				ОбластьУдалитьСтроку = ТекТабличноеПоле.Области.Найти("УдалитьСтроку" + ИмяОбластиЯчейки);
				
				Если ОбластьУдалитьСтроку <> Неопределено Тогда
					
					ОбластьУдалитьСтроку.Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
					
					ТекТабличноеПоле.Область(ОбластьУдалитьСтроку.Верх - СдвигСтрок, ОбластьУдалитьСтроку.Лево, ОбластьУдалитьСтроку.Низ - СдвигСтрок, ОбластьУдалитьСтроку.Право).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
					
				КонецЕсли;
			КонецЕсли;
			
			// очищаем значения ячеек вставленной области
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			Иначе
				// порядековый номер последней строки перед вставкой
				ИсходныйНомер        = Число("0" + ОбластьЯчейки.Текст);
				НовыйПорядковыйНомер = ИсходныйНомер + 1;
				
				ОбластьЯчейки.Текст  = ? (НЕ НовыйПорядковыйНомер > МаксимальноеКоличествоСтрокГруппы, Строка(НовыйПорядковыйНомер), "");
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Назначим текущей областью таблицы первую редактируемую ячейку добавленной строки.
	// Определяем текущую область таблицы
	ИмяТекущейОбласти = ИмяГруппы + "010_" + КолСтрокСтр1;
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	// установим фокус на поле табличн. документа
	Форма.ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	// добавляем в структуру многострочной группы новую строку
	НоваяСтрока = СтруктураГруппы.Добавить();
	
	// Заполним значениями по умолчанию
	ЗаполнитьПоказателиЗначениямиПоУмолчанию(Форма, ТекущаяСтраница);
	
	ОтрисоватьЗначкиУдаленияСтрок(ТекТабличноеПоле);
	
	СохранитьДополнительныеСтрокиВСтруктуре(Форма, ТекущаяСтраница, Ложь);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере(ТекущаяСтраница)
	
	УдалитьДополнительнуюСтроку(ЭтаФорма, , , ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте(ТекущаяСтраница)
	
	УдалитьДополнительнуюСтроку(ЭтаФорма, , , ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено, ТекущаяСтраница) Экспорт
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	// Сначала выполним проверку на активную страницу панели формы,
	// которая содержит многострочный раздел
	#Если НаКлиенте Тогда
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ТекущаяСтраница);
	#Иначе
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ТекущаяСтраница);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	ТекущаяОбласть = Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть;
	ИмяЯчейки      = ТекущаяОбласть.Имя;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// предварительно обновим структуру многострочных разделов
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(Форма, ИмяГруппы);
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число( Сред( ИмяЯчейки, СтрНайти( ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	СтруктураГруппы = Форма[СтруктураГруппы];
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы И СтруктураГруппы.Количество() > НомерСтрокиТаблицы Тогда
		// удаляется добавленная строка
		ИмяПервойЯчейкиУдаляемойСтроки = ИмяГруппы + "010_" + НомУдаляемойСтроки;
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		// номера строк удаляемой области
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх - 1;
		НомерНижнЯчейкиОбласти = НомерВерхЯчейкиОбласти + ВысотаСтроки - 1;  // первая область - контрол удаления строки
		
		РегламентированнаяОтчетностьВызовСервера.СпециальногоУдаленияСтроки(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИмяГруппы, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр-1];
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=") + "0";
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=") + "0";
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки     = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ОбластьСдвинутойЯчейки.СодержитЗначение <> Истина Тогда
							// обновляем порядковый номер строки
							
							СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
							НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
							ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер + ".";
							
							// обновляем значение элемента таблицы значений
							ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
		// обновляем структуру многострочного раздела
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли СтруктураГруппы.Количество() > НомерСтрокиТаблицы Тогда
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					ИмяЯчейки                = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицы;
					ОбластьЯчейкиТаблицы     = ТекТабличноеПоле.Области[ИмяЯчейки];
					
					Если ОбластьЯчейкиТаблицы.СодержитЗначение <> Истина Тогда
						
						ПервыйНомерВГруппе = 1;
						
						// обновляем порядковый номер строки
						НовыйПорядковыйНомер = Строка(ПервыйНомерВГруппе + НомерСтрокиВТаблице);
						
						СтрокаТаблицы[КолонкаТаблицыИмя] = НовыйПорядковыйНомер;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Данные в многострочном блоке обновляются в декларациях!
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае
	
	// определяем текущую область таблицы
	НомТекущейСтроки  = Мин( НомУдаляемойСтроки, СтруктураГруппы.Количество() );
	ИмяТекущейОбласти = ИмяГруппы + "010_" + НомТекущейСтроки;
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	ОтрисоватьЗначкиУдаленияСтрок(ТекТабличноеПоле);
	
	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	СохранитьДополнительныеСтрокиВСтруктуре(Форма, ТекущаяСтраница, Ложь);
	
	Расчет(Форма, ТекущаяСтраница);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		
		ЗначениеКорректировки = ТабличныйДокумент.Области.НомерКорректировки.Значение;
		
		Если НЕ ЗначениеЗаполнено(ЗначениеКорректировки) Тогда
			ТабличныйДокумент.Области.НомерКорректировки.Значение = "0";
			ЗначениеКорректировки = 0;
		КонецЕсли;
		
		НомерКорректировки = ЗначениеКорректировки;
		СтруктураРеквизитовФормы.ВидДокумента = ?(ЗначениеКорректировки = 0, 0, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхЛистД2.Очистить();
	СтруктураДанныхЛистЕ1.Очистить();
	СтруктураДанныхЛистГ.Очистить();
	СтруктураДанныхЛистЗ.Очистить();
	СтруктураДанныхЛистЗПродолжение.Очистить();
	СтруктураДанныхЛистЗПродолжение2.Очистить();
	СтруктураДанныхЛистЗПродолжение3.Очистить();
	СтруктураДанныхЛистЗПродолжение4.Очистить();
	СтруктураДанныхЛистИ.Очистить();
	СтруктураДанныхЛистИПродолжение.Очистить();
	
	НомерКорректировки = 0;
	ДатаПодписи = ТекущаяДатаСеанса();
	
	Для каждого ЭлементСтруктурыТаблицаСтраницы Из мСтруктураМногостраничныхРазделов Цикл
		
		ЭтаФорма[ЭлементСтруктурыТаблицаСтраницы.Значение].Очистить();
		
	КонецЦикла;
	
	ИнициализацияМногостраничныхРазделов();
	
	Для Каждого мнгРаздел Из мСтруктураМногострочныхРазделов Цикл
		ЭтаФорма[мнгРаздел.Ключ].Очистить();
	КонецЦикла;
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если НЕ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	СпециальныеОперацииПослеОчисткиЛистаНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(ЭтаФорма);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура СохранитьЗначениеПоказателяВСтруктуреНаСервере(ИмяРаздела, ИмяПоказателя, Значение);
	
	СохранитьЗначениеПоказателяВСтруктуре(ЭтаФорма, ИмяРаздела, ИмяПоказателя, Значение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, ИмяПоказателя, ЗначениеПоказателя)
	
	МногостраничностьВРазделе = Ложь;
	КолМногострочныхЧастей = 0;
	СохранятьМногострКакТЗ = Истина;
	ИмяГруппы = "";
	Если ИмяРаздела = "Титульный" Тогда
		МногостраничностьВРазделе = Ложь;
	ИначеЕсли ИмяРаздела = "ЛистА" Тогда
		КолМногострочныхЧастей = 1;
		МногостраничностьВРазделе = Истина;
		ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппыА;
	ИначеЕсли ИмяРаздела = "ЛистБ" Тогда
		КолМногострочныхЧастей = 1;
		МногостраничностьВРазделе = Истина;
		ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппыБ;
	ИначеЕсли ИмяРаздела = "ЛистВ" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	ИначеЕсли ИмяРаздела = "ЛистГ" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Ложь;
	ИначеЕсли ИмяРаздела = "ЛистЕ2" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	ИначеЕсли ИмяРаздела = "ЛистД1" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	ИначеЕсли ИмяРаздела = "ЛистЖ" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	ИначеЕсли ИмяРаздела = "Раздел1" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	ИначеЕсли ИмяРаздела = "Раздел2" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	КонецЕсли; 
	
	ДанныеРаздела = Неопределено;
	ДанныеМногострочногоРаздела = Неопределено;
	
	Если ИмяРаздела <> "" Тогда
		
		Если МногостраничностьВРазделе Тогда  //Для многостраничных разделов
			
			ИмяТаблицыСтраницы = Неопределено;
			Если Форма.мСтруктураМногостраничныхРазделов.Свойство(ИмяРаздела, ИмяТаблицыСтраницы) Тогда
				
				ТаблицаСтраницы = Форма[ИмяТаблицыСтраницы];
				АктивныеСтраницы = ТаблицаСтраницы.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
				
				Если АктивныеСтраницы.Количество() > 0 Тогда
					
					ДанныеРазделаСписок = АктивныеСтраницы[0].Данные;
					Если ДанныеРазделаСписок.Количество() > 0 Тогда
						
						ДанныеРаздела = ДанныеРазделаСписок[0].Значение;
						ДанныеРазделаСписок[0].Пометка = Ложь; //Регистрируем для передачи на сервер (при редактировании таблицы значения не передаются)
						
					КонецЕсли;
					
					Если КолМногострочныхЧастей > 0 Тогда  // И многострочных разделов
						
						ДанныеДопСтрокРазделаСписок = АктивныеСтраницы[0].ДанныеДопСтрок;
						Если ДанныеДопСтрокРазделаСписок.Количество() > 0 Тогда
							
							ДанныеДопСтрокРаздела = ДанныеДопСтрокРазделаСписок[0].Значение;
							ДанныеДопСтрокРазделаСписок[0].Пометка = Ложь;
							
							СтруктураГруппы = Неопределено;
							Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
							
							ДанныеМногострочногоРаздела = Форма[СтруктураГруппы];
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе  //Для обычных разделов
			
			ДанныеРаздела = Форма["СтруктураДанных" + ИмяРаздела];
			
			Если КолМногострочныхЧастей > 0 Тогда  // И многострочных разделов
				
				СтруктураГруппы = Неопределено;
				Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
				
				ДанныеМногострочногоРаздела = Форма[СтруктураГруппы];
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ДанныеМногострочногоРаздела = Неопределено Тогда
			Если ДанныеРаздела <> Неопределено Тогда
				Если ДанныеРаздела.Свойство(ИмяПоказателя) Тогда
					ДанныеРаздела[ИмяПоказателя] = ЗначениеПоказателя;
				Иначе
					ДанныеРаздела.Вставить(ИмяПоказателя, ЗначениеПоказателя);
				КонецЕсли
			КонецЕсли; 
		Иначе
			Если ИмяГруппы = Лев(ИмяПоказателя, 10) Тогда //Показатель входит в многострочную часть
				ИмяПок = Лев(ИмяПоказателя, 13);
				СтрИнд = Сред(ИмяПоказателя, 14);
				Если Лев(СтрИнд, 1)="_" Тогда
					СтрИнд = Сред(СтрИнд, 2);
				КонецЕсли;
				Инд = ?(ПустаяСтрока(СтрИнд), 0, Число(СтрИнд));
				Если (Инд > 0) И ДанныеМногострочногоРаздела.Количество() >= Инд Тогда
					ДанныеМногострочногоРаздела[Инд-1][ИмяПок] = ЗначениеПоказателя;
				КонецЕсли; 
				
				Если (Инд > 0) И ДанныеДопСтрокРаздела.Количество() >= Инд Тогда
					ДанныеДопСтрокРаздела[Инд-1][ИмяПок] = ЗначениеПоказателя;
				КонецЕсли; 
				
			КонецЕсли;
			
			Если ДанныеРаздела <> Неопределено Тогда
				Если ДанныеРаздела.Свойство(ИмяПоказателя) Тогда
					ДанныеРаздела[ИмяПоказателя] = ЗначениеПоказателя;
				Иначе
					ДанныеРаздела.Вставить(ИмяПоказателя, ЗначениеПоказателя);
				КонецЕсли
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруПоказателей()
	
	мДанныеОтчета = Новый Структура;
	
	СохрСтруктура = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	ПоказателиОтчета = СохрСтруктура.ПоказателиОтчета;
	Для Каждого Раздел Из ПоказателиОтчета Цикл
		мДанныеОтчета.Вставить(СтрЗаменить(Раздел.Ключ, "ПолеТабличногоДокумента", ""), РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Раздел.Значение));
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры Из СохрСтруктура.ДанныеМногостраничныхРазделов Цикл	
		
		НайденноеЗначение = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
		
		Если НЕ НайденноеЗначение = Неопределено Тогда
			
			НайденноеЗначение = ЭтаФорма[НайденноеЗначение];
			
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, НайденноеЗначение);
			
			Если НайденноеЗначение[0].Свойство("Данные") Тогда
				
				Для Каждого СтрокаТаблЗнач Из НайденноеЗначение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
						
						СтрокаТаблЗнач.Данные.Очистить();
						СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НайденноеЗначение[0].Свойство("ДанныеДопСтрок") Тогда
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
						
						Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
							
							ТаблЗнач = ЭлСтруктуры.Значение;
							
							ЭлСтруктуры.Значение = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
							
							ЗначениеВДанныеФормы(ТаблЗнач, ЭлСтруктуры.Значение);
							
							НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(ЭлСтруктуры.Значение);
							
						КонецЦикла;
						
					ИначеЕсли ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("ТаблицаЗначений") Тогда
						
						СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
						
						ЗначениеВДанныеФормы(СтрокаТаблЗнач.ДанныеДопСтрок, СтрокаТаблЗначДанныеДопСтрок);
						
						НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
						
					КонецЕсли;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		ТаблицаЛистовРаздела = ЭтаФорма[Раздел.Значение];
		Для Каждого Лист Из ТаблицаЛистовРаздела Цикл
			Лист.Данные[0].Значение = РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Лист.Данные[0].Значение);
		КонецЦикла;
		мДанныеОтчета.Вставить(Раздел.Ключ, ЭтаФорма[Раздел.Значение]);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПроверитьРазделыНаНаличиеИнформации(ДеревоВыгрузки, парамРазделы)
	
	Разделы = Новый Массив;
	Если ТипЗнч(парамРазделы) = Тип("Строка") Тогда
		Если СтрНайти(парамРазделы, ",") <> 0 Тогда
			СтрРазделы = Новый Структура(парамРазделы);
			Для Каждого Эл Из СтрРазделы Цикл
				Разделы.Добавить(Эл.Ключ);
			КонецЦикла;
		Иначе
			Разделы.Добавить(парамРазделы);
		КонецЕсли;
	КонецЕсли;
	
	РазделыПусты = Ложь;
	Для Каждого Раздел Из Разделы Цикл
		Если РазделПуст(ДеревоВыгрузки, Раздел) Тогда
			РазделыПусты = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ РазделыПусты;
	
КонецФункции

&НаСервере
Функция ПолучитьПоказателиРаздела(ДеревоВыгрузки, Раздел)
	
	ПоказателиРаздела = ДеревоВыгрузки.Строки.НайтиСтроки(Новый Структура("Раздел", Раздел), Истина);
	КоличествоСтрокРаздела = ПоказателиРаздела.Количество();
	Для ОбрИнд = 1 По КоличествоСтрокРаздела Цикл
		Инд = КоличествоСтрокРаздела - ОбрИнд;
		ТекСтр = ПоказателиРаздела[Инд];
		Если НЕ ЗначениеЗаполнено(ТекСтр.Ключ) Тогда
			ПоказателиРаздела.Удалить(Инд);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоказателиРаздела;
	
КонецФункции

&НаСервере
Функция ПоказательЗаполнен(Показатель, Значение)
	
	Возврат ЗначениеЗаполнено(Значение) И НЕ (СокрЛП(Показатель.Формат) = "N" И Показатель.МаксРазмерность = 15 И ТипЗнч(Значение) = Тип("Число") И Окр(Значение) = 0);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоказателиНеанализируемыеНаЗаполненность()
	ПоказателиНеанализируемыеНаЗаполненность= Новый Массив;
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001020");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001030");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001040");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001050");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001070");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001130");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000400001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000400001150");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000400001160");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000400001170");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001130");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001150");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001160");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001170");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001180");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001040");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001080");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001200");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001220");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001200");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001230");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001240");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001050");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001090");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001150");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001160");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001190");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000900001080");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000900001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001000001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001000001130");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001000001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001100001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001103");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001104");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001106");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001107");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001108");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001109");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001113");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001114");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000904");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000607");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000508");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000112");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001303");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001304");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001314");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001315");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001323");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001403");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001404");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001409");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001410");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001523");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001524");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001527");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001528");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001529");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001530");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001531");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001532");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001533");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001050");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001170");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001180");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001230");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001240");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001290");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001300");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001330");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001340");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001350");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001360");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001370");
	
	Возврат ПоказателиНеанализируемыеНаЗаполненность;

КонецФункции 

&НаСервере
Функция СтраницаПуста(ДанныеСтраницы, Показатели, ДеревоВыгрузки, РодМногостр = Ложь)
	
	Если ТипЗнч(Показатели) = Тип("Строка") Тогда
		ПоказателиРаздела = ПолучитьПоказателиРаздела(ДеревоВыгрузки, Показатели);
	Иначе
		ПоказателиРаздела = Показатели;
	КонецЕсли;
	
	ПоказателиНеанализируемыеНаЗаполненность = ПоказателиНеанализируемыеНаЗаполненность();
	
	Для Каждого Пок Из ПоказателиРаздела Цикл
		Если ПоказателиНеанализируемыеНаЗаполненность.Найти(Пок.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Пок.Многострочность Или (РодМногостр И Пок.Родитель.Многострочность) Тогда
			ИндексСтроки = 1;
			ЗначениеПоказателя = Неопределено;
			Пока ДанныеСтраницы.Свойство(Пок.Ключ + "_" + Формат(ИндексСтроки, "ЧГ="), ЗначениеПоказателя) Цикл
				Если ПоказательЗаполнен(Пок, ЗначениеПоказателя) Тогда
					Возврат Ложь;
				КонецЕсли;
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
		Иначе
			ЗначениеПоказателя = Неопределено;
			ДанныеСтраницы.Свойство(СтрЗаменить(Пок.Ключ,"_Ч",""), ЗначениеПоказателя);
			Если ПоказательЗаполнен(Пок, ЗначениеПоказателя) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция РазделПуст(ДеревоВыгрузки, Раздел)
	
	ПоказателиРаздела = ПолучитьПоказателиРаздела(ДеревоВыгрузки, Раздел);
	
	ДанныеРаздела = мДанныеОтчета[Раздел];
	РазделПуст = Истина;
	Если ТипЗнч(ДанныеРаздела) <> Тип("Структура") Тогда
		Для Каждого Стр Из ДанныеРаздела Цикл
			Если НЕ СтраницаПуста(Стр.Данные[0].Значение, ПоказателиРаздела, ДеревоВыгрузки) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если НЕ СтраницаПуста(ДанныеРаздела, ПоказателиРаздела, ДеревоВыгрузки) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ДеревоВыгрузки); // формируем точную структуру XML-макета
	ЗаполнитьДаннымиУзел(ДеревоВыгрузки, ПараметрыВыгрузки); // заполняем дерево данными
	
	ОтсечьНезаполненныеНеобязательныеУзлы(ДеревоВыгрузки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУсловныеЭлементы(Знач ПараметрыВыгрузки, Узел)
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если Узел.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
			Возврат;
		КонецЕсли;
		РегламентированнаяОтчетность.ДополнитьСтруктуруПараметров(мДанныеОтчета, ПараметрыВыгрузки, Узел);
	КонецЕсли;
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		ТекСтр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		Если НЕ ПустаяСтрока(ТекСтр.Условие) Тогда
			Если НЕ РегламентированнаяОтчетность.УсловиеВыполнено(ЭтаФорма, ПараметрыВыгрузки, ТекСтр.Условие) Тогда
				Узел.Строки.Удалить(ТекСтр);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ТекСтр);
	КонецЦикла;
	
КонецПроцедуры

// Процедура рассчитывает итоги по указанному листу (если лист не указан, рассчитываются итоги на всех листах)
//  Если лист помечен активным и в табличном документе на форме есть соответствующие итогам области, их значения будут обновлены
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогиЛиста(Форма, ИмяЛиста = Неопределено)

	Если ИмяЛиста = "ЛистБ" Тогда
		
#Область Пересчет_ЛистБ

		СтруктураИтогов = Новый Структура;
		
		Для Каждого ЛистБ Из Форма.ТаблицаСтраницыЛистБ Цикл
			
			Если ЛистБ.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтавкаНалога = ЛистБ.Данные[0].Значение.П000400001001;
			КлючСтавки = "Ставка_" + Формат(СтавкаНалога, "ЧДЦ=; ЧГ="); 
			
			ИтогиПоСтавке = Неопределено;
			Если НЕ СтруктураИтогов.Свойство(КлючСтавки, ИтогиПоСтавке) Тогда
				СтруктураИтогов.Вставить(КлючСтавки, Новый Структура("Ставка,Колонка140,Колонка150,Колонка160,Колонка170,СтраницаИтогов", 
						СтавкаНалога,0,0,0,0, Неопределено));
				ИтогиПоСтавке = СтруктураИтогов[КлючСтавки];
			КонецЕсли; 
			
			
			Если ЛистБ.ДанныеДопСтрок.Количество() > 0 Тогда
				
				ИтогиПоСтавке.Колонка140 = ИтогиПоСтавке.Колонка140 + ЛистБ.ДанныеДопСтрок[0].Значение.Итог("П000400001070");
				ИтогиПоСтавке.Колонка150 = ИтогиПоСтавке.Колонка150 + ЛистБ.ДанныеДопСтрок[0].Значение.Итог("П000400001110");
				ИтогиПоСтавке.Колонка160 = ИтогиПоСтавке.Колонка160 + ЛистБ.ДанныеДопСтрок[0].Значение.Итог("П000400001120");
				ИтогиПоСтавке.Колонка170 = ИтогиПоСтавке.Колонка170 + ЛистБ.ДанныеДопСтрок[0].Значение.Итог("П000400001130");
				
				ИтогиПоСтавке.СтраницаИтогов = ЛистБ; // Запоминаем последнюю страницу листа для записи итогов
				
			КонецЕсли; 
			
		КонецЦикла;
		
		// Для каждой ставки записываем итоги на последней странице листа Б с этой ставкой
		Для Каждого КлючСтавки Из СтруктураИтогов Цикл
			
			ЛистБ = КлючСтавки.Значение.СтраницаИтогов;
			Если ЛистБ <> Неопределено Тогда
				
				ЛистБ.Данные[0].Значение.Вставить("П000400001140", КлючСтавки.Значение.Колонка140);
				ЛистБ.Данные[0].Значение.Вставить("П000400001150", КлючСтавки.Значение.Колонка150);
				ЛистБ.Данные[0].Значение.Вставить("П000400001160", КлючСтавки.Значение.Колонка160);
				ЛистБ.Данные[0].Значение.Вставить("П000400001170", КлючСтавки.Значение.Колонка170);
				
				Если ЛистБ.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000400001140") <> Неопределено Тогда
					
					// Обновляем итоги на активной странице
					Форма.ТабличныйДокумент.Области["П000400001140"].Значение = КлючСтавки.Значение.Колонка140;
					Форма.ТабличныйДокумент.Области["П000400001150"].Значение = КлючСтавки.Значение.Колонка150;
					Форма.ТабличныйДокумент.Области["П000400001160"].Значение = КлючСтавки.Значение.Колонка160;
					Форма.ТабличныйДокумент.Области["П000400001170"].Значение = КлючСтавки.Значение.Колонка170;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
#КонецОбласти

	ИначеЕсли ИмяЛиста = "ЛистВ" Тогда
		
#Область Пересчет_ЛистВ

		Колонка110 = 0;  // общая сумма дохода
		Колонка120 = 0;  // общая сумма проф.вычета (факт или по норме)
		СтраницаИтогов = Неопределено;
		
		Для Каждого ЛистВ Из Форма.ТаблицаСтраницыЛистВ Цикл
			
			Если ЛистВ.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Колонка110 = Колонка110 + ЛистВ.Данные[0].Значение.П000500001030;
			Колонка120 = Колонка120 + ЛистВ.Данные[0].Значение.П000500001040
									+ ЛистВ.Данные[0].Значение.П000500001100;
			СтраницаИтогов = ЛистВ;
			
		КонецЦикла;
		
		Если СтраницаИтогов <> Неопределено Тогда
			
			ЛистВ.Данные[0].Значение.Вставить("П000500001110", Колонка110);
			ЛистВ.Данные[0].Значение.Вставить("П000500001120", Колонка120);
			
			Если СтраницаИтогов.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000500001110") <> Неопределено Тогда
				Форма.ТабличныйДокумент.Области["П000500001110"].Значение = Колонка110;
				Форма.ТабличныйДокумент.Области["П000500001120"].Значение = Колонка120;
			КонецЕсли; 
			
		КонецЕсли; 
	
#КонецОбласти
			
	ИначеЕсли ИмяЛиста = "ЛистГ" Тогда
		
#Область Пересчет_ЛистГ

		ПоказателиЛиста = Форма.СтруктураДанныхЛистГ;
		ПоказателиЛиста.П000600001200 = 
			ПоказателиЛиста.П000600001020 +
			ПоказателиЛиста.П000600001040 +
			ПоказателиЛиста.П000600001060 +
			ПоказателиЛиста.П000600001080 +
			ПоказателиЛиста.П000600001100 +
			ПоказателиЛиста.П000600001120 +
			ПоказателиЛиста.П000600001140 +
			ПоказателиЛиста.П000600001160 +
			ПоказателиЛиста.П000600001190;
			
		Если Форма.ТабличныйДокумент.Области.Найти("П000600001200") <> Неопределено Тогда
			Форма.ТабличныйДокумент.Области["П000600001200"].Значение = ПоказателиЛиста.П000600001200;
		КонецЕсли; 
		
#КонецОбласти

	ИначеЕсли ИмяЛиста = "ЛистД1" Тогда
		
#Область Пересчет_ЛистД1

		// Формула определения суммы налоговой базы для определения имущественного вычета
		//ВсегоДоходПоСтавке13 (строка 010 Раздела 2) 
		// - пункт 10 Листа Г
		// - пункт 4 Листа Е1
		// - пункт 3 Листа Е2
		// - подпункты 11.3 Листа 3
		// - пункт 7.3 листа И
		// - подпункт 3.2 Листа В
		// - пункте 4 листа Д2
		// - подпункт 6.1 Листа Ж
		// - подпункт 2.5 Листа Д1
		// - подпункт 2.6 Листа Д1
		
		ЗаполнитьСводныеТаблицы(Форма);
		
		СуммаДохода           = СуммаДоходаДляИмущественногоВычета(Форма);
		
		СтраницаИтогов        = Неопределено;
		
		ВсегоНаПриобретение   = 0;
		ВсегоПоПроцентам      = 0;
		
		ОстатокВычетаНаПриобретение = 2000000;
		ОстатокВычетаПоПроцентам    = 3000000;
		
		// Вычет по нескольким объектам можно получить только по законодательству 2014 года.
		РассчитыватьПределПоПроцентам = Форма.ТаблицаСтраницыЛистД1.Количество() > 1;
		
		// Собираем информацию по вычетам по всем листам
		Для Каждого ЛистД1 Из Форма.ТаблицаСтраницыЛистД1 Цикл
			
			Если ЛистД1.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтраницаИтогов  = ЛистД1;
			ПоказателиЛиста = ЛистД1.Данные[0].Значение;
			
			Если ПоказателиЛиста.П000700001120 > ОстатокВычетаНаПриобретение Тогда
				ПоказателиЛиста.П000700001120 = ОстатокВычетаНаПриобретение;
				Если ЛистД1.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000700001120") <> Неопределено Тогда
					Форма.ТабличныйДокумент.Области["П000700001120"].Значение = ПоказателиЛиста.П000700001120;
				КонецЕсли; 
			КонецЕсли; 
			
			ВсегоНаПриобретение = ВсегоНаПриобретение + ПоказателиЛиста.П000700001120;
			ОстатокВычетаНаПриобретение = макс(0, ОстатокВычетаНаПриобретение - ПоказателиЛиста.П000700001120);
			
			// Предел на вычет по процентам действует только для объектов недвижимости, приобретенных с 01.01.2014 
			Если НЕ РассчитыватьПределПоПроцентам Тогда
				РассчитыватьПределПоПроцентам = НЕ ЗначениеЗаполнено(ПоказателиЛиста.П000700001110) ИЛИ ПоказателиЛиста.П000700001110 >= 2014;
			КонецЕсли; 
			
			Если РассчитыватьПределПоПроцентам Тогда
				
				Если ПоказателиЛиста.П000700001130 > ОстатокВычетаПоПроцентам Тогда
					ПоказателиЛиста.П000700001130 = ОстатокВычетаПоПроцентам;
					Если ЛистД1.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000700001130") <> Неопределено Тогда
						Форма.ТабличныйДокумент.Области["П000700001130"].Значение = ПоказателиЛиста.П000700001130;
					КонецЕсли; 
				КонецЕсли; 
				
				ВсегоПоПроцентам         = ВсегоПоПроцентам + ПоказателиЛиста.П000700001130;
				ОстатокВычетаПоПроцентам = ОстатокВычетаПоПроцентам - ПоказателиЛиста.П000700001130;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ВсегоНаПриобретение = Мин(ВсегоНаПриобретение, 2000000);
		
		// Заполняем итоги
		Если СтраницаИтогов <> Неопределено Тогда
			
			ПоказателиЛиста = СтраницаИтогов.Данные[0].Значение;
			
				// Сумма дохода - налоговая база, вычисленная по формуле
				ПоказателиЛиста.Вставить("П000700001200", СуммаДохода);
				
				// Рассчитываем вычет на приобретение
				
				Если НЕ ПоказателиЛиста.Свойство("П000700001140") Тогда
					ПоказателиЛиста.Вставить("П000700001140", 0);
				КонецЕсли;
				
				// Определение суммы вычета, перешедшего с прошлых периодов
				Показатель_П000700001160 = 0;
				Если ПоказателиЛиста.Свойство("П000700001160", Показатель_П000700001160) Тогда
					
					Показатель_П000700001160 = Мин(2000000, Показатель_П000700001160);
				
				КонецЕсли;
				ПоказателиЛиста.Вставить("П000700001160", Макс(Показатель_П000700001160, 0));
				
				Если НЕ ПоказателиЛиста.Свойство("П000700001180") Тогда
					ПоказателиЛиста.Вставить("П000700001180", 0);
				КонецЕсли;
				
				// Определение суммы вычета, доступного в текущем периоде
				ОстатокВычетаНаПриобретение = Макс(ВсегоНаПриобретение - ПоказателиЛиста.П000700001140 - ПоказателиЛиста.П000700001180, 0); // вычли вычет, предоставленный налоговым агентом
				
				// Расчет принимаемой к вычету суммы:
				ПринимаемыйВычет = Мин(СуммаДохода, ОстатокВычетаНаПриобретение);
				ПоказательП000700001210 = 0;
				
				Если ПоказателиЛиста.Свойство("П000700001210", ПоказательП000700001210) Тогда

					ПринимаемыйВычет = Мин(ПринимаемыйВычет, ПоказательП000700001210);
					
				КонецЕсли;
				
				ПоказателиЛиста.Вставить("П000700001210", ПринимаемыйВычет);
				
				ПоказателиЛиста.Вставить("П000700001230", Макс(ОстатокВычетаНаПриобретение - ПринимаемыйВычет, 0)); // остаток на будущие периоды
				
				
				// уменьшаем сумму дохода на сумму принятого вычета
				СуммаДохода = СуммаДохода - ПринимаемыйВычет;
				
				
				// Рассчитываем вычет по процентам
				
				Если НЕ ПоказателиЛиста.Свойство("П000700001150") Тогда
					ПоказателиЛиста.Вставить("П000700001150", 0);
				КонецЕсли;
				
				// Определение суммы вычета, перешедшего с прошлых периодов
				Если ЗначениеЗаполнено(ПоказателиЛиста.П000700001150) Тогда //сумма, принятая к вычету в прошлые периоды
					ПоказателиЛиста.Вставить("П000700001170", Макс(ПоказателиЛиста.П000700001130 - ПоказателиЛиста.П000700001150, 0));
				Иначе
					ПоказателиЛиста.Вставить("П000700001170", 0); // не может быть суммы, если вычет ранее не предоставлялся
				КонецЕсли; 
				
				
				// Определение суммы вычета, доступного в текущем периоде
				ОстатокВычета = ?(ПоказателиЛиста.П000700001170 = 0, ПоказателиЛиста.П000700001130, ПоказателиЛиста.П000700001170);
				Если РассчитыватьПределПоПроцентам Тогда
					ОстатокВычета = Мин(ОстатокВычета, 3000000);
				КонецЕсли; 
				
				Если НЕ ПоказателиЛиста.Свойство("П000700001190") Тогда
					ПоказателиЛиста.Вставить("П000700001190", 0);
				КонецЕсли;
				
				ОстатокВычета = Макс(ОстатокВычета - ПоказателиЛиста.П000700001190, 0); // вычли вычет, предоставленный налоговым агентом
				
				// Расчет принимаемой к вычету суммы:
				ПринимаемыйВычет = Мин(СуммаДохода, ОстатокВычета);
				ПоказательП000700001220 = 0;
				Если ПоказателиЛиста.Свойство("П000700001220", ПоказательП000700001220) Тогда
					
					ПринимаемыйВычет = Мин(ПринимаемыйВычет, ПоказательП000700001220);

				КонецЕсли;
				
				ПоказателиЛиста.Вставить("П000700001220", ПринимаемыйВычет);
				
				ПоказателиЛиста.Вставить("П000700001240", Макс(ОстатокВычета - ПринимаемыйВычет, 0)); // остаток на будущие периоды
			
			Если СтраницаИтогов.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000700001200") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П000700001200"].Значение = ПоказателиЛиста.П000700001200; // Сумма дохода
				
				Форма.ТабличныйДокумент.Области["П000700001160"].Значение = ПоказателиЛиста.П000700001160; // Остаток с прошлых лет
				Форма.ТабличныйДокумент.Области["П000700001170"].Значение = ПоказателиЛиста.П000700001170; // Остаток с прошлых лет
				
				Форма.ТабличныйДокумент.Области["П000700001210"].Значение = ПоказателиЛиста.П000700001210; // Принимаемый вычет
				
				Форма.ТабличныйДокумент.Области["П000700001220"].Значение = ПоказателиЛиста.П000700001220; // Принимаемый вычет
			
				Форма.ТабличныйДокумент.Области["П000700001230"].Значение = ПоказателиЛиста.П000700001230; // Остаток на будущее
				Форма.ТабличныйДокумент.Области["П000700001240"].Значение = ПоказателиЛиста.П000700001240; // Остаток на будущее
				
			КонецЕсли; 
			
		КонецЕсли; 
			
#КонецОбласти

	ИначеЕсли ИмяЛиста = "ЛистД2" Тогда
		
#Область Пересчет_ЛистД2

		// Расчет итогов Листа Д2
		ПоказателиЛиста = Форма.СтруктураДанныхЛистД2;
		
		// Пункт 1.3
		ПоказателиЛиста.П000800001050 = ПоказателиЛиста.П000800001010 + ПоказателиЛиста.П000800001030;
		ПоказателиЛиста.П000800001060 = Мин(ПоказателиЛиста.П000800001020 + ПоказателиЛиста.П000800001040, 1000000);
		
		// Пункт 1.5
		ПоказателиЛиста.П000800001090 = ПоказателиЛиста.П000800001050 + ПоказателиЛиста.П000800001070;
		ПоказателиЛиста.П000800001100 = ПоказателиЛиста.П000800001060 + ПоказателиЛиста.П000800001080;
		
		// Пункт 2.3
		ПоказателиЛиста.П000800001150 = ПоказателиЛиста.П000800001110 + ПоказателиЛиста.П000800001130;
		ПоказателиЛиста.П000800001160 = ПоказателиЛиста.П000800001120 + ПоказателиЛиста.П000800001140;
		
		// Пункт 4
		ПоказателиЛиста.П000800001190 = ПоказателиЛиста.П000800001100 + ПоказателиЛиста.П000800001160 + ПоказателиЛиста.П000800001180;
		
		Если Форма.ТабличныйДокумент.Области.Найти("П000800001050") <> Неопределено Тогда
			
			// Пункт 1.3
			Форма.ТабличныйДокумент.Области["П000800001050"].Значение = ПоказателиЛиста.П000800001050;
			Форма.ТабличныйДокумент.Области["П000800001060"].Значение = ПоказателиЛиста.П000800001060;
			// Пункт 1.5
			Форма.ТабличныйДокумент.Области["П000800001090"].Значение = ПоказателиЛиста.П000800001090;
			Форма.ТабличныйДокумент.Области["П000800001100"].Значение = ПоказателиЛиста.П000800001100;
			// Пункт 2.3
			Форма.ТабличныйДокумент.Области["П000800001150"].Значение = ПоказателиЛиста.П000800001150;
			Форма.ТабличныйДокумент.Области["П000800001160"].Значение = ПоказателиЛиста.П000800001160;
			// Пункт 4
			Форма.ТабличныйДокумент.Области["П000800001190"].Значение = ПоказателиЛиста.П000800001190;
			
		КонецЕсли; 

#КонецОбласти

	ИначеЕсли ИмяЛиста = "ЛистЕ1" Тогда
		
#Область Пересчет_ЛистЕ1

		// Расчет итогов Листа Е1
		ПоказателиЛиста = Форма.СтруктураДанныхЛистЕ1;
		
		// Пункт 1.8
		ПоказателиЛиста.П000900001080 = ПоказателиЛиста.П000900001010 + ПоказателиЛиста.П000900001020 + ПоказателиЛиста.П000900001040 
							+ ПоказателиЛиста.П000900001050 + ПоказателиЛиста.П000900001060 + ПоказателиЛиста.П000900001070;
		
		// Пункт 2.4
		ПоказателиЛиста.П000900001120 = ПоказателиЛиста.П000900001090 + ПоказателиЛиста.П000900001100 + ПоказателиЛиста.П000900001110; 
		
		// Пункт 3.5
		ПоказателиЛиста.П000900001170 = Мин(120000, ПоказателиЛиста.П000900001130 + ПоказателиЛиста.П000900001140 + ПоказателиЛиста.П000900001150
									+ ПоказателиЛиста.П000900001160);
		
		// Пункт 3.6
		ПоказателиЛиста.П000900001180 = ПоказателиЛиста.П000900001120 + ПоказателиЛиста.П000900001170;
		
		// Пункт 4
		ПоказателиЛиста.П000900001190 = ПоказателиЛиста.П000900001080 + ПоказателиЛиста.П000900001180;
		
		Если Форма.ТабличныйДокумент.Области.Найти("П000900001080") <> Неопределено Тогда
			
			Форма.ТабличныйДокумент.Области["П000900001080"].Значение = ПоказателиЛиста.П000900001080;
			Форма.ТабличныйДокумент.Области["П000900001120"].Значение = ПоказателиЛиста.П000900001120;
			Форма.ТабличныйДокумент.Области["П000900001170"].Значение = ПоказателиЛиста.П000900001170;
			Форма.ТабличныйДокумент.Области["П000900001180"].Значение = ПоказателиЛиста.П000900001180;
			Форма.ТабличныйДокумент.Области["П000900001190"].Значение = ПоказателиЛиста.П000900001190;
			
		КонецЕсли; 

#КонецОбласти

	ИначеЕсли ИмяЛиста = "ЛистЕ2" Тогда
		
#Область Пересчет_ЛистЕ2

		// Расчет итогов Листа Е2
		Колонка120     = 0;  // сумма, принимаемая к вычету
		Колонка130     = 0;  // предоставлено налоговыми агентами
		СтраницаИтогов = Неопределено;
		
		Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЕ2 Цикл
			
			Если Лист.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтраницаИтогов  = Лист;
			ПоказателиЛиста = Лист.Данные[0].Значение;
			
			Колонка120 = Колонка120 + ПоказателиЛиста.П001000001070 + ПоказателиЛиста.П001000001100;
			Колонка130 = Колонка130 + ПоказателиЛиста.П001000001080 + ПоказателиЛиста.П001000001110;
			
		КонецЦикла;
		
		Если СтраницаИтогов <> Неопределено Тогда
			
			ПоказателиЛиста = СтраницаИтогов.Данные[0].Значение;
			ПоказателиЛиста.П001000001120 = Колонка120;
			ПоказателиЛиста.П001000001130 = Колонка130;
			ПоказателиЛиста.П001000001140 = Макс(Колонка120 - Колонка130, 0);
			
			Если СтраницаИтогов.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001000001120") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П001000001120"].Значение = ПоказателиЛиста.П001000001120;
				Форма.ТабличныйДокумент.Области["П001000001130"].Значение = ПоказателиЛиста.П001000001130;
				Форма.ТабличныйДокумент.Области["П001000001140"].Значение = ПоказателиЛиста.П001000001140;
				
				// Сохраняем итоговый показатель на листе Е1
				Форма.СтруктураДанныхЛистЕ1.П000900001160 = ПоказателиЛиста.П001000001140;
				
			КонецЕсли;
			
		КонецЕсли; 
		

#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистЖ" Тогда
		
#Область Пересчет_ЛистЖ

	Для Каждого СтраницаЛистЖ Из Форма.ТаблицаСтраницыЛистЖ Цикл
		
		ПоказателиЛиста = СтраницаЛистЖ.Данные[0].Значение;
		
		ПоказателиЛиста.П001100001020 = Мин(ПоказателиЛиста.П001100001010, ПоказателиЛиста.П001100001020);
		
		ПоказателиЛиста.П001100001040 = Мин(ПоказателиЛиста.П001100001030, ПоказателиЛиста.П001100001040);
		
		ПоказателиЛиста.П001100001060 = Мин(ПоказателиЛиста.П001100001050, ПоказателиЛиста.П001100001060);
		
		ПоказателиЛиста.П001100001080 = Мин(ПоказателиЛиста.П001100001070, ПоказателиЛиста.П001100001080);
		
		ПоказателиЛиста.П001100001100 = Мин(ПоказателиЛиста.П001100001090, ПоказателиЛиста.П001100001100);
		
		ПоказателиЛиста.П001100001110 = ПоказателиЛиста.П001100001020
							+ ПоказателиЛиста.П001100001040
							+ ПоказателиЛиста.П001100001060
							+ ПоказателиЛиста.П001100001080
							+ ПоказателиЛиста.П001100001100;
		
		Если СтраницаЛистЖ.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001100001020") <> Неопределено Тогда
			
			Форма.ТабличныйДокумент.Области["П001100001020"].Значение = ПоказателиЛиста.П001100001020;
			Форма.ТабличныйДокумент.Области["П001100001040"].Значение = ПоказателиЛиста.П001100001040;
			Форма.ТабличныйДокумент.Области["П001100001060"].Значение = ПоказателиЛиста.П001100001060;
			Форма.ТабличныйДокумент.Области["П001100001080"].Значение = ПоказателиЛиста.П001100001080;
			Форма.ТабличныйДокумент.Области["П001100001100"].Значение = ПоказателиЛиста.П001100001100;
			Форма.ТабличныйДокумент.Области["П001100001110"].Значение = ПоказателиЛиста.П001100001110;
			
		КонецЕсли;
	
	КонецЦикла;
	
#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистЗ" Тогда
		
#Область Пересчет_ЛистЗ

	ЛистЗ             = Форма.СтруктураДанныхЛистЗ;
	ЛистЗПродолжение  = Форма.СтруктураДанныхЛистЗПродолжение;
	ЛистЗПродолжение2 = Форма.СтруктураДанныхЛистЗПродолжение2;
	ЛистЗПродолжение3 = Форма.СтруктураДанныхЛистЗПродолжение3;
	ЛистЗПродолжение4 = Форма.СтруктураДанныхЛистЗПродолжение4;
	
	ЛистЗ.П001200001106 = ЛистЗ.П001200001102 
						+ ЛистЗ.П001200001103 
						+ ЛистЗ.П001200001104 
						+ ЛистЗ.П001200001105;
	
	ЛистЗ.П001200001107 = Макс(ЛистЗ.П001200001101 - ЛистЗ.П001200001106, 0);
	
	ЛистЗ.П001200001108 = Макс(ЛистЗ.П001200001106 - ЛистЗ.П001200001101, 0);
	
	ЛистЗ.П001200001114 = Макс(ЛистЗ.П001200001108 - ЛистЗ.П001200001112 - ЛистЗ.П001200001113, 0);
	
	// Обновляем показатели на странице
	Если Форма.ТабличныйДокумент.Области.Найти("П001200001114") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001200001106"].Значение = ЛистЗ.П001200001106;
		Форма.ТабличныйДокумент.Области["П001200001107"].Значение = ЛистЗ.П001200001107;
		Форма.ТабличныйДокумент.Области["П001200001108"].Значение = ЛистЗ.П001200001108;
		Форма.ТабличныйДокумент.Области["П001200001114"].Значение = ЛистЗ.П001200001114;
		
	КонецЕсли; 
	
#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение" Тогда
		
#Область Пересчет_ЛистЗПродолжение

	ЛистЗПродолжение 	= Форма.СтруктураДанныхЛистЗПродолжение;
	
	ЛистЗПродолжение.П001300001204 = Макс(ЛистЗПродолжение.П001300001201
									- ЛистЗПродолжение.П001300001202
									- ЛистЗПродолжение.П001300001203,0);
	
	
	
	ЛистЗПродолжение.П001300001211 = ЛистЗПродолжение.П001300001206
									+ ЛистЗПродолжение.П001300001207
									+ ЛистЗПродолжение.П001300001208
									+ ЛистЗПродолжение.П001300001209
									+ ЛистЗПродолжение.П001300001210;
	
	ЛистЗПродолжение.П001300001212 = Макс(ЛистЗПродолжение.П001300001205
									- ЛистЗПродолжение.П001300001211, 0);
	
	Если Форма.ТабличныйДокумент.Области.Найти("П001300001212") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001300001211"].Значение = ЛистЗПродолжение.П001300001211;
		Форма.ТабличныйДокумент.Области["П001300001204"].Значение = ЛистЗПродолжение.П001300001204;
		Форма.ТабличныйДокумент.Области["П001300001212"].Значение = ЛистЗПродолжение.П001300001212;
		
	КонецЕсли; 
	
#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение2" Тогда
		
#Область Пересчет_ЛистЗПродолжение2

	ЛистЗПродолжение2 = Форма.СтруктураДанныхЛистЗПродолжение2;

	ЛистЗПродолжение2.П001400001303 = Макс(ЛистЗПродолжение2.П001400001301 - ЛистЗПродолжение2.П001400001302, 0);
	ЛистЗПродолжение2.П001400001304 = Макс(ЛистЗПродолжение2.П001400001302 - ЛистЗПродолжение2.П001400001301, 0);	
	
	ЛистЗПродолжение2.П001400001314 = Макс(ЛистЗПродолжение2.П001400001312 - ЛистЗПродолжение2.П001400001313, 0);
	ЛистЗПродолжение2.П001400001315 = Макс(ЛистЗПродолжение2.П001400001313 - ЛистЗПродолжение2.П001400001312, 0);
	
	ЛистЗПродолжение2= Форма.СтруктураДанныхЛистЗПродолжение2;
	
	ЛистЗПродолжение2.П001400001323 = Макс(ЛистЗПродолжение2.П001400001321
									- ЛистЗПродолжение2.П001400001322, 0);
		
	Если Форма.ТабличныйДокумент.Области.Найти("П001400001323") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001400001303"].Значение = ЛистЗПродолжение2.П001400001303;
		Форма.ТабличныйДокумент.Области["П001400001304"].Значение = ЛистЗПродолжение2.П001400001304;
		Форма.ТабличныйДокумент.Области["П001400001309"].Значение = ЛистЗПродолжение2.П001400001309;
		Форма.ТабличныйДокумент.Области["П001400001310"].Значение = ЛистЗПродолжение2.П001400001310;
		Форма.ТабличныйДокумент.Области["П001400001311"].Значение = ЛистЗПродолжение2.П001400001311;
		Форма.ТабличныйДокумент.Области["П001400001314"].Значение = ЛистЗПродолжение2.П001400001314;
		Форма.ТабличныйДокумент.Области["П001400001315"].Значение = ЛистЗПродолжение2.П001400001315;
		Форма.ТабличныйДокумент.Области["П001400001323"].Значение = ЛистЗПродолжение2.П001400001323;
		
	КонецЕсли; 
	
#КонецОбласти



	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение3" Тогда
		
#Область Пересчет_ЛистЗПродолжение3

	ЛистЗПродолжение3 = Форма.СтруктураДанныхЛистЗПродолжение3;
	
	ЛистЗПродолжение3.П001500001403 = Макс(ЛистЗПродолжение3.П001500001401 - ЛистЗПродолжение3.П001500001402, 0);
	ЛистЗПродолжение3.П001500001404 = Макс(ЛистЗПродолжение3.П001500001402 - ЛистЗПродолжение3.П001500001401, 0);
	
	ЛистЗПродолжение3.П001500001409 = Макс(ЛистЗПродолжение3.П001500001407 - ЛистЗПродолжение3.П001500001408, 0);
	ЛистЗПродолжение3.П001500001410 = Макс(ЛистЗПродолжение3.П001500001408 - ЛистЗПродолжение3.П001500001407, 0);
	
	Если Форма.ТабличныйДокумент.Области.Найти("П001500001410") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001500001403"].Значение = ЛистЗПродолжение3.П001500001403;
		Форма.ТабличныйДокумент.Области["П001500001404"].Значение = ЛистЗПродолжение3.П001500001404;
		Форма.ТабличныйДокумент.Области["П001500001409"].Значение = ЛистЗПродолжение3.П001500001409;
		Форма.ТабличныйДокумент.Области["П001500001410"].Значение = ЛистЗПродолжение3.П001500001410;
		
	КонецЕсли;
	
#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение4" Тогда
		
#Область Пересчет_ЛистЗПродолжение4

	ЛистЗ = Форма.СтруктураДанныхЛистЗ;
	ЛистЗПродолжение = Форма.СтруктураДанныхЛистЗПродолжение;
	ЛистЗПродолжение2 = Форма.СтруктураДанныхЛистЗПродолжение2;
	ЛистЗПродолжение3 = Форма.СтруктураДанныхЛистЗПродолжение3;
	ЛистЗПродолжение4 = Форма.СтруктураДанныхЛистЗПродолжение4;

	ЛистЗПродолжение4.П001600001501 = ЛистЗПродолжение4.П001600001502
									+ ЛистЗПродолжение4.П001600001503
									+ ЛистЗПродолжение4.П001600001504
									+ ЛистЗПродолжение4.П001600001505
									+ ЛистЗПродолжение4.П001600001506
									+ ЛистЗПродолжение4.П001600001507
									+ ЛистЗПродолжение4.П001600001508
									+ ЛистЗПродолжение4.П001600001509
									+ ЛистЗПродолжение4.П001600001510
									+ ЛистЗПродолжение4.П001600001511;
	
	ЛистЗПродолжение4.П001600001512 = ЛистЗПродолжение4.П001600001513
									+ ЛистЗПродолжение4.П001600001514
									+ ЛистЗПродолжение4.П001600001515
									+ ЛистЗПродолжение4.П001600001516
									+ ЛистЗПродолжение4.П001600001517
									+ ЛистЗПродолжение4.П001600001518
									+ ЛистЗПродолжение4.П001600001519
									+ ЛистЗПродолжение4.П001600001520
									+ ЛистЗПродолжение4.П001600001521
									+ ЛистЗПродолжение4.П001600001522;
	
	
	ЛистЗПродолжение4.П001600001527 = Макс(ЛистЗПродолжение4.П001600001501 - ЛистЗПродолжение4.П001600001525, 0);
	
	ЛистЗПродолжение4.П001600001528 = Макс(ЛистЗПродолжение4.П001600001512 - ЛистЗПродолжение4.П001600001526, 0);
	
	ЛистЗПродолжение4.П001600001531 = ЛистЗ.П001200001101 
									+ ЛистЗПродолжение.П001300001201
									+ ЛистЗПродолжение.П001300001205
									+ ЛистЗПродолжение2.П001400001301
									+ ЛистЗПродолжение2.П001400001312
									+ ЛистЗПродолжение2.П001400001321
									+ ЛистЗПродолжение3.П001500001401
									+ ЛистЗПродолжение3.П001500001407;
	
	ЛистЗПродолжение4.П001600001532 = ЛистЗ.П001200001111 
									+ ЛистЗПродолжение.П001300001204
									+ ЛистЗПродолжение.П001300001212
									+ ЛистЗПродолжение2.П001400001308
									+ ЛистЗПродолжение2.П001400001318
									+ ЛистЗПродолжение2.П001400001323
									+ ЛистЗПродолжение3.П001500001403
									+ ЛистЗПродолжение3.П001500001409;
	
	ЛистЗПродолжение4.П001600001533 = Макс(ЛистЗПродолжение4.П001600001531 - ЛистЗПродолжение4.П001600001532, 0);
	
	Если Форма.ТабличныйДокумент.Области.Найти("П001600001533") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001600001501"].Значение = ЛистЗПродолжение4.П001600001501;
		Форма.ТабличныйДокумент.Области["П001600001512"].Значение = ЛистЗПродолжение4.П001600001512;
		Форма.ТабличныйДокумент.Области["П001600001527"].Значение = ЛистЗПродолжение4.П001600001527;
		Форма.ТабличныйДокумент.Области["П001600001528"].Значение = ЛистЗПродолжение4.П001600001528;
		Форма.ТабличныйДокумент.Области["П001600001531"].Значение = ЛистЗПродолжение4.П001600001531;
		Форма.ТабличныйДокумент.Области["П001600001532"].Значение = ЛистЗПродолжение4.П001600001532;
		Форма.ТабличныйДокумент.Области["П001600001533"].Значение = ЛистЗПродолжение4.П001600001533;
		
	КонецЕсли;
	
#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистИ" Тогда
		
#Область Пересчет_ЛистИ

	ЛистИ = Форма.СтруктураДанныхЛистИ;

	ЛистИ.П001700001050 = Макс(ЛистИ.П001700001010 - ЛистИ.П001700001020 - ЛистИ.П001700001030 - ЛистИ.П001700001040, 0);
	
	ЛистИ.П001700001060 = Макс(ЛистИ.П001700001020 + ЛистИ.П001700001030 - ЛистИ.П001700001010, 0);
	
	ЛистИ.П001700001110 = Макс(ЛистИ.П001700001070 - ЛистИ.П001700001080 - ЛистИ.П001700001090 - ЛистИ.П001700001100, 0);
	
	ЛистИ.П001700001120 = Макс(ЛистИ.П001700001090 + ЛистИ.П001700001080 - ЛистИ.П001700001070, 0);
	
	ЛистИ.П001700001170 = Макс(ЛистИ.П001700001130 - ЛистИ.П001700001140 - ЛистИ.П001700001150 - ЛистИ.П001700001160, 0);
	
	ЛистИ.П001700001170 = Макс(ЛистИ.П001700001130 - ЛистИ.П001700001140 - ЛистИ.П001700001150 - ЛистИ.П001700001160, 0);
	
	ЛистИ.П001700001180 = Макс(ЛистИ.П001700001140 + ЛистИ.П001700001150 - ЛистИ.П001700001130, 0);
	
	Если Форма.ТабличныйДокумент.Области.Найти("П001700001180") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001700001050"].Значение = ЛистИ.П001700001050;
		Форма.ТабличныйДокумент.Области["П001700001060"].Значение = ЛистИ.П001700001060;
		Форма.ТабличныйДокумент.Области["П001700001110"].Значение = ЛистИ.П001700001110;
		Форма.ТабличныйДокумент.Области["П001700001120"].Значение = ЛистИ.П001700001120;
		Форма.ТабличныйДокумент.Области["П001700001170"].Значение = ЛистИ.П001700001170;
		Форма.ТабличныйДокумент.Области["П001700001170"].Значение = ЛистИ.П001700001170;
		Форма.ТабличныйДокумент.Области["П001700001180"].Значение = ЛистИ.П001700001180;
		
	КонецЕсли;
	
#КонецОбласти
		
	ИначеЕсли ИмяЛиста = "ЛистИПродолжение" Тогда
		
#Область Пересчет_ЛистИПродолжение

	ЛистИ = Форма.СтруктураДанныхЛистИ;
	ЛистИПродолжение = Форма.СтруктураДанныхЛистИПродолжение;

	ЛистИПродолжение.П001800001230 = Макс(ЛистИПродолжение.П001800001190 - ЛистИПродолжение.П001800001200 - ЛистИПродолжение.П001800001210 - ЛистИПродолжение.П001800001220, 0);
	
	ЛистИПродолжение.П001800001240 = Макс(ЛистИПродолжение.П001800001200 + ЛистИПродолжение.П001800001210 - ЛистИПродолжение.П001800001190, 0);
	
	ЛистИПродолжение.П001800001290 = Макс(ЛистИПродолжение.П001800001250 - ЛистИПродолжение.П001800001260 - ЛистИПродолжение.П001800001270 - ЛистИПродолжение.П001800001280, 0);
	
	ЛистИПродолжение.П001800001300 = Макс(ЛистИПродолжение.П001800001260 + ЛистИПродолжение.П001800001270 - ЛистИПродолжение.П001800001250, 0);
	
	ЛистИПродолжение.П001800001330 = Макс(ЛистИПродолжение.П001800001310 - ЛистИПродолжение.П001800001320, 0);
	
	ЛистИПродолжение.П001800001340 = Макс(ЛистИПродолжение.П001800001320 - ЛистИПродолжение.П001800001310, 0);
	
	ЛистИПродолжение.П001800001350 = ЛистИ.П001700001010
									+ ЛистИ.П001700001070
									+ ЛистИ.П001700001130
									+ ЛистИПродолжение.П001800001190
									+ ЛистИПродолжение.П001800001250
									+ ЛистИПродолжение.П001800001310;
	
	ЛистИПродолжение.П001800001360 = ЛистИ.П001700001050
									+ ЛистИ.П001700001110
									+ ЛистИ.П001700001170
									+ ЛистИПродолжение.П001800001230
									+ ЛистИПродолжение.П001800001290
									+ ЛистИПродолжение.П001800001330;
	
	ЛистИПродолжение.П001800001370 = Макс(ЛистИПродолжение.П001800001350 - ЛистИПродолжение.П001800001360, 0);
	
	Если Форма.ТабличныйДокумент.Области.Найти("П001800001370") <> Неопределено Тогда
		
		Форма.ТабличныйДокумент.Области["П001800001230"].Значение = ЛистИПродолжение.П001800001230;
		Форма.ТабличныйДокумент.Области["П001800001240"].Значение = ЛистИПродолжение.П001800001240;
		Форма.ТабличныйДокумент.Области["П001800001290"].Значение = ЛистИПродолжение.П001800001290;
		Форма.ТабличныйДокумент.Области["П001800001300"].Значение = ЛистИПродолжение.П001800001300;
		Форма.ТабличныйДокумент.Области["П001800001330"].Значение = ЛистИПродолжение.П001800001330;
		Форма.ТабличныйДокумент.Области["П001800001340"].Значение = ЛистИПродолжение.П001800001340;
		Форма.ТабличныйДокумент.Области["П001800001350"].Значение = ЛистИПродолжение.П001800001350;
		Форма.ТабличныйДокумент.Области["П001800001360"].Значение = ЛистИПродолжение.П001800001360;
		Форма.ТабличныйДокумент.Области["П001800001370"].Значение = ЛистИПродолжение.П001800001370;
		
	КонецЕсли;
		
#КонецОбласти

	ИначеЕсли Не ЗначениеЗаполнено(ИмяЛиста) Тогда
		
		РассчитатьИтогиЛиста(Форма, "ЛистБ");
		РассчитатьИтогиЛиста(Форма, "ЛистВ");
		РассчитатьИтогиЛиста(Форма, "ЛистГ");
		РассчитатьИтогиЛиста(Форма, "ЛистД2");
		РассчитатьИтогиЛиста(Форма, "ЛистЕ2");
		РассчитатьИтогиЛиста(Форма, "ЛистЕ1");
		РассчитатьИтогиЛиста(Форма, "ЛистЖ");
		РассчитатьИтогиЛиста(Форма, "ЛистЗ");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение2");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение3");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение4");
		РассчитатьИтогиЛиста(Форма, "ЛистИ");
		РассчитатьИтогиЛиста(Форма, "ЛистИПродолжение");
		РассчитатьИтогиЛиста(Форма, "ЛистД1");
		
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСводныеТаблицы(Форма)

	//Очищаем покатазети
	Форма.СводДоходов.Очистить();
	Форма.СводВычетов.Очистить();
	ОКТМОналогоплательщика = "";
	
	// Перебираем строки Листа А:
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистА Цикл
		
		Если Лист.Данные.Количество() = 0 ИЛИ Лист.ДанныеДопСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для Каждого СтрокаЛиста Из Лист.ДанныеДопСтрок[0].Значение Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛиста.П000300001070) Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокаДохода = Форма.СводДоходов.Добавить();
			Если СтрокаЛиста.П000300001020 = "06" ИЛИ СтрокаЛиста.П000300001020 = "03"
				ИЛИ СтрокаЛиста.П000300001100 <> 0 Тогда
				СтрокаДохода.КБК = "18210102010011000110"; //доход от налогового агента
			Иначе
				СтрокаДохода.КБК = "18210102030011000110"; //доход с самостоятельным исчислением и уплатой налога
			КонецЕсли; 
			СтрокаДохода.ОКТМО            = СтрокаЛиста.П000300001050;
			СтрокаДохода.Ставка           = СтрокаЛиста.П000300001010;
			СтрокаДохода.СуммаДохода      = СтрокаЛиста.П000300001070;
			СтрокаДохода.НачисленоНалога  = СтрокаЛиста.П000300001090;
			СтрокаДохода.УдержаноНалога   = СтрокаЛиста.П000300001100;
			
		КонецЦикла; 
		
	КонецЦикла;
	
	// Перебираем строки Листа Б:
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистБ Цикл
		
		Если Лист.Данные.Количество() = 0 ИЛИ Лист.ДанныеДопСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтавкаНалога = Лист.Данные[0].Значение.П000400001001;
		
		Для Каждого СтрокаЛиста Из Лист.ДанныеДопСтрок[0].Значение Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛиста.П000400001070) Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокаДохода = Форма.СводДоходов.Добавить();
			СтрокаДохода.КБК = "18210102030011000110"; // доход с самостоятельным исчислением и уплатой налога
			СтрокаДохода.ОКТМО            = ОКТМОналогоплательщика;
			СтрокаДохода.Ставка           = СтавкаНалога;
			СтрокаДохода.СуммаДохода      = СтрокаЛиста.П000400001070;
			СтрокаДохода.НачисленоНалога  = СтрокаЛиста.П000400001120;
			
			СтрокаДохода.НалогПринимаемыйКУчету   = СтрокаЛиста.П000400001130;
			
		КонецЦикла; 
		
	КонецЦикла;

	// Перебираем строки Листа В:
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистВ Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		Если СтрокаЛиста.П000500001030 = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаДохода = Форма.СводДоходов.Добавить();
		СтрокаДохода.КБК = "18210102020011000110"; // доход от предпринимательской деятельности
		СтрокаДохода.ОКТМО            = ОКТМОналогоплательщика;
		СтрокаДохода.Ставка           = 13;
		СтрокаДохода.СуммаДохода      = СтрокаЛиста.П000500001030;
		СтрокаДохода.НачисленоНалога  = Окр((СтрокаДохода.СуммаДохода - СтрокаЛиста.П000500001040 - СтрокаЛиста.П000500001100) * 0.13, 0);
		Если СтрокаЛиста.Свойство("П000500001140") Тогда
			// Итоговые показатели находятся только на последнем листе
			СтрокаДохода.УплаченоНалога   = СтрокаЛиста.П000500001140;
		КонецЕсли; 
		
		// Добавляем строку вычета
		// - подпункт 3.2 Листа В
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистВ.120";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000500001100 + СтрокаЛиста.П000500001040;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		
	КонецЦикла;

	// Заполняем таблицу вычетов:
	
	// - пункт 9 Листа Г
	Если Форма.СтруктураДанныхЛистГ.П000600001200 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистГ.200";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистГ.П000600001200;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
	КонецЕсли; 
	
	// - пункт 10.2 Листа Г
	Если Форма.СтруктураДанныхЛистГ.П000600001220 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистГ.200";
		СтрокаВычета.Ставка                  = 35;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистГ.П000600001220;
		СтрокаВычета.СуммаВычетаДляД1        = 0;
	КонецЕсли; 
	
	// - пункт 4 Листа Е1
	Если Форма.СтруктураДанныхЛистЕ1.П000900001190 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЕ1.190";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистЕ1.П000900001190;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
	КонецЕсли; 
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЕ2 Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		// Вычет, предоставленный налоговым агентом
		// - пункт 3 Листа Е2
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЕ2.130";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П001000001080 + СтрокаЛиста.П001000001110;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		
	КонецЦикла; 
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистД1 Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		// Итоговые показатели есть только на последнем листе, если есть один,
		// то есть и остальные, в противном случае пропускаем эту страницу
		Если СтрокаЛиста.Свойство("П000700001180") Тогда
			// - подпункт 2.5 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.180";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001180;
			СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
			
			// - подпункт 2.6 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.190";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001190;
			СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
			
			// - подпункт 2.8 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.210";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001210;
			СтрокаВычета.СуммаВычетаДляД1        = 0;
			
			// - подпункт 2.9 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.220";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001220;
			СтрокаВычета.СуммаВычетаДляД1        = 0;
		КонецЕсли;
		
	КонецЦикла; 
	
	// - пункте 4 листа Д2
	Если Форма.СтруктураДанныхЛистД2.П000800001190 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистД2.190";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистД2.П000800001190;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
	КонецЕсли; 
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЖ Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		// - подпункт 6.1 Листа Ж
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЖ.110";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П001100001110;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		
	КонецЦикла; 
	
	// - подпункты 11.3 Листа 3
	Если Форма.СтруктураДанныхЛистЗПродолжение4.П001600001533 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЗ.533";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистЗПродолжение4.П001600001533;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
	КонецЕсли; 
	
	// - пункт 7.3 листа И
	Если Форма.СтруктураДанныхЛистИПродолжение.П001800001370 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистИ.370";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистИПродолжение.П001800001370;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СуммаДоходаДляИмущественногоВычета(Форма)

	Результат = 0;
	
	// Определяем сумму дохода по ставке 13%
	СтрокиДохода = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка", 13));
	Для Каждого СтрокаДохода Из СтрокиДохода Цикл
		Результат = Результат + СтрокаДохода.СуммаДохода;
	КонецЦикла; 
	
	// Вычитаем суммы вычетов, принимаемых до имущественного вычета 
	Результат = Результат - Форма.СводВычетов.Итог("СуммаВычетаДляД1");

	Возврат Макс(Результат, 0);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаОблагаемогоДоходаПоСтавке(Форма, Ставка)

	// Вычисляет и возвращает сумму, соответствующую п. 3 раздела 2
	Результат = 0;
	
	СтрокиДохода = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка", Ставка));
	Для Каждого СтрокаДохода Из СтрокиДохода Цикл
		Результат = Результат + СтрокаДохода.СуммаДохода;
	КонецЦикла; 
	
	Если Ставка = 13 Тогда
		
		Для Каждого СтрокаВычета Из Форма.СводВычетов Цикл
			Если Лев(СтрокаВычета.ВидВычета, 5) = "ЛистГ" Тогда
				Результат = Результат - СтрокаВычета.СуммаВычетаДляРаздела2;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат Макс(Результат, 0);

КонецФункции

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт 
	
	Расчет(ЭтаФорма, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

// Выполняет провреку значений и пересчет зависимых показателей на заданной странице отчета
// Параметры:
//  Форма - управляемая форма - форма этого отчета
//	ИмяОбласти - Строка - имя раздела или листа декларации
//
&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяРаздела = "", ИмяОбласти = "")
	
	Перем ТаблицаБлока, ТаблицаРаздела;
	
	Если (Форма.СтруктураРеквизитовФормы.мРежимПечати) Тогда
		Возврат; // служебный вызов в процессе печати
	КонецЕсли;
	
	Если (Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет) Тогда
		Возврат; // отключен режим авторасчета
	КонецЕсли;
	
	ИмяОбласти13 = Лев(ИмяОбласти, 13); // имя области без номера строки
	
	// Если пересчитывается текущий раздел, нужно обновить значения в табличном документе
	ОбновитьТабличныйДокумент = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	// Проверки значений и пересчет связанных НЕ итоговых реквизитов
	Если ИмяРаздела = "ЛистА" Тогда
		
#Область Пересчет_ЛистА

		НомерСтрокиСтрокой  = Сред(ИмяОбласти, 15);

		// При изменении ставки или суммы облагаемого дохода пересчитываем сумму налога
		Если ИмяОбласти13 = "П000300001010" ИЛИ ИмяОбласти13 = "П000300001080" Тогда
			
			П000300001090 = Окр(Форма.ТабличныйДокумент.Области["П000300001080_" + НомерСтрокиСтрокой].Значение
						* Форма.ТабличныйДокумент.Области["П000300001010_" + НомерСтрокиСтрокой].Значение / 100, 0); 
						
			Форма.ТабличныйДокумент.Области["П000300001090_" + НомерСтрокиСтрокой].Значение = П000300001090;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000300001090_" + НомерСтрокиСтрокой, П000300001090);
			
		КонецЕсли; 
		
#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистБ" Тогда
		
#Область Пересчет_ЛистБ

		НомерСтрокиСтрокой  = Сред(ИмяОбласти, 15);
		
		// Проверка необходимости пересчитать сумму дохода из валюты в рубли
		ПересчитыватьДоходВруб = ИмяОбласти13 = "П000400001030" // Код валюты
			Или ИмяОбласти13 = "П000400001040" // дата получения дохода
			Или ИмяОбласти13 = "П000400001050" // курс валюты на дату получения дохода
			Или ИмяОбласти13 = "П000400001060"; // сумма дохода в валюте
			
		Если ПересчитыватьДоходВруб Тогда
			
			Курс         = Форма.ТабличныйДокумент.Области["П000400001050_" + НомерСтрокиСтрокой].Значение;
			СуммаВВалюте = Форма.ТабличныйДокумент.Области["П000400001060_" + НомерСтрокиСтрокой].Значение;
			
			Если ЗначениеЗаполнено(Курс) И ЗначениеЗаполнено(СуммаВВалюте) Тогда
				ДоходВРублях = Окр(СуммаВВалюте * Курс, 2);
				Форма.ТабличныйДокумент.Области["П000400001070_" + НомерСтрокиСтрокой].Значение = ДоходВРублях;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001070_" + НомерСтрокиСтрокой, ДоходВРублях);
			КонецЕсли; 
			
		КонецЕсли; 
		
		// Проверка необходимости пересчитать сумму налога из валюты в рубли
		ПересчитыватьНалогВРуб = ИмяОбласти13 = "П000400001030" // Код валюты
			Или ИмяОбласти13 = "П000400001080" // дата уплаты налога
			Или ИмяОбласти13 = "П000400001090" // курс валюты на дату уплаты налога
			Или ИмяОбласти13 = "П000400001100"; // сумма налога в валюте
			
		Если ПересчитыватьНалогВРуб Тогда
			
			Курс         = Форма.ТабличныйДокумент.Области["П000400001090_" + НомерСтрокиСтрокой].Значение;
			СуммаВВалюте = Форма.ТабличныйДокумент.Области["П000400001100_" + НомерСтрокиСтрокой].Значение;
			
			Если ЗначениеЗаполнено(Курс) И ЗначениеЗаполнено(СуммаВВалюте) Тогда
				НалогВРублях = Окр(СуммаВВалюте * Курс, 2); 
				Форма.ТабличныйДокумент.Области["П000400001110_" + НомерСтрокиСтрокой].Значение = НалогВРублях;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001110_" + НомерСтрокиСтрокой, НалогВРублях);
			КонецЕсли; 
			
		КонецЕсли; 
		
		// Расчет суммы налога, начисленного в РФ.
		СтавкаНалога = Форма.ТабличныйДокумент.Области["П000400001001"].Значение;
		
		Если ИмяОбласти13 = "П000400001001" Тогда // Ставка налога на листе
			
			// Пересчитываем все суммы налогов на текущем листе
			АктивныеСтраницы = Форма.ТаблицаСтраницыЛистБ.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			АктивнаяСтраница = ?(АктивныеСтраницы.Количество() = 0, Неопределено, АктивныеСтраницы[0]);
			
			Если АктивнаяСтраница <> Неопределено Тогда
				
				Для Каждого ЗначениеДобСтрок Из АктивнаяСтраница.ДанныеДопСтрок Цикл
					
					СчетчикСтрок = 0;
					Для Каждого ЭлементСтроки Из ЗначениеДобСтрок.Значение Цикл
						
						СчетчикСтрок = СчетчикСтрок + 1;
						НалогВРФ = Окр(ЭлементСтроки.П000400001070 * СтавкаНалога / 100, 2);
						Форма.ТабличныйДокумент.Области["П000400001120_" + СчетчикСтрок].Значение = НалогВРФ;
						СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001120_" + СчетчикСтрок, НалогВРФ);
						
						// Сумма принимаемого налога не может превышать сумму уплаченного
						Если ЭлементСтроки.П000400001130 > 0 Тогда
							ПринимаемаяСумма = Мин(ЭлементСтроки.П000400001120, ЭлементСтроки.П000400001110);
							Форма.ТабличныйДокумент.Области["П000400001130_" + СчетчикСтрок].Значение = ПринимаемаяСумма;
							СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001130_" + СчетчикСтрок, ПринимаемаяСумма);
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЦикла; 
				
			КонецЕсли;
			
		ИначеЕсли ПересчитыватьДоходВруб ИЛИ ИмяОбласти13 = "П000400001070" Тогда
			
			НалогВРФ = Окр(Форма.ТабличныйДокумент.Области["П000400001070_" + НомерСтрокиСтрокой].Значение * СтавкаНалога / 100, 2);
			Форма.ТабличныйДокумент.Области["П000400001120_" + НомерСтрокиСтрокой].Значение = НалогВРФ;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001120_" + НомерСтрокиСтрокой, НалогВРФ);
			
		КонецЕсли; 

		Если (ПересчитыватьДоходВруб ИЛИ ПересчитыватьНалогВРуб ИЛИ ИмяОбласти13 = "П000400001130" ИЛИ ИмяОбласти13 = "П000400001120" ИЛИ ИмяОбласти13 = "П000400001070")
				И НомерСтрокиСтрокой <> "" И Форма.ТабличныйДокумент.Области["П000400001130_" + НомерСтрокиСтрокой].Значение > 0 Тогда
			
			Значение = Мин(Форма.ТабличныйДокумент.Области["П000400001130_" + НомерСтрокиСтрокой].Значение, Форма.ТабличныйДокумент.Области["П000400001120_" + НомерСтрокиСтрокой].Значение);
			
			Форма.ТабличныйДокумент.Области["П000400001130_" + НомерСтрокиСтрокой].Значение = Значение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001130_" + НомерСтрокиСтрокой, Значение);
			
		КонецЕсли;
		
#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистВ" Тогда
		
#Область Пересчет_ЛистВ
		
		ОбновлятьФактическиеРасходы = ИмяОбласти13 = "П000500001050" // Матер. расходы
									Или ИмяОбласти13 = "П000500001060" // амморт. начилсения
									Или ИмяОбласти13 = "П000500001070" // выплаты физлицам
									Или ИмяОбласти13 = "П000500001090"; // прочие расходы
		
		Если ИмяОбласти13 = "П000500001040" И Форма.ТабличныйДокумент.Области["П000500001040"].Значение = 0 Тогда 
			
			// очищаем фактические расходы
			Форма.ТабличныйДокумент.Области["П000500001050"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001050", 0);
			Форма.ТабличныйДокумент.Области["П000500001060"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			Форма.ТабличныйДокумент.Области["П000500001070"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			Форма.ТабличныйДокумент.Области["П000500001080"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			Форма.ТабличныйДокумент.Области["П000500001090"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			ОбновлятьФактическиеРасходы = Истина;
			
		ИначеЕсли ИмяОбласти13 = "П000500001080" Тогда // Выплаты по трудовым договорам
			
			// Проверим сумму общих выплат физическим лицам
			Если Форма.ТабличныйДокумент.Области["П000500001070"].Значение < Форма.ТабличныйДокумент.Области["П000500001080"].Значение Тогда
				
				Форма.ТабличныйДокумент.Области["П000500001070"].Значение = Форма.ТабличныйДокумент.Области["П000500001080"].Значение;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001070", Форма.ТабличныйДокумент.Области["П000500001070"].Значение);
				ОбновлятьФактическиеРасходы = Истина;
				
			КонецЕсли; 
			
		ИначеЕсли ИмяОбласти13 = "П000500001070" Тогда // все выплаты физическим лицам
			
			// Проверим сумму выплат по трудовым договорам
			Если Форма.ТабличныйДокумент.Области["П000500001070"].Значение < Форма.ТабличныйДокумент.Области["П000500001080"].Значение Тогда
				
				Форма.ТабличныйДокумент.Области["П000500001080"].Значение = Форма.ТабличныйДокумент.Области["П000500001070"].Значение;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001080", Форма.ТабличныйДокумент.Области["П000500001080"].Значение);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		ВсегоФактРасходы = Форма.ТабличныйДокумент.Области["П000500001050"].Значение + Форма.ТабличныйДокумент.Области["П000500001060"].Значение
					+ Форма.ТабличныйДокумент.Области["П000500001070"].Значение + Форма.ТабличныйДокумент.Области["П000500001090"].Значение;
					
		Если ОбновлятьФактическиеРасходы ИЛИ 
				ИмяОбласти13 = "П000500001040" И Форма.ТабличныйДокумент.Области["П000500001040"].Значение < ВсегоФактРасходы Тогда

			Форма.ТабличныйДокумент.Области["П000500001040"].Значение = ВсегоФактРасходы;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001040", ВсегоФактРасходы);
			
			
		КонецЕсли; 
		
		ВсегоФактРасходы = Макс(ВсегоФактРасходы, Форма.ТабличныйДокумент.Области["П000500001040"].Значение);
		
		Если ВсегоФактРасходы = 0 Тогда
			
			// Если не указаны фактические расходы, то считаем расходы по норме
			Форма.ТабличныйДокумент.Области["П000500001100"].Значение = 
					Окр(Форма.ТабличныйДокумент.Области["П000500001030"].Значение * 0.2, 2);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001100", Форма.ТабличныйДокумент.Области["П000500001100"].Значение);
			
		ИначеЕсли Форма.ТабличныйДокумент.Области["П000500001100"].Значение <> 0 Тогда
			
			// Если указаны фактические расходы, расходы по норме обнуляем
			Форма.ТабличныйДокумент.Области["П000500001100"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001100", 0);
			
		КонецЕсли; 

#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистГ" Тогда
		
#Область Пересчет_ЛистГ

		Если (ИмяОбласти13 = "П000600001010" ИЛИ  ИмяОбласти13 = "П000600001020") // Мат.помощь на рождение
				И Форма.ТабличныйДокумент.Области["П000600001020"].Значение > Форма.ТабличныйДокумент.Области["П000600001010"].Значение Тогда
				
			Форма.ТабличныйДокумент.Области["П000600001020"].Значение = Форма.ТабличныйДокумент.Области["П000600001010"].Значение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001020", Форма.ТабличныйДокумент.Области["П000600001020"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001030" ИЛИ ИмяОбласти13 = "П000600001040" 
				И Форма.ТабличныйДокумент.Области["П000600001040"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001030"].Значение, 4000) Тогда // Мат.помощь на выход на пенсию
			
			Форма.ТабличныйДокумент.Области["П000600001040"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001030"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001040", Форма.ТабличныйДокумент.Области["П000600001040"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001050" ИЛИ ИмяОбласти13 = "П000600001060"
				И Форма.ТабличныйДокумент.Области["П000600001060"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001050"].Значение, 4000) Тогда // Мат.помощь от обществ. организаций инвалидов
			
			Форма.ТабличныйДокумент.Области["П000600001060"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001050"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001060", Форма.ТабличныйДокумент.Области["П000600001060"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001070" ИЛИ ИмяОбласти13 = "П000600001080"
				И Форма.ТабличныйДокумент.Области["П000600001080"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001070"].Значение, 4000) Тогда // Подарки от ИП и организаций
			
			Форма.ТабличныйДокумент.Области["П000600001080"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001070"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001080", Форма.ТабличныйДокумент.Области["П000600001080"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001090" ИЛИ ИмяОбласти13 = "П000600001100"
				И Форма.ТабличныйДокумент.Области["П000600001100"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001090"].Значение, 4000)Тогда //Призы на конкурсах и соревнованиях по решениям правительства РФ
			
			Форма.ТабличныйДокумент.Области["П000600001100"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001090"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001100", Форма.ТабличныйДокумент.Области["П000600001100"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001110" ИЛИ ИмяОбласти13 = "П000600001120"
				И Форма.ТабличныйДокумент.Области["П000600001120"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001110"].Значение, 4000) Тогда // Стоимость медикаментов
			
			Форма.ТабличныйДокумент.Области["П000600001120"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001110"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001120", Форма.ТабличныйДокумент.Области["П000600001120"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001130" ИЛИ ИмяОбласти13 = "П000600001140"
				И Форма.ТабличныйДокумент.Области["П000600001140"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001130"].Значение, 10000) Тогда // Помощь ветеранам ВОВ
			
			Форма.ТабличныйДокумент.Области["П000600001140"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001130"].Значение, 10000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001140", Форма.ТабличныйДокумент.Области["П000600001140"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001150" ИЛИ ИмяОбласти13 = "П000600001160"
				И Форма.ТабличныйДокумент.Области["П000600001160"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001150"].Значение, 12000) Тогда // Доп.взносы на накопительную часть пенсии
			
			Форма.ТабличныйДокумент.Области["П000600001160"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001150"].Значение, 12000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001160", Форма.ТабличныйДокумент.Области["П000600001160"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001210" ИЛИ ИмяОбласти13 = "П000600001220"
				И Форма.ТабличныйДокумент.Области["П000600001220"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001210"].Значение, 4000) Тогда // Выигрыши
			
			Форма.ТабличныйДокумент.Области["П000600001220"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001210"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001220", Форма.ТабличныйДокумент.Области["П000600001220"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001170" И Форма.ТабличныйДокумент.Области["П000600001170"].Значение > 12 Тогда // Кол-во месяцев
			
			Форма.ТабличныйДокумент.Области["П000600001170"].Значение = 12;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001170", 12);
			
		ИначеЕсли ИмяОбласти13 = "П000600001190" И Форма.ТабличныйДокумент.Области["П000600001190"].Значение > Форма.ТабличныйДокумент.Области["П000600001180"].Значение Тогда // Не подлежит налогообложению доход в натуральной форме
			
			Форма.ТабличныйДокумент.Области["П000600001190"].Значение = Форма.ТабличныйДокумент.Области["П000600001180"].Значение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001190", Форма.ТабличныйДокумент.Области["П000600001190"].Значение);
			
		КонецЕсли; 
		
#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистД1" Тогда
		
#Область Пересчет_ЛистД1

		// Для определения допустимых пределов вычетов подсчитаем расходы, указанные на других (неактивных) страницах
		ПоказателиНеактивныхЛистов = Новый Структура("НаПриобретение, НаПроценты", 0, 0);
		Для Каждого СтраницаЛистД1 Из Форма.ТаблицаСтраницыЛистД1 Цикл
			
			Если СтраницаЛистД1.АктивнаяСтраница Тогда
				Продолжить;
			КонецЕсли; 
			
			ЛистД1 = СтраницаЛистД1.Данные[0].Значение;
			
			ПоказателиНеактивныхЛистов.НаПриобретение = ПоказателиНеактивныхЛистов.НаПриобретение + ЛистД1.П000700001120;
			
			// Предел на вычет по процентам действует только для объектов недвижимости, приобретенных с 01.01.2014 
			Если НЕ ЗначениеЗаполнено(ЛистД1.П000700001070) И НЕ ЗначениеЗаполнено(ЛистД1.П000700001080)
				ИЛИ ЗначениеЗаполнено(ЛистД1.П000700001070) И Год(ЛистД1.П000700001070) = 2014
				ИЛИ ЗначениеЗаполнено(ЛистД1.П000700001080) И Год(ЛистД1.П000700001080) = 2014 Тогда
				ПоказателиНеактивныхЛистов.НаПроценты = ПоказателиНеактивныхЛистов.НаПроценты + ЛистД1.П000700001130;
			КонецЕсли; 
			
		КонецЦикла; 
		
		ОстатокПределаНаПриобретение = Макс(2000000 - ПоказателиНеактивныхЛистов.НаПриобретение, 0);
		
		// Предел на вычет по процентам действует только для объектов недвижимости, приобретенных с 01.01.2014 
		Если Форма.ТаблицаСтраницыЛистД1.Количество() > 1 ИЛИ НЕ ЗначениеЗаполнено(Форма.ТабличныйДокумент.Области["П000700001110"].Значение) 
					ИЛИ Форма.ТабличныйДокумент.Области["П000700001110"].Значение >= 2014 Тогда
			ОстатокПределаНаПроценты     = Макс(3000000 - ПоказателиНеактивныхЛистов.НаПроценты, 0);
		Иначе
			ОстатокПределаНаПроценты = 0;
		КонецЕсли; 
		
		
		Если ИмяОбласти13 = "П000700001120"  // сумма раходов на приобретение
				И Форма.ТабличныйДокумент.Области["П000700001120"].Значение > ОстатокПределаНаПриобретение Тогда
				
			// суммма фактических расходов не может превышать установленный законом предел
			Форма.ТабличныйДокумент.Области["П000700001120"].Значение = ОстатокПределаНаПриобретение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000700001120", Форма.ТабличныйДокумент.Области["П000700001120"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000700001130"  // сумма раходов на приобретение
				И ОстатокПределаНаПроценты > 0 И Форма.ТабличныйДокумент.Области["П000700001130"].Значение > ОстатокПределаНаПроценты Тогда
			
			// суммма фактически уплаченных процентов не может превышать установленный законом предел
			Форма.ТабличныйДокумент.Области["П000700001130"].Значение = ОстатокПределаНаПроценты;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000700001130", Форма.ТабличныйДокумент.Области["П000700001130"].Значение);
			
		КонецЕсли; 
		
#КонецОбласти

	ИначеЕсли ИмяРаздела = "ЛистД2" Тогда
		
#Область Пересчет_ЛистД2

		ПределНормыВычетаНедвижимости     = 1000000;
		ПределНормыВычетаПрочегоИмущества =  250000;
		//
		Если ИмяОбласти13 = "П000800001010" // Доход от продажи недвижимости, находившейся в собственности менее 3 лет
			ИЛИ ИмяОбласти13 = "П000800001020"  // Вычет из доходов от продажи недвижимости, находившейся в собственности менее 3 лет
				И Форма.ТабличныйДокумент.Области["П000800001020"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001010"].Значение, ПределНормыВычетаНедвижимости)
			Тогда 
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001010"].Значение, ПределНормыВычетаНедвижимости);
			Форма.ТабличныйДокумент.Области["П000800001020"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001020", СуммаВычета);
			
		ИначеЕсли ИмяОбласти13 = "П000800001030" // Доход от продажи долей недвижимости, находившейся в собственности менее 3 лет
			ИЛИ ИмяОбласти13 = "П000800001040"  // Вычет из доходов от продажи долей недвижимости, находившейся в собственности менее 3 лет
				И Форма.ТабличныйДокумент.Области["П000800001040"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001030"].Значение, ПределНормыВычетаНедвижимости) Тогда
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001030"].Значение, ПределНормыВычетаНедвижимости);
			Форма.ТабличныйДокумент.Области["П000800001040"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001040", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001070" ИЛИ ИмяОбласти13 = "П000800001080")  // Фактические расходы по проданной недвижимости
				И Форма.ТабличныйДокумент.Области["П000800001080"].Значение > Форма.ТабличныйДокумент.Области["П000800001070"].Значение Тогда
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001080"].Значение, Форма.ТабличныйДокумент.Области["П000800001070"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001080"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001080", СуммаВычета);
			
		ИначеЕсли ИмяОбласти13 = "П000800001110" // Доход от продажи прочего имущества для вычета по норме
			ИЛИ ИмяОбласти13 = "П000800001120"  // Вычет по норме из доходов от продажи прочего имущества 
				И Форма.ТабличныйДокумент.Области["П000800001120"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001110"].Значение, ПределНормыВычетаПрочегоИмущества)
				Тогда
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001110"].Значение, ПределНормыВычетаПрочегоИмущества);
			Форма.ТабличныйДокумент.Области["П000800001120"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001120", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001130" ИЛИ ИмяОбласти13 = "П000800001140") // Фактические расходы по проданному прочему имуществу
				И Форма.ТабличныйДокумент.Области["П000800001140"].Значение > Форма.ТабличныйДокумент.Области["П000800001130"].Значение Тогда
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001130"].Значение, Форма.ТабличныйДокумент.Области["П000800001140"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001140"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001140", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001170" ИЛИ ИмяОбласти13 = "П000800001180") // Фактические расходы по проданному прочему имуществу
				И Форма.ТабличныйДокумент.Области["П000800001180"].Значение > Форма.ТабличныйДокумент.Области["П000800001170"].Значение Тогда
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001170"].Значение, Форма.ТабличныйДокумент.Области["П000800001180"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001180"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001180", СуммаВычета);
			
		КонецЕсли; 
		
#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистЕ1" Тогда
		
#Область Пересчет_ЛистЕ1

		Если ИмяОбласти13 = "П000900001010" // 3000 х кол-во месяцев
				И Форма.ТабличныйДокумент.Области["П000900001010"].Значение > 36000 Тогда 
				
			Форма.ТабличныйДокумент.Области["П000900001010"].Значение = 36000;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000900001010", Форма.ТабличныйДокумент.Области["П000900001010"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000900001020" // 500 х кол-во месяцев
				И Форма.ТабличныйДокумент.Области["П000900001020"].Значение > 6000 Тогда 
				
			Форма.ТабличныйДокумент.Области["П000900001020"].Значение = 6000;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000900001020", Форма.ТабличныйДокумент.Области["П000900001020"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000900001030" // количество месяцев
				И Форма.ТабличныйДокумент.Области["П000900001030"].Значение > 12 Тогда 
				
			Форма.ТабличныйДокумент.Области["П000900001030"].Значение = 12;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000900001120", Форма.ТабличныйДокумент.Области["П000900001120"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000900001090" И Форма.ТабличныйДокумент.Области["П000900001090"].Значение > 0 Тогда 
			
			ЗаполнитьСводныеТаблицы(Форма);
			ОблагаемыйДоход = Окр(СуммаОблагаемогоДоходаПоСтавке(Форма, 13) * 0.25, 2);
			
			Если Форма.ТабличныйДокумент.Области["П000900001090"].Значение > ОблагаемыйДоход Тогда
				Форма.ТабличныйДокумент.Области["П000900001090"].Значение = ОблагаемыйДоход;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000900001090", Форма.ТабличныйДокумент.Области["П000900001090"].Значение);
			КонецЕсли; 
			
		КонецЕсли;
		
#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистЕ2" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
	
	ИначеЕсли ИмяРаздела = "ЛистЖ" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
		
	ИначеЕсли ИмяРаздела = "ЛистЗ" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
		
	ИначеЕсли ИмяРаздела = "ЛистЗПродолжение" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
		
	ИначеЕсли ИмяРаздела = "ЛистЗПродолжение2" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
	
	ИначеЕсли ИмяРаздела = "ЛистЗПродолжение3" Тогда
		
#Область Пересчет_ЛистЗПродолжение3

	ЛистЗПродолжение3 = Форма.СтруктураДанныхЛистЗПродолжение3;
	ЛистЗ = Форма.СтруктураДанныхЛистЗ;
	ЛистЗПродолжение = Форма.СтруктураДанныхЛистЗПродолжение;
	
	ЛистЗПродолжение3.П001500001409 = Макс(ЛистЗПродолжение3.П001500001407 - ЛистЗПродолжение3.П001500001408, 0);
	Форма.ТабличныйДокумент.Области["П001500001409"].Значение = ЛистЗПродолжение3.П001500001409;
	
	ЛистЗПродолжение3.П001500001410 = Макс(ЛистЗПродолжение3.П001500001408 - ЛистЗПродолжение3.П001500001407, 0);
	Форма.ТабличныйДокумент.Области["П001500001410"].Значение = ЛистЗПродолжение3.П001500001410;
	
#КонецОбласти
		
	ИначеЕсли ИмяРаздела = "ЛистЗПродолжение4" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
		
	ИначеЕсли ИмяРаздела = "ЛистИ" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры
		
	ИначеЕсли ИмяРаздела = "ЛистИПродолжение" Тогда
		
		// только пересчет итогов, выполняется в конце процедуры

	ИначеЕсли ИмяРаздела = "Раздел2" Тогда
		
#Область Пересчет_Раздел2

		// Пересчет выполняется при выводе листа или при изменении ставки
		
		ЗаполнитьСводныеТаблицы(Форма);
		
		ТаблицаСтраницыРаздел2 = Форма.ТаблицаСтраницыРаздел2;
		Для Каждого ЛистСтраницы Из ТаблицаСтраницыРаздел2 Цикл
			Если ЛистСтраницы.АктивнаяСтраница Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
		
		Ставка = Форма.ТабличныйДокумент.Области.П000200001001.Значение;
		ЗаполнитьРасчтеныеДанныеРаздела2(Форма, ЛистСтраницы, ?(ЗначениеЗаполнено(Ставка), Число(Ставка), 0), Истина);

#КонецОбласти

	ИначеЕсли ИмяРаздела = "Раздел1" Тогда
		
#Область Пересчет_Раздел1

#КонецОбласти

	КонецЕсли; 
	
	// Пересчет итогов листа
	РассчитатьИтогиЛиста(Форма, ИмяРаздела);
	
	// Обновляем сводные таблицы
	ЗаполнитьСводныеТаблицы(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанныеВРаздел2()
	
	//Пересчитываем итоги всех листов
	РассчитатьИтогиЛиста(ЭтотОбъект, Неопределено);
	
	// Заполняем сводные таблицы итогов
	ЗаполнитьСводныеТаблицы(ЭтотОбъект);
	
	// Сначала в разделе 2 рассчитываются результаты в разрезе ставок
	ПодготовитьДанныеРаздела2(ЭтотОбъект);
	
	// Обновляем дерево разделов
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
	// Выводим макет в табличный документ
	ВывестиМакетВТаблДокНаСервере("Раздел2", 1, , , Истина);
	
	// Активизируем строку раздела в дереве
	Для Каждого СтрокаРаздела Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если СтрокаРаздела.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = СтрокаРаздела.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Модифицированность = Истина;
	
КонецПроцедуры	

// Заполняет страницу расчетными данными по указанной ставке
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРасчтеныеДанныеРаздела2(Форма, СтраницаРаздела, Ставка, ОбновлятьТабличныйДокумент = Ложь)

	ДанныеСтраницы    = СтраницаРаздела.Данные[0].Значение;
	
	ОКТМОНАлогоплательщика = Форма.СтруктураРеквизитовФормы.Октмо;
	
	// Обнуляем все значения страницы
	Для Каждого КлючИЗначение Из ДанныеСтраницы Цикл
			
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Число") Тогда
			ДанныеСтраницы[КлючИЗначение.Ключ] = 0;
		ИначеЕсли ТипЗнч(КлючИЗначение.Значение) = Тип("Дата") Тогда
			ДанныеСтраницы[КлючИЗначение.Ключ] = '00010101';
		ИначеЕсли ТипЗнч(КлючИЗначение.Значение) = Тип("Строка") Тогда
			ДанныеСтраницы[КлючИЗначение.Ключ] = "";
		Иначе
			ДанныеСтраницы[КлючИЗначение.Ключ] = Неопределено;
		КонецЕсли; 
		
	КонецЦикла; 
	
	// Устанавливаем ставку налога
	ДанныеСтраницы.П000200001001 = Число(Ставка);
	Если ЗначениеЗаполнено(Ставка) Тогда
		
		// Находим строки доходов по указанной ставке
		СтрокиДоходов = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка", Число(Ставка)));
		Если СтрокиДоходов.Количество() > 0  Тогда
			
			// Заполняем суммами полученного дохода и уплаченных (удержанных) налогов
			Для Каждого СтрокаДохода Из СтрокиДоходов Цикл
				
				//Если ЭтоАвтозаполнение Тогда
					ДанныеСтраницы.П000200001010 = ДанныеСтраницы.П000200001010 + СтрокаДохода.СуммаДохода;
					ДанныеСтраницы.П000200001080 = ДанныеСтраницы.П000200001080 + СтрокаДохода.УдержаноНалога;
				//КонецЕсли; 
				ДанныеСтраницы.П000200001100 = ДанныеСтраницы.П000200001100 + СтрокаДохода.УплаченоНалога;
				ДанныеСтраницы.П000200001120 = ДанныеСтраницы.П000200001120 + СтрокаДохода.НалогПринимаемыйКУчету;
				
			КонецЦикла; 
			
			// Заполняем суммами вычетов
			СтрокиВычетов = Форма.СводВычетов.НайтиСтроки(Новый Структура("Ставка", Число(Ставка)));
			Для Каждого СтрокаВычета Из СтрокиВычетов Цикл
				
				Если СтрокаВычета.ВидВычета = "ЛистГ.200" ИЛИ СтрокаВычета.ВидВычета = "ЛистГ.200" Тогда
					
					ДанныеСтраницы.П000200001020 = ДанныеСтраницы.П000200001020 + СтрокаВычета.СуммаВычетаДляРаздела2;
					
				ИначеЕсли СтрокаВычета.ВидВычета = "ЛистВ.120" ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.180"
					ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.190" ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.210"
					ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.220" ИЛИ СтрокаВычета.ВидВычета = "ЛистД2.190"
					ИЛИ СтрокаВычета.ВидВычета = "ЛистЕ1.190" ИЛИ СтрокаВычета.ВидВычета = "ЛистЕ2.130"
					ИЛИ СтрокаВычета.ВидВычета = "ЛистЖ.110" Тогда
					
					ДанныеСтраницы.П000200001040 = ДанныеСтраницы.П000200001040 + СтрокаВычета.СуммаВычетаДляРаздела2;
					
				ИначеЕсли СтрокаВычета.ВидВычета = "ЛистЗ.533" ИЛИ СтрокаВычета.ВидВычета = "ЛистИ.370" Тогда
					
					ДанныеСтраницы.П000200001050 = ДанныеСтраницы.П000200001050 + СтрокаВычета.СуммаВычетаДляРаздела2;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
			// Рассчитываем суммы и итоги
			ДанныеСтраницы.П000200001030 = ДанныеСтраницы.П000200001010 - ДанныеСтраницы.П000200001020;  // Облагаемый доход
			ДанныеСтраницы.П000200001060 = Макс(0, 
			ДанныеСтраницы.П000200001030 - ДанныеСтраницы.П000200001040 - ДанныеСтраницы.П000200001050); // Налогооблагаемая база
			ДанныеСтраницы.П000200001070 = Окр(ДанныеСтраницы.П000200001060 * ДанныеСтраницы.П000200001001 / 100, 0); // Начислено налога
			
			ДанныеСтраницы.П000200001130 = Макс(0, ДанныеСтраницы.П000200001070 - ДанныеСтраницы.П000200001080 - ДанныеСтраницы.П000200001090
			- ДанныеСтраницы.П000200001100 - ДанныеСтраницы.П000200001110 - ДанныеСтраницы.П000200001120);
			
			ДанныеСтраницы.П000200001140 = Макс(0, ДанныеСтраницы.П000200001080 + ДанныеСтраницы.П000200001090
			+ ДанныеСтраницы.П000200001100 + ДанныеСтраницы.П000200001110 - ДанныеСтраницы.П000200001070);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// Если страница активна, заполняем ячейки табличного документа
	ТабличныйДокумент = Форма.ТабличныйДокумент;
	Если ОбновлятьТабличныйДокумент И ТабличныйДокумент.Области.Найти("П000200001001") <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ДанныеСтраницы Цикл
			ТабличныйДокумент.Области[КлючИЗначение.Ключ].Значение = КлючИЗначение.Значение;
		КонецЦикла; 
	КонецЕсли; 

КонецПроцедуры
 
// Перезаполняет страницы Раздела 2
//	Для каждой ставки в сводной таблице доходов создаем отдельную страницу раздела 2, в которой вычисляем 
//	результат (к доплате или к возмещению).
//	Полученный результат распределяем в колонке "РезультатРасчетов" таблицы "СводДоходов" по строкам с рассчитанной ставкой,
//	т.к. Раздел 2 должен заполняться уже не по ставкам, а по сочетанию КБК и ОКТМО
&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьДанныеРаздела2(Форма)
	
	ТаблицаСтраницыРаздел2 = Форма.ТаблицаСтраницыРаздел2;
	
	ОбразецСтруктуры = Новый Структура(Новый ФиксированнаяСтруктура(ТаблицаСтраницыРаздел2[0].Данные[0].Значение));
	Для Каждого ЭлементСтруктуры Из ОбразецСтруктуры Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Число") Тогда
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = 0;
		Иначе
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = "";
		КонецЕсли; 
	КонецЦикла; 
	
	ТаблицаСтраницыРаздел2.Очистить();
	
	Для Каждого СтрокаСтавки Из Форма.мСтавкиНалога Цикл
		
		Если ПустаяСтрока(СтрокаСтавки.Код) Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокиДоходов = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка", Число(СтрокаСтавки.Код)));
		Если СтрокиДоходов.Количество() = 0  Тогда
			Продолжить;
		КонецЕсли; 
		
		СтраницаРаздела = ТаблицаСтраницыРаздел2.Добавить();
		СтраницаРаздела.Представление               = СтрокаСтавки.Код + " %";
		СтраницаРаздела.АвтоматическоеПредставление = Истина;
		СтраницаРаздела.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
		
		ЗаполнитьРасчтеныеДанныеРаздела2(Форма, СтраницаРаздела, Число(СтрокаСтавки.Код));
		
	КонецЦикла; 
	
	Если ТаблицаСтраницыРаздел2.Количество() = 0 Тогда
		
		СтраницаРаздела = ТаблицаСтраницыРаздел2.Добавить();
		СтраницаРаздела.Представление               = "Новая страница";
		СтраницаРаздела.АктивнаяСтраница            = Истина;
		СтраницаРаздела.АвтоматическоеПредставление = Истина;
		СтраницаРаздела.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
		
	Иначе
		
		ТаблицаСтраницыРаздел2[0].АктивнаяСтраница  = Истина;
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанныеВРаздел1()
	
	СобратьДанныеВРаздел1Сервер();
	
	// Обновляем дерево разделов
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
	// Выводим макет в табличный документ
	ВывестиМакетВТаблДокНаСервере("Раздел1", 1, , , Истина);
	
	// Активизируем строку раздела в дереве
	Для Каждого СтрокаРаздела Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если СтрокаРаздела.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = СтрокаРаздела.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Модифицированность = Истина;
	
КонецПроцедуры	

&НаСервере
Процедура СобратьДанныеВРаздел1Сервер()
	
	// Итоги пересчитываем только в том случае, если не заполнена таблица свода доходов
	Если СводДоходов.Количество() = 0 Тогда
		РассчитатьИтогиЛиста(ЭтотОбъект, Неопределено);
		ЗаполнитьСводныеТаблицы(ЭтотОбъект);
	КонецЕсли; 
	
	ОКТМОНАлогоплательщика = СтруктураРеквизитовФормы.Октмо;
	
	// Сначала распределим результаты расчета Раздела 2 по своду доходов
	Для Каждого СтраницаРаздела Из ТаблицаСтраницыРаздел2 Цикл
		
		Если СтраницаРаздела.Данные.Количество() = 0 ИЛИ СтраницаРаздела.Данные[0].Значение.П000200001001 = 0
			 ИЛИ СтраницаРаздела.Данные[0].Значение.П000200001010 = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		ДанныеСтраницы = СтраницаРаздела.Данные[0].Значение;
		
		ОстатокКУплате     = Число(ДанныеСтраницы.П000200001130);
		ОстатокКВозмещению = Число(ДанныеСтраницы.П000200001140);
		ПоследняяСтрока    = Неопределено;
		
		// Находим строки доходов по указанной ставке
		СтрокиДоходов = СводДоходов.НайтиСтроки(Новый Структура("Ставка", Число(СтраницаРаздела.Данные[0].Значение.П000200001001)));
		Для Каждого СтрокаДохода Из СтрокиДоходов Цикл
		
			Если  ОстатокКУплате > 0 Тогда
				
				СтрокаДохода.ОКТМО             = ОКТМОНАлогоплательщика; // доплата налога всегда по месту регистрации налогоплательщика
				СтрокаДохода.РезультатРасчетов = Мин(ОстатокКУплате, СтрокаДохода.НачисленоНалога);
				ОстатокКУплате                 = Макс(0, ОстатокКУплате - СтрокаДохода.РезультатРасчетов);
				
			ИначеЕсли  ОстатокКВозмещению > 0 Тогда
				
				НалогУплачен = СтрокаДохода.УплаченоНалога + СтрокаДохода.УдержаноНалога + СтрокаДохода.НалогПринимаемыйКУчету; // возмещается только то, что уплачено или удержано
				СтрокаДохода.РезультатРасчетов = - Мин(ОстатокКВозмещению, НалогУплачен); // пишем со знаком минус для получения итоговой суммы при сворачивании по КБК и ОКТМО
				ОстатокКВозмещению             = Макс(0, ОстатокКВозмещению + СтрокаДохода.РезультатРасчетов);
				
			КонецЕсли; 
			
			Если СтрокаДохода.РезультатРасчетов <> 0 Тогда
				ПоследняяСтрока = СтрокаДохода;
			КонецЕсли; 
			
		КонецЦикла; 
		
		// Убеждаемся, что распределен весь результат расчетов
		Если (ОстатокКУплате > 0 ИЛИ ОстатокКВозмещению > 0) И ПоследняяСтрока <> Неопределено Тогда
			
			Если  ОстатокКУплате > 0 Тогда
				ПоследняяСтрока.РезультатРасчетов = ПоследняяСтрока.РезультатРасчетов + ОстатокКУплате;
			ИначеЕсли  ОстатокКВозмещению > 0 Тогда
				СтрокаДохода.РезультатРасчетов = СтрокаДохода.РезультатРасчетов - ОстатокКВозмещению;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	// Свернем таблицу доходов по КБК и ОКТМО, чтобы получить итоги расчетов
	ТаблицаРасчетов = СводДоходов.Выгрузить();
	ТаблицаРасчетов.Свернуть("КБК,ОКТМО", "РезультатРасчетов");
	
	// Сохраним образец структуры реквизитов для заполнения добавленный страниц
	ОбразецСтруктуры = Новый Структура(Новый ФиксированнаяСтруктура(ТаблицаСтраницыРаздел1[0].Данные[0].Значение));
	Для Каждого ЭлементСтруктуры Из ОбразецСтруктуры Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Число") Тогда
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = 0;
		Иначе
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = "";
		КонецЕсли; 
	КонецЦикла; 
	
	// очистим страницы раздела
	ТаблицаСтраницыРаздел1.Очистить();
	
	// Для каждой пары КБК+ОКТМО создаем страницу раздела 1
	Для Каждого СтрокаРасчета Из ТаблицаРасчетов Цикл
		
		СтраницаРасчета = ТаблицаСтраницыРаздел1.Добавить();
		СтраницаРасчета.Представление               = "Страница N " + ТаблицаСтраницыРаздел1.Количество();
		СтраницаРасчета.АвтоматическоеПредставление = Истина;
		СтраницаРасчета.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
		ДанныеСтраницыРасчета = СтраницаРасчета.Данные[0].Значение;
		
		ДанныеСтраницыРасчета.П000100001020 = СтрокаРасчета.КБК;
		ДанныеСтраницыРасчета.П000100001030 = СтрокаРасчета.ОКТМО;
		
		Если СтрокаРасчета.РезультатРасчетов > 0 Тогда
			
			ДанныеСтраницыРасчета.П000100001010 = 1;
			ДанныеСтраницыРасчета.П000100001040 = СтрокаРасчета.РезультатРасчетов;
			ДанныеСтраницыРасчета.П000100001050 = 0;
			
		ИначеЕсли СтрокаРасчета.РезультатРасчетов < 0 Тогда
			
			ДанныеСтраницыРасчета.П000100001010 = 2;
			ДанныеСтраницыРасчета.П000100001040 = 0;
			ДанныеСтраницыРасчета.П000100001050 = - СтрокаРасчета.РезультатРасчетов;
			
		Иначе
			
			ДанныеСтраницыРасчета.П000100001010 = 3;
			ДанныеСтраницыРасчета.П000100001040 = 0;
			ДанныеСтраницыРасчета.П000100001050 = 0;
			
		КонецЕсли; 
		
		
	КонецЦикла; 
	
	// Если не оказалось новых страниц раздела, добавим пустую
	Если ТаблицаСтраницыРаздел1.Количество() = 0 Тогда
		
		СтраницаРаздела = ТаблицаСтраницыРаздел1.Добавить();
		СтраницаРаздела.Представление               = "Новая страница";
		СтраницаРаздела.АктивнаяСтраница            = Истина;
		СтраницаРаздела.АвтоматическоеПредставление = Истина;
		СтраницаРаздела.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
		
	Иначе
		
		ТаблицаСтраницыРаздел1[0].АктивнаяСтраница  = Истина;
		
	КонецЕсли; 
	
	
КонецПроцедуры	


#КонецОбласти

#Область ПроверкаКС

&НаСервере
Функция ПроверитьКонтрольныеСоотношенияВОтчете() Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("КоличествоНайденныхОшибок",    0);
	СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", 0);
	СтруктураРезультата.Вставить("СтруктураОшибок", Новый Структура);
	
	Возврат СтруктураРезультата;
	
КонецФункции


#КонецОбласти


#Область ЧтениеСохранениеВыводОтчета


// Восстанавливает сохраненные данные отчета.
//
&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	Перем ДанныеМногострочныхРазделов;
	Перем ДанныеМногостраничныхРазделов;
	Перем ДанныеВариановАвтоЗаполнения;
	Перем ПоказателиОтчета;
	Перем Автозаполнение;
	Перем ТаблицаМногостраничногоДокумента;
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.Организация) Тогда
		СтруктураРеквизитовФормы.Организация =	СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	КонецЕсли;
	
	ДатаПодписи			                              = СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи;
	СтруктураРеквизитовФормы.ЕдиницаИзмерения         = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
	СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 0;
	Комментарий					                      = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// список листов, выводимых на печать
	ДеревоНастройкиСтраниц = СтруктураРеквизитовФормы.мСохраненныйДок.ДеревоНастройкиСтраниц.Получить();
	
	ЗначениеВРеквизитФормы(ДеревоНастройкиСтраниц.Скопировать(), "мДеревоСтраницОтчета");
	
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	
	// восстанавливаем сохраненные данные многострочных разделов
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			
			мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, ЭтаФорма[НайденноеЗначение]);
				
			КонецЕсли;
				
		КонецЦикла;
		
	КонецЕсли;
	
	// восстанавливаем сохраненные данные вариантов автозаполнения ячеек
	Если СписокСохранения.Свойство("ДанныеВариантовАвтоЗаполнения", ДанныеВариановАвтоЗаполнения) Тогда
		
		Если НЕ ДанныеВариановАвтоЗаполнения = Неопределено Тогда
			
			мСтруктураВариантыЗаполнения.Очистить();
			
			Для Каждого ЭлементСтруктуры Из ДанныеВариановАвтоЗаполнения Цикл
				
				мСтруктураВариантыЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Ключ);
				
				ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Очистить();
				
				Для Каждого ЭлементМассива Из ЭлементСтруктуры.Значение Цикл
					
					ТаблВарЗаполнения = ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Добавить().ТаблицаВариантовЗаполнения;
					
					ЗначениеВДанныеФормы(ЭлементМассива, ТаблВарЗаполнения);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// восстанавливаем сохраненные данные многостраничных разделов
	Если СписокСохранения.Свойство("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногостраничныхРазделов Цикл
			
			НайденноеЗначение = Неопределено;
			
			мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
			
			Если НЕ НайденноеЗначение = Неопределено Тогда
				
				НайденноеЗначение = ЭтаФорма[НайденноеЗначение];
				
				Если ЭлементСтруктуры.Значение.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
					ЭлементСтруктуры.Значение.Колонки.Добавить("ДанныеДопСтрок");
				КонецЕсли;
				
				
				
				ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, НайденноеЗначение);          
				
				Если НайденноеЗначение[0].Свойство("Данные") Тогда
					
					Для Каждого СтрокаТаблЗнач Из НайденноеЗначение Цикл
						
						Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
							
							ПреобразоватьПосимвольныеДанныеВЗначения(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
							СтрокаТаблЗнач.Данные.Очистить();
							СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если НайденноеЗначение[0].Свойство("ДанныеДопСтрок") Тогда
					
					Ном = 0;
					
					Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
						
						Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
							
							Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
								
								ТаблЗнач = ЭлСтруктуры.Значение;
								
								ЭлСтруктуры.Значение = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
								
								ЗначениеВДанныеФормы(ТаблЗнач, ЭлСтруктуры.Значение);
								
								НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(ЭлСтруктуры.Значение);
								
							КонецЦикла;
							
						ИначеЕсли ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("ТаблицаЗначений") Тогда
							
							СтрокаТаблЗначДанныеДопСтрок = ЭтаФорма["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
							
							ЗначениеВДанныеФормы(СтрокаТаблЗнач.ДанныеДопСтрок, СтрокаТаблЗначДанныеДопСтрок);
							
							НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
							
						КонецЕсли;
						
						Ном = Ном + 1;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		Для Каждого Страница Из ЭтаФорма[Раздел.Значение] Цикл
			Страница.АктивнаяСтраница = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	СписокСохранения.Свойство("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	
	Если НЕ СписокСохранения.Свойство("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов) Тогда
		СтруктураРеквизитовФормы.мАвтоВыборКодов = Ложь;
	КонецЕсли;
		
	Если НЕ СписокСохранения.Свойство("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки) Тогда
		СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки = Ложь;
	КонецЕсли;
	
	ОбновитьПеременныеМодуляНаСервере("СтатусНалогоплательщика", СписокСохранения.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.СтатусНалогоплательщика);

	СписокСохранения.Свойство("Автозаполнение", Автозаполнение);
	СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет = Автозаполнение;
	
	Если НЕ СписокСохранения.Свойство("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена) Тогда
		СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена = Ложь;
	КонецЕсли;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл	
		
		Если НЕ Раздел.МногостраничностьВРазделе Тогда
			ПреобразоватьПосимвольныеДанныеВЗначения(ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы]);
			ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		КонецЕсли;
		
	КонецЦикла;
	
	ИмяТекРаздела = "Титульный";
	
	Для Каждого ЭлСтруктуры Из ЭтаФорма["СтруктураДанных" + ИмяТекРаздела] Цикл
		Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
			ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураРеквизитовФормы.мПоМесту = ТабличныйДокумент.Области.ПоМесту.Значение;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтаФорма);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, НаимТекРаздела)
	
	Если РегламентированнаяОтчетность.БылиИзмененыКлючевыеРеквизитыОтчета(ЭтаФорма, КодИФНС, КПП)
		И РегламентированнаяОтчетность.СуществуетДокументСАналогичнымиРеквизитами(ЭтаФорма, КодИФНС) Тогда
		
		ПодобныйОтчетСуществует = Истина;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = (СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено);
	
	Если Вариант <> Неопределено И ((СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено) ИЛИ (СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено) ИЛИ (Вариант <> СтруктураРеквизитовФормы.мВариант)) Тогда
		
		Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			
		ИначеЕсли Вариант <> СтруктураРеквизитовФормы.мВариант Тогда
			
			ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПодобныйОтчетСуществует
		ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Сохранить(Автосохранение, КодИФНС, КПП, Вариант, , НаимТекРаздела);
	
КонецФункции

// Формирует структуру данных отчета и помещает в реквизит типа ХранилищеЗначения
// документа РегламентированныйОтчет.
// 
// При первом сохранении данных отчета создает новый документ этого вида.
// Структура данных отчета состоит из элементов:
//   - значения редактируемых реквизитов отчета;
//   - данные по многострочным разделам отчета;
//   - данные по  многостраничным разделам отчета;
//   - данные по вариантам заполнения реквизитов,
//     участвующих в автозаполнении.
//
&НаСервере
Функция Сохранить(Автосохранение = Ложь, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен = Неопределено, НаимТекРаздела) Экспорт	
	
	ДанныеДляРазблокирования = Неопределено;
	
	Если НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
		Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы Тогда
			ДанныеДляРазблокирования = Новый Структура("Ключ,ИдФормы",
			СтруктураРеквизитовФормы.мСохраненныйДок, ЭтаФорма.УникальныйИдентификатор);
		КонецЕсли;
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект();
	КонецЕсли;
	
	// ДЕНЬГИ
	ОбновитьСсылкуОрганизации(СтруктураРеквизитовФормы, СтруктураДанныхТитульный, КодИФНС);
	ОргСтр = " (" + СтруктураРеквизитовФормы.НаимОрганизации + ")";
	Заголовок = "Декларация 3-НДФЛ " + СтруктураРеквизитовФормы.СтрПериодОтчета + ОргСтр;
	// Конец ДЕНЬГИ
	
	Если НЕ РегламентированнаяОтчетность.ПриЗаписиРегламентированногоОтчетаНаСервере(ЭтаФорма, КодИФНС, Автосохранение, Вариант, ВидДокументаНомерКорректировкиИзменен, СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	//Если перед сохранением изменяли значение показателя - нужен полный расчет
	Если СтруктураРеквизитовФормы.НужноРассчитатьОтчетНаСервере Тогда
		РасчетНаСервере();
	КонецЕсли; 
	
	// установим текущие значения реквизитов документа

	МетаданныеОтчета = ОтчетОбъект().Метаданные();
	СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета           = МетаданныеОтчета.Имя;
	СтруктураРеквизитовФормы.мСохраненныйДок.НаименованиеОтчета       = МетаданныеОтчета.ОсновнаяФорма.Синоним;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаНачала               = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания            = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	СтруктураРеквизитовФормы.мСохраненныйДок.Периодичность            = СтруктураРеквизитовФормы.мПериодичность;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма           = СтруктураРеквизитовФормы.мВыбраннаяФорма;
	СтруктураРеквизитовФормы.мСохраненныйДок.Организация              = СтруктураРеквизитовФормы.Организация;
	СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи              = ДатаПодписи;
	СтруктураРеквизитовФормы.мСохраненныйДок.ЕдиницаИзмерения         = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ТочностьЕдиницыИзмерения = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	СтруктураРеквизитовФормы.мСохраненныйДок.ВидОтчетности            = Перечисления.ВидыОтчетности.РегламентированнаяОтчетность;
	СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий              = Комментарий;
	СтруктураРеквизитовФормы.мСохраненныйДок.КодНалоговогоОргана      = КодИФНС;
	СтруктураРеквизитовФормы.мСохраненныйДок.КПП                      = КПП;
	СтруктураРеквизитовФормы.мСохраненныйДок.Вид                      = Вариант;
	СтруктураРеквизитовФормы.мСохраненныйДок.ПредставлениеВида        = РегламентированнаяОтчетность.ПредставлениеВидаДокумента(СтруктураРеквизитовФормы.мСохраненныйДок.Вид);
	СтруктураРеквизитовФормы.мВариант                                 = Вариант;
	
	СтруктураРеквизитовФормы.мСохраненныйДок.ФорматВыгрузки = "Автоматически";
	
	СохранитьДанныеРаздела(НаимТекРаздела, Ложь, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	// формируем данные редактируемых ячеек таблицы
	ПоказателиОтчета = Новый Структура();
	
	ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета);
	
	// формируем список сохранения
	СписокСохранения = Новый Структура();
	
	// вставляем данные редактируемых ячеек таблицы	
	СписокСохранения.Вставить("ПоказателиОтчета", ПоказателиОтчета);
	
	ДанныеМногострочныхРазделов = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		
		ДанныеМногострочныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
	КонецЦикла;
	
	// вставляем данные многострочных разделов
	СписокСохранения.Вставить("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов);
	
	ДанныеМногостраничныхРазделов = Новый Структура;
	
	МассивТиповНеопределено = Новый Массив; 
	МассивТиповНеопределено.Добавить(Тип("Неопределено"));
	ОписаниеТиповНеопределено = Новый ОписаниеТипов(МассивТиповНеопределено);
	
	Для Каждого ЭлементСтруктуры Из мСтруктураМногостраничныхРазделов Цикл
		
		ДанныеМногостраничныхРазделов.Вставить(ЭлементСтруктуры.Ключ, ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение], Тип("ТаблицаЗначений")));
		
		ТаблЗнач = Неопределено;
		
		Если ДанныеМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, ТаблЗнач) Тогда
			
			Если НЕ ТаблЗнач.Колонки.Найти("Данные") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("Данные");
				ТаблЗнач.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					СтрокаТаблЗнач.Данные = ЭтаФорма[ЭлементСтруктуры.Значение][Ном].Данные[0].Значение;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НЕ ТаблЗнач.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
				
				ТаблЗнач.Колонки.Удалить("ДанныеДопСтрок");
				ТаблЗнач.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ТаблЗнач Цикл
					
					Если (ЭтаФорма[ЭлементСтруктуры.Значение][Ном].ДанныеДопСтрок.Количество() > 0)
						И (ЭтаФорма[ЭлементСтруктуры.Значение][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела") Тогда
						
						СтрокаТаблЗнач.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтаФорма[ЭлементСтруктуры.Значение][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
						
						Ном = Ном + 1;
						
						Продолжить;
						
					КонецЕсли;
					
					СтруктураДанныхДопСтрок = Новый Структура;
					
					Для Каждого ЭлСтруктуры Из ЭтаФорма[ЭлементСтруктуры.Значение][Ном].ДанныеДопСтрок Цикл
						
						СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));	
						
					КонецЦикла;
					
					СтрокаТаблЗнач.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// вставляем данные многостраничных разделов
	СписокСохранения.Вставить("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов);
	
	ДанныеВариантовАвтоЗаполнения = Новый Структура;
	
	Для Каждого ЭлементСтруктуры Из мСтруктураВариантыЗаполнения Цикл
		
		МассивТаблЗнач = Новый Массив;
		
		ДанныеВариантовАвтоЗаполнения.Вставить(ЭлементСтруктуры.Ключ, МассивТаблЗнач);
		
		Для Каждого ЭлементМассива Из ЭтаФорма["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ] Цикл
			
			МассивТаблЗнач.Добавить(ДанныеФормыВЗначение(ЭлементМассива.ТаблицаВариантовЗаполнения, Тип("ТаблицаЗначений")));
			
		КонецЦикла;
		
	КонецЦикла;
	
	// вставляем данные вариантов автозаполнения ячеек
	СписокСохранения.Вставить("ДанныеВариантовАвтоЗаполнения", ДанныеВариантовАвтоЗаполнения);
	
	// вствляем версию формы
	СписокСохранения.Вставить("ВерсияФормы", СтруктураРеквизитовФормы.мВерсияФормы);
	
	// вствляем флажок пересчета страниц
	СписокСохранения.Вставить("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	
	// вствляем флажок отключения
	СписокСохранения.Вставить("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	
	// вствляем флажок ручной ввод ВРЕМЕННАЯ ОТМЕНА
	СписокСохранения.Вставить("Автозаполнение", СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	
	// вствляем флажок разрешения печати без штрихкода
	СписокСохранения.Вставить("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	
	СписокСохранения.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	
	ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
	СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета = ХранилищеДанных;
	
	// записываем документ, хранящий данные отчета	
	Попытка
		СтруктураРеквизитовФормы.мСохраненныйДок.Записать();
		РегламентированнаяОтчетность.СохранитьСтатусОтправкиРеглОтчета(ЭтаФорма);
	Исключение
		Если НЕ Автосохранение Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), РегламентированнаяОтчетностьКлиентСервер.СформироватьТекстСообщения(ОписаниеОшибки()));
			
			Сообщение.Сообщить();
			
		КонецЕсли;
		СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
		Возврат Ложь;
	КонецПопытки;
	
	Модифицированность   = Ложь;
	
	СохранитьДеревоНастройкиСтраниц(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	СтруктураРеквизитовФормы.мСохраненныйДок = СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка;
	
	Если НЕ СтруктураРеквизитовФормы.мБезОткрытияФормы
       И НЕ СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено Тогда
				   
    	ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , ЭтаФорма.УникальныйИдентификатор);

    КонецЕсли;
	
	Если ДанныеДляРазблокирования <> Неопределено Тогда
		РазблокироватьДанныеДляРедактирования(ДанныеДляРазблокирования.Ключ, ДанныеДляРазблокирования.ИдФормы);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоказателиОтчетаНаСервере(ПоказателиОтчета)
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если НЕ Раздел.МногостраничностьВРазделе Тогда
			ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтаФорма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрытьПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаКлиенте(Знач ИмяРаздела) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

&НаСервере
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаСервере(Знач ИмяРаздела) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

// ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу()
// Процедура обнуляем переменные модуля, используемые для отображения в квадратиках
// в разделе 1
// запускается при добавлении новой страницы, а также при инициализации формы
//
&НаКлиентеНаСервереБезКонтекста
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(Знач ИмяРаздела, ПеременныеМодуля)
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеЗначенийВКвадратикахНаКлиенте(Знач ИмяСтраницы) Экспорт
	
	ЗаполнениеЗначенийВКвадратиках(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеЗначенийВКвадратикахНаСервере(Знач ИмяСтраницы) Экспорт
	
	ЗаполнениеЗначенийВКвадратиках(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнениеЗначенийВКвадратиках(Форма, Знач ИмяСтраницы)
	
	Возврат;
	
КонецПроцедуры

// Процедура очищает содержимое редактируемых и вычисляемых ячеек
// поля табличного документа, переданного параметром ВыбТабличноеПоле.
//
// Параметры:
//  ВыбТабличноеПоле - поле табличного документа.
//
&НаСервере
Процедура ОчиститьТабличноеПолеСпец(ИмяТекущегоРаздела, ОбновитьСтавки = Истина) Экспорт
	
	//для очистки защищенных областей итоговых ячеек
	//получим список итоговых ячеек, снимая с них защиту), а после очищения вернем защиту
	СписокИтоговыхЯчеек = Новый СписокЗначений;
	
	Для каждого Область Из ТабличныйДокумент.Области Цикл
		Если Область.ЦветФона = СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика И Область.Защита Тогда
			Область.Защита = Ложь;
			СписокИтоговыхЯчеек.Добавить(Область.Имя);
		КонецЕсли;
	КонецЦикла;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьТабличноеПоле(ЭтаФорма, ИмяТекущегоРаздела);
	
	НомерКорректировки = 0;
	ДатаПодписи = ТекущаяДатаСеанса();
	
	СохранитьДанныеРаздела(ИмяТекущегоРаздела, Истина, Ложь);
	
	Для каждого КодИтоговогоПоказателя Из СписокИтоговыхЯчеек Цикл
		ОбластьПоказателя=ТабличныйДокумент.Области.Найти(КодИтоговогоПоказателя.Значение);
		Если ОбластьПоказателя <> Неопределено Тогда
			ОбластьПоказателя.Защита = Истина;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы)
	
	ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтаФорма, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(Форма, НазванияМногостраничныхРазделовДляУдаления = "") Экспорт
	
	Если НЕ ПустаяСтрока(НазванияМногостраничныхРазделовДляУдаления) Тогда
		НазванияМнгостраничныхРазделов = Новый Структура(НазванияМногостраничныхРазделовДляУдаления);
	Иначе
		НазванияМнгостраничныхРазделов = Новый Структура;
	КонецЕсли;
	
	Для каждого СтрокаУровня1 из Форма.мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		НазваниеСтраницы           = СтрокаУровня1.ИмяСтраницы;
		МногостраничностьВРазделе  = СтрокаУровня1.МногостраничностьВРазделе;
		РазделАвтозаполняется = СтрокаУровня1.РазделЯвляетсяАвтозаполняемым;
		
		Если НазваниеСтраницы = "Титульный" Тогда
			Продолжить;
		КонецЕсли;
		
		мРазделИмя = "ТабличныйДокумент";
		мРаздел    = Форма[мРазделИмя];
		Если НазванияМнгостраничныхРазделов.Свойство(НазваниеСтраницы) Тогда
			// Очистим текущий лист.
			#Если НаКлиенте Тогда
				Форма.ОчиститьТабличноеПолеНаКлиенте(НазваниеСтраницы);
			#Иначе
				Форма.ОчиститьТабличноеПолеНаСервере(НазваниеСтраницы);
			#КонецЕсли
			
			ТаблицаСтраницРаздела = Неопределено;
			Форма.мСтруктураМногостраничныхРазделов.Свойство(НазваниеСтраницы, ТаблицаСтраницРаздела);
			
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			
			ИндексСтраницы = 0;
			Пока Не (ИндексСтраницы > (ТаблицаСтраницРаздела.Количество()-1)) Цикл
				СтрокаТаблицы = ТаблицаСтраницРаздела[ИндексСтраницы];
				Если НЕ СтрокаТаблицы.АктивнаяСтраница Тогда
					// удаляем дополнительную страницу
					ТаблицаСтраницРаздела.Удалить(СтрокаТаблицы);
					Продолжить;
				КонецЕсли;
				ИндексСтраницы = ИндексСтраницы + 1;
			КонецЦикла;
			
			// Варианты заполнения установим в один массив. Все варианты возьмем из Эталона.
			// Цвет ячеек перерисуется в показе статика многостраничного раздела, ниже.
			РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(Форма, НазваниеСтраницы, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Открывает форму документа ФормаНастройкиОтчета с целью выбора 
// выводимых на печать листов отчета.
//
// Параметры:
//   ВариантВыбора - строка, назначение выбора страниц.
//
&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ПроверкаСоотношений", Истина);
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	
	Если СтруктураРеквизитовФормы.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417 Тогда
		мПараметры.Вставить("РазрешитьВстроеннуюПечать", Истина);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФлажокОтклАвтоРасчет", СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	ПараметрыФормы.Вставить("мПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	ПараметрыФормы.Вставить("мСчетчикСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	ПараметрыФормы.Вставить("мАвтоВыборКодов", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	ПараметрыФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	ПараметрыФормы.Вставить("мПараметры", мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтаФорма);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, ФормаНастройкиОтчета.Дерево);
	
	ЗначениеАвторасчета = СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет;
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТаблицуВариантовЗаполненияНаСервере()
	
	РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(ЭтаФорма, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	РегламентированнаяОтчетностьЗагрузкаКлиент.ЗагрузитьИзФайлаОтчет(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузкаОтчетаИзФайла(ДанныеДляЗагрузки) Экспорт
	
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru='Отчет ""%1"" не сохранен.'"), ЭтотОбъект.Заголовок);
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗагрузкаОтчетаИзФайлаНаСервере(ДанныеДляЗагрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗагрузкаОтчетаИзФайлаНаСервере(ДанныеДляЗагрузки)
	
	СформироватьСтруктуруПоказателей();
	
	ПараметрыОтчета = СформироватьСтруктуруПараметров();
	
	ДеревоДляЗагрузки = ИзвлечьСтруктуруXML();
	
	Если НЕ РегламентированнаяОтчетностьЗагрузка.ЗагрузкаОтчетаИзФайла(
		ЭтотОбъект, ПараметрыОтчета, ДанныеДляЗагрузки, ДеревоДляЗагрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВыгрузкуОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуОтчетаЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = СформироватьСтруктуруПараметров();
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	Если НЕ ПроверитьВозможностьВыгрузки(ПараметрыВыгрузки, ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	Если НЕ ПроверитьДанные(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция УниверсальнаяВыгрузка(ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина) Экспорт
	
	Перем ПараметрыВыгрузки;
	
	Если Модифицированность Тогда

		ТекстЗаголовка = ЗаголовокРегламентированногоОтчета(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ОргСтр = " (" + СтруктураРеквизитовФормы.Организация + ")";
		Если СтрНайти(ТекстЗаголовка, ОргСтр) = 0 Тогда
			ТекстЗаголовка = ТекстЗаголовка + ОргСтр;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет """ + ТекстЗаголовка + """ не сохранен.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	Если Открыта() Тогда
		Если СтруктураРеквизитовФормы.ЕдиницаИзмерения <> ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Перед выгрузкой необходимо установить единицу измерения ""в рублях"".'");
			
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения <> 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Перед выгрузкой необходимо установить точность ""0"".'");
			
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	Если НЕ УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки)
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = СформироватьСтруктуруПараметров();
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	
	Если НЕ ПроверитьВозможностьВыгрузки(ПараметрыВыгрузки, ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	Если НЕ ПроверитьДанные(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстВыгрузки = ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ИзвлечьСтруктуруXML()
	
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("Код");
	ДеревоСтруктуры.Колонки.Добавить("Тип");
	ДеревоСтруктуры.Колонки.Добавить("Формат");
	ДеревоСтруктуры.Колонки.Добавить("МинРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("МаксРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("Обязательность");
	ДеревоСтруктуры.Колонки.Добавить("Многостраничность");
	ДеревоСтруктуры.Колонки.Добавить("Многострочность");
	ДеревоСтруктуры.Колонки.Добавить("Раздел");
	ДеревоСтруктуры.Колонки.Добавить("Ключ");
	ДеревоСтруктуры.Колонки.Добавить("Условие");
	ДеревоСтруктуры.Колонки.Добавить("ЗначениеПоУмолчанию");
	ДеревоСтруктуры.Колонки.Добавить("Значение");
	ДеревоСтруктуры.Колонки.Добавить("Представление");
	ДеревоСтруктуры.Колонки.Добавить("Показатели");
	
	Макет = ОтчетОбъект().ПолучитьМакет("СтруктураXML509");
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	УчтенныеГруппы = Новый Соответствие;
	
	Для Уровень = 0 По Макет.КоличествоУровнейГруппировокСтрок() - 1 Цикл
		Макет.ПоказатьУровеньГруппировокСтрок(Уровень);
		Для НомерСтроки = 2 По ВысотаТаблицы Цикл
			НомСтр = ВысотаТаблицы - НомерСтроки + 2;
			Если Макет.Область(НомСтр, 0, НомСтр, 0).Видимость = Истина И УчтенныеГруппы.Получить(НомСтр) = Неопределено Тогда
				
				РодительскийУзел = ДеревоСтруктуры;
				Если Уровень <> 0 Тогда
					Для Инд = 1 По НомСтр - 2 Цикл
						Узел = УчтенныеГруппы.Получить(НомСтр - Инд);
						Если Узел <> Неопределено Тогда
							РодительскийУзел = Узел;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				НовСтр = РодительскийУзел.Строки.Вставить(0);
				НовСтр.Код = СокрЛП(Макет.Область(НомСтр, 1, НомСтр, 1).Текст);
				НовСтр.Раздел = СокрЛП(Макет.Область(НомСтр, 2, НомСтр, 2).Текст);
				НовСтр.Ключ = СокрЛП(Макет.Область(НомСтр, 3, НомСтр, 3).Текст);
				НовСтр.Тип = СокрЛП(Макет.Область(НомСтр, 4, НомСтр, 4).Текст);
				НовСтр.Формат = СокрЛП(Макет.Область(НомСтр, 5, НомСтр, 5).Текст);
				МинРазмерность = СокрЛП(Макет.Область(НомСтр, 6, НомСтр, 6).Текст);
				НовСтр.МинРазмерность = ?(ПустаяСтрока(МинРазмерность), ?(НовСтр.Формат = "N", 99999, 0), Число(МинРазмерность));
				МаксРазмерность = СокрЛП(Макет.Область(НомСтр, 7, НомСтр, 7).Текст);
				НовСтр.МаксРазмерность = ?(ПустаяСтрока(МаксРазмерность), 99999, Число(МаксРазмерность));
				НовСтр.Обязательность = СокрЛП(Макет.Область(НомСтр, 8, НомСтр, 8).Текст);
				НовСтр.Многостраничность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 9, НомСтр, 9).Текст);
				НовСтр.Многострочность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 10, НомСтр, 10).Текст);
				НовСтр.Условие = СокрЛП(Макет.Область(НомСтр, 11, НомСтр, 11).Текст);
				НовСтр.ЗначениеПоУмолчанию = СокрЛП(Макет.Область(НомСтр, 12, НомСтр, 12).Текст);
				НовСтр.Представление = СокрЛП(Макет.Область(НомСтр, 13, НомСтр, 13).Текст);
				
				УчтенныеГруппы.Вставить(НомСтр, НовСтр);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьВыгрузки(ПараметрыВыгрузки, ДеревоВыгрузки)
	
	СтатусПроверки = Истина;
	
	// проверка на незаполненный отчет
	Если НЕ ПроверитьРазделыНаНаличиеИнформации(ДеревоВыгрузки, "Раздел1, Раздел2") Тогда
		
		ТекстСообщений = НСтр("ru = 'Должны быть заполнены, следующие разделы: ""Раздел 1"", ""Раздел 2"".'");
		
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, ТекстСообщений, "Раздел1");
		СтатусПроверки = Ложь;
		Возврат СтатусПроверки;
	КонецЕсли;

	// проверка листа А
	ДанныеЛистА = мДанныеОтчета.ЛистА;
	Для Каждого Стр Из ДанныеЛистА Цикл
		НомерСтраницы = ДанныеЛистА.Индекс(Стр) + 1;
		ДанныеСтраницы = Стр.Данные[0].Значение;
		Если НЕ СтраницаПуста(ДанныеСтраницы, "ЛистА", ДеревоВыгрузки) Тогда
			
			НомСтроки = 1;
			НомерСтрокиВФормате =  Формат(НомСтроки, "ЧГ=");
			Пока ДанныеСтраницы.Свойство("П000300001030_" + НомерСтрокиВФормате) Цикл
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000300001010_" +НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " Листа А в строке " + НомерСтрокиВФормате + 
						" не указана ставка налога", "ЛистА", "П000300001010_" +НомерСтрокиВФормате, НомерСтраницы);
					
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				ДлинаИНН = СтрДлина(СокрЛП(ДанныеСтраницы["П000300001030_" +НомерСтрокиВФормате])); //ИНН
				ДлинаКПП = СтрДлина(СокрЛП(ДанныеСтраницы["П000300001040_" + НомерСтрокиВФормате])); //КПП
				
				Если ДлинаИНН > 0 И ДлинаИНН <> 12 И  ДлинаИНН <> 10  Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа А в строке " + НомерСтрокиВФормате + 
						" указан ИНН некорректной длины!", "ЛистА", "П000300001030_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если ДлинаИНН = 10 И ДлинаКПП <> 9  Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа А в строке " + НомерСтрокиВФормате + 
						" указан КПП некорректной длины!", "ЛистА", "П000300001040_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СокрЛП(ДанныеСтраницы["П000300001060_" + НомерСтрокиВФормате])) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа А в строке " + НомерСтрокиВФормате + 
						" не указано Наименование источника выплаты дохода", "ЛистА", "П000300001060_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000300001070_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа А в строке " + НомерСтрокиВФормате + 
						" не указана сумма дохода", "ЛистА", "П000300001070_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				НомСтроки = НомСтроки + 1;
				НомерСтрокиВФормате =  Формат(НомСтроки, "ЧГ=");
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	

	// проверка листа Б
	ДанныеЛистБ = мДанныеОтчета.ЛистБ;
	Для Каждого Стр Из ДанныеЛистБ Цикл
		НомерСтраницы = ДанныеЛистБ.Индекс(Стр) + 1;
		ДанныеСтраницы = Стр.Данные[0].Значение;
		Если НЕ СтраницаПуста(ДанныеСтраницы, "ЛистБ", ДеревоВыгрузки) Тогда
			
			Если НЕ ЗначениеЗаполнено(ДанныеСтраницы.П000400001001) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерСтраницы + " Лист Б не указана ставка налога", "ЛистБ", "П000400001001", НомерСтраницы);
				СтатусПроверки = Ложь;
			КонецЕсли;
			
			НомСтроки = 1;
			НомерСтрокиВФормате =  Формат(НомСтроки, "ЧГ=");
			Пока ДанныеСтраницы.Свойство("П000400001010_" + НомерСтрокиВФормате) Цикл
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001010_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указан код страны по классификатору ОКСМ", "ЛистБ", "П000400001010_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(СокрЛП(ДанныеСтраницы["П000400001020_" + НомерСтрокиВФормате])) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указано Наименование источника выплаты дохода", "ЛистБ", "П000400001020_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001030_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указан код валюты", "ЛистБ", "П000400001030_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001040_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указана дата получения дохода", "ЛистБ", "П000400001040_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001050_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указан курс иностранной валюты", "ЛистБ", "П000400001050_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001060_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, 
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указана сумма дохода, полученная в иностранной валюте", "ЛистБ", "П000400001060_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001070_" + НомерСтрокиВФормате]) Тогда
					РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
						"На странице " + НомерСтраницы + " листа Б в строке " + НомерСтрокиВФормате + 
						" не указана сумма дохода, полученная в иностранной валюте в пересчете в рубли", "ЛистБ", "П000400001070_" + НомерСтрокиВФормате, НомерСтраницы);
					СтатусПроверки = Ложь;
				КонецЕсли;
				
				НомСтроки = НомСтроки + 1;
				НомерСтрокиВФормате =  Формат(НомСтроки, "ЧГ=");
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// проверка листа Д1
	ДанныеЛистД1 = мДанныеОтчета.ЛистД1;
	Для Каждого Стр Из ДанныеЛистД1 Цикл
		НомерСтраницы = ДанныеЛистД1.Индекс(Стр) + 1;
		ДанныеСтраницы = Стр.Данные[0].Значение;
		Если НЕ СтраницаПуста(ДанныеСтраницы, "ЛистД1", ДеревоВыгрузки) И (ДанныеСтраницы.П000700001110 = 0 ИЛИ ДанныеСтраницы.П000700001110 = "0001") Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма, "На странице " + НомерСтраницы + " Лист Д1 не указан год начала использования налогового вычета", "ЛистД1", "П000700001110", НомерСтраницы);
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтатусПроверки;
	
КонецФункции

// СохранитьНаКлиенте()
//
&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		СтруктураДанныхТитульный.Вставить("КодИМНС", ТабличныйДокумент.Области.КодИМНС.Значение);
		Если ТабличныйДокумент.Области.НомерКорректировки.Значение = "" Тогда
			ТабличныйДокумент.Области.НомерКорректировки.Значение = "0";
		КонецЕсли;
		Вариант = Число(ТабличныйДокумент.Области.НомерКорректировки.Значение);
	Иначе
		Вариант = Число(СтруктураДанныхТитульный.НомерКорректировки);
	КонецЕсли;
	
	КодИФНС = СтруктураДанныхТитульный.КодИМНС;
	КПП 	= "";

	// ДЕНЬГИ
	ОбновитьСсылкуОрганизации(СтруктураРеквизитовФормы, СтруктураДанныхТитульный, КодИФНС);
	// Конец ДЕНЬГИ
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтаФорма, КодИФНС, Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	ПодобныйОтчетСуществует = Ложь;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Ложь;
			
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		НаименованиеТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Иначе
		НаименованиеТекущегоРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	КонецЕсли;

	РезультатСохранения = ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, НаименованиеТекущегоРаздела);
	ВидДокументаНомерКорректировкиИзменен = Неопределено;
	
	Если ПодобныйОтчетСуществует И Автосохранение Тогда
		Возврат;
	КонецЕсли;
	
	НуженВопросПередСохранением = (ПодобныйОтчетСуществует ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки);
	
	Если НуженВопросПередСохранением Тогда
		
		СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП);
		
	Иначе
		
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП)
	
	Если ПодобныйОтчетСуществует Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Сохранить");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
		
		// ДЕНЬГИ
		ТекстВопроса = НСтр("ru = 'Для налогоплательщика %1 за %2 год уже существует декларация с номером корректировки %3.
				|Сохранить еще один экземпляр декларации?'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, СтруктураРеквизитовФормы.Организация,
					Формат(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ЧДЦ=; ЧГ="), Вариант);
		//ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Отчет с видом %1 уже существует.
		//	|Сохранить отчет с таким же видом?'"), ?(Вариант = 0, """Первичный""", """Корректирующий/" + Вариант + """"));
		// Конец ДЕНЬГИ
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСохранитьОтчетСТакимЖеВидомЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки.Получить(1).Значение);
		
	Иначе
		
		СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьОтчетСТакимЖеВидомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = ДополнительныеПараметры.ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП)
	
	Если ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидОтчета", Вариант);
		
		ФормаВопроса = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ВопросПриИзмененииВидаДокументаНомераКорректировки", ПараметрыФормы);
		ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение,КодИФНС, КПП );
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииВидаДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВопроса.Открыть();
	Иначе
		Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраняется %1...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Записать);
		РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, Неопределено, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииВидаДокументаЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	Если КодВозврата = КодВозвратаДиалога.Да
		ИЛИ КодВозврата = КодВозвратаДиалога.Нет Тогда
		ВидДокументаНомерКорректировкиИзменен = ?(КодВозврата = КодВозвратаДиалога.Да, Истина, Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраняется %1...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Записать);
	РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтаФорма);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ СТЫКОВКИ С СЕРВИСОМ СДАЧИ ОТЧЕТНОСТИ ЧЕРЕЗ ПРЕДСТАВИТЕЛЯ

&НаКлиенте
Процедура ОтправитьЧерезПредставителяЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиЧерезПредставителяВРегламентированномОтчете(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернетеЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруПараметров()
	
	Перем Титульный, Титульный002, ЛистИ;

	Титульный    = ЭтаФорма.мДанныеОтчета.Титульный;
    ЛистД1        = ЭтаФорма.мДанныеОтчета.ЛистД1;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ВерсПрог",          РегламентированнаяОтчетность.НазваниеИВерсияПрограммы());
	мПараметры.Вставить("КНД",               "1151020");
	мПараметры.Вставить("ДатаДок",           Формат(СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи, "ДФ=дд.ММ.гггг"));
	мПараметры.Вставить("ГодПериодОтч",      Формат(СтруктураРеквизитовФормы.мСохраненныйДок.ДатаОкончания, "ДФ=гггг"));
	мПараметры.Вставить("ПериодОтч",         СокрЛП(Титульный.Период));
	мПараметры.Вставить("КодИФНС",           СокрЛП(Титульный.КодИМНС));
	мПараметры.Вставить("ВидДок",            Строка(СтруктураРеквизитовФормы.мСохраненныйДок.Вид));
	мПараметры.Вставить("ТелФЛ",             СокрЛП(Титульный.ТелОрганизации));
	мПараметры.Вставить("ФамилияФЛ",         СокрЛП(Титульный.Фамилия));
	мПараметры.Вставить("ИмяФЛ",             СокрЛП(Титульный.Имя));
	мПараметры.Вставить("ОтчествоФЛ",        СокрЛП(Титульный.Отчество));

	мПараметры.Вставить("КодКатегорииФЛ",    СокрЛП(Титульный.ПоМесту));
	мПараметры.Вставить("СтатусФЛ",          СокрЛП(Титульный.СтатусНалогоплательщика));
	мПараметры.Вставить("АдресИноФЛ",        СокрЛП(Титульный.АдресЗаПределамиРФ));

	мПараметры.Вставить("ПрАдрФЛ",           СокрЛП(Титульный.МестоЖительства));
	мПараметры.Вставить("ИндексФЛ",          СокрЛП(Титульный.Индекс));
	мПараметры.Вставить("РегионФЛ",          СокрЛП(Титульный.Регион));
	мПараметры.Вставить("РайонФЛ",           СокрЛП(Титульный.Район));
	мПараметры.Вставить("ГородФЛ",           СокрЛП(Титульный.Город));
	мПараметры.Вставить("НаселенныйПунктФЛ", СокрЛП(Титульный.НаселенныйПункт));
	мПараметры.Вставить("УлицаФЛ",           СокрЛП(Титульный.Улица));
	мПараметры.Вставить("ДомФЛ",             СокрЛП(Титульный.Дом));
	мПараметры.Вставить("КорпусФЛ",          СокрЛП(Титульный.Корпус));
	мПараметры.Вставить("КвартираФЛ",        СокрЛП(Титульный.Квартира));

	мПараметры.Вставить("ИННФЛ",             СокрЛП(Титульный.ИНН));
	мПараметры.Вставить("ДатаРожденияФЛ",    СокрЛП(Титульный.ДатаРождения));
	мПараметры.Вставить("МестоРожденияФЛ",   СокрЛП(Титульный.МестоРождения));
	мПараметры.Вставить("СтранаФЛ",          СокрЛП(Титульный.КодСтраны));

	мПараметры.Вставить("КодВидДокФЛ",       СокрЛП(Титульный.КодВидаДокумента));
	мПараметры.Вставить("СерНомДокФЛ",       СокрЛП(Титульный.СерияИНомерДокумента));
	мПараметры.Вставить("ДатаДокФЛ",         Формат(Титульный.ДатаВыдачиДокумента, "ДФ=дд.ММ.гггг"));
	мПараметры.Вставить("ВыдДокФЛ",          СокрЛП(Титульный.КемВыданДокумент));     

	мПараметры.Вставить("ТипПодписанта",        СокрЛП(Титульный.ПрПодп));
	мПараметры.Вставить("НаимДокПредставителя", СокрЛП(Титульный.ДокУпПред));

	мПараметры.Вставить("ФамилияПодписанта",    Титульный.ОргПодписантФамилия);
	мПараметры.Вставить("ИмяПодписанта",        Титульный.ОргПодписантИмя);
	мПараметры.Вставить("ОтчествоПодписанта",   Титульный.ОргПодписантОтчество);

	мПараметры.Вставить("ИмяФайлаСхемы",             "NO_NDFL3_1_033_00_05_09_01.xsd");
	мПараметры.Вставить("ПрефиксИмениФайлаВыгрузки", "NO_NDFL3");

	мПараметры.Вставить("ИмяКлючевогоУзлаСодержательнойЧасти", "НДФЛ3");

	мПараметры.Вставить("ИдФайл", СформироватьИдФайл(мПараметры));

	Для Каждого ДанныеЛистаД1 Из ЛистД1 Цикл
		СтраницаЛистаД1 = ДанныеЛистаД1.Данные[0].Значение;
		Если ЗначениеЗаполнено(СтраницаЛистаД1.П000700001100_1) И ЗначениеЗаполнено(СтраницаЛистаД1.П000700001100_3) Тогда
			СтраницаЛистаД1.Вставить("П000700001100", СокрЛП(СтраницаЛистаД1.П000700001100_1) + "/" + СокрЛП(СтраницаЛистаД1.П000700001100_3));
		Иначе
			СтраницаЛистаД1.Вставить("П000700001100", "");
		КонецЕсли;
	КонецЦикла;
	
	Возврат мПараметры;
	
КонецФункции

&НаСервере
Функция ВывестиПоказательВXML(Узел, ЗначениеПоказателя)
	
	МинШирина = Узел.МинРазмерность;
	МаксШирина = Узел.МаксРазмерность;
	
	// Для ОКВЭД нужно убрать точки в конце
	Если Узел.Код = "ОКВЭД" Тогда
		
		ЗначениеПоказателя = СтрЗаменить(СокрЛП(СтрЗаменить(ЗначениеПоказателя, ".", " ")) ," ", ".");
		
	КонецЕсли;
	
	Если Узел.Формат = "T" ИЛИ Узел.Формат = "Т" Тогда // учтем оба варианта: кириллицу и латиницу
		Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			Узел.Значение = ?(МаксШирина < СтрДлина(СокрЛП(ЗначениеПоказателя)), СокрЛП(Лев(СокрЛП(ЗначениеПоказателя), МаксШирина)), СокрЛП(ЗначениеПоказателя));
		Иначе
			Узел.Значение = Неопределено;
		КонецЕсли;
	ИначеЕсли Узел.Формат = "N" Тогда
		СтрокаФормата = "ЧРД=.; ЧН=0; ЧГ=";
		Если Узел.МаксРазмерность <> 0 И Узел.МаксРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧЦ=" + Формат(Узел.МаксРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Если Узел.МинРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧДЦ=" + Формат(Узел.МинРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, СтрокаФормата));
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Если ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
			Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
				Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, "ДФ=гггг"));
			Иначе
				Узел.Значение = Неопределено;
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			// Пустое значение для gYear
			Узел.Значение = "0001";
		ИначеЕсли ТипЗнч(ЗначениеПоказателя) = Тип("Число") Тогда
			
			Узел.Значение = Прав(СокрЛП(Формат(ЗначениеПоказателя, "ЧГ=")), 4);
			
		Иначе
			Узел.Значение = Прав(СокрЛП(ЗначениеПоказателя), 4);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УсловиеЮр_Физ(Параметры, Узел, НомерСтроки = Неопределено)
	
	//проверка на длину ИНН для заполнения соответствующей ветки
	Результат = Ложь;
	ЗначениеПоказателя = Неопределено;
	Если Узел.Код = "ИстЮЛ" ИЛИ Узел.Код = "СведИст" ИЛИ Узел.Код = "СвОрг" Тогда
		КлючПодчиненногоЭлемента = Узел.Строки.Найти("ИННЮЛ").Ключ;
		ПолныйКодПоказателя = КлючПодчиненногоЭлемента + ?(ЗначениеЗаполнено(НомерСтроки), "_" + Формат(НомерСтроки, "ЧГ="), "");
		Если Параметры.Свойство(ПолныйКодПоказателя, ЗначениеПоказателя) Тогда
			Если НЕ ЗначениеЗаполнено(ЗначениеПоказателя) ИЛИ СтрДлина(СокрЛП(ЗначениеПоказателя)) > 10 Тогда
				РегламентированнаяОтчетность.УдалитьУзел(Узел);
				Результат = Ложь;
			Иначе
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Узел.Код = "ИстФЛИн" ИЛИ Узел.Код = "СвФЛ" Тогда
		КлючПодчиненногоЭлемента = Узел.Строки.Найти("ИННФЛ").Ключ;
		ПолныйКодПоказателя = КлючПодчиненногоЭлемента + ?(ЗначениеЗаполнено(НомерСтроки), "_" + Формат(НомерСтроки, "ЧГ="), "");
		Если Параметры.Свойство(ПолныйКодПоказателя, ЗначениеПоказателя) Тогда
			Если ЗначениеЗаполнено(ЗначениеПоказателя) И СтрДлина(СокрЛП(ЗначениеПоказателя)) < 12 Тогда
				РегламентированнаяОтчетность.УдалитьУзел(Узел);
				Результат = Ложь;
			Иначе
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела = Неопределено, НомерСтроки = Неопределено, ТолькоАтрибуты = Ложь)
	
	Если Узел = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Получаем данные конкретного раздела
	Если ДанныеРаздела = Неопределено Тогда
		ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	КонецЕсли;
	
	СтрокиУзла = Новый Массив;
	Для Каждого Стр Из Узел.Строки Цикл
		СтрокиУзла.Добавить(Стр);
	КонецЦикла;

	Для Каждого Стр из СтрокиУзла Цикл
		Если (Стр.Тип = "С" ИЛИ Стр.Тип = "C") И Не ТолькоАтрибуты Тогда // учтем оба варианта: кириллицу и латиницу
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеРаздела, "ИмяКлючевогоУзлаСодержательнойЧасти") И Стр.Код = ДанныеРаздела.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
				ЗаполнитьСодержательнуюЧасть(Стр);
			ИначеЕсли Стр.Многострочность Тогда
				//Особенность декларации, многострочные подузлы для вывода сведений об организациях-источниках
				//
				Если Стр.Код = "ИстЮЛ" ИЛИ Стр.Код = "ИстФЛИн" ИЛИ Стр.Код = "СведИст" 
					ИЛИ Стр.Код = "СвОрг" ИЛИ Стр.Код = "СвФЛ" Тогда
					Если Стр.Родитель.Многострочность Тогда
						Если УсловиеЮр_Физ(ДанныеРаздела, Стр, НомерСтроки) Тогда
							ЗаполнитьДаннымиУзел(Стр, ДанныеРаздела, НомерСтроки);
						КонецЕсли;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				НомСтр = 1;
				ПодчиненныйЭлемент = ПолучитьПервыйПодчиненныйУзелСЗаполненнымКлючом(Стр);
				КлючПодчиненногоЭлемента = ПодчиненныйЭлемент.Ключ;
				Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеРаздела, КлючПодчиненногоЭлемента + "_" + Формат(НомСтр, "ЧГ=")) Цикл

					УзелСоответствующийСтроке = СкопироватьУзел(Узел, Стр);

					ЗаполнитьДаннымиУзел(УзелСоответствующийСтроке, ДанныеРаздела, НомСтр);
					НомСтр = НомСтр + 1;
					
				КонецЦикла;
			Иначе
				Если Стр.Код = "ИстЮЛ" ИЛИ Стр.Код = "ИстФЛИн" ИЛИ Стр.Код = "СведИст" 
					ИЛИ Стр.Код = "СвОрг" ИЛИ Стр.Код = "СвФЛ" Тогда
					Если УсловиеЮр_Физ(ДанныеРаздела, Стр, НомерСтроки) Тогда
						ЗаполнитьДаннымиУзел(Стр, ДанныеРаздела, НомерСтроки);
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Стр.Раздел) И Не Стр.Многостраничность Тогда
					ЗаполнитьДаннымиУзел(Стр, , НомерСтроки);
				Иначе
					ЗаполнитьДаннымиУзел(Стр, ДанныеРаздела, НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ПустаяСтрока(Стр.ЗначениеПоУмолчанию) Тогда
				Если НЕ ПустаяСтрока(Стр.Ключ) Тогда
					ПолныйКодПоказателя = Стр.Ключ + ?(ЗначениеЗаполнено(НомерСтроки), "_" + Формат(НомерСтроки, "ЧГ="), "");
					Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеРаздела, ПолныйКодПоказателя) Тогда
						ЗначениеПоказателя = ?(ДанныеРаздела[ПолныйКодПоказателя] = 0,Стр.ЗначениеПоУмолчанию , ДанныеРаздела[ПолныйКодПоказателя]);
						ЗначениеПоказателя = ?(ЗначениеПоказателя = "" И Стр.Формат = "N", "0" + Сред(Формат(1, "ЧРД=.; ЧЦ= " + (Стр.МинРазмерность + 1) + "; ЧДЦ=" + Стр.МинРазмерность + ";"), 2) , ЗначениеПоказателя);
						ВывестиПоказательВXML(Стр, ЗначениеПоказателя);
					Иначе
						ВывестиПоказательВXML(Стр, "");
					КонецЕсли;
				Иначе
					Стр.Значение = "";
				КонецЕсли;
			ИначеЕсли Лев(Стр.ЗначениеПоУмолчанию, 1) = "&" Тогда
				ВывестиПоказательВXML(Стр, ДанныеРаздела[Сред(Стр.ЗначениеПоУмолчанию, 2)]);
			Иначе
				Стр.Значение = Стр.ЗначениеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗначениеСоответствуетФормату(Стр)
	
	СтатусПроверки = Истина;
	
	Если Стр.Формат = "Т" ИЛИ Стр.Формат = "T"  ИЛИ Стр.Формат = "S" Тогда // учтем оба варианта: кириллицу и латиницу
		ДлинаЗначения = СтрДлина(Стр.Значение);
		Если ДлинаЗначения < Стр.МинРазмерность Тогда
			СтатусПроверки = Ложь;
			Если ЗначениеЗаполнено(Стр.Раздел) И ЗначениеЗаполнено(Стр.Ключ) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """ (" + РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)+ ") меньше минимально возможной (" + ДлинаЗначения
					+ " < " + Стр.МинРазмерность + ")", Стр.Раздел, Стр.Ключ, "");
			Иначе
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """ (" + РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)+ ") меньше минимально возможной (" + ДлинаЗначения
					+ " < " + Стр.МинРазмерность + ")", "Титульный", "");
			КонецЕсли;
		КонецЕсли;
		Если ДлинаЗначения > Стр.МаксРазмерность Тогда
			СтатусПроверки = Ложь;
			Если ЗначениеЗаполнено(Стр.Раздел) И ЗначениеЗаполнено(Стр.Ключ) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """  (" + РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)+ ") больше максимально возможной (" + ДлинаЗначения
					+ " > " + Стр.МаксРазмерность + ")", Стр.Раздел, Стр.Ключ, "");
			Иначе
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтаФорма,
					"Формирование XML: Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """  (" + РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)+ ") больше максимально возможной (" + ДлинаЗначения
					+ " > " + Стр.МаксРазмерность + ")", "Титульный", "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ПроверитьДанные(Узел)
	
	СтатусПроверки = Истина;
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если НЕ ЗначениеСоответствуетФормату(Узел) Тогда
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Стр из Узел.Строки Цикл
		СтатусПроверки = (ПроверитьДанные(Стр) И СтатусПроверки); // именно в указанном порядке для выдачи всех ошибок
	КонецЦикла;
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ПотокXML = РегламентированнаяОтчетность.СоздатьНовыйПотокXML("windows-1251"); // создаем новый поток для записи
	ЗаписатьУзелДереваВXML(ДеревоВыгрузки, ПотокXML, ПараметрыВыгрузки); // пишем дерево в поток
	ТекстДляЗаписи = ПотокXML.Закрыть(); // получаем текст XML
	Возврат ТекстДляЗаписи;
	
КонецФункции

&НаСервере
Функция СформироватьИдФайл(ПараметрыВыгрузки)
	
		Возврат ПараметрыВыгрузки.ПрефиксИмениФайлаВыгрузки
				+ "_" + ПараметрыВыгрузки.КодИФНС
				+ "_" + ПараметрыВыгрузки.КодИФНС
				// ДЕНЬГИ
				// Если ИНН не указан, нужно заполнять 12-ю нулями
				//+ "_" + СокрЛП(ПараметрыВыгрузки.ИННФЛ)
				+ "_" + ?(ПустаяСтрока(ПараметрыВыгрузки.ИННФЛ), "000000000000", СокрЛП(ПараметрыВыгрузки.ИННФЛ))
				// Конец ДЕНЬГИ
				+ "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд")
				+ "_" + Строка(Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция СкопироватьУзел(Родитель, Узел)
	
	// находим узел с максимальным индексом и с тем же кодом, что и у копируемого, и добавляем новый сразу после найденного
	СтрокиСТемЖеКодом = Родитель.Строки.НайтиСтроки(Новый Структура("Код", Узел.Код), Ложь);
	МаксИндекс = -1;
	Для Каждого СтрокаСТемЖеКодом Из СтрокиСТемЖеКодом Цикл
		ТекИндекс = Родитель.Строки.Индекс(СтрокаСТемЖеКодом);
		Если ТекИндекс > МаксИндекс Тогда
			МаксИндекс = ТекИндекс;
		КонецЕсли;
	КонецЦикла;
	
	ИндексСоздаваемогоУзла = МаксИндекс + 1;
	Если ИндексСоздаваемогоУзла >= Родитель.Строки.Количество() ИЛИ ИндексСоздаваемогоУзла = 0 Тогда // если аналогичный узел не найден или найденный узел - последний
		НовыйУзел = Родитель.Строки.Добавить();
	Иначе
		НовыйУзел = Родитель.Строки.Вставить(ИндексСоздаваемогоУзла);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйУзел, Узел, , "Родитель, Строки");
	Для Каждого Стр из Узел.Строки Цикл
		СкопироватьУзел(НовыйУзел, Стр);
	КонецЦикла;
	Возврат НовыйУзел;
	
КонецФункции

&НаСервере
Функция ПолучитьПодчиненныйЭлемент(Узел, КодЭлемента)
	
	ЧислоВместоКодаЭлемента = (ТипЗнч(КодЭлемента) = Тип("Число"));
	Если ТипЗнч(КодЭлемента) = Тип("Число") Тогда
		Если Узел.Строки.Количество() > КодЭлемента Тогда
			Возврат Узел.Строки.Получить(КодЭлемента);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Для Каждого Стр Из Узел.Строки Цикл
			Если Стр.Код = КодЭлемента Тогда
				Возврат Стр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСодержательнуюЧасть(УзелРодитель)
	
	Если УзелРодитель = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДеревоВыгрузки = УзелРодитель.Владелец();
	
	// Создаем Родительский узел - эталон, структура будет определеяться по эталонному узлу
	// после прохода по всем элемента структуры эталонного узла он будет удален
	Эталон = СкопироватьУзел(УзелРодитель.Родитель, УзелРодитель);
	
	// Очищаем все подчиненные узлы родительского узла
	// по мере необходимости эти узлы будут создаваться
	УзелРодитель.Строки.Очистить();
	
	// Перебираем подчиненные разлелы и листы
	Для Каждого ПодчиненныйУзел Из Эталон.Строки Цикл

		// Получаем данные конкретного раздела
		ДанныеРаздела = мДанныеОтчета[ПодчиненныйУзел.Раздел];
		
		// Многостраничные разделы
		Если ПодчиненныйУзел.Многостраничность Тогда
			
			Если ПодчиненныйУзел.Код = "ДоходИстИно" Тогда
				СтавкиИУзлы = Новый Соответствие;
				
				ЭталонСтрокиЛистаБ = ПолучитьПодчиненныйЭлемент(ПодчиненныйУзел, "РасчДохНалИно");
				
				Для Каждого СтраницаЛистаБ Из ДанныеРаздела  Цикл
					
					// Проверим заполненность страницы раздела
					Если НЕ СтраницаПуста(СтраницаЛистаБ.Данные[0].Значение, ПодчиненныйУзел.Раздел, ДеревоВыгрузки) Тогда
						СтавкаЛиста = Неопределено;
						Если СтраницаЛистаБ.Данные[0].Значение.Свойство("П000400001001", СтавкаЛиста) Тогда
							
							ЭкземплярУзла = СтавкиИУзлы.Получить(СтавкаЛиста);
							Если ЭкземплярУзла = Неопределено Тогда
								ЭкземплярУзла = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);
								СтавкиИУзлы.Вставить(СтавкаЛиста, ЭкземплярУзла);
							КонецЕсли;
							Для Каждого СтрокаЛистаБ Из СтраницаЛистаБ.ДанныеДопСтрок[0].Значение Цикл
								ЭкземплярСтроки = СкопироватьУзел(ЭкземплярУзла, ЭталонСтрокиЛистаБ);
								ЗаполнитьДаннымиУзел(ЭкземплярСтроки, СтрокаЛистаБ);
							КонецЦикла;
							ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтраницаЛистаБ.Данные[0].Значение,, Истина);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
	
			// ЛистВ обраатываем по особенному
			// Итоги на последнем листе являются атрибутами всего раздела
			// а данные о видах деятельности подразделами
			// отдельным разделом является информация о крестьянском фермерском хозяйстве
			ИначеЕсли ПодчиненныйУзел.Код = "ДоходПредпр" Тогда
				
				// Создаем узел раздела, в него будем добавлять подузлы для видов деятельности
				УзелЛистаВ = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);
				
				УзелВидаДеятельности = ПолучитьПодчиненныйЭлемент(ПодчиненныйУзел, "РасчВидДеят");
				Если УзелВидаДеятельности = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Для Каждого СтраницаЛистаВ Из ДанныеРаздела  Цикл
					
					// Проверим заполненность страницы раздела
					Если НЕ СтраницаПуста(СтраницаЛистаВ.Данные[0].Значение, ПодчиненныйУзел.Раздел, ДеревоВыгрузки) Тогда
						
						ЭкземплярУзла = СкопироватьУзел(УзелЛистаВ, УзелВидаДеятельности);
						ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтраницаЛистаВ.Данные[0].Значение);
						
					КонецЕсли;
				КонецЦикла;
				
				// Последняя страница - итоговая, на ней находятся итоговые данные по всему узлу
				// данные о крестьянском фермерском хозяйстве и о корректировке
				УзелКФХ = ПолучитьПодчиненныйЭлемент(УзелЛистаВ, "СведКФХ");
				Если УзелКФХ <> Неопределено Тогда
					ЗаполнитьДаннымиУзел(УзелКФХ, СтраницаЛистаВ.Данные[0].Значение);
				КонецЕсли;
				
				УзелНБКор105_3 = ПолучитьПодчиненныйЭлемент(УзелЛистаВ, "НБКор105.3");
				Если УзелНБКор105_3 <> Неопределено Тогда
					ЗаполнитьДаннымиУзел(УзелНБКор105_3, СтраницаЛистаВ.Данные[0].Значение);
				КонецЕсли;
				
				ЗаполнитьДаннымиУзел(УзелЛистаВ, СтраницаЛистаВ.Данные[0].Значение, , Истина);
				
			ИначеЕсли ПодчиненныйУзел.Код = "ВычСоцИнв219" Тогда
				
				ЭкземплярУзлаЕ2 = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);;
				
				Экземпляр_РасчПСВВыч = ПолучитьПодчиненныйЭлемент(ЭкземплярУзлаЕ2, "РасчПСВВыч");
				Эталон_РасчПСВВыч = ПолучитьПодчиненныйЭлемент(ПодчиненныйУзел, "РасчПСВВыч");
				Эталон_СведДогНПО = ПолучитьПодчиненныйЭлемент(Эталон_РасчПСВВыч, "СведДогНПО");
				Экземпляр_СведДогНПО = ПолучитьПодчиненныйЭлемент(Экземпляр_РасчПСВВыч, "СведДогНПО");
				Экземпляр_СведДогНПО.Родитель.Строки.Удалить(Экземпляр_СведДогНПО);
				Экземпляр_РасчДопСВВыч = ПолучитьПодчиненныйЭлемент(ЭкземплярУзлаЕ2, "РасчДопСВВыч");
				
				ИтогиЛистаЕ2 = Новый ТаблицаЗначений;
				ИменаКолонок = "";
				Для Каждого СтраницаЛистаЕ2 Из ДанныеРаздела Цикл
					// Проверим заполненность страницы раздела
					Если НЕ СтраницаПуста(СтраницаЛистаЕ2.Данные[0].Значение, ПодчиненныйУзел.Раздел, ДеревоВыгрузки) Тогда
						
						Если ИтогиЛистаЕ2.Колонки.Количество() = 0 Тогда
							Для Каждого КлючИЗначение Из СтраницаЛистаЕ2.Данные[0].Значение Цикл
								ИтогиЛистаЕ2.Колонки.Добавить(КлючИЗначение.Ключ);
								ИменаКолонок = ИменаКолонок + КлючИЗначение.Ключ + ",";
							КонецЦикла;
						КонецЕсли;
						ИменаКолонок = Сред(ИменаКолонок,0 , СтрДлина(ИменаКолонок));
						СтрокаИтогов = ИтогиЛистаЕ2.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаИтогов, СтраницаЛистаЕ2.Данные[0].Значение);
						
						ЭкземплярСведДогНПО = СкопироватьУзел(Экземпляр_РасчПСВВыч, Эталон_СведДогНПО);
						ЗаполнитьДаннымиУзел(ЭкземплярСведДогНПО, СтраницаЛистаЕ2.Данные[0].Значение);
						
					КонецЕсли;
				КонецЦикла;
				
				Если ИтогиЛистаЕ2.Количество() > 0 Тогда
					ИтогиЛистаЕ2.Колонки.Добавить("КолонкаСвертки");
					ИтогиЛистаЕ2.Свернуть("КолонкаСвертки", ИменаКолонок);
					ЗаполнитьДаннымиУзел(Экземпляр_РасчПСВВыч,  ИтогиЛистаЕ2[0], , Истина);
					ЗаполнитьДаннымиУзел(Экземпляр_РасчДопСВВыч, ИтогиЛистаЕ2[0], , Истина);
				КонецЕсли;
				
				ЗаполнитьДаннымиУзел(ЭкземплярУзлаЕ2, СтраницаЛистаЕ2.Данные[0].Значение, , Истина);
			ИначеЕсли ПодчиненныйУзел.Код = "ИмущНалВычНов" Тогда
				
				ЭкземплярУзлаД1 = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);;
				
				Экземпляр_РасчИмущВыч = ПолучитьПодчиненныйЭлемент(ЭкземплярУзлаД1, "РасчИмущВыч");
				Эталон_РасчИмущВыч = ПолучитьПодчиненныйЭлемент(ПодчиненныйУзел, "РасчИмущВыч");
				Эталон_СвОбъектРасх = ПолучитьПодчиненныйЭлемент(Эталон_РасчИмущВыч, "СвОбъектРасх");
				Экземпляр_СвОбъектРасх = ПолучитьПодчиненныйЭлемент(Экземпляр_РасчИмущВыч, "СвОбъектРасх");
				Экземпляр_СвОбъектРасх.Родитель.Строки.Удалить(Экземпляр_СвОбъектРасх);
				
				НужноЗаполнитьИтог = Ложь;
				Для Каждого СтраницаЛистаД1 Из ДанныеРаздела Цикл
					// Проверим заполненность страницы раздела
					Если НЕ СтраницаПуста(СтраницаЛистаД1.Данные[0].Значение, ПодчиненныйУзел.Раздел, ДеревоВыгрузки) Тогда
						
						Экземпляр_СвОбъектРасх = СкопироватьУзел(Экземпляр_РасчИмущВыч, Эталон_СвОбъектРасх);
						ЗаполнитьДаннымиУзел(Экземпляр_СвОбъектРасх, СтраницаЛистаД1.Данные[0].Значение);
						НужноЗаполнитьИтог = Истина;
					КонецЕсли;
				КонецЦикла;
				Если НужноЗаполнитьИтог Тогда
					ЗаполнитьДаннымиУзел(Экземпляр_РасчИмущВыч, СтраницаЛистаД1.Данные[0].Значение, , Истина);
				КонецЕсли;
			Иначе
				// Перебираем страницы раздела
				Для Каждого СтраницаРаздела Из ДанныеРаздела Цикл
					
					// Проверим заполненность страницы раздела
					Если НЕ СтраницаПуста(СтраницаРаздела.Данные[0].Значение, ПодчиненныйУзел.Раздел, ДеревоВыгрузки, ПодчиненныйУзел.Многострочность) Тогда
						
						// Для листа А требуется особая обрабока, 
						// строка листа А в декларации соответствует отдельному листу А в структуре выгрузки
						// таким образом в файле выгрузки нужно создать такое количество листов А которое 
						// соответствует количеству строк у всех листов А в декларации
						Если ПодчиненныйУзел.Раздел = "ЛистА" Тогда
							
							Для Каждого СтрокаМногострочнойЧасти Из СтраницаРаздела.ДанныеДопСтрок[0].Значение Цикл
								
								// Копируем пустой подчиненные узел из эталона в РодительскийУзел
								ЭкземплярУзла = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);
								
								ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтрокаМногострочнойЧасти);
								
							КонецЦикла;
							
						Иначе
							
							// Копируем пустой подчиненные узел из эталона в РодительскийУзел
							ЭкземплярУзла = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);
							
							// Заполняем новый узел данными
							ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтраницаРаздела.Данные[0].Значение);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		// Лист З особенный, у него 4 продолжения, на основе которых заполняются 10 узлов выгрузки
		ИначеЕсли ПодчиненныйУзел.Код = "ДохОперЦБ" Тогда
			
			// Создаем узел раздела, в него будем добавлять подузлы
			УзелЛистаЗСПродолжениями = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);
			
			ПоказатьИтоговыйРаздел = Ложь;
			
			// Лист З
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохОперЦБОрг");
			Если НЕ СтраницаПуста(ДанныеРаздела, Узел.Раздел, ДеревоВыгрузки) Тогда
				ПоказатьИтоговыйРаздел = Истина;
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
			КонецЕсли;
		
			// Продолжение Листа З
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохОперЦБОргНеОрг");
			ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
			
			Если НЕ СтраницаПуста(ДанныеРаздела, Узел.Раздел, ДеревоВыгрузки) Тогда
				ПоказатьИтоговыйРаздел = Истина;
				
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохОперЦБНеОрг");
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
			КонецЕсли;
			
			// Продолжение 2 Листа З
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохФИССОргЦБ");
			ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
			
			Если НЕ СтраницаПуста(ДанныеРаздела, Узел.Раздел, ДеревоВыгрузки) Тогда
				ПоказатьИтоговыйРаздел = Истина;
				
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохФИССОргНеЦБ");
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохФИССНеОрг");
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
			КонецЕсли;
			
			// Продолжение 3 Листа З
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохРЕПО");
			ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
			
			Если НЕ СтраницаПуста(ДанныеРаздела, Узел.Раздел, ДеревоВыгрузки) Тогда
				ПоказатьИтоговыйРаздел = Истина;
				
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ДохЗаймЦБ");
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
			КонецЕсли;
			
			// Продолжение 4 Листа З
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "УбытПредПер");
			ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
			
			Если НЕ СтраницаПуста(ДанныеРаздела, Узел.Раздел, ДеревоВыгрузки) ИЛИ ПоказатьИтоговыйРаздел Тогда
				
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "УбытПрхПер");
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениями, "ИтогСовОпер");
				ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела);
				
			Иначе
				
				Узел.Родитель.Строки.Удалить(Узел);
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ СтраницаПуста(ДанныеРаздела, ПодчиненныйУзел.Раздел, ДеревоВыгрузки, ПодчиненныйУзел.Многострочность) Тогда
				
				// Копируем пустой подчиненные узел из эталона в РодительскийУзел
				ЭкземплярУзла = СкопироватьУзел(УзелРодитель, ПодчиненныйУзел);
				
				// Заполняем новый узел данными
				// Данные для заполнения этого и каждого подчиненного узла будут получены отдельно внутри
				ЗаполнитьДаннымиУзел(ЭкземплярУзла);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаляем эталон из дерева выгрузки
	Эталон.Родитель.Строки.Удалить(Эталон);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНулямиНезаполненныеАтрибуты(Узел, Знач Исключения = Неопределено)
	
	Если Исключения = Неопределено Тогда
		Исключения = Новый Структура;
	КонецЕсли;
	
	Если (Узел.Тип = "А" ИЛИ Узел.Тип = "A") И НЕ ЗначениеЗаполнено(Узел.Значение) Тогда
		ЗначениеАтрибута = Неопределено;
		Узел.Значение = ?(Исключения.Свойство(Узел.Код, ЗначениеАтрибута), ЗначениеАтрибута, "0");
	КонецЕсли;
	
	Для Каждого Стр Из Узел.Строки Цикл
		ЗаполнитьНулямиНезаполненныеАтрибуты(Стр, Исключения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьПустойУзелРаздела(УзелРодитель, СтруктураПустогоРаздела, ТолькоПервыйУровень = Ложь, ИндексУзла = Неопределено, УзелРаздела = Неопределено)
	
	Если ТолькоПервыйУровень Тогда
		
		Если УзелРаздела = Неопределено Тогда
			Если ИндексУзла = Неопределено Тогда
				УзелРаздела = УзелРодитель.Строки.Добавить();
			Иначе
				УзелРаздела = УзелРодитель.Строки.Вставить(ИндексУзла);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(УзелРаздела, СтруктураПустогоРаздела);
		КонецЕсли;
		
		Для Каждого Стр Из СтруктураПустогоРаздела.Строки Цикл
			Если (Стр.Тип = "А" ИЛИ Стр.Тип = "A") И УзелРаздела.Строки.Найти(Стр.Код, "Код") = Неопределено Тогда
				
				// ищем первое вхождение сложного элемента и вставляем на его место новый атрибут
				СложныйЭлемент = УзелРаздела.Строки.Найти("С", "Тип");
				Если СложныйЭлемент = Неопределено Тогда
					НовСтр = УзелРаздела.Строки.Добавить();
				Иначе
					НовСтр = УзелРаздела.Строки.Вставить(УзелРаздела.Строки.Индекс(СложныйЭлемент));
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НовСтр, Стр);
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Если УзелРаздела = Неопределено Тогда
			Если ИндексУзла = Неопределено Тогда
				УзелРаздела = УзелРодитель.Строки.Добавить();
			Иначе
				УзелРаздела = УзелРодитель.Строки.Вставить(ИндексУзла);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(УзелРаздела, СтруктураПустогоРаздела);
		
		Для Каждого Стр Из СтруктураПустогоРаздела.Строки Цикл
			ЗагрузитьПустойУзелРаздела(УзелРаздела, Стр, ТолькоПервыйУровень);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат УзелРаздела;
	
КонецФункции

&НаСервере
Процедура ОтсечьНезаполненныеНеобязательныеУзлы(Узел)
	
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Стр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		ОтсечьНезаполненныеНеобязательныеУзлы(Стр);
	КонецЦикла;
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) И УзелПуст(Узел) Тогда // учтем оба варианта: кириллицу и латиницу
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		ИначеЕсли (СтрНайти(Узел.Обязательность, "М") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "M") <> 0) // учтем оба варианта: кириллицу и латиницу
			И УзелПуст(Узел)
			И ?(СтрНайти(Узел.Обязательность, "О") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "O") <> 0, РегламентированнаяОтчетность.ИмеютсяАналогичныеСоседниеУзлыКлюч(Узел), Истина) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УзелПуст(Узел)

	Для Каждого Стр из Узел.Строки Цикл
		Если НЕ УзелПуст(Стр) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел.Формат = "S" Тогда
		Возврат Истина;
		
	ИначеЕсли Узел.Формат = "N" Тогда
		
		ПустойПоказатель = "0" + Сред(Формат(1, "ЧРД=.; ЧЦ= " + (Узел.МинРазмерность + 1) + "; ЧДЦ=" + Узел.МинРазмерность + ";"), 2);
		Возврат Узел.Значение = ПустойПоказатель ИЛИ НЕ ЗначениеЗаполнено(Узел.Значение);
		
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Возврат Узел.Значение = "0001";
		
	Иначе
		Возврат НЕ ЗначениеЗаполнено(Узел.Значение);
		
	КонецЕсли;

КонецФункции

&НаСервере
Функция ЗаписатьУзелДереваВXML(СтрокаДерева, ПотокXML, ПараметрыВыгрузки) Экспорт
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДеревоЗначений") Тогда
		ПотокXML.ЗаписатьНачалоЭлемента("Файл");
		ПотокXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		Для каждого Стр Из СтрокаДерева.Строки Цикл
			ЗаписатьУзелДереваВXML(Стр, ПотокXML, ПараметрыВыгрузки);
		КонецЦикла;
		ПотокXML.ЗаписатьКонецЭлемента();
	Иначе
		Если СтрокаДерева.Тип = "А" ИЛИ СтрокаДерева.Тип = "A" Тогда 
			ПотокXML.ЗаписатьАтрибут(СтрокаДерева.Код, Строка(СтрокаДерева.Значение));
		Иначе
			ПотокXML.ЗаписатьНачалоЭлемента(СтрокаДерева.Код);
			Для каждого Лист из СтрокаДерева.Строки Цикл
				ЗаписатьУзелДереваВXML(Лист, ПотокXML, ПараметрыВыгрузки);
			КонецЦикла;
			ПотокXML.ЗаписатьТекст(Строка(СтрокаДерева.Значение));
			ПотокXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
		
	Печать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтаФорма.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтаФорма, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтаФорма, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	// Запомним текущий раздел и страницу, чтобы к ним вернутся
	НаимТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	НомерТекущейСтраницы = СтруктураРеквизитовФормы.НомерТекущейСтраницы;
	
	Если НЕ РегламентированнаяОтчетность.ПринтерДоступен() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Перед формированием печатных форм необходимо определить в системе принтер и задать его в качестве используемого по умолчанию!'");
		
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(мДеревоВыбранныхСтраниц) <> Тип("ДанныеФормыДерево") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь, Ложь);
	
	Если СтруктураРеквизитовФормы.НужноРассчитатьОтчетНаСервере Тогда
		РасчетНаСервере();
	КонецЕсли; 
	
	сохрТаблДок = ТабличныйДокумент.ПолучитьОбласть();
	
	СтрПоля = "ПолеСверху, ПолеСправа, ПолеСнизу, ПолеСлева";
	ВремПоля = Новый Структура(СтрПоля);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	
	ВывестиМакетВТаблДокНаСервере("Титульный", 0);
	
	ОбщиеРеквизитыРазделов = ПолучитьОбщиеРеквизитыСТитульногоЛиста();
	
	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.ПолучитьЭлементы() Цикл
		
		Если СтрокаУровня1.ВыводНаПечать = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НаименованиеЛиста",  СтрЗаменить(СтрокаУровня1.Представление, Символы.ПС, " "));
		СтруктураПараметров.Вставить("ОриентацияЛиста",    СтрокаУровня1.ОриентацияСтраницы);
		СтруктураПараметров.Вставить("ИмяСтраницы",        СтрокаУровня1.ИмяСтраницы);
		СтруктураПараметров.Вставить("ИмяОбластиТаблПоля", СтрокаУровня1.ИмяОбластиТабличногоПоля);
		СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
		СтруктураПараметров.Вставить("НомСтр", 				1);
		СтруктураПараметров.Вставить("Количество",          1);
		
		Если НЕ мСтруктураМногостраничныхРазделов.Свойство(СтрокаУровня1.ИмяСтраницы) Тогда
			
			ВывестиМакетВТаблДокНаСервере(СтрокаУровня1.ИмяСтраницы, 0);
			ВывестиНаПечатьЛист(СтруктураПараметров, ОбщиеРеквизитыРазделов, СтрПоля);
			
		Иначе
			
			СтруктураПараметров.Вставить("ИмяСтраницыПанели", СтрокаУровня1.ИмяСтраницы);
			
			ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметров, ОбщиеРеквизитыРазделов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Возвращаем текущий раздел и страницу
	ВывестиМакетВТаблДокНаСервере(НаимТекущегоРаздела, НомерТекущейСтраницы);
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(сохрТаблДок);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
		
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтаФорма, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, мДеревоСтраницОтчета);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьЛист(Парам1, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено)
	
	СоответствиеРазделовМакетам = Новый Соответствие;
	
	СоответствиеРазделовМакетам.Вставить("Титульный",	 		"МЧБ_2015Кв1_01_Титульный");
	СоответствиеРазделовМакетам.Вставить("Раздел1",	 			"МЧБ_2015Кв1_02_Раздел1");
	СоответствиеРазделовМакетам.Вставить("Раздел2",	 			"МЧБ_2015Кв1_03_Раздел2");
	СоответствиеРазделовМакетам.Вставить("ЛистА",		 		"МЧБ_2015Кв1_04_ЛистА");
	СоответствиеРазделовМакетам.Вставить("ЛистБ",		 		"МЧБ_2015Кв1_05_ЛистБ");
	СоответствиеРазделовМакетам.Вставить("ЛистВ",	 			"МЧБ_2015Кв1_06_ЛистВ");
	СоответствиеРазделовМакетам.Вставить("ЛистГ",	 			"МЧБ_2015Кв1_07_ЛистГ");
	СоответствиеРазделовМакетам.Вставить("ЛистД1",	 			"МЧБ_2015Кв1_08_ЛистД1");
	СоответствиеРазделовМакетам.Вставить("ЛистД2",	 			"МЧБ_2015Кв1_09_ЛистД2");
	СоответствиеРазделовМакетам.Вставить("ЛистЕ1",		 		"МЧБ_2015Кв1_10_ЛистЕ1");
	СоответствиеРазделовМакетам.Вставить("ЛистЕ2",		 		"МЧБ_2015Кв1_11_ЛистЕ2");
	СоответствиеРазделовМакетам.Вставить("ЛистЖ",		 		"МЧБ_2015Кв1_12_ЛистЖ");
	СоответствиеРазделовМакетам.Вставить("ЛистЗ",		 		"МЧБ_2015Кв1_13_ЛистЗ");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение",	"МЧБ_2015Кв1_14_ЛистЗПродолжение");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение2",	"МЧБ_2015Кв1_15_ЛистЗПродолжение2");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение3",	"МЧБ_2015Кв1_17_ЛистЗПродолжение3");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение4",	"МЧБ_2015Кв1_17_ЛистЗПродолжение4");
	СоответствиеРазделовМакетам.Вставить("ЛистИ",		 		"МЧБ_2015Кв1_18_ЛистИ");
	СоответствиеРазделовМакетам.Вставить("ЛистИПродолжение",	"МЧБ_2015Кв1_19_ЛистИПродолжение");
	
	МЧБРаздела = СоответствиеРазделовМакетам[Парам1.ИмяСтраницы];
	
	МакетМЧБ = ОтчетОбъект().ПолучитьМакет(МЧБРаздела);
	МакетМЧБ.ПолеСверху = 5;
	МакетМЧБ.ПолеСправа = 5;
	МакетМЧБ.ПолеСнизу = 5;
	МакетМЧБ.ПолеСлева = 5;
	
	ВремПоля = Новый Структура(СтрПоля);
	
	//Специальный алгоритм для многострочных разделов
	//Определение: является ли раздел многострочным 
	ИдГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(Парам1.ИмяСтраницы);
	
	Если ИдГруппы <> Неопределено Тогда
		
		ИсхКолвоСтрокБлока = 0;
		
		//определение исходного количества строк на листе МЧБ
		Если Парам1.ИмяСтраницы = "ЛистА" Тогда
			ИсхКолвоСтрокБлока = 3;
		ИначеЕсли Парам1.ИмяСтраницы = "ЛистБ" Тогда
			ИсхКолвоСтрокБлока = 2;
		КонецЕсли;
		
		СохрТабличныйДокумент = Новый ТабличныйДокумент;
		СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
		
		ТекКолвоСтрокБлока = ЭтаФорма[мСтруктураМногострочныхРазделов[ИдГруппы]].Количество();
		Если ТекКолвоСтрокБлока > ИсхКолвоСтрокБлока И ИсхКолвоСтрокБлока > 0 Тогда
			//Добавляли строки - значит будут доп. листы МЧБ
			//Определение общего количества листов МЧБ
			КолвоЛистовМЧБ = Цел(ТекКолвоСтрокБлока / ИсхКолвоСтрокБлока);
			КолвоСтрокНаПоследнемЛисте = ТекКолвоСтрокБлока % ИсхКолвоСтрокБлока;
			Если КолвоСтрокНаПоследнемЛисте <> 0 Тогда
				КолвоЛистовМЧБ = КолвоЛистовМЧБ + 1;	
			КонецЕсли;
			
			//заполнение строки имен показателей (для проверки перед переименованием)
			СтрИменаПоказателей = "";
			
			Колонки = ДанныеФормыВЗначение(ЭтаФорма[мСтруктураМногострочныхРазделов[ИдГруппы]], Тип("ТаблицаЗначений")).Колонки;
			
			Для каждого КолонкаСтруктуры Из Колонки Цикл
				СтрИменаПоказателей = СтрИменаПоказателей + КолонкаСтруктуры.Имя;
			КонецЦикла;
			
			//Заполнение списка листов МЧБ
			СписокЛистовМЧБ = Новый СписокЗначений;
			Для Сч = 1 По КолвоЛистовМЧБ Цикл
				//переименование (начиная со второго листа)
				Если Сч > 1 Тогда
					СписокОчищаемыхОбластей = Новый Массив;
					СписокОбластейПереименования = Новый СписокЗначений;
					Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
						ИмяЯчейки = ТекущаяОбласть.Имя;
						
						Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
							//проверка на вхождение в данную многострочную часть
							Продолжить;
						КонецЕсли;
						
						//определение и обрасывание НомерЯчейки
						ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
						ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
						НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
						//определение СмысловаяЧасть и ТекущийСчетчик
						СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
						СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
						ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
						
						СмысловаяЧастьСРазделителем = ?(ЗначениеЗаполнено(СмысловаяЧастьСРазделителем),СмысловаяЧастьСРазделителем, ПоказательИНомерСтрокиСРазделителем);
						СмысловаяЧасть = ?(ЗначениеЗаполнено(СмысловаяЧасть),СмысловаяЧасть, ПоказательИНомерСтроки);
						ТекущийСчетчик = ?(ЗначениеЗаполнено(ТекущийСчетчик),ТекущийСчетчик, НомерЯчейки);
						
						//Окончательная проверка на вхождение в данную многострочную часть
						Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						НовыйСчетчик = Число(ТекущийСчетчик) + ИсхКолвоСтрокБлока;
						Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
							//очищение происходит после этого цикла
							СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
							Продолжить;
						КонецЕсли;
						
						//Подготовка к переименованию
						//заполнение списка: значение - область, представление - будущее имя
						СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
					КонецЦикла;
					
					//Очищение
					Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
						ОбластьСписка.Имя = "";
						ОбластьСписка.Текст = "-";
					КонецЦикла;
					
					//Переименование
					Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
						ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
					КонецЦикла;
					
				КонецЕсли; 
				//переименование
				//
				СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
			КонецЦикла;
			
			Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
				
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
				
				ЛистМЧБ = элЛистМЧБ.Значение;
				
				ЗаполнитьМакетМЧБ(Парам1, ЛистМЧБ, ОбщиеРеквизитыРазделов);
				
				Если СписокЛистовМЧБ.Индекс(элЛистМЧБ)<СписокЛистовМЧБ.Количество() - 1 Тогда
					//Выводится не последний лист многострочной серии листов МЧБ
					//Необходимо обнулить итоговые показатели
					ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ЛистМЧБ);
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(ЛистМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
			КонецЦикла;
			Возврат;
			
			
			//Не добавляли строки - продолжение выполнения
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьМакетМЧБ(Парам1, МакетМЧБ, ОбщиеРеквизитыРазделов);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(МакетМЧБ);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
	
	РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтаФорма.Заголовок, Парам1, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов)
	Перем ИмяСтраницы;
	Перем ТаблицаСтраницРаздела;
	
	СтруктураПараметровСтраницы.Свойство("ИмяСтраницыПанели", ИмяСтраницы);
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяСтраницы, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = ЭтаФорма[ТаблицаСтраницРаздела];
	СтруктураПараметровСтраницы.Вставить("Количество", ТаблицаСтраницРаздела.Количество());
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		// выводим на печать каждую страницу многостраничного раздела
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		СохрАктивнаяСтраница = ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница;
		ВывестиМакетВТаблДокНаСервере(ИмяСтраницы, ТекущийИндекс + 1);
		ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница = СохрАктивнаяСтраница;
		СтруктураПараметровСтраницы.Вставить("НомСтр", ТекущийИндекс + 1);
		ВывестиНаПечатьЛист(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетМЧБ(Параметры, МакетМЧБ, ОбщиеРеквизитыРазделов)

	ТипЧисло  = Тип("Число");
	ТипДата   = Тип("Дата");
	ТипСтрока = Тип("Строка");
	
	// Заполняем ФИО, ИНН и дату подпсии
	Если МакетМЧБ.Области.Найти("ИНН") <> Неопределено Тогда
		МакетМЧБ.Области.ИНН.Текст = ОбщиеРеквизитыРазделов.СтрИНН;
	КонецЕсли; 
	
	Если МакетМЧБ.Области.Найти("Фамилия") <> Неопределено Тогда
		МакетМЧБ.Области.Фамилия.Текст = ОбщиеРеквизитыРазделов.СтрФамилия;
	КонецЕсли; 
	Если МакетМЧБ.Области.Найти("ИнициалИмя") <> Неопределено Тогда
		МакетМЧБ.Области.ИнициалИмя.Текст = Лев(СокрЛП(ОбщиеРеквизитыРазделов.СтрИмя),1);
	КонецЕсли; 
	Если МакетМЧБ.Области.Найти("ИнициалОтчество") <> Неопределено Тогда
		МакетМЧБ.Области.ИнициалОтчество.Текст = Лев(СокрЛП(ОбщиеРеквизитыРазделов.СтрОтчество),1);
	КонецЕсли; 
	
	Если МакетМЧБ.Области.Найти("ДатаПодписи1") <> Неопределено Тогда
		Для Счетчик = 1 По 8 Цикл
			МакетМЧБ.Области["ДатаПодписи" + Счетчик].Текст = ОбщиеРеквизитыРазделов.ДатаПодписи[Счетчик - 1];
		КонецЦикла; 
	КонецЕсли; 
	
	// Аккуратно переносим значения из табличного документа в макет МЧБ
	ИсходныйМакет = ТабличныйДокумент;
	
	Для Каждого Область Из ИсходныйМакет.Области Цикл
		
		Если Область.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник ИЛИ НЕ Область.СодержитЗначение Тогда
			Продолжить;
		КонецЕсли; 
		
		ИмяОбластиМЧБ = Область.Имя; // По умолчанию имена областей в МЧБ и в макете заполнения совпадают
		
		// Сначала обработаем нестандартные ситуации определеня значений
		Если Параметры.ИмяСтраницы = "Титульный" И Область.Имя = "МестоРождения" Тогда 
			
			ОбластьНазначения = МакетМЧБ.Области.Найти("МестоРождения");
			Если ОбластьНазначения <> Неопределено Тогда
				ОбластьНазначения.Текст = ОбщиеРеквизитыРазделов.МестоРождения.МестоРождения;
			КонецЕсли; 
			
			ОбластьНазначения = МакетМЧБ.Области.Найти("МестоРождения2");
			Если ОбластьНазначения <> Неопределено Тогда
				ОбластьНазначения.Текст = ОбщиеРеквизитыРазделов.МестоРождения.МестоРождения2;
			КонецЕсли; 
			
			Продолжить;
			
		ИначеЕсли Параметры.ИмяСтраницы = "ЛистВ" И Лев(Область.Имя, 13) = "П000500001020" Тогда 
			
			ЗначениеОбласти = СтрЗаменить(Область.Значение, ".", " ");
			
		ИначеЕсли Параметры.ИмяСтраницы = "ЛистД1" И Лев(Область.Имя, 15) = "П000700001100_1" Тогда
			
			Если НЕ ЗначениеЗаполнено(ИсходныйМакет.Области.П000700001100_1.Значение) И НЕ ЗначениеЗаполнено(ИсходныйМакет.Области.П000700001100_3.Значение)  Тогда
				ЗначениеОбласти = ""; // Доля с 2014 года не указывается
			Иначе
				ЗначениеОбласти = СокрЛП(ИсходныйМакет.Области.П000700001100_1.Значение) + "/" + СокрЛП(ИсходныйМакет.Области.П000700001100_3.Значение);
			КонецЕсли; 
			ИмяОбластиМЧБ = "П000700001100";
			
		ИначеЕсли Параметры.ИмяСтраницы = "ЛистВ" И Лев(Область.Имя, 13) = "П000500001150" Тогда
			
			ЗначениеОбласти = ?(Область.Значение = 0, "", Область.Значение);
			
		Иначе
			
			// Для стандартных значений просто получим значение обсласти
			ЗначениеОбласти = Область.ТипЗначения.ПривестиЗначение(Область.Значение);
			
		КонецЕсли; 
		
		ТипЗначенияОбласти = ТипЗнч(ЗначениеОбласти);
		
		ОбластьНазначения = МакетМЧБ.Области.Найти(ИмяОбластиМЧБ);
		Если ОбластьНазначения <> Неопределено Тогда
			
			Если ТипЗначенияОбласти = ТипЧисло Тогда

				// выводим число с учетом разрядности
				СтрокаФормата = "ЧЦ=" +  Область.ТипЗначения.КвалификаторыЧисла.Разрядность + 
								"; ЧДЦ=" + Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти + 
								"; ЧГ=; ЧРД=.; ЧН=0" + 
								?(Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти = 0, 
											"", 
											Лев(".00000000", Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти + 1));
				ОбластьНазначения.Текст = Формат(ЗначениеОбласти, СтрокаФормата); 
				
			ИначеЕсли ТипЗначенияОбласти = ТипДата Тогда
				
				ОбластьНазначения.Текст = Формат(ЗначениеОбласти, "ДФ=дд.ММ.гггг"); 
				
			Иначе
				
				ОбластьНазначения.Текст = ЗначениеОбласти; 
				
			КонецЕсли; 
				
		КонецЕсли; 
		
	КонецЦикла; 
	
	

КонецПроцедуры

&НаСервере
Функция ПолучитьОбщиеРеквизитыСТитульногоЛиста()
	
	МассивИНН         = Новый Массив(12);
	МассивКПП         = Новый Массив(9);
	МассивДатаПодписи = Новый Массив(8);
	МассивФамилия     = Новый Массив(32);
	МассивИмя         = Новый Массив(32);
	МассивОтчество    = Новый Массив(32);
	
	ИсходныйМакет = ТабличныйДокумент;
	
	Область = ИсходныйМакет.Области.Найти("ИНН");
	СтрИНН = "";
	Если НЕ Область = Неопределено Тогда
		
		СтрИНН = Область.Значение;
		
		Если СтрДлина(СтрИНН) = 10 Тогда
			СтрИНН = СтрИНН + "--";
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрИНН) Цикл
			
			МассивИНН[Ном - 1] = Сред(СтрИНН, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Область = ИсходныйМакет.Области.Найти("ДатаПодписи");
	
	Если НЕ Область = Неопределено Тогда
		
		Если ЗначениеЗаполнено(Область.Значение) Тогда
			СтрДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
		Иначе
			// Если дата подписи не заполнена подставим пустую строку соответствующей длины
			СтрДатаПодписи = "        ";
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрДатаПодписи) Цикл
			
			МассивДатаПодписи[Ном - 1] = Сред(СтрДатаПодписи, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = ИсходныйМакет.Области.Найти("Фамилия");
	СтрФамилия = "";
	Если НЕ Область = Неопределено Тогда
		СтрФамилия = Область.Значение;
		ДлинаФамилии = СтрДлина(СтрФамилия);
		
		Для Ном = 1 По ДлинаФамилии Цикл
			
			МассивФамилия[Ном - 1] = Сред(СтрФамилия, Ном, 1);
			
		КонецЦикла;
		
		Для Ном = Макс(ДлинаФамилии, 1) По МассивФамилия.Количество() Цикл
			
			МассивФамилия[Ном - 1] = "-";
			
		КонецЦикла;
		
	КонецЕсли;

	Область = ИсходныйМакет.Области.Найти("Имя");
	СтрИмя = "";
	Если НЕ Область = Неопределено Тогда
		СтрИмя = Область.Значение;
		ДлинаИмени = СтрДлина(СтрИмя);
		Для Ном = 1 По ДлинаИмени Цикл
			
			МассивИмя[Ном - 1] = Сред(СтрИмя, Ном, 1);
			
		КонецЦикла;
		
		Для Ном = Макс(ДлинаИмени, 1) По МассивИмя.Количество() Цикл
			
			МассивИмя[Ном - 1] = "-";
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = ИсходныйМакет.Области.Найти("Отчество");
	СтрОтчество = "";
	Если НЕ Область = Неопределено Тогда
		СтрОтчество = Область.Значение;
		ДлинаОтчества = СтрДлина(СтрОтчество);
		Для Ном = 1 По ДлинаОтчества Цикл
			
			МассивОтчество[Ном - 1] = Сред(СтрОтчество, Ном, 1);
			
		КонецЦикла;
		
		Для Ном = Макс(ДлинаОтчества, 1) По МассивОтчество.Количество() Цикл
			
			МассивОтчество[Ном - 1] = "-";
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Место рождения
	Область = ИсходныйМакет.Области.Найти("МестоРождения");
	МестоРожденияПоСловам = РазложитьСтрокуВМассивПодстрок(Область.Значение, " ");
	
	ДлинаВСимволах = 0;
	МестоРожденияВ21Строки = Новый Структура("МестоРождения, МестоРождения2", "", "");
	Для Каждого Слово Из МестоРожденияПоСловам Цикл
		
		ДлинаВСимволах = ДлинаВСимволах + СтрДлина(Слово);
		
		Если ДлинаВСимволах > 18 Тогда
			
			МестоРожденияВ21Строки.МестоРождения2 = МестоРожденияВ21Строки.МестоРождения2+ Слово+ " ";
			
		Иначе
			
			МестоРожденияВ21Строки.МестоРождения = МестоРожденияВ21Строки.МестоРождения + Слово + " ";
			
		КонецЕсли;
		
	КонецЦикла;

	МестоРожденияВ21Строки.МестоРождения = СокрЛП(МестоРожденияВ21Строки.МестоРождения);
	МестоРожденияВ21Строки.МестоРождения2 = СокрЛП(МестоРожденияВ21Строки.МестоРождения2);
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	ОбщиеРеквизитыРазделов.Вставить("ИНН", МассивИНН);
	ОбщиеРеквизитыРазделов.Вставить("КПП", МассивКПП);
	ОбщиеРеквизитыРазделов.Вставить("ДатаПодписи", МассивДатаПодписи);
	ОбщиеРеквизитыРазделов.Вставить("Фамилия", МассивФамилия);
	ОбщиеРеквизитыРазделов.Вставить("Имя", МассивИмя);
	ОбщиеРеквизитыРазделов.Вставить("Отчество", МассивОтчество);
	ОбщиеРеквизитыРазделов.Вставить("СтрИНН", СтрИНН);
	
	ОбщиеРеквизитыРазделов.Вставить("СтрФамилия", СтрФамилия);
	ОбщиеРеквизитыРазделов.Вставить("СтрИмя", СтрИмя);
	ОбщиеРеквизитыРазделов.Вставить("СтрОтчество", СтрОтчество);
	ОбщиеРеквизитыРазделов.Вставить("МестоРождения", МестоРожденияВ21Строки);
	Возврат ОбщиеРеквизитыРазделов;
	
КонецФункции

//используется для удаления значений итоговых показателей на листах МЧБ, образованных многострочными разделами (кроме последнего)
&НаСервере
Процедура ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ТаблДок)
	
	ОбластьИтоговыеПоказатели = ТаблДок.Области.Найти("ИтоговыеПоказатели");
	Если ОбластьИтоговыеПоказатели <> Неопределено Тогда
		
		ОбластьИтоговыеПоказателиВерх = ОбластьИтоговыеПоказатели.Верх;
		ОбластьИтоговыеПоказателиНиз = ОбластьИтоговыеПоказатели.Низ;
		
		Для Каждого Обл Из ТаблДок.Области Цикл
			Если Обл.Верх >= ОбластьИтоговыеПоказателиВерх
				И Обл.Низ <= ОбластьИтоговыеПоказателиНиз
				И Обл.ГраницаСлева.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Точечная
				Тогда
				Обл.Текст = "-";
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Команда = ДополнительныеПараметры.Команда;

	// Активизируем строку раздела в дереве
	Для Каждого СтрокаРаздела Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если СтрокаРаздела.КолонкаРазделыОтчетаСокрНаим = "ЛистВ" Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = СтрокаРаздела.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	ЗаполнитьАвтоНаСервере();
	
	РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтаФорма);
	
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация", 			     СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета",     СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",      СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы", ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("ИНН",							 СтруктураДанныхТитульный.ИНН);
	
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки"); // Адрес временного хранилища, где размещена расшифровка результата автозаполнения.
	
	Контейнер = Новый Структура();
	
	// Из базы данных берем данные о доходах и расходах предпринимателя
	Контейнер.Вставить("ЛистВ",					ТаблицаСтраницыЛистВ);
	
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(Сред(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") - 1), 7), Сред(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".Форма.") + 7), ПараметрыОтчета, Контейнер);
	
	СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПараметрыОтчета.АдресВременногоХранилищаРасшифровки;
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	ЗаполнитьСведенияОбОрганизации();
	
	РассчитатьИтогиЛиста(ЭтотОбъект, "ЛистВ");
	
	РасчетНаСервере();
	
	ПодготовитьДанныеРаздела2(ЭтотОбъект);
	
	СобратьДанныеВРаздел1Сервер();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПервыйПодчиненныйУзелСЗаполненнымКлючом(Родитель)
	
	Для Каждого Стр из Родитель.Строки Цикл
		Если ЗначениеЗаполнено(Стр.Ключ) Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрганЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтаФорма, "ФНС");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьСразуЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
		
	Печать(Команда.Имя);
	
КонецПроцедуры

#КонецОбласти


// ДЕНЬГИ

&НаСервереБезКонтекста
Процедура ОбновитьСсылкуОрганизации(СтруктураРеквизитовФормы, Знач СтруктураДанныхТитульный, Знач КодИФНС)

	СтруктураРеквизитовФормы.Организация =  Обработки.ПомощникЗаполнения3НДФЛ_2016.ПолучитьСсылкуНалогоплательщика(
					СтруктураДанныхТитульный.Фамилия,
					СтруктураДанныхТитульный.Имя,
					СтруктураДанныхТитульный.Отчество,
					СтруктураДанныхТитульный.ИНН,
					КодИФНС, "", Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено);
	СтруктураРеквизитовФормы.НаимОрганизации = Строка(СтруктураРеквизитовФормы.Организация);

КонецПроцедуры
 

// Конец ДЕНЬГИ


#КонецОбласти


