
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте 
Перем НастройкиЗапуска, Действие;
&НаКлиенте 
Перем ВозвращаемыйРезультат;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЦентральнаяБаза = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	
	ВключитьРежимСинхронизации();
	ПроверитьРежимИПараметрыПодключения();
	ТекущийШаг = "ПодключениеКОблаку";
	
	ОчиститьИндикаторыШагов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьШаг();
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Повторить(Команда)
	ТекущийШаг = "ПодключениеКОблаку";
	ОчиститьИндикаторыШагов(ЭтотОбъект);
	ВыполнитьШаг();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ВозвращаемыйРезультат = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМонитор(Команда)
	
	// Открытие формы
	ОткрытьФорму("ОбщаяФорма.УправлениеСервисомАвтосинхронизации", , , Истина, , , , РежимОткрытияОкнаФормы.Независимый);
	Если Открыта() Тогда
		ВозвращаемыйРезультат = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВключитьРежимСинхронизации()
	
	Константы.ИспользоватьСинхронизациюДанных.Установить(Истина);
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.СинхронизацияССервисом);
	Константы.ДеньгиПриостановитьАвтосинхронизацию.Установить(Истина);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРежимИПараметрыПодключения()
	
	ЦентральнаяБаза = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	КодЭтогоУзла    = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла("СинхронизацияАвтономныхКопий");
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	ПараметрыПодключения = Неопределено;
	Если Режим = "Разделенный" Тогда
		ПараметрыПодключенияЗаполнены = Истина;
		ЭталонныйНабор = Новый Структура("Логин,Пароль,НомерОбласти,КодАбонента,ПолныйПутьКБазе");
		ИмяНастройки = ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединенияНаСервере();
		ПараметрыПодключения = РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ИмяНастройки, ЭталонныйНабор);
		БазаПодключенаКОблаку = Истина;
	Иначе
		ПараметрыПодключенияЗаполнены = ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Ложь);
		БазаПодключенаКОблаку = ДеньгиВОблакеВызовСервера.ЭтаБазаПодключенаКОблаку(ПараметрыПодключения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьИндикаторыШагов(Форма)
	
	Форма.Элементы.ДекорацияШаг1.Картинка = Новый Картинка;
	Форма.Элементы.ДекорацияШаг2.Картинка = Новый Картинка;
	Форма.Элементы.ДекорацияШаг3.Картинка = Новый Картинка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьШаг()
	
	Если ЗначениеЗаполнено(ТекущийШаг) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьШаг", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьШаг()
	
	Если ТекущийШаг = "ПодключениеКОблаку" Тогда
		
		Если БазаПодключенаКОблаку Тогда
			
			Элементы.ДекорацияШаг1.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
			Элементы.ДекорацияШаг2.Картинка = БиблиотекаКартинок.ПереместитьВправо;
			ТекущийШаг = "ПроверкаЛицензий";
			ТекстОшибки = "";
			ВыполнитьШаг();
			Возврат;
			
		Иначе
			
			Элементы.ДекорацияШаг1.Картинка = БиблиотекаКартинок.ПереместитьВправо;
			ОткрытьДиалогПодключения();
			
		КонецЕсли;
		
	ИначеЕсли ТекущийШаг = "ПроверкаЛицензий" Тогда
		
		ОбновитьСостояниеПодписок();
		
	ИначеЕсли ТекущийШаг = "ВыполнитьСинхронизацию" Тогда
		
		ВыполнитьИнтерактивнуюСинхронизацию();
		
	КонецЕсли;
	
	Элементы.Повторить.Доступность = ЗначениеЗаполнено(ТекущийШаг) И ЗначениеЗаполнено(ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогПодключения()
	
	Оповещение = Новый ОписаниеОповещения("НастройкиУчетнойЗаписиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ПодключениеКСервисуАвтоСинхронизации", , , Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчетнойЗаписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьРежимИПараметрыПодключения();
	Если Режим <> "КлиентОблака" Тогда
		Если Открыта() Тогда
			ВозвращаемыйРезультат = Ложь;
			Закрыть();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если БазаПодключенаКОблаку Тогда
		ВыполнитьШаг();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеПодписок()
	
	Действие    = "Обновление состояния подписок";
	ТекстОшибки = "";
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Получение информации о подписках");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПолучитьСвойстваЭтойБазыИзОблакаВФоне");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне");
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ДеньгиКлиент.ВыполнитьЭтапФоновогоЗадания(ЭтотОбъект, НастройкиЗапуска, РезультатЗапускаФоновогоЗадания);
	НастройкиЗапуска = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибкиФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ФоновоеЗадание <> Неопределено И Результат.ФоновоеЗадание.Статус = "Ошибка" Тогда
		
		Обращение = Результат.ФоновоеЗадание.КраткоеПредставлениеОшибки;
		Ошибка = Результат.ФоновоеЗадание.ПодробноеПредставлениеОшибки;
		
	Иначе
		Обращение = НСтр("ru='Запрос к облаку был отменен пользователем'");
		Ошибка = "";
		
	КонецЕсли;
	
	ПоказатьОшибкуНаФорме(Обращение, Ошибка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуНаФорме(СообщениеПользователю, Ошибка)
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = ?(ЗначениеЗаполнено(Ошибка), Ошибка, "");
	КонецЕсли;
	
	//Элементы.ГруппаОшибка.Видимость = Истина;
	Элементы.Повторить.Доступность = ЗначениеЗаполнено(ТекущийШаг) И ЗначениеЗаполнено(ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПолучитьСвойстваЭтойБазыИзОблакаВФоне" Тогда
		
		ОбновитьСвойстваБазыПолученныеИзОблака(Результат, ДополнительныеПараметры);
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне" Тогда
		
		ВывестиРезультатСостоянияПодписок(Результат, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвойстваБазыПолученныеИзОблака(Результат, ДополнительныеПараметры)
	
	СвйстваБазыВОблаке = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	
	Если Не СвйстваБазыВОблаке.Существует Тогда
		ВидимостьСтроки = Истина;
		ТекстОшибки = НСтр("ru='эта база не найдена в списке подключенных баз'");
		
	ИначеЕсли СвйстваБазыВОблаке.ИБУстаревшая Тогда
		ВидимостьСтроки = Истина;
		ТекстОшибки = НСтр("ru='эта база помечена как устаревшая'");
		
	ИначеЕсли СвйстваБазыВОблаке.ИБЗапрещена Тогда
		
		ТекстОшибки = НСтр("ru='в сервисе установлен запрет на эту базу. 
				|база очищена от всех записей!'");
		Результат.НастройкиЗапуска.ПоследовательностьПроцедур.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРезультатСостоянияПодписок(Результат, ДополнительныеПараметры)
	
	ОтветСервера = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	
	// Активные подписки
	ДоступноЛицензий       = ОтветСервера.ЛицензийСейчас;
	ЛицензийПослеИзменений = ОтветСервера.ЛицензийПослеИзменения;
	ДатаИзменений          = ОтветСервера.БлижайшаяДатаИзменения;
	НеиспользованнаяСумма  = ОтветСервера.НеиспользованнаяСумма;
	СписокТарифов          = ОтветСервера.СписокТарифов;
	
	// Доступные лицензии
	Если ДоступноЛицензий = -111 Тогда
		ПредставлениеЛицензий = НСтр("ru='без ограничений'");
	Иначе
		ПредставлениеЛицензий = Формат(ДоступноЛицензий, "ЧДЦ=0; ЧН=0; ЧГ=");
	КонецЕсли;
	
	// Список баз
	ПодключеноБаз = ОтветСервера.ПодключеноБаз;
	ПредставлениеПодключенныхБаз = Формат(ПодключеноБаз, "ЧДЦ=0; ЧН=0; ЧГ=");
	
	// Текст рекомендации и кнопки покупки
	Если ДоступноЛицензий <> -111 И ДоступноЛицензий < ПодключеноБаз Тогда
		// Лицензий недостаточно для продолжения работы
		НужноЛицензий = ПодключеноБаз - ДоступноЛицензий;
		ТекстОшибки = СтрШаблон(НСтр("ru='Не хватает лицензий: %1 шт.
			|Данные из облачного сервиса будут загружены в эту базу, но дальнейшая синхронизация будет возможна только после покупки подписки'"), НужноЛицензий);
		
	КонецЕсли;
	
	Элементы.ОткрытьМонитор.Видимость = ЗначениеЗаполнено(ТекстОшибки);
	Элементы.Повторить.Доступность = ЗначениеЗаполнено(ТекущийШаг) И ЗначениеЗаполнено(ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Элементы.ДекорацияШаг2.Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		
	Иначе
		
		Элементы.ДекорацияШаг2.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
		
	КонецЕсли;
	
	Элементы.ДекорацияШаг3.Картинка = БиблиотекаКартинок.ПереместитьВправо;
	ТекущийШаг = "ВыполнитьСинхронизацию";
	ВыполнитьШаг();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИнтерактивнуюСинхронизацию()
	
	УстановитьСценарииСинхронизации();
	
	ПараметрыФормы = Новый Структура("УзелИнформационнойБазы,ВидТранспорта,ВыполнятьВыгрузку,
		|ВыполнятьЗагрузку,ИмяФайлаВыгрузки,ЗакрыватьПоЗавершении");
	ПараметрыФормы.УзелИнформационнойБазы = ЦентральнаяБаза;
	ПараметрыФормы.ВидТранспорта         = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.WS");
	ПараметрыФормы.ВыполнятьВыгрузку     = Истина;
	ПараметрыФормы.ВыполнятьЗагрузку     = Истина;
	ПараметрыФормы.ЗакрыватьПоЗавершении = Истина;
	
	Оповещение = Новый ОписаниеОповещения("СинхронизироватьСейчасЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.МониторСинхронизацииССервисом.Форма.ИнтерактивнаяОперация", ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСценарииСинхронизации()
	
	СценарийОбъединения = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных;
	СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии;
	Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
		СценарийСинхронизации, СценарийСинхронизации, СценарийОбъединения);
	СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(ЦентральнаяБаза, Изменения);
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "КлиентОблака" Тогда
		
		Набор = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей();
		Набор.Отбор.УзелИнформационнойБазы.Установить(ЦентральнаяБаза);
		Набор.Записать(Истина);
		
		Набор = РегистрыСведений.СостоянияУспешныхОбменовДанными.СоздатьНаборЗаписей();
		Набор.Отбор.УзелИнформационнойБазы.Установить(ЦентральнаяБаза);
		Набор.Записать(Истина);
		
		СостояениеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
		АвтоматСинхронизацииССервисом.СброситьСостояние(СостояениеОбмена);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСейчасЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ОбновитьСостояниеСинхронизации();
	Если СинхронизацияВыполнена Тогда
		ВозвращаемыйРезультат = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеСинхронизации()
	
	ТекстОшибки = "";
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СинхронизацияВыполнена = СостояниеОбмена.Прием.ПроцессЗавершен 
			И СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКоды.Выполнено.Код;
	ТекущийШаг = "";
	
КонецПроцедуры


#КонецОбласти
