#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Заголовок = Параметры.ЗаголовокФормы;
	КлючСохраненияПоложенияОкна = Параметры.КлючНазначенияФормы;
	
	Элементы.ДекорацияКакИзменитьДекларацию.Видимость = (Параметры.КлючНазначенияФормы = "КакИзменитьДекларацию");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "РегламентированнаяОтчетность" Тогда
		СтандартнаяОбработка = Ложь;
		// ДЕНЬГИ 
		Если Открыта() Тогда
			Закрыть("Открыть бланк");
		КонецЕсли;
		// конец ДЕНЬГИ
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
