
////////////////////////////////////////////////////////////////////////////////
//  ОбменДаннымиДеньгиСобытия - обработчики событий подсистем обмена данными
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура СинхронизацияАвтономныхКопийРегистрацияИзмененийСправочниковПередЗаписью(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимСинхронизацииАвтономныхКопий() Или ЗапретНаРегистрациюОбъектаВПланеОбмена(Источник) Тогда
		Возврат;
	КонецЕсли;

	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("СинхронизацияАвтономныхКопий", Источник, Отказ);
	
КонецПроцедуры

Процедура СинхронизацияАвтономныхКопийРегистрацияИзмененийДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимСинхронизацииАвтономныхКопий() Или ЗапретНаРегистрациюОбъектаВПланеОбмена(Источник) Тогда
		Возврат;
	КонецЕсли;

	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("СинхронизацияАвтономныхКопий", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура СинхронизацияАвтономныхКопийРегистрацияИзмененийКонстантПередЗаписью(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимСинхронизацииАвтономныхКопий() Или ЗапретНаРегистрациюОбъектаВПланеОбмена(Источник) Тогда
		Возврат; 
	КонецЕсли;

	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюКонстанты("СинхронизацияАвтономныхКопий", Источник, Отказ);
	
КонецПроцедуры

Процедура СинхронизацияАвтономныхКопийРегистрацияИзмененийРегистровПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимСинхронизацииАвтономныхКопий() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтложенноеПроведение") Тогда
		// Записи перенесены, регистрировать нечего
		Возврат;
	КонецЕсли;

	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("СинхронизацияАвтономныхКопий", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура СинхронизацияАвтономныхКопийРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не РежимСинхронизацииАвтономныхКопий() Или ЗапретНаРегистрациюОбъектаВПланеОбмена(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("СинхронизацияАвтономныхКопий", Источник, Отказ);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция РежимСинхронизацииАвтономныхКопий() 
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Возврат Режим = "КлиентОблака" Или Режим = "Разделенный" Или Режим = "Неразделенный";
КонецФункции 

Функция ЗапретНаРегистрациюОбъектаВПланеОбмена(Источник)
	Возврат Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") 
			И Источник.ДополнительныеСвойства.ОтключитьМеханизмРегистрацииОбъектов = Истина
			Или Не Метаданные.ПланыОбмена.СинхронизацияАвтономныхКопий.Состав.Содержит(Источник.Метаданные());
КонецФункции

#КонецОбласти