///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет необходимые проверки и выполняет следующее действие в последовательности синхронизации с облачным сервисом
//
//Параметры:
//	СостояниеЭтойБазы - Структура - описывает теущее состояние процесса обмена данными (см. НовыйСтуктураСостоянияОбмена())
//
//
Процедура ПродолжитьСинхронизацию(СостояниеЭтойБазы = Неопределено, ДополнительныеПараметры = Неопределено, СпособЗапуска = "Вручную") Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеЭтойБазы) Тогда
		СостояниеЭтойБазы = СостояниеОбмена();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДополнительныеПараметры = ДополнительныеПараметрыПроцесса(СостояниеЭтойБазы.ТекущийВидТранспорта);
	КонецЕсли;
	ДополнительныеПараметры.СпособЗапуска = СпособЗапуска;
	
	ПроверитьСостоянияПроцессов(СостояниеЭтойБазы, ДополнительныеПараметры);
	ПроверитьВидТранспорта(СостояниеЭтойБазы, ДополнительныеПараметры);
	
	// сбросить статус сервера
	ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеЭтойБазы, 0, "");
	
	Если Не СостояниеЭтойБазы.ПроцессАктивен Тогда
		// проверка версий приложения и регистрации устройства на сервере
		Если Не ПроверитьНомерВерсииНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры.ПараметрыПодключения, "")
			Или Не ПроверитьРегистрациюУстройстваНаСервере(СостояниеЭтойБазы, 
						ДополнительныеПараметры.ПараметрыПодключения, 
						Неопределено, "", Ложь) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Получить состояние синхронизации на сервере и отметить изменения в состоянии
	СостояниеСервера = СостояниеОбменаНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры);
	ДополнительныеПараметры.Вставить("СостояниеСервера", СостояниеСервера);
	Если СостояниеСервера = Неопределено 
			Или Не ПроверитьСостояниеСервера(СостояниеЭтойБазы, СостояниеСервера, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СостояниеЭтойБазы.ПроцессАктивен Тогда
		// после проверки состояния на сервере процесс может оказаться завершенным
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СостояниеЭтойБазы.Передача.ДействиеПроцесса)
		И Не ЗначениеЗаполнено(СостояниеЭтойБазы.Прием.ДействиеПроцесса)
		И СостояниеЭтойБазы.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных Тогда
		// первая итерация по стандартному сценарию
		
		ОбработкаПроцессаПриема(СостояниеЭтойБазы, ДополнительныеПараметры);
		ОбработкаПроцессаПередачи(СостояниеЭтойБазы, ДополнительныеПараметры);
			
	Иначе
		ОбработкаПроцессаПередачи(СостояниеЭтойБазы, ДополнительныеПараметры);
		ОбработкаПроцессаПриема(СостояниеЭтойБазы, ДополнительныеПараметры);
	КонецЕсли;
	
	
КонецПроцедуры

// Возвращает текущее состояние обмена данными для указанного узла плана обмена
//
//Параметры:
//	УзелКорреспондента - ПланОбменаСсылка - узел, для которого нужно получить состояние обмена.
//			 Пустое значение приравнивается к узлу центральной базы в плане обмена СинхронизацияАвтономныхКопий
//
//Возвращаемое значение:
//	Структура - см. НовыйСтуктураСостоянияОбмена()
//
Функция СостояниеОбмена(УзелКорреспондента = Неопределено)  Экспорт
	
	Возврат ПроцессыОбменаСлужебный.СостояниеОбмена(УзелКорреспондента, 
				Перечисления.ВидыТранспортаСообщенийОбмена.WS);
	
КонецФункции

// Переводит состояние автомата в начальное состояние
//
//Параметры:
//	СостояниеОбмена - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Строка - "Прием", "Передача" или пусто. В последнем случае сбрасываются состояния обоих процессов
//
Процедура СброситьСостояние(СостояниеОбмена, Процесс = "", ПараметрыПодключения = Неопределено) Экспорт
	
	Если СостояниеОбмена.Режим = "КлиентОблака" 
		И СостояниеОбмена.СтатусТранспорта.СоединениеНастроено Тогда
		
		Если Нрег(Процесс) = "прием" Тогда
			ПроцессНаСервере = "Передача";
		ИначеЕсли Нрег(Процесс) = "передача" Тогда
			ПроцессНаСервере = "Прием";
		Иначе
			ПроцессНаСервере = Процесс;
		КонецЕсли;
		
		Попытка
			СброситьСостояниеОбменаНаСервере(ПроцессНаСервере, СостояниеОбмена, Неопределено);
		Исключение
			// обработка не требуется
		КонецПопытки;
		
	КонецЕсли;
	
	ПроцессыОбменаСлужебный.СброситьСостояние(СостояниеОбмена, Процесс);
	
КонецПроцедуры

// Делает отметку о начале выполнения действия обмена данными. При этом обнуляются результаты действия и 
// обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	СостояниеОбмена - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	НомерПакета - Число - номре отправляемого или получаемого пакета. Если Неопределено - не изменяется
//	КоличествоЧастей - Число - количество частей пакета к получению или отправке. Если Неопределено - не изменяется
//	НомерОбработаннойЧасти - Число - номер последней полученной или отправленной части пакета. Если Неопределено - не изменяется
//
Процедура ОтметитьНачалоДействия(СостояниеОбмена, знач Процесс, знач Действие, знач НомерПакета = Неопределено, 
								знач КоличествоЧастей = Неопределено, знач НомерОбработаннойЧасти = Неопределено, 
								знач ОбъектовВсего = Неопределено, знач ОбъектовОбработано = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	
	ПроцессыОбменаСлужебный.ОтметитьНачалоДействия(СостояниеОбмена, Процесс, Действие, НомерПакета, 
								КоличествоЧастей, НомерОбработаннойЧасти, 
								ОбъектовВсего, ОбъектовОбработано);	
КонецПроцедуры

// Обновляет номера-количества в состоянии процесс и одновременно обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	СостояниеОбмена - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	НомерПакета - Число - номре отправляемого или получаемого пакета. Если Неопределено - не изменяется
//	КоличествоЧастей - Число - количество частей пакета к получению или отправке. Если Неопределено - не изменяется
//	НомерОбработаннойЧасти - Число - номер последней полученной или отправленной части пакета. Если Неопределено - не изменяется
//
Процедура ОбновитьСтатистикуДействия(СостояниеОбмена, знач Процесс, знач НомерПакета = Неопределено, 
								знач КоличествоЧастей = Неопределено, знач НомерОбработаннойЧасти = Неопределено, 
								знач ОбъектовВсего = Неопределено, знач ОбъектовОбработано = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	
	ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбмена, Процесс, НомерПакета, 
								КоличествоЧастей, НомерОбработаннойЧасти, 
								ОбъектовВсего, ОбъектовОбработано);
	
КонецПроцедуры

// Делает отметку о завершении действия обмена данными, устанавливая код состояния, текст ошибки и т.д. 
// При этом обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	СостояниеОбмена - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	КодРезультатаДействия - Число - код, соответствующий результату. см. ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий()
//	Ошибка - Строка - текст ошибки, если таковая возникла
//
Процедура ОтметитьЗавершениеДействия(СостояниеОбмена, знач Процесс, знач Действие, знач КодРезультатаДействия, знач Ошибка = "") Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	
	ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбмена, Процесс, Действие, КодРезультатаДействия, Ошибка);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ДополнительныеПараметрыПроцесса(ВидТранспорта) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВидТранспорта", ВидТранспорта);
	ДополнительныеПараметры.Вставить("ИспользуетсяСервисСинхронизации", Истина);
	ДополнительныеПараметры.Вставить("ВсеКодыРезультатов", ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий());
	ДополнительныеПараметры.Вставить("ВсеКодыСостояний", ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера());
	ДополнительныеПараметры.Вставить("ПараметрыПодключения", );
	ДополнительныеПараметры.Вставить("СостояниеСервера", Неопределено); // заполняется структурой, полученной 
																		//с сервера по команде statusserver
	ДополнительныеПараметры.Вставить("СпособЗапуска", ""); 

	Возврат ДополнительныеПараметры;
		
КонецФункции



#Область РегламентныеИФоновыеЗадания


// Метод фонового задания для загрузки данных в этой базе
//
Процедура ВыполнитьВФонеЗагрузитьДанные(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	УзелКорреспондента = ПараметрыПроцедуры.Узел;
	НомерКЗагрузке     = ПараметрыПроцедуры.НомерПакета;
	
	СостояниеОбмена = СостояниеОбмена(УзелКорреспондента);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВсеКодыРезультатов", ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий());
	ДополнительныеПараметры.Вставить("ВсеКодыСостояний", ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера());
	ДополнительныеПараметры.Вставить("ПараметрыПодключения", );
	
	ПроцессыОбменаСлужебный.ЗагрузитьПакетВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры, НомерКЗагрузке);
	
КонецПроцедуры

// Метод фонового задания для выгрузки изменений
//
Процедура ВыполнитьВФонеВыгрузитьДанные(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	УзелКорреспондента = ПараметрыПроцедуры.Узел;
	
	СостояниеОбмена = СостояниеОбмена(УзелКорреспондента);

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВсеКодыРезультатов", ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий());
	ДополнительныеПараметры.Вставить("ВсеКодыСостояний", ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера());
	ДополнительныеПараметры.Вставить("ПараметрыПодключения", );
	
	ПроцессыОбменаСлужебный.ВыгрузитьИзмененияВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработчикРеглЗаданияОбменСОблачнымСервисом(ПараметрыМетода = Неопределено, АдресРезультата = Неопределено, АдресДополнительногоРезультата = Неопределено) Экспорт
	
	// часть проверок выполняется вне БСП, чтобы получить причину в случае отказа
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если БлокировкаРаботыСВнешнимиРесурсами.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		ОтметитьОтказЗапускаФоновогоЗадания(ВсеКоды.РаботаСВнешнимиРесурсамиЗаблокирована.Код, 
				НСтр("ru='Заблокирована работа с внешними ресурсами.
			|Разблокировать можно в меню Сервис -> Настройка и обслуживание -> Администрирование'"));
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ДеньгиИспользуетсяОблако") Или Режим <> "КлиентОблака" Тогда
		ОтметитьОтказЗапускаФоновогоЗадания(ВсеКоды.СинхронизацияОтключена.Код, 
				НСтр("ru='Выбранный способ синхронизации не позволяет выполнить обмен данными с облачным сервисом.
				|Проверьте, что в программе выбран способ синхронизации с облачным сервисом'"));
	КонецЕсли;

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбменСОблачнымСервисом);
	
	Если ПараметрыМетода = Неопределено Тогда
		ПараметрыМетода = Новый Структура("СпособЗапуска", "в фоне");
	КонецЕсли;
	
	Если Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить() И ПараметрыМетода.СпособЗапуска = "в фоне" Тогда
		// автоматическая синхрнизация приостановлена пользователем
		Возврат;
	КонецЕсли;
	
	СостояниеОбмена = СостояниеОбмена();
	Если Не СостояниеОбмена.ПроцессАктивен Тогда
		СброситьСостояние(СостояниеОбмена);
	КонецЕсли;
	
	ДополнительныеПараметры = Неопределено;
	Пока СостояниеОбмена.ПроцессАктивен Цикл
		ПродолжитьСинхронизацию(СостояниеОбмена, ДополнительныеПараметры, ПараметрыМетода.СпособЗапуска);
	КонецЦикла;
	
КонецПроцедуры

Функция РегламентноеЗаданиеОбмена(ОбновлятьПараметры = Ложь) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Или Режим = "Неразделенный" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбменСОблачнымСервисом);
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	Если ЗначениеЗаполнено(СписокЗаданий) Тогда
		ПроцессыОбменаСлужебный.ПроверитьСписокЗаданийНаДубли(СписокЗаданий);
		Задание =  СписокЗаданий[0];
	Иначе
		Отбор.Вставить("Использование", ПолучитьФункциональнуюОпцию("ДеньгиИспользуетсяОблако"));
		Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(Отбор);
	КонецЕсли;
	
	Если ОбновлятьПараметры Тогда
		ПроверитьПараметрыРегламентногоЗадания(Задание, Истина);
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

Процедура ПроверитьПараметрыРегламентногоЗадания(Задание, Записывать = Истина) Экспорт
	
	ПараметрыМетода = Новый Структура("СпособЗапуска");
	ПараметрыМетода.СпособЗапуска = "в фоне"; // остальные значения заполняются в обработчике из текущих настроек
	МассивПараметров = Новый Массив(2);
	МассивПараметров[0] = ПараметрыМетода;
	
	Задание.Параметры = МассивПараметров;
	
	Если Записывать Тогда
		УстановитьПривилегированныйРежим(Истина);
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ФоновоеЗаданиеОбмена(ТолькоАктивное = Истина) Экспорт
	
	Задание = РегламентноеЗаданиеОбмена();
	Результат = ПроцессыОбменаСлужебный.ФоновоеЗаданиеОбмена(Задание);
	
	Если ТолькоАктивное И Результат <> Неопределено И Результат.Статус <> "Выполняется" Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Останавливает выполнение фонового задания синхронизации данных
//
Функция ОстановитьФоновоеЗаданиеОбмена() Экспорт
	
	СвойстваФЗ = ФоновоеЗаданиеОбмена();
	Если СвойстваФЗ = Неопределено Или СвойстваФЗ.Статус <> "Выполняется" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(СвойстваФЗ.ИдентификаторФоновогоЗадания));
	Если ФоновоеЗадание <> Неопределено И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Попытка
			ФоновоеЗадание.Отменить();
			ЗаписьЖурналаРегистрации("Отмена фонового задания", УровеньЖурналаРегистрации.Информация, , ,
					НСтр("ru='Отменено фоновое задание синхронизации с сервисом 1С:Деньги'"));
		Исключение
			ЗаписьЖурналаРегистрации("Отмена фонового задания", УровеньЖурналаРегистрации.Ошибка, , ,
					СтрШаблон("Не удалось отменить фоновое задание синхронизации с сервисом 1С:Деньги:
					|%1", КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Запускает выполнение фонового задания вручную (интерактивно), 
// при этом игнирируется значение константы ПриостановитьАвтоСинхронизацию
//
//Возвращаемое значение
//	Структруа - см.  ОбщегоНазначенияДеньги.НовыйСтруктураФоновогоЗадания()
//
//
Функция ОбменСОблачнымХранилищемВручную(Форма) Экспорт
	
	// параметры метода, выполняемого в фоне
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("СпособЗапуска", "Интерактивно");
	
	АдресРезультата    = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	АдресДопРезультата = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	
	МассивПараметров = Новый Массив(3);
	МассивПараметров[0] = ПараметрыМетода;
	МассивПараметров[1] = АдресРезультата;
	МассивПараметров[2] = АдресДопРезультата;
	
	Задание = РегламентноеЗаданиеОбмена(Ложь);
	Задание.Параметры = МассивПараметров;
	УстановитьПривилегированныйРежим(Истина);
	Задание.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатЗапуска = РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(Задание);
	
	ПроверитьПараметрыРегламентногоЗадания(Задание, Истина);
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(РезультатЗапуска.ИдентификаторФоновогоЗадания) И РезультатЗапуска.ЗапускВыполнен Тогда
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(РезультатЗапуска.ИдентификаторФоновогоЗадания));
		Результат = ОбщегоНазначенияДеньги.СтруктраСвойствФоновогоЗадания(ФоновоеЗадание, АдресРезультата, АдресДопРезультата);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет состояние обмена на сервере и, если там продолжает выполняться фоновое задание,
//обновляет в этой базе информацию о состоянии обмена.
//Используется, чтобы восстановить состояние после, например, перезагрузки приложения с откюченным 
//автоматическим обменом
//
Функция ПроверитьСостояниеОбменаНаСервере() Экспорт
	
	СостояниеЭтойБазы = СостояниеОбмена();
	ДополнительныеПараметры = ДополнительныеПараметрыПроцесса(СостояниеЭтойБазы.ТекущийВидТранспорта);
	
	Попытка
		
		Если Не ПроверитьНомерВерсииНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры.ПараметрыПодключения) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		СостояниеСервера = СостояниеОбменаНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры);
		ДополнительныеПараметры.Вставить("СостояниеСервера", СостояниеСервера);
		
		Если СостояниеСервера = Неопределено 
				Или Не ПроверитьСостояниеСервера(СостояниеЭтойБазы, СостояниеСервера, ДополнительныеПараметры) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		
		Ошибка = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизация автономных копий.Подготовка", 
				УровеньЖурналаРегистрации.Ошибка,
				, 
				, 
				СтрШаблон("Не удалось проверить состояние обмена на сервере:
				|%1
				|", КраткоеПредставлениеОшибки(Ошибка)));
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область команды_синхронизации_21

// Выполняет заданную команду синхронизации на сервере и возвращает результат
//
//Параметры:
//	Команда - Строка - имя вызываемого метода API синхронизации
//	ПараметрыКонанды - Структура или непоределено - параметры, передаваемые методу на сервере
//	ПараметрыПодключения - Структура или непоределено - параметры соединения с сервером
//
//Возвращаемое значение:
//	Структура 
//		* КодСостояния - 200 в случае успеха или другой код в случае ошибки
//		* ОписаниеОшибки - Строка - имеет смысл только если КодСостояния <> 200
//		* ОтветСервера - Структура или Неопределено - возвращаемые сервером данные
//
Функция ВыполнитьКомандуСинхронизацииНаСервере(Команда, ПараметрыКонанды = Неопределено, ПараметрыПодключения = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния",   200); 
	Результат.Вставить("ОписаниеОшибки", ""); 
	Результат.Вставить("ОтветСервера",   Неопределено); 
	
	ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураЗапроса = ДеньгиВОблаке.НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
							ДеньгиВОблаке.АдресСервисаСинхронизации(), 
							"execute");
	СтруктураЗапроса.ИменаПолейТипаДата = "Дата,ДатаОстатков,НачалоДействия,ЗавершениеДействия,Срок,Старт,Финиш";
	
	ТелоЗапроса = Новый Структура("general", НовыйСтруктураGeneralExecute(ПараметрыПодключения, Команда));
	Если ПараметрыКонанды <> Неопределено Тогда
		Для Каждого КлючиИзначение Из ПараметрыКонанды Цикл
			ТелоЗапроса.Вставить(КлючиИзначение.Ключ, ОбщегоНазначения.СкопироватьРекурсивно(КлючиИзначение.Значение));
		КонецЦикла;
	КонецЕсли;
	ТекстТелаЗапроса = ПарсерJSON.ДанныеВСтрокуJSON(ТелоЗапроса);
	
	Для Счетчик = 1 По 3 Цикл
		// обход проблемы с краткими сбоями соединения
		
		Ответ = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, ТекстТелаЗапроса, 
					"Обмен данными.СинхронизацияАвтономныхКопий." + Команда);
		
		Если Ответ = Неопределено Тогда
			ВызватьИсключение НСтр("ru='Нет ответа на HTTP-запрос о состоянии синхронизации на сервере'");
		ИначеЕсли Ответ.КодСостояния = 404 Тогда
			ОбщегоНазначенияДеньги.Пауза(3);
			Продолжить;
		Иначе
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.КодСостояния   = Ответ.КодСостояния;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	Если Результат.КодСостояния = 200 Тогда
		Результат.ОтветСервера = Ответ.ЗначениеОтвета;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет регистрацию этого узла в плане обмена на сервере и проверяет НомерПринятого и НомерОтправленного
// Если НомерОтправленного < НомерПринятогоСервером Или НомерПринятого > НомерОтправленногоСервером будет выполнена 
// регистрация всех объектов в этой базе и на сервере
// 
//Параметры:
//	- ВариантРегистрации - Строка - "Зарегистрировать все", "Отменить регистрацию всего"
//	- ПараметрыПодключения - Структура или непоределено - см. СинхронизацияВызовСервера.ПараметрыОбменаCWSСервером()
//	- Процесс - Строка - имя процесса для корректных сообщений и отметке в логах
//
Функция ПроверитьРегистрациюУстройстваНаСервере(СостояниеОбмена = Неопределено, ПараметрыПодключения = Неопределено, 
			ПараметрыОбмена = Неопределено, ТекстОшибки = "", ОбновлятьНомераПакетов = Истина) Экспорт
	
	Если СостояниеОбмена = Неопределено Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	
	Если ПараметрыОбмена = Неопределено Тогда
		ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(СостояниеОбмена.УзелКорреспондента, Истина);
	КонецЕсли;
	
	Процесс = "Подготовка";
	ТекстДействия = НСтр("ru='Проверка регистрации устройства'");
	ПараметрыКонанды = Новый Структура("Наименование", ПараметрыОбмена.ИмяУзла);
	ПараметрыКонанды.Вставить("ПараметрыОбмена", ПараметрыОбменаДляОтправкиВСервис(ПараметрыОбмена));
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("checkregnode", 
						ПараметрыКонанды, 
						ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеОбмена, РезультатКоманды, ТекстДействия, Процесс);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.General, ТекстДействия, СостояниеОбмена);
	
	Если Не ОбновлятьНомераПакетов Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Проверить номера пакетов
	НомерПринятогоСервером = РезультатКоманды.ОтветСервера.ПараметрыОбмена.НомерПринятого;
	НомерОтправленногоСервером = РезультатКоманды.ОтветСервера.ПараметрыОбмена.НомерОтправленного;
	УзелЦБ = СостояниеОбмена.УзелКорреспондента;
	ОбновлятьНомера = РезультатКоманды.ОтветСервера.ПараметрыОбмена.Активность 
				И (УзелЦБ.НомерОтправленного < НомерПринятогоСервером 
					Или УзелЦБ.НомерПринятого > НомерОтправленногоСервером);
	
	Если ОбновлятьНомера Тогда

		УзелОбъект = УзелЦБ.ПолучитьОбъект();
		Если УзелОбъект.НомерПринятого > НомерОтправленногоСервером Тогда
			УзелОбъект.НомерПринятого = НомерОтправленногоСервером;
		КонецЕсли;
		Если УзелОбъект.НомерОтправленного < НомерПринятогоСервером Тогда
			УзелОбъект.НомерОтправленного = НомерПринятогоСервером;
		КонецЕсли;
		УзелОбъект.ОбменДанными.Загрузка = Истина;
		УзелОбъект.Записать();

		// возможно, эта база или база на сервере были восстановлены из резервной копии
		ПланыОбмена.ЗарегистрироватьИзменения(УзелЦБ);
		УстановитьРегистрациюИзмененийНаСервере("Зарегистрировать все", ПараметрыПодключения, Процесс);
	
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Выполняет регистрацию объектов в плане обмена на сервере
// 
//Параметры:
//	- ВариантРегистрации - Строка - "Зарегистрировать все", "Отменить регистрацию всего"
//	- ПараметрыПодключения - Структура или непоределено - см. СинхронизацияВызовСервера.ПараметрыОбменаCWSСервером()
//	- Процесс - Строка - имя процесса для корректных сообщений и отметке в логах
//
Процедура УстановитьРегистрациюИзмененийНаСервере(ВариантРегистрации, ПараметрыПодключения = Неопределено, Процесс = Неопределено) Экспорт
	
	Процесс = ?(ЗначениеЗаполнено(Процесс), Процесс, "Подготовка");
	ПараметрыКонанды = Новый Структура("ВариантРегистрации", ВариантРегистрации);
	ТекстДействия = НСтр("ru='Регистрация объектов к отправке на серврере'");
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("setregchanges", 
						ПараметрыКонанды, 
						ПараметрыПодключения);
	ПроверитьОтветСервера(Неопределено, РезультатКоманды, ТекстДействия, Процесс);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.General, ТекстДействия, Неопределено, Процесс);
	
КонецПроцедуры

// Возвращает структуру, описываюшую состояние синхронизации на сервере
//
Функция СостояниеОбменаНаСервере(СостояниеОбмена, ДополнительныеПараметры) Экспорт
	
	Если Не ДополнительныеПараметры.Свойство("ПараметрыПодключения") Тогда
		ДополнительныеПараметры.Вставить("ПараметрыПодключения", Неопределено);
	КонецЕсли;
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("statusserver", Неопределено, ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеОбмена, РезультатКоманды, НСтр("ru='Получение состояния обмена на сервере'"), "Прием");
	
	Возврат РезультатКоманды.ОтветСервера;
	
КонецФункции

// Отправляет на сервер команду остановки процесса обмена данными
// 
//Параметры:
//	ПараметрыПодключения - структура или Неопределено - структура с параметрами подключения
//	Процесс - Строка - "Прием", "Передача" или пусто. в послденем случае на сервре будут остановлены оба процесса обмена
//	СостояниеОбмена - Структура или неопределено - текущее состояние обмена (см. СостояниеОбмена())
//
Процедура ОстановитьСинхронизациюНаСервере(ПараметрыПодключения = Неопределено, Процесс = "", СостояниеОбмена = Неопределено) Экспорт
	
	ИмяПроцесса = ?(ЗначениеЗаполнено(Процесс), Процесс, НСтр("ru='прием и передача'"));
	ТекстДействия = СтрШаблон(НСтр("ru='Отмена процесса ""%1"" на серврере'"), ИмяПроцесса);
	ПараметрыКонанды = Новый Структура("Процесс", Процесс);
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("stopprocess", 
						ПараметрыКонанды, 
						ПараметрыПодключения);
	ПроверитьОтветСервера(Неопределено, РезультатКоманды, НСтр("ru='Отмена процесса ""%1"" на серврере'"), 
							ИмяПроцесса);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.General, ТекстДействия, Неопределено, ИмяПроцесса);
	
КонецПроцедуры

// Удаляет на сервере пакеты указанного типа - т.е. записи в РС ПакетыСинхронизацииКОтправке или ПакетыСинхронизацииПолученные
// 
//Параметры:
//	ТипПакетов - Строка - "полученные" или "отправленные"
//	НомерПакета - Число или пусто - номер пакета, части которого нужно удалить из РС. Если пусто - удаляются все пакеты
//	ПараметрыПодключения - структура или Неопределено - структура с параметрами подключения
//	Процесс - Строка - "Прием", "Передача" или пусто. в послденем случае на сервре будут остановлены оба процесса обмена
//	СостояниеОбмена - Структура или неопределено - текущее состояние обмена (см. СостояниеОбмена())
//
Процедура УдалитьПакетыНаСервере(ТипПакетов, НомерПакета = Неопределено, ПараметрыПодключения = Неопределено, 
									Процесс = Неопределено, СостояниеОбмена = Неопределено) Экспорт
	
	ПараметрыКонанды = Новый Структура("ТипПакетов,НомерПакета", ТипПакетов, НомерПакета);
	Если ТипПакетов = "полученные" Тогда
		ИмяПроцесса = "Передача";
	Иначе
		ИмяПроцесса = "Прием";
	КонецЕсли;
	ТекстДействия = СтрШаблон(НСтр("ru='Удаление пакета #%1 (тип: %2)'"), ТипПакетов, НомерПакета);
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("deletepackages", 
						ПараметрыКонанды, 
						ПараметрыПодключения);
	ПроверитьОтветСервера(Неопределено, РезультатКоманды, ТекстДействия, ИмяПроцесса);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.General, ТекстДействия);
	
КонецПроцедуры

Процедура СброситьСостояниеОбменаНаСервере(Процесс, СостояниеОбмена, ПараметрыПодключения = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	ТекстДействия = НСтр("ru='Сброс состояния синхронизации на сервере'");
	
	ПараметрыКонанды = Новый Структура("ПроцессНаСервере", Процесс);
	ПараметрыКонанды.Вставить("СостояниеОбмена",    
			СтруктураСостоянияДляОтправкиВСервис(СостояниеОбмена));
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("resetstatus", 
						ПараметрыКонанды, 
						ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеОбмена, РезультатКоманды, ТекстДействия, 
			?(ЗначениеЗаполнено(Процесс), Процесс, НСтр("ru='прием и передача'")));
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.General, ТекстДействия, СостояниеОбмена);
	
КонецПроцедуры



#КонецОбласти



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Проверяет корректность значений в состоянии обмена
//
Процедура ПроверитьСостоянияПроцессов(СостояниеОбмена, ДополнительныеПараметры)
	
	Если СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка Тогда
		СброситьСостояние(СостояниеОбмена, "Прием", ДополнительныеПараметры.ПараметрыПодключения);
	КонецЕсли;
	Если СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение Тогда
		СброситьСостояние(СостояниеОбмена, "Передача", ДополнительныеПараметры.ПараметрыПодключения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьВидТранспорта(СостояниеОбмена, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена.ТекущийВидТранспорта) Тогда
		Возврат;
	КонецЕсли;
	
	// если вид трансопрта был изменен до завершения процесса, состояние процесса следует сбросить
	
	Если Не СостояниеОбмена.Прием.ПроцессЗавершен 
		И ЗначениеЗаполнено(СостояниеОбмена.Прием.ВидТранспорта) 
		И СостояниеОбмена.Прием.ВидТранспорта <> СостояниеОбмена.ТекущийВидТранспорта Тогда
		СброситьСостояние(СостояниеОбмена, "Прием", ДополнительныеПараметры.ПараметрыПодключения);
	КонецЕсли;
	
	Если Не СостояниеОбмена.Передача.ПроцессЗавершен 
		И ЗначениеЗаполнено(СостояниеОбмена.Передача.ВидТранспорта) 
		И СостояниеОбмена.Передача.ВидТранспорта <> СостояниеОбмена.ТекущийВидТранспорта Тогда
		СброситьСостояние(СостояниеОбмена, "Передача", ДополнительныеПараметры.ПараметрыПодключения);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСостояниеСервера(СостояниеЭтойБазы, СостояниеСервера, ДополнительныеПараметры)
	
	ВсеКоды = ДополнительныеПараметры.ВсеКодыСостояний;
	
	// проверка-обновление текущего статуса сервера
	ТекущийСтатус = ?(ЗначениеЗаполнено(ДополнительныеПараметры.СостояниеСервера) 
			И ДополнительныеПараметры.СостояниеСервера.Свойство("СтатусСервера"), 
					ДополнительныеПараметры.СостояниеСервера.СтатусСервера, Неопределено);
	Если СостояниеСервера.СтатусСервера <> ТекущийСтатус  Тогда
		// обновление состояния сервера для информирования пользователя
		ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеЭтойБазы, 
			СостояниеСервера.СтатусСервера, 
			СостояниеСервера.general.message);
	КонецЕсли;
	
	// номера пакетов проверяются независимо от статуса сервера
	ПроверитьНомерПринятогоВЭтойБазе(СостояниеЭтойБазы, СостояниеСервера);
	ПроверитьНомерОтправленногоВЭтойБазе(СостояниеЭтойБазы, СостояниеСервера);
	
	// проверка-обновление состояний на сервере и в этой базе
	ПроверитьСостояниеПередачиНаСервере(СостояниеЭтойБазы, СостояниеСервера, 
					ДополнительныеПараметры);
	ПроверитьСостояниеПриемаНаСервере(СостояниеЭтойБазы, СостояниеСервера, 
					ДополнительныеПараметры);
	
	Возврат СостояниеСервера.СтатусСервера = ВсеКоды.Готов.Код // сервер полностью готов к обмену данными
		Или СостояниеСервера.СтатусСервера = ВсеКоды.НетЛицензий.Код; // возможна только загрузка изменений с сервера
	
КонецФункции

Процедура ПроверитьНомерПринятогоВЭтойБазе(СостояниеЭтойБазы, СостояниеСервера)
	
	Если СостояниеЭтойБазы.НомерПринятого > СостояниеСервера.НомерОтправленного Тогда
		// сервер был восстановлен из резервной копии (?)
		ИзменитьЗначениеРеквизитовУзла(СостояниеЭтойБазы.УзелКорреспондента, 
				Новый Структура("НомерПринятого", СостояниеСервера.НомерОтправленного));
		СостояниеЭтойБазы.НомерПринятого = СостояниеСервера.НомерОтправленного;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСостояниеПередачиНаСервере(СостояниеЭтойБазы, СостояниеСервера, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(СостояниеЭтойБазы.Прием.ДействиеПроцесса) Тогда
		// состояние приема в этой базе сброшено, на сервере должно быть так же
		Возврат;
	КонецЕсли;
	
	
	// сравнение состояния приема в этой базе с состоянием передачи на сервере
	Если СостояниеЭтойБазы.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка
		И СостояниеСервера.Передача.ДействиеПроцесса = "Выгрузка" Тогда
		// эта база инициировала выгрузку на сервере. Обновить состояние в этой базе результатами с сервера 
		
		ЗаполнитьСостояниеПроцессаДаннымиССервера(СостояниеЭтойБазы.Прием, СостояниеСервера.Передача);
		Если ЗначениеЗаполнено(СостояниеСервера.Передача.КодРезультатаДействия) Тогда
			// на сервере процесс завершился
			
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеЭтойБазы, "Прием", 
						СостояниеЭтойБазы.Прием.ДействиеПроцесса, 
						СостояниеСервера.Передача.КодРезультатаДействия, 
						СостояниеСервера.Передача.ТекстОшибки);
		Иначе
			ПроцессыОбменаСлужебный.ЗаписатьСостояниеВРегистр(СостояниеЭтойБазы, "Прием");
		КонецЕсли;
		
	ИначеЕсли СостояниеЭтойБазы.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда 
		// в этой базе выполнялась загрузка. Отправить результат загрузки на сервер
		
		Если СостояниеЭтойБазы.НомерПринятого > 0 
			И СостояниеЭтойБазы.НомерПринятого = СостояниеСервера.НомерОтправленного 
			И СостояниеЭтойБазы.НомерПринятого = СостояниеСервера.Передача.НомерПакета Тогда
			// в эту базу загружено все, что было выгружено на сервере
					
			Если Не СостояниеСервера.Передача.ПроцессЗавершен Тогда
				ОтметитьНаСервереЗавершениеПередачи(СостояниеЭтойБазы, ДополнительныеПараметры, 
					ДополнительныеПараметры.ВсеКодыРезультатов.Выполнено.Код);
			КонецЕсли;
			
		ИначеЕсли СостояниеСервера.Передача.НомерПакета > 0 
			И СостояниеСервера.Передача.НомерПакета <> СостояниеЭтойБазы.Прием.НомерПакета Тогда
			
			СброситьСостояние(СостояниеЭтойБазы, "Прием", ДополнительныеПараметры.ПараметрыПодключения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНомерОтправленногоВЭтойБазе(СостояниеЭтойБазы, СостояниеСервера)
	
	Если СостояниеЭтойБазы.НомерОтправленного < СостояниеСервера.НомерПринятого Тогда
		// эта база восстановлена из резервной копии
		ИзменитьЗначениеРеквизитовУзла(СостояниеЭтойБазы.УзелКорреспондента, 
				Новый Структура("НомерОтправленного", СостояниеСервера.НомерПринятого));
		СостояниеЭтойБазы.НомерОтправленного = СостояниеСервера.НомерПринятого;
	КонецЕсли;
	
	Если СостояниеЭтойБазы.НомерОтправленного >= СостояниеСервера.НомерПринятого Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(СостояниеЭтойБазы.УзелКорреспондента, СостояниеСервера.НомерПринятого);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСостояниеПриемаНаСервере(СостояниеЭтойБазы, СостояниеСервера, ДополнительныеПараметры)
	
	Если Не ЗначениеЗаполнено(СостояниеЭтойБазы.Передача.ДействиеПроцесса) Тогда
		// состояние на клиенте сброшено, на сервере должно быть сброшено так же
		Возврат;
	КонецЕсли;
	
	Если СостояниеЭтойБазы.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка
		И СостояниеСервера.Прием.ДействиеПроцесса = "Загрузка" Тогда
		// эта база инициировала загрузку на сервере. Обновить состояние в этой базе результатами с сервера
		
		// обновляем состояние передачи в этой базе состоянием приема на сервере
		ЗаполнитьСостояниеПроцессаДаннымиССервера(СостояниеЭтойБазы.Передача, СостояниеСервера.Прием);
		Если ЗначениеЗаполнено(СостояниеСервера.Прием.КодРезультатаДействия) Тогда
			
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеЭтойБазы, "Передача", 
				СостояниеЭтойБазы.Передача.ДействиеПроцесса, 
				СостояниеСервера.Прием.КодРезультатаДействия, 
				СостояниеСервера.Прием.ТекстОшибки);
			ПроверитьЗавершениеПроцессаПередачи(СостояниеЭтойБазы, ДополнительныеПараметры);
			
		Иначе
			
			ПроцессыОбменаСлужебный.ЗаписатьСостояниеВРегистр(СостояниеЭтойБазы, "Передача");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗавершениеПроцессаПередачи(СостояниеЭтойБазы, ДополнительныеПараметры)
	
	Если Не ПроцессЗавершенУспешно(СостояниеЭтойБазы, "Передача", ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
			
	Если СостояниеЭтойБазы.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе Тогда
		// если данные на сервере загружены, восстанавливаем стандартный сценарий

		НомерОтправленногоПоСценарию = СостояниеЭтойБазы.НомерДляУстановленногоСценария;
		СостояниеСервера = ДополнительныеПараметры.СостояниеСервера;
		Если НомерОтправленногоПоСценарию <= СостояниеСервера.НомерПринятого Тогда
			// на сервере принят пакет с номером более, чем номер, по которому устанавливался нестандартный сценарий
			СинхронизацияАвтономныхКопий.УстановитьСтандартныйСценарийЗапросаДанных(СостояниеЭтойБазы.УзелКорреспондента);
			
			СостояниеЭтойБазы.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных;
			СостояниеЭтойБазы.НомерДляУстановленногоСценария = 0;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьЗначениеРеквизитовУзла(Узел, ЗначенияРеквизитов)
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
	    ЭлементБлокировки = Блокировка.Добавить(ОбщегоНазначения.ИмяТаблицыПоСсылке(Узел));
	    ЭлементБлокировки.УстановитьЗначение("Ссылка", Узел);
	    Блокировка.Заблокировать();
		
		ЗаблокироватьДанныеДляРедактирования(Узел);
		УзелОбъект = Узел.ПолучитьОбъект();
		
		Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
			Если УзелОбъект[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				УзелОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если УзелОбъект.Модифицированность() Тогда
			УзелОбъект.ОбменДанными.Загрузка = Истина;
			УзелОбъект.Записать();
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПроцессЗавершенУспешно(СостояниеОбмена, Процесс, ДополнительныеПараметры = Неопределено)
	
	ОписаниеПроцесса = СостояниеОбмена[Процесс];
	ВсеКоды = ?(ДополнительныеПараметры = Неопределено, 
			ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий(),
			ДополнительныеПараметры.ВсеКодыРезультатов);
	
	Возврат ОписаниеПроцесса.ПроцессЗавершен
		И ОписаниеПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка
		И ОписаниеПроцесса.КодРезультатаДействия = ВсеКоды.Выполнено.Код;
	
КонецФункции

Процедура ЗаполнитьСостояниеПроцессаДаннымиССервера(СостояниеПроцесса, ДанныеССервера, СписокСвойств = Неопределено, ИсключаемыеСвойства = Неопределено)
	
	ЗаполнитьЗначенияСвойств(СостояниеПроцесса, ДанныеССервера, СписокСвойств, ИсключаемыеСвойства);
	
	Если ДанныеССервера.Свойство("ДействиеПроцесса") И ТипЗнч(ДанныеССервера.ДействиеПроцесса) = Тип("Строка") Тогда
		// Получение на сервере - это отправка на клиенте и наоборот
	
		Если (Не ЗначениеЗаполнено(СписокСвойств) Или СтрНайти(Нрег(СписокСвойств), "действиепроцесса") > 0)
			И (Не ЗначениеЗаполнено(ИсключаемыеСвойства) Или СтрНайти(Нрег(ИсключаемыеСвойства), "действиепроцесса") = 0) Тогда
			
			Если Не ЗначениеЗаполнено(ДанныеССервера.ДействиеПроцесса) Тогда
				СостояниеПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.ПустаяСсылка(); 
			ИначеЕсли ДанныеССервера.ДействиеПроцесса = "Отправка" Тогда
				СостояниеПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение;
			ИначеЕсли ДанныеССервера.ДействиеПроцесса = "Получение" Тогда
				СостояниеПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка;
			Иначе
				СостояниеПроцесса.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена[ДанныеССервера.ДействиеПроцесса];
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеССервера.Свойство("КодРезультатаДействия") И ЗначениеЗаполнено(ДанныеССервера.КодРезультатаДействия) Тогда
		
		Если (Не ЗначениеЗаполнено(СписокСвойств) Или СтрНайти(Нрег(СписокСвойств), "кодрезультатадействия") > 0)
			И (Не ЗначениеЗаполнено(ИсключаемыеСвойства) Или СтрНайти(Нрег(ИсключаемыеСвойства), "кодрезультатадействия") = 0) Тогда
			
			ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
			Если ДанныеССервера.КодРезультатаДействия = ВсеКоды.ОтсутствуютДанныеДляВыгрузки.Код Тогда
				СостояниеПроцесса.КодРезультатаДействия = ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код;
			ИначеЕсли ДанныеССервера.КодРезультатаДействия = ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код Тогда
				СостояниеПроцесса.КодРезультатаДействия = ВсеКоды.ОтсутствуютДанныеДляВыгрузки.Код;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНомерВерсииНаСервере(СостояниеОбмена = Неопределено, ПараметрыПодключения = Неопределено, ТекстОшибки = "") Экспорт
	
	ВерсииСервера = ПолучитьВерсиюСервера(СостояниеОбмена, ПараметрыПодключения);
	
	ТекущаяВерсияНаСервере     = ВерсииСервера.ВерсияПриложения;
	МинимальнаяВерсияНаСервере = ПроцессыОбменаПовтИсп.МинимальнаяВерсияСервера();
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсияНаСервере, МинимальнаяВерсияНаСервере) >= 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
	ТекстОшибки = СтрШаблон(НСтр("ru='На сервере версия приложения %1, а требуется версия не ниже %2'"),
				ТекущаяВерсияНаСервере, МинимальнаяВерсияНаСервере);
	
	Если СостояниеОбмена <> Неопределено Тогда
		// изменить статус сервера в состоянии обмена
		ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, ВсеКоды.СерверУстарел.Код, ТекстОшибки);
	КонецЕсли;
	
	// записать ошибку в журнал
	ЗаписьЖурналаРегистрации(СостояниеОбмена.КлючЖурнала + "Подготовка", 
				УровеньЖурналаРегистрации.Предупреждение,,,ТекстОшибки);
	
	Возврат Ложь;
	
КонецФункции

Функция ОбновитьСостояниеКлиентаНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры, ПроцессНаСервере = "")
	
	ПараметрыКонанды = Новый Структура("ПроцессНаСервере", ПроцессНаСервере);
	ПараметрыКонанды.Вставить("СостояниеОбмена", СтруктураСостоянияДляОтправкиВСервис(СостояниеЭтойБазы));
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("updateresults", 
					ПараметрыКонанды, ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеЭтойБазы, РезультатКоманды, 
				НСтр("ru='Обновление результатов обмена на сервере'"), 
				ПроцессНаСервере);
	
	СтруктураРезультата = РезультатКоманды.ОтветСервера;
	Возврат СтруктураРезультата;
	
КонецФункции

Процедура ОтметитьОтказЗапускаФоновогоЗадания(КодСостояния, ТекстОшибки)
	
	СостояниеОбмена = СостояниеОбмена();
	ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
			КодСостояния, 
			ТекстОшибки);
	ВызватьИсключение ТекстОшибки;
	
КонецПроцедуры

#Область Запросы_к_сервису

Функция НовыйСтруктураGeneralExecute(ПараметрыПодключения, Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("ib", ПараметрыПодключения.КодЭтогоУзла);
	Результат.Вставить("cib", ПараметрыПодключения.КодЦентральнойБазы);
	Результат.Вставить("mobile", Ложь);
	Результат.Вставить("version", Метаданные.Версия);
	Результат.Вставить("format", СинхронизацияАвтономныхКопийКлиентСервер.ТекущаяВерсияФормата());
	Результат.Вставить("method", Команда);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВерсиюСервера(СостояниеОбмена, ПараметрыПодключения) Экспорт
	
	ИмяПроцесса = "Подготовка";
	ТекстДействия = НСтр("ru='Установка на сервере отметки о завершении передачи'");

	ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураЗапроса = ДеньгиВОблаке.НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
							ПараметрыПодключения.АдресСервисаСинхронизации, 
							"version");
	ОтветСервера = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураЗапроса, "", 
				"Обмен данными.СинхронизацияАвтономныхКопий." + "version");
				
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния",   ОтветСервера.КодСостояния); 
	Результат.Вставить("ОписаниеОшибки", ОтветСервера.ОписаниеОшибки);
	Если ОтветСервера.КодСостояния = 200 Тогда
		Результат.Вставить("ОтветСервера",   ОтветСервера.ЗначениеОтвета); 
	КонецЕсли; 

	ПроверитьОтветСервера(СостояниеОбмена, Результат, ТекстДействия, ИмяПроцесса);
	
	Возврат ОтветСервера.ЗначениеОтвета;
	
КонецФункции

Процедура ОтметитьНаСервереЗавершениеПередачи(СостояниеЭтойБазы, ДополнительныеПараметры, КодРезультата, ТекстОшибки = Неопределено)
	
	ИмяПроцесса = "Прием";
	ТекстДействия = НСтр("ru='Установка на сервере отметки о завершении передачи'");
	
	РезультатПередачи = Новый Структура("КодРезультатаДействия,ТекстОшибки", 
						КодРезультата, ТекстОшибки);
	ПараметрыКонанды = Новый Структура("НомерПакета,Результат", 
						СостояниеЭтойБазы.НомерПринятого, РезультатПередачи);
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("marktransfer", ПараметрыКонанды, ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеЭтойБазы, РезультатКоманды, ТекстДействия, ИмяПроцесса);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.general, ТекстДействия, 
								СостояниеЭтойБазы, ИмяПроцесса);
	
КонецПроцедуры

Функция ПроверитьНеобходимостьВыгрузкиНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры)
	
	ИмяПроцесса = "Прием";
	ТекстДействия = НСтр("ru='Проверка изменений, зарегистрированных на сервере'");
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("checkunloading", Неопределено, 
				ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеЭтойБазы, РезультатКоманды, ТекстДействия, ИмяПроцесса);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.general, ТекстДействия, 
								СостояниеЭтойБазы, ИмяПроцесса);
	
	Возврат РезультатКоманды.ОтветСервера.НужнаВыгрузкаНаСервере;
	
КонецФункции

Функция РезультатКомандыВыгрузкиНаСервере(СостояниеЭтойБазы, ДополнительныеПараметры)
	
	ИмяПроцесса = "Прием";
	ТекстДействия = НСтр("ru='Запуск/проверка выгрузки изменений на сервере'");
	ПараметрыКонанды = Новый Структура("НомерПакета", СостояниеЭтойБазы.НомерПринятого);
						
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("unloadingchanges", ПараметрыКонанды, 
				ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеЭтойБазы, РезультатКоманды, ТекстДействия, ИмяПроцесса);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.general, ТекстДействия, 
								СостояниеЭтойБазы, ИмяПроцесса);
	
	Возврат РезультатКоманды.ОтветСервера.Передача;
	
КонецФункции

Функция ОписаниеПакетаДляПолученияССервера(СостояниеЭтойБазы, ДополнительныеПараметры)
	
	ИмяПроцесса = "Прием";
	ТекстДействия = НСтр("ru='Информация о пакете к получению с сервера'");

	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("infosendpack", Неопределено, 
				ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеЭтойБазы, РезультатКоманды, ТекстДействия, ИмяПроцесса);
	ПроверитьСтатусСервераВОтветеНаЗапрос(РезультатКоманды.ОтветСервера.general, ТекстДействия, 
								СостояниеЭтойБазы, ИмяПроцесса);
	
	Возврат РезультатКоманды.ОтветСервера.ПакетКОтправке;
	
КонецФункции

// Вызывает исключение в случае некорркетного ответа сервера
// Используется для проверки ответов на метод POST execute
//
Процедура ПроверитьОтветСервера(СостояниеОбмена, ОтветСервера, ОписаниеОперации, Процесс) Экспорт
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизация автономных копий." + Процесс, 
				УровеньЖурналаРегистрации.Ошибка,
				, 
				, 
				СтрШаблон("Ошибка выполнения операции ""%1"":
				|http-запрос к серверу вернул результат с кодом %2
				|и описанием: %3
				|", ОписаниеОперации, ОтветСервера.КодСостояния, ОтветСервера.ОписаниеОшибки));
		
		Если СостояниеОбмена <> Неопределено Тогда
			ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
					ОтветСервера.КодСостояния, 
					ОтветСервера.ОписаниеОшибки);
		КонецЕсли;
		
		ВызватьИсключение СтрШаблон(НСтр("ru='Ошибка процесса синхронизации ""%1"":
			|http-запрос завершился с кодом состояния %2 
			|описание: %3'"), Процесс, ОтветСервера.КодСостояния, ОтветСервера.ОписаниеОшибки);
	
	КонецЕсли;
	
	ТипОтвета = ТипЗнч(ОтветСервера.ОтветСервера);
	Если ТипОтвета <> Тип("Структура") И ТипОтвета <> Тип("ФиксированнаяСтруктура") Тогда
	
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизация автономных копий." + Процесс, 
				УровеньЖурналаРегистрации.Ошибка,
				, 
				, 
				СтрШаблон("Ошибка выполнения операции ""%1"":
				|http-запрос к серверу вернул результат с типом %2 вместо структуры
				|", ОписаниеОперации, ТипОтвета));
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось выполнить операцию ""%1"":
			|http-запрос вернул ответ некорректного типа %2 
			|описание: '"), ОписаниеОперации, ТипОтвета);
		Если СостояниеОбмена <> Неопределено Тогда
			ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
					500, 
					ТекстСообщения);
		КонецЕсли;
		
		ВызватьИсключение ТекстСообщения;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтатусСервераВОтветеНаЗапрос(СтруктураGenehal, ВыполняемоеДействие, СостояниеОбмена = Неопределено, Процесс = "")
	
	Процесс = ?(ЗначениеЗаполнено(Процесс), Процесс, "Подготовка");
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
	
	Если СтруктураGenehal.response <> ВсеКоды.Готов.Код Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='На сервере не удалось выполнить действие ""%1""
			|Причина: %2'"),
					ВыполняемоеДействие, СтруктураGenehal.message);
		ТекстОшибки = СтрШаблон(НСтр("ru='Статус сервера не позволил выполнить действие ""%1"":
		|Код состояния сервера: %2
		|Сообщение сервера: %3
		|Подробности:
		|%4'"),
				ВыполняемоеДействие,
				СтруктураGenehal.response, 
				СтруктураGenehal.message,
				СтруктураGenehal.errordescription);
		
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизация автономных копий." + Процесс, 
				УровеньЖурналаРегистрации.Ошибка,
				, 
				, 
				ТекстОшибки);
		Если СостояниеОбмена <> Неопределено Тогда
			ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, СтруктураGenehal.response, ТекстОшибки);
		КонецЕсли;
		
		ВызватьИсключение ТекстСообщения;
		
	ИначеЕсли СостояниеОбмена <> Неопределено 
		И СтруктураGenehal.response <> СостояниеОбмена.СтатусТранспорта.КодСостояния  Тогда
		// обновление состояния сервера для информирования пользователя
		
		ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
				СтруктураGenehal.response, 
				СтруктураGenehal.message);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОбменаДляОтправкиВСервис(ПараметрыОбмена = Неопределено) 
	
	ИмяПланаОбмена = "СинхронизацияАвтономныхКопий";
	ЭтотУзел = СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел(ИмяПланаОбмена);
	УзелЦБ   = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы(ИмяПланаОбмена);
	Если ПараметрыОбмена = Неопределено Тогда
		ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(УзелЦБ, Истина);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ВерсияФорматаОбмена", СинхронизацияАвтономныхКопийКлиентСервер.ТекущаяВерсияФормата()); 
	Результат.Вставить("МобильноеУстройство", Ложь); 
	Результат.Вставить("ПользовательБазы", ПараметрыОбмена.ПользовательБазы); 
	Результат.Вставить("Наименование", СокрЛП(ЭтотУзел)); 
	Результат.Вставить("ВидПериода", Неопределено); 
	Результат.Вставить("КоличествоПериодов", 0); 
	
	Сценарий = ПараметрыОбмена.ЗатребованныйСценарий;
	Если Сценарий = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии Тогда
		Результат.Вставить("ЗатребованныйСценарий", "ЗаменитьВсеВАвтономнойКопии"); 
		Результат.Вставить("СценарийПереданныхДанных", "ОбъединениеДанных"); 
		Результат.Вставить("СценарийЗапрашиваемыхДанных", "ЗаменитьВсеВАвтономнойКопии"); 
		
	ИначеЕсли Сценарий = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе Тогда
		Результат.Вставить("ЗатребованныйСценарий", "ЗаменитьВсеВЦентральнойБазе"); 
		Результат.Вставить("СценарийПереданныхДанных", "ЗаменитьВсеВЦентральнойБазе"); 
		Результат.Вставить("СценарийЗапрашиваемыхДанных", "ОбъединениеДанных"); 
		
	Иначе
		Результат.Вставить("ЗатребованныйСценарий", "ОбъединениеДанных"); 
		Результат.Вставить("СценарийПереданныхДанных", "ОбъединениеДанных"); 
		Результат.Вставить("СценарийЗапрашиваемыхДанных", "ОбъединениеДанных"); 
		
	КонецЕсли;
	
	Результат.Вставить("НомерПринятого",     ПараметрыОбмена.НомерПринятого);
	Результат.Вставить("НомерОтправленного", ПараметрыОбмена.НомерОтправленного);
	Результат.Вставить("НомерДляУстановленногоСценария", ПараметрыОбмена.НомерДляУстановленногоСценария);
	
	Возврат Результат;
	
КонецФункции 

Функция СтруктураСостоянияДляОтправкиВСервис(СостояниеОбмена)
	
	Если СостояниеОбмена = Неопределено Тогда
		СостояниеОбмена = СостояниеОбмена();
	КонецЕсли;
	
	Результат = Новый Структура("НомерПринятого,НомерОтправленного,ПроцессАктивен,СценарийОбмена");
	ЗаполнитьЗначенияСвойств(Результат, СостояниеОбмена);
	
	Если ЗначениеЗаполнено(СостояниеОбмена.СценарийОбмена) Тогда
		Результат.СценарийОбмена = ОбщегоНазначения.ИмяЗначенияПеречисления(СостояниеОбмена.СценарийОбмена);
	Иначе
		Результат.СценарийОбмена = "ЗаменитьВсеВАвтономнойКопии";
	КонецЕсли;
	Результат.Вставить("НомерДляУстановленногоСценария", СостояниеОбмена.НомерДляУстановленногоСценария);
			
	Результат.Вставить("Прием", ОбщегоНазначения.СкопироватьРекурсивно(СостояниеОбмена.Прием));
	Результат.Прием.ДействиеПроцесса = ?(ЗначениеЗаполнено(Результат.Прием.ДействиеПроцесса),
				ОбщегоНазначения.ИмяЗначенияПеречисления(Результат.Прием.ДействиеПроцесса), "");
	
	Результат.Вставить("Передача", ОбщегоНазначения.СкопироватьРекурсивно(СостояниеОбмена.Передача));
	Результат.Передача.ДействиеПроцесса = ?(ЗначениеЗаполнено(Результат.Передача.ДействиеПроцесса),
				ОбщегоНазначения.ИмяЗначенияПеречисления(Результат.Передача.ДействиеПроцесса), "");
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти


#Область Процесс_Передача

Функция ДопускаетсяПерезапускПроцессаПередача(СостояниеОбмена, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.СпособЗапуска = "Интерактивно" Тогда
		// Состояние не изменяем, процесс заново не начинаем
		Возврат Ложь;
	КонецЕсли;
	
	// Все последующие проверки выполняются только для автоматического режима синхронизации, когда 
	//процессы Прием и Передача могут выполняться параллельно 
	
	// Проверка сценария
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если СостояниеОбмена.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии
		И ЗначениеЗаполнено(СостояниеОбмена.Прием.ДействиеПроцесса) И Не СостояниеОбмена.Прием.ПроцессЗавершен Тогда
		// невозможно начинать новую передачу, пока не будет завершен прием по сценарию "Заменить все в автономной копии"
		Возврат Ложь;
	КонецЕсли;
	
	Если СостояниеОбмена.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе
		И СостояниеОбмена.Передача.КодРезультатаДействия <> ВсеКодыРезультатов.Выполнено.Код Тогда
		// Передача по сценарию "заменить все на сервере" не была успешно завершена
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

// Проверяет состояние процесса "Передача" и, при необходимости, выполняет следующее действие или 
//изменяет результат выполняемого дейсвтия
Процедура ОбработкаПроцессаПередачи(СостояниеОбмена, ДополнительныеПараметры)
	
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если СостояниеОбмена.Передача.ПроцессЗавершен Тогда
		Если Не ДопускаетсяПерезапускПроцессаПередача(СостояниеОбмена, ДополнительныеПараметры) Тогда
			Возврат;
		Иначе
			СброситьСостояние(СостояниеОбмена, "Передача", ДополнительныеПараметры.ПараметрыПодключения);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена.Передача.ДействиеПроцесса)
		Или СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка
			И Не ЗначениеЗаполнено(СостояниеОбмена.Передача.КодРезультатаДействия) Тогда
		// выгрузка не выполнялась или не была завершена
		
		ВыгрузитьИзмененияВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры);
		
	ИначеЕсли СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
		
		Если СостояниеОбмена.Передача.КодРезультатаДействия <> ВсеКодыРезультатов.Выполнено.Код Тогда
			// повторить выгрузку
			ВыгрузитьИзмененияВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры);
		Иначе
			// отправить выгруженное на сервере
			ОтправитьПакетНаСервер(СостояниеОбмена, ДополнительныеПараметры);
		КонецЕсли;
		
	ИначеЕсли СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка Тогда
		
		Если СостояниеОбмена.Передача.КодРезультатаДействия <> ВсеКодыРезультатов.Выполнено.Код Тогда
			// передача пакета не начиналась или не завершилась
			// отправка (продолжение отправки) пакета по частям 
			ОтправитьПакетНаСервер(СостояниеОбмена, ДополнительныеПараметры);
			
		Иначе
			// пакет передан на сервер, начать его загрузку
			ОчиститьВыгруженныйПакет(СостояниеОбмена, ДополнительныеПараметры);
			ЗагрузитьДанныеНаСервере(СостояниеОбмена, ДополнительныеПараметры);
		
		КонецЕсли;
		
	ИначеЕсли СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
		// проверка состояния загрузки на сервере делается в ПродолжитьПроцесс() после
		//получения состояния сервера. Здесь только проверяем запуск процесса на севрере 
		
		Если Не ЗначениеЗаполнено(ДополнительныеПараметры.СостояниеСервера)
			Или Не ДополнительныеПараметры.СостояниеСервера.Свойство("Прием")
			Или ДополнительныеПараметры.СостояниеСервера.Прием.ДействиеПроцесса <> "Загрузка"
			Или Не ДополнительныеПараметры.СостояниеСервера.Прием.ПроцессЗавершен Тогда
				// нет информации о загрузке пакета на сервере
			ЗагрузитьДанныеНаСервере(СостояниеОбмена, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьИзмененияВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры)
	
	ВсеКоды = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если СостояниеОбмена.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных
		И Не ОбменДаннымиСлужебный.ИзмененияЗарегистрированы(СостояниеОбмена.УзелКорреспондента) Тогда
			
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Загрузка", 
				ВсеКоды.ОтсутствуютДанныеДляВыгрузки.Код, "");
		ОбновитьСостояниеКлиентаНаСервере(СостояниеОбмена, ДополнительныеПараметры, "Прием");
		Возврат;
		
	КонецЕсли;
	
	НомерПакетаКОтправке = СостояниеОбмена.НомерОтправленного + 1;
	ОтметитьНачалоДействия(СостояниеОбмена, "Передача", "Выгрузка", НомерПакетаКОтправке, 0, 0, 0, 0);
	ОбновитьСостояниеКлиентаНаСервере(СостояниеОбмена, ДополнительныеПараметры, "Прием");
	
	ПроцессыОбменаСлужебный.ВыгрузитьИзмененияВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры);
	
	ОбновитьСостояниеКлиентаНаСервере(СостояниеОбмена, ДополнительныеПараметры, "Прием");
	
КонецПроцедуры

Процедура ОтправитьПакетНаСервер(СостояниеОбмена, ДополнительныеПараметры)
	
	Узел               = СостояниеОбмена.УзелКорреспондента;
	НомерПакета        = СостояниеОбмена.Передача.НомерПакета;
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	
	// Проверка выгруженных изменений
	СписокПакетов = РегистрыСведений.ПакетыСинхронизацииКОтправке.ОчередьПакетовДляУзла(Узел, НомерПакета);
	Если Не ЗначениеЗаполнено(СписокПакетов) Тогда
		// Отправлять нечего
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Отправка", ВсеКодыРезультатов.Выполнено.Код, "Отсутствуют данные для отправки");
		Возврат;
	КонецЕсли;
	
	ОтметитьНачалоДействия(СостояниеОбмена, "Передача", "Отправка", Неопределено, СписокПакетов.Количество(), 0);
	
	Ключ = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", СостояниеОбмена.УзелКорреспондента, Перечисления.ПроцессыОбменаДанными.Передача));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ключ);
	Исключение
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Отправка", 
				ВсеКодыРезультатов.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		ТекстПредупреждения = СтрШаблон(НСтр("ru='Не удалось заблокировать запись узла ""%1"" для отправки пакета на сервер'"), 
					СостояниеОбмена.УзелКорреспондента);
		ВызватьИсключение ТекстПредупреждения;
	КонецПопытки;

	// Отправить все части по одной
	ОбработаноЧастей = 0;
	Для каждого СтрокаСписка Из СписокПакетов Цикл
		
		Если СтрокаСписка.Отправлено Тогда
			ОбработаноЧастей = ОбработаноЧастей + 1;
			ОбновитьСтатистикуДействия(СостояниеОбмена, "Передача", Неопределено, 
					Неопределено, ОбработаноЧастей);
			Продолжить;
		КонецЕсли;
		
		РезультатОтправки = ПередатьЧастьПакета(ДополнительныеПараметры.ПараметрыПодключения, СтрокаСписка);
		Если РезультатОтправки.КодСостояния = 200 Или РезультатОтправки.КодСостояния = 201 Тогда
			
			СтрокаСписка.Отправлено = Истина;
			Запись = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаСписка, "УзелКорреспондента,НомерПакетаКОтправке,НомерЧастиПакета");
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.Отправлено = Истина;
				Запись.Записать(Истина);
			КонецЕсли;
			ОбработаноЧастей = ОбработаноЧастей + 1;
			ОбновитьСтатистикуДействия(СостояниеОбмена, "Передача", Неопределено, 
					Неопределено, ОбработаноЧастей);
			
		Иначе
			
			ОбработатьОшибкуСервераПоОтправке(СостояниеОбмена, РезультатОтправки, ДополнительныеПараметры);
			РазблокироватьДанныеДляРедактирования(Ключ);
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Отправка", ВсеКодыРезультатов.Выполнено.Код, "");
	РазблокироватьДанныеДляРедактирования(Ключ);
	
КонецПроцедуры

// Отправляет на сервер данные, сохраненные в РС ПакетыСинхронизацииКОтправке
//
//Параметры:
//	ПараметрыПодключения - Структура или непоределено
//	ПараметрыПакета - Структура или строка таблицы значений с описанием ключей записи регистра сведений
//
//Возвращаемое значение:
//	Структура:
//		* ПакетОтправлен - Булево
//		* КодСостояния - 200 в случае успеха или другой код в случае ошибки
//		* ОписаниеОшибки - Строка - имеет смысл только если КодСостояния <> 200
//
Функция ПередатьЧастьПакета(ПараметрыПодключения, ПараметрыПакета)
	
	Результат = Новый Структура;
	Результат.Вставить("ПакетОтправлен", Истина); 
	Результат.Вставить("КодСостояния",   201); 
	Результат.Вставить("ОписаниеОшибки", ""); 
	
	Запись = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыПакета, "УзелКорреспондента,НомерПакетаКОтправке,НомерЧастиПакета");
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение НСтр("ru='Ошибка отправки пакета на сервер'") + Символы.ПС + Символы.ПС
				+ Символы.Таб + "Узел = " + ПараметрыПакета.УзелКорреспондента + Символы.ПС
				+ Символы.Таб + "Номер пакета = " + ПараметрыПакета.НомерПакетаКОтправке + Символы.ПС
				+ Символы.Таб + "Номер части = " + ПараметрыПакета.НомерЧастиПакета;
	КонецЕсли;
	
	СтрокаПараметров = СтрШаблон("sentno=%1&partno=%2&total=%3&type=%4&date=%5", 
			Формат(ПараметрыПакета.НомерПакетаКОтправке, "ЧДЦ=0; ЧГ="),
			Формат(ПараметрыПакета.НомерЧастиПакета, "ЧДЦ=0; ЧГ="),
			Формат(ПараметрыПакета.ВсегоЧастей, "ЧДЦ=0; ЧГ="),
			ОбщегоНазначения.ИмяЗначенияПеречисления(ПараметрыПакета.ТипПакета),
			Формат(ПараметрыПакета.ДатаВыгрузки, "ЧДЦ=0; ЧГ=; ДФ=ггггММддЧЧммсс")
			);
	
	ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураЗапроса = ДеньгиВОблаке.НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
							ДеньгиВОблаке.АдресСервисаСинхронизации(), 
							"upload/" + ПараметрыПодключения.КодЭтогоУзла + "?" + СтрокаПараметров);
	Ответ = RESTВызовСервера.РезультатHTTPЗапроса("PUT", СтруктураЗапроса, , 
					СинхронизацияАвтономныхКопий.КлючДляЖурналаРегистрации("ВыгрузкаДанных"), 
					"201", Запись.ДанныеПакета.Получить());
	
	Результат.КодСостояния = Ответ.КодСостояния;
	Результат.ПакетОтправлен = Результат.КодСостояния = 201;
	Результат.ОписаниеОшибки = Ответ.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции 

Процедура ОбработатьОшибкуСервераПоОтправке(СостояниеОбмена, ОтветСервера, ДополнительныеПараметры)
	
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	Результат = Неопределено;
	Если ОтветСервера.КодСостояния = 402 Тогда
		Результат = ВсеКодыРезультатов.НетЛицензий;
	ИначеЕсли ОтветСервера.КодСостояния = 408 Или ОтветСервера.КодСостояния = 504 Тогда
		Результат = ВсеКодыРезультатов.ИстеклоВремяОжидания;
	ИначеЕсли ОтветСервера.КодСостояния = 403 Тогда
		Результат = ВсеКодыРезультатов.ОбменЗапрещен;
	ИначеЕсли ОтветСервера.КодСостояния = 503 Тогда
		Результат = ВсеКодыРезультатов.СерверНедоступен;
	Иначе 
		Результат = ВсеКодыРезультатов.ОшибкаНаСервере
	КонецЕсли;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Отправка", Результат.Код, 
			?(ЗначениеЗаполнено(ОтветСервера.ОписаниеОшибки), ОтветСервера.ОписаниеОшибки, "Неизвестная ошибка"));
	
КонецПроцедуры

Процедура ОчиститьВыгруженныйПакет(СостояниеОбмена, ДополнительныеПараметры)
	
	РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, 
				СостояниеОбмена.Передача.НомерПакета);
	ОбновитьСтатистикуДействия(СостояниеОбмена, "Передача", Неопределено, 0, 0);
	
КонецПроцедуры

Процедура ЗагрузитьДанныеНаСервере(СостояниеОбмена, ДополнительныеПараметры)
	
	ИмяПроцесса  = "Передача";
	Если Не ДополнительныеПараметры.Свойство("ПараметрыПодключения") Тогда
		ДополнительныеПараметры.Вставить("ПараметрыПодключения", Неопределено);
	КонецЕсли;
	
	ПараметрыКонанды = Новый Структура("НомерПакета", СостояниеОбмена.Передача.НомерПакета);
	
	РезультатКоманды = ВыполнитьКомандуСинхронизацииНаСервере("readingpackage", 
						ПараметрыКонанды, 
						ДополнительныеПараметры.ПараметрыПодключения);
	ПроверитьОтветСервера(СостояниеОбмена, РезультатКоманды, НСтр("ru='Запуск загрузки данных на сервере'"), ИмяПроцесса);
	
	ВсеКодыСостояний = ДополнительныеПараметры.ВсеКодыСостояний;
	ОбщийОбъектОтвета = РезультатКоманды.ОтветСервера.general;
	Если ОбщийОбъектОтвета.response <> ВсеКодыСостояний.Готов.Код Тогда
		// на сервере возникли проблемы
		ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, ОбщийОбъектОтвета.response, 
				ОбщийОбъектОтвета.message + Символы.ПС + ОбщийОбъектОтвета.errordescription);
		Возврат;
	КонецЕсли;
	
	Если РезультатКоманды.ОтветСервера.Свойство("Прием") Тогда
		
		ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
		
		// обновляем СостояниеОбмена обмена значениями, полученными с сервера
		ЗаполнитьСостояниеПроцессаДаннымиССервера(СостояниеОбмена.Передача, 
				РезультатКоманды.ОтветСервера.Прием, ,"Количество,НомерОбработанного,ОбъектовВсего");
		// Завершение процесса приема на сервере является завершением процесса передачи на клиенте
		Если СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка
				И СостояниеОбмена.Передача.КодРезультатаДействия = ВсеКодыРезультатов.Выполнено.Код
			Или ЗначениеЗаполнено(СостояниеОбмена.Передача.КодРезультатаДействия) 
				И СостояниеОбмена.Передача.КодРезультатаДействия <> ВсеКодыРезультатов.Выполнено.Код Тогда
			
			СостояниеОбмена.Передача.ПроцессЗавершен    = Истина;
			СостояниеОбмена.Передача.ЗавершениеДействия = ТекущаяДата();
			
		КонецЕсли;
		ПроцессыОбменаСлужебный.ЗаписатьСостояниеВРегистр(СостояниеОбмена, ИмяПроцесса);
		
		ПроверитьЗавершениеПроцессаПередачи(СостояниеОбмена, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область Процесс_Прием

Функция СценарийТребуетЗавершенияПередачи(СостояниеОбмена)
	
	ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(СостояниеОбмена.УзелКорреспондента);
	Возврат ПараметрыОбмена.ЗатребованныйСценарий <> Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных
	
КонецФункции

// Проверяет состояние процесса "Прием" и, при необходимости, выполняет следующее действие или 
//изменяет результат выполняемого дейсвтия
Процедура ОбработкаПроцессаПриема(СостояниеОбмена, ДополнительныеПараметры)
	
	ИмяПроцесса        = "Прием";
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	
	Если СостояниеОбмена.Прием.ПроцессЗавершен Тогда
		Если СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКодыРезультатов.ПриемОжидаетЗавершенияПередачи.Код Тогда
			СброситьСостояние(СостояниеОбмена, ИмяПроцесса, ДополнительныеПараметры.ПараметрыПодключения);
		Иначе
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	// проверить, что сценарий позволяет выполнить Прием параллельно Передаче
	Если СценарийТребуетЗавершенияПередачи(СостояниеОбмена) 
			И Не ПроцессЗавершенУспешно(СостояниеОбмена, "Передача", ДополнительныеПараметры) Тогда
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, "Выгрузка", 
					ВсеКодыРезультатов.ПриемОжидаетЗавершенияПередачи.Код, "");
		Возврат;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена.Прием.ДействиеПроцесса)
			Или СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка 
				И Не ЗначениеЗаполнено(СостояниеОбмена.Прием.КодРезультатаДействия) Тогда
		// выгрузка данных не выполнялась или была прервана
		ВыгрузитьИзмененияНаСервере(СостояниеОбмена, ДополнительныеПараметры);
			
	ИначеЕсли СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
		
		Если СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКодыРезультатов.Выполнено.Код Тогда
			// данные выгружены. Начать/продолжить получение пакета с сервера
			ПолучитьПакетССервера(СостояниеОбмена, ДополнительныеПараметры);
			
		Иначе
			//проверить или перезапустить выгрузку на сервере
			ВыгрузитьИзмененияНаСервере(СостояниеОбмена, ДополнительныеПараметры);
			
		КонецЕсли;
		
	ИначеЕсли СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение Тогда
		
		Если СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКодыРезультатов.Выполнено.Код Тогда
			// пакет с сервера получен, начать его загрузку
			ЗагрузитьПакетВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры);
			
		Иначе
			// Проверить/продолжить получение пакета с сервера
			ПолучитьПакетССервера(СостояниеОбмена, ДополнительныеПараметры);
			
		КонецЕсли;
		
	ИначеЕсли СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
		
		Если СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКодыРезультатов.Выполнено.Код Тогда
			// пакет с сервера загружен, но не записан результат
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", ВсеКодыРезультатов.Выполнено.Код, "");
			ОтметитьНаСервереЗавершениеПередачи(СостояниеОбмена, ДополнительныеПараметры, ВсеКодыРезультатов.Выполнено.Код);
			
		Иначе
			// предыдущая загрузка была прервана
			ЗагрузитьПакетВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьИзмененияНаСервере(СостояниеОбмена, ДополнительныеПараметры)
	
	ИмяПроцесса = "Прием";
	ИмяДействия = "Выгрузка";
	
	Если СостояниеОбмена.Прием.ПроцессЗавершен 
		Или СостояниеОбмена.Прием.ДействиеПроцесса <> Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
		ОтметитьНачалоДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, 0, 0, 0, 0, 0);
	КонецЕсли;
	
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;
	Результат = РезультатКомандыВыгрузкиНаСервере(СостояниеОбмена, ДополнительныеПараметры);
	Если Результат = Неопределено Тогда
		// Проблемеы с доступом к серверу
		ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, 
			ВсеКодыРезультатов.СерверНедоступен.Код, "");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСостояниеПроцессаДаннымиССервера(СостояниеОбмена.Прием, Результат);
	Если ЗначениеЗаполнено(Результат.КодРезультатаДействия) Тогда
		// на сервере процесс завершился
		
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, 
					СостояниеОбмена.Прием.ДействиеПроцесса, 
					СостояниеОбмена.Прием.КодРезультатаДействия, 
					СостояниеОбмена.Прием.ТекстОшибки);
	Иначе
		ПроцессыОбменаСлужебный.ЗаписатьСостояниеВРегистр(СостояниеОбмена, ИмяПроцесса);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьПакетССервера(СостояниеОбмена, ДополнительныеПараметры)
	
	ИмяПроцесса = "Прием";
	ИмяДействия = "Получение";
	
	Если СостояниеОбмена.Прием.ПроцессЗавершен 
		Или СостояниеОбмена.Прием.ДействиеПроцесса <> Перечисления.ДействияПроцессовОбмена.Получение Тогда
		ОтметитьНачалоДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, , 0, 0, 0, 0);
	КонецЕсли;
	
	ВсеКодыРезультатов = ДополнительныеПараметры.ВсеКодыРезультатов;

	// блокировка ключевой записи процесса
	Ключ = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", СостояниеОбмена.УзелКорреспондента, Перечисления.ПроцессыОбменаДанными.Передача));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ключ);
	Исключение
		ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, 
				ВсеКодыРезультатов.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		ТекстПредупреждения = СтрШаблон(НСтр("ru='Не удалось заблокировать запись узла ""%1"" для получения данных с сервера'"), 
					СостояниеОбмена.УзелКорреспондента);
		ВызватьИсключение ТекстПредупреждения;
	КонецПопытки;

	ПакетКПолучению = ОписаниеПакетаДляПолученияССервера(СостояниеОбмена, ДополнительныеПараметры);
	Если ПакетКПолучению = Неопределено Тогда
		// Проблемеы с доступом к серверу
		ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, ВсеКодыРезультатов.СерверНедоступен.Код, "");
		РазблокироватьДанныеДляРедактирования(Ключ);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПакетКПолучению.НомерПакета)
		Или Не ЗначениеЗаполнено(ПакетКПолучению.ВсегоЧастей) Тогда
		ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, "Загрузка", ВсеКодыРезультатов.ОтсутствуютДанныеДляЗагрузки.Код, "");
		РазблокироватьДанныеДляРедактирования(Ключ);
		Возврат;
	КонецЕсли;
	
	// Удаление более старых пакетов
	Если ПакетКПолучению.НомерПакета > 1 Тогда
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, ПакетКПолучению.НомерПакета - 1);
	КонецЕсли;
	
	ПолученныеПакеты = РегистрыСведений.ПакетыСинхронизацииПолученные.ИнформацияОПолученныхПакетах(СостояниеОбмена.УзелКорреспондента, 
									ПакетКПолучению.НомерПакета);
	// Проверка полученных пакетов
	Если ПолученныеПакеты.КоличествоВсего <> 0 И ПолученныеПакеты.КоличествоВсего <> ПакетКПолучению.ВсегоЧастей Тогда
		// удаляем все ранее полученные пакеты
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(СостояниеОбмена.УзелКорреспондента, ПакетКПолучению.НомерПакета);
		ПолученныеПакеты.ПолученныеЧасти.Очистить();
	КонецЕсли;
	
	// для исключения повторного получения уже полученных пакетов
	КонтрольПолученных = Новый Соответствие;
	Для Каждого Элемент Из ПолученныеПакеты.ПолученныеЧасти Цикл
		КонтрольПолученных.Вставить(Элемент.НомерЧастиПакета, Истина);
	КонецЦикла;
	
	ОписаниеЧасти = Новый Структура("ТипПакета,НомерПакетаКОтправке,ВсегоЧастей,ДатаВыгрузки,НомерЧастиПакета", 
				ПакетКПолучению.ТипПакета, ПакетКПолучению.НомерПакета, ПакетКПолучению.ВсегоЧастей,
				Дата(ПакетКПолучению.ДатаВыгрузки), 0);
	Для Счетчик = 1 По ПакетКПолучению.ВсегоЧастей Цикл
		
		Если КонтрольПолученных[Счетчик] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеЧасти.НомерЧастиПакета = Счетчик;
		
		Для Повторов = 1 По 3 Цикл
			
			ОтветСервера = ПолучитьЧастьПакета(ДополнительныеПараметры.ПараметрыПодключения, 
								СостояниеОбмена.УзелКорреспондента, ОписаниеЧасти);
			Если ОтветСервера.КодСостояния = 200 Тогда
				КонтрольПолученных.Вставить(Счетчик, Истина);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОтветСервера.КодСостояния <> 200 Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, 
					ВсеКодыРезультатов.ОшибкаНаСервере.Код, ОтветСервера.ОписаниеОшибки);
			РазблокироватьДанныеДляРедактирования(Ключ);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КонтрольПолученных.Количество() = ПакетКПолучению.ВсегоЧастей Тогда
		ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, ИмяДействия, 
				ВсеКодыРезультатов.Выполнено.Код, "");
	КонецЕсли;
	
	РазблокироватьДанныеДляРедактирования(Ключ);
	
КонецПроцедуры

// Получает с сервера часть пакета с указанными в описании свойсвами
//
//Параметры:
//	ПараметрыПодключения - Структура или непоределено
//	ОписаниеЧасти - Структура - должна содержать реквизиты, аналогичные измерениям и ресурсам в РС ПакетыСинхронизацииКОтправке
//
//Возвращаемое значение:
//		* ЧастьПолучена - булево - истина, если указанная часть получена и сохранена в базе
//		* КодСостояния - 200 в случае успеха или другой код в случае ошибки
//		* ОписаниеОшибки - Строка - имеет смысл только если КодСостояния <> 200
//
Функция ПолучитьЧастьПакета(ПараметрыПодключения, Узел, ОписаниеЧасти) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЧастьПолучена", Истина); 
	Результат.Вставить("КодСостояния",   200); 
	Результат.Вставить("ОписаниеОшибки", ""); 
	
	СтрокаПараметров = СтрШаблон("receivedno=%1&partno=%2", 
			Формат(ОписаниеЧасти.НомерПакетаКОтправке, "ЧДЦ=0; ЧГ="), 
			Формат(ОписаниеЧасти.НомерЧастиПакета, "ЧДЦ=0; ЧГ="));
	ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураЗапроса = ДеньгиВОблаке.НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
							ДеньгиВОблаке.АдресСервисаСинхронизации(), 
							"download/" + ПараметрыПодключения.КодЭтогоУзла + "?" + СтрокаПараметров);
	Ответ = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураЗапроса, , 
					"Обмен данными." + Перечисления.ДействияПриОбмене.ЗагрузкаДанных, "200", , );
	
	
	Если Ответ.КодСостояния = 200 Тогда
		
		Если ТипЗнч(Ответ.ЗначениеОтвета) <> Тип("ДвоичныеДанные") Тогда
			ВызватьИсключение "Ответ севрера не содержит двоинчые данные для записи в регистр сведений ПакетыСинхронизацииПолученные";
		КонецЕсли;
		
		Запись = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ОписаниеЧасти);
		Если ЗначениеЗаполнено(ОписаниеЧасти.ТипПакета) Тогда
			Запись.ТипПакета = ?(ТипЗнч(ОписаниеЧасти.ТипПакета) = Тип("Строка"), 
							Перечисления.ТипыПакетовСинхронизации[ОписаниеЧасти.ТипПакета], 
							ОписаниеЧасти.ТипПакета);
		КонецЕсли;
		Запись.УзелКорреспондента = Узел;
		Запись.НомерПакетаКПолучению = ОписаниеЧасти.НомерПакетаКОтправке;
		Запись.ДанныеПакета = Новый ХранилищеЗначения(Ответ.ЗначениеОтвета, Новый СжатиеДанных(9));
		Запись.Записать(Истина);
		
		// Отмека на сервере о получении пакета
		СтруктураЗапроса = ДеньгиВОблаке.НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
								ДеньгиВОблаке.АдресСервисаСинхронизации(), 
								"markdownload/" + ПараметрыПодключения.КодЭтогоУзла + "?" + СтрокаПараметров);
		ОтветПодтверждения = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, , 
						"Обмен данными." + Перечисления.ДействияПриОбмене.ЗагрузкаДанных, "200");
		
		Если ОтветПодтверждения.КодСостояния <> 200 Тогда
			Результат.ЧастьПолучена   = Истина;
			Результат.КодСостояния    = ОтветПодтверждения.КодСостояния;
			Результат.ОписаниеОшибки  = НСтр("ru='Ошибка подтверждения получения пакета на сервере:'") 
					+ Символы.ПС + ОтветПодтверждения.ОписаниеОшибки;
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат.ЧастьПолучена   = Ответ.КодСостояния = 200;
	Результат.КодСостояния    = Ответ.КодСостояния;
	Результат.ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	
	Возврат Результат;
	
КонецФункции 

Процедура ЗагрузитьПакетВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры)
	
	ПроцессыОбменаСлужебный.ОтметитьНачалоДействия(СостояниеОбмена, "Прием", "Загрузка", 
				СостояниеОбмена.Прием.НомерПакета, 0, 0, 0, 0);
	ОбновитьСостояниеКлиентаНаСервере(СостояниеОбмена, ДополнительныеПараметры, "Передача");
	
	ПроцессыОбменаСлужебный.ЗагрузитьПакетВЭтойБазе(СостояниеОбмена, ДополнительныеПараметры, СостояниеОбмена.Прием.НомерПакета);
	
	Если СостояниеОбмена.Прием.ПроцессЗавершен Тогда
		
		ЗначенияНомеров = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СостояниеОбмена.УзелКорреспондента, 
				"НомерПринятого,НомерОтправленного");
		ЗаполнитьЗначенияСвойств(СостояниеОбмена, ЗначенияНомеров);
		
		ОтметитьНаСервереЗавершениеПередачи(СостояниеОбмена, ДополнительныеПараметры, 
				ДополнительныеПараметры.ВсеКодыРезультатов.Выполнено.Код);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#КонецОбласти