////////////////////////////////////////////////////////////////////////////////
// ПрикрепленныеФайлыВызовСервера
//	Серверный функционал подсистемы для доступа с клиента
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает структуру с адресами хранилищ значений картинок, отображающих 
//неграфические файлы на формах
//
//Параметры:
//	нет
//
//Возвращаемое значение:
//	Структура - значение параметра сеанса "ПредставленияФайлов"
//
Функция ПредставленияПрикрепленныхФайлов() Экспорт

	Возврат ПрикрепленныеФайлыСервер.ПредставленияПрикрепленныхФайлов();

КонецФункции

// Обновляет ссылку на графическое отображение в списке файлов
//
//Параметры:
//	СписокФайлов	- СписокЗначений, значениями которого являются структуры описания прикрепленных файлов
//						(см. ПрикрепленныеФайлыКлиентСервер.НоваяСтруктураПрикрепляемогоФайла())
//
Процедура ОбновитьПредставленияФайловВСписке(СписокФайлов) Экспорт
	
	ПрикрепленныеФайлыСервер.ОбновитьПредставленияФайловВСписке(СписокФайлов);
	
КонецПроцедуры
 
// Возвращает структуру с описанием файла по указанной ссылке
//Подробное описание см. в ПрикрепленныеФайлыСервер.СтруктураОписанияФайлаИзСсылки()
//
Функция СтруктураОписанияФайлаИзСсылки(ФайлСсылка) Экспорт

	Возврат ПрикрепленныеФайлыСервер.СтруктураОписанияФайлаИзСсылки(ФайлСсылка);

КонецФункции
 

#КонецОбласти

