
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	ЭлементФайла = Форма.МедиаФайлы.Получить(Форма.ИндексТекущегоФайла);
	Если ЭлементФайла = Неопределено Или ЭлементФайла.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПрикрепленныеФайлыКлиент.ОбновитьСодержимоеФайла(ЭлементФайла.Значение, Форма) Тогда
		
		Форма.Модифицированность = Истина;
		ПрикрепленныеФайлыКлиентСервер.ОбновитьПредставлениеМедиафайлов(Форма);
		
		Оповестить(ПрикрепленныеФайлыКлиент.ИмяСобытияИзменениеСпискаМультимедиа(), Форма.МедиаФайлы, Форма);
		
	КонецЕсли;
	
КонецПроцедуры
