///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс


// Возвращает список расхождений итогов автономной копии с итогами на сервере
//
//Параметры:
//	Нет
//
//Возвращаемое значение:
//	Массив структур с описанием результатов проверки
//
Функция ВыполнитьПроверкуРезультатовСинхронизации(ПроксиСервиса = Неопределено, УзелЦБ = Неопределено) Экспорт
	Перем Результат;
	
	ИменаТаблиц = Новый Массив;
	// таблицы справочников
	ИменаТаблиц.Добавить("Справочник_Валюты");
	ИменаТаблиц.Добавить("Справочник_ВариантыБюджетов");
	ИменаТаблиц.Добавить("Справочник_Долги");
	ИменаТаблиц.Добавить("Справочник_ЗначенияСвойствОбъектов");
	ИменаТаблиц.Добавить("Справочник_ЗначенияСвойствОбъектовИерархия");
	ИменаТаблиц.Добавить("Справочник_ДополнительныеЗначенияВидовАналитик");
	ИменаТаблиц.Добавить("Справочник_Имущество");
	ИменаТаблиц.Добавить("Справочник_Контакты");
	ИменаТаблиц.Добавить("Справочник_КошелькиИСчета");
	ИменаТаблиц.Добавить("Справочник_НаборыДополнительныхРеквизитовИСведений");
	ИменаТаблиц.Добавить("Справочник_ЗначенияСубконтоАналитика");
	//ИменаТаблиц.Добавить("Справочник_Пользователи");
	ИменаТаблиц.Добавить("Справочник_ПравилаЧтенияТабличныхДокументов");
	ИменаТаблиц.Добавить("Справочник_ПрикрепленныеФайлы");
	ИменаТаблиц.Добавить("Справочник_СтатьиДоходов");
	ИменаТаблиц.Добавить("Справочник_СтатьиРасходов");
	ИменаТаблиц.Добавить("Справочник_ФинансовыеЦели");
	// ПВХ
	ИменаТаблиц.Добавить("ПланВидовХарактеристик_ВидыАналитик");
	ИменаТаблиц.Добавить("ПланВидовХарактеристик_ДополнительныеРеквизитыИСведения");
	// документы
	ИменаТаблиц.Добавить("Документ_ВводИзменениеОстатка");
	ИменаТаблиц.Добавить("Документ_Доход");
	ИменаТаблиц.Добавить("Документ_МыВернулиДолг");
	ИменаТаблиц.Добавить("Документ_МыВзялиВДолг");
	ИменаТаблиц.Добавить("Документ_МыДалиВДолг");
	ИменаТаблиц.Добавить("Документ_НамВернулиДолг");
	ИменаТаблиц.Добавить("Документ_ОбменВалюты");
	ИменаТаблиц.Добавить("Документ_Перемещение");
	ИменаТаблиц.Добавить("Документ_Расход");
	ИменаТаблиц.Добавить("Документ_УниверсальнаяОперация");
	// реистры сведений
	ИменаТаблиц.Добавить("РегистрСведений_ДатыРасписаний");
	ИменаТаблиц.Добавить("РегистрСведений_КлючевыеСловаОбъектов");
	ИменаТаблиц.Добавить("РегистрСведений_КурсыВалют");
	ИменаТаблиц.Добавить("РегистрСведений_НастройкиАналитикиВДокументахПоУмолчанию");
	ИменаТаблиц.Добавить("РегистрСведений_НастройкиАналитикиПоСтатьям");
	ИменаТаблиц.Добавить("РегистрСведений_ПараметрыГрафикаПогашенияДолгов");
	ИменаТаблиц.Добавить("РегистрСведений_ПоказателиБюджета");
	ИменаТаблиц.Добавить("РегистрСведений_ПринадлежностьФайлов");
	ИменаТаблиц.Добавить("РегистрСведений_Расписания");
	ИменаТаблиц.Добавить("РегистрСведений_СоставСтатейБюджета");
	// реистры накопления
	ИменаТаблиц.Добавить("РегистрНакопления_ФактическиеОборотыБюджета");
	ИменаТаблиц.Добавить("РегистрНакопления_ОборотыПлановыхОпераций");
	ИменаТаблиц.Добавить("РегистрНакопления_КоличественныеОборотыПоСтатьямРасходов");
	// проверка результатов обработки
	//ИменаТаблиц.Добавить("РегистрСведений_КлючиСтатей");
	ИменаТаблиц.Добавить("РегистрСведений_ОперацииШаблонов");
	//ИменаТаблиц.Добавить("РегистрСведений_СтатистикаСправочников");
	
	КомандыПроверки = "";
	Для каждого ИмяТаблицы Из ИменаТаблиц Цикл
		КомандыПроверки = КомандыПроверки + ?(КомандыПроверки = "", "", ",")
				+ "КоличествоЗаписей_" + ИмяТаблицы;
	КонецЦикла;
	
	ИменаРазделов = Новый Массив;
	ИменаРазделов.Добавить("СвободныеДеньги");
	ИменаРазделов.Добавить("Накопления");
	ИменаРазделов.Добавить("Имущество");
	ИменаРазделов.Добавить("ОсновныеСуммыДолгов");
	ИменаРазделов.Добавить("ПроцентыПоДолгам");
	ИменаРазделов.Добавить("Капитал");
	Для каждого ИмяРаздела Из ИменаРазделов Цикл
		КомандыПроверки = КомандыПроверки + ","
				+ "КонтрольРазделаУчета_" + ИмяРаздела;
	КонецЦикла;
	
	МассивКоманд = СтрРазделить(КомандыПроверки, ",");
	ПараметрыПодключения = Неопределено;
	ОтветСервера = ДеньгиВОблаке.ПолучитьССервераИнформацию(ПараметрыПодключения, МассивКоманд);
	Если ОтветСервера.КодСостояния <> 200 Тогда
		ВызватьИсключение ОтветСервера.ОписаниеОшибки; 
	КонецЕсли;
	РезультатыСервера = ОтветСервера.ЗначениеОтвета;
	
	РезультатыЭтойБазы = ПолучитьИтогиЭтойБазы(КомандыПроверки);
	Результат = Новый Массив; 
	
	Для каждого КлючИЗначение Из РезультатыЭтойБазы Цикл
		
		Если РезультатыСервера.Свойство(КлючИЗначение.Ключ) Тогда
			Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
				Для каждого ПодчиненныйКлючИЗначение Из КлючИЗначение.Значение Цикл
					Если РезультатыСервера[КлючИЗначение.Ключ][ПодчиненныйКлючИЗначение.Ключ] 
							<> КлючИЗначение.Значение[ПодчиненныйКлючИЗначение.Ключ] Тогда
						Результат.Добавить(СтрШаблон(НСтр("ru='%1, показатель %2: на сервере: %3, в этой базе: %4'"), 
								КлючИЗначение.Ключ, ПодчиненныйКлючИЗначение.Ключ, 
								РезультатыСервера[КлючИЗначение.Ключ][ПодчиненныйКлючИЗначение.Ключ], 
								КлючИЗначение.Значение[ПодчиненныйКлючИЗначение.Ключ]));
					КонецЕсли;
				КонецЦикла;
			Иначе
				Если РезультатыСервера[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
					Результат.Добавить(СтрШаблон(НСтр("ru='%1: на сервере: %2, в этой базе: %3'"), 
							КлючИЗначение.Ключ, 
							РезультатыСервера[КлючИЗначение.Ключ], 
							КлючИЗначение.Значение));
				КонецЕсли;
			КонецЕсли;
			 
		Иначе
			Результат.Добавить("" + КлючИЗначение.Ключ + ": отсутствует в результатах проверки сервера");
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого КлючИЗначение Из РезультатыСервера Цикл
		Если Не РезультатыЭтойБазы.Свойство(КлючИЗначение.Ключ) Тогда
			Результат.Добавить("" + КлючИЗначение.Ключ + ": отсутствует в результатах проверки этой базы");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает ссылку на узел центральной базы в плане обмена "СинхронизацияАвтономныхКопий"
//
//Параметры:
//	Нет
//
//Возвращаемое значение:
//	ПланОбменаСсылка.СинхронизацияАвтономныхКопий
//
Функция ПроверитьСоздатьУзелЦентральнойБазы() Экспорт
	Перем Результат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	План.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияАвтономныхКопий КАК План
	|ГДЕ
	|	НЕ План.ЭтотУзел
	|	И НЕ План.ПометкаУдаления
	|	И План.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = СинхронизацияАвтономныхКопий.НовыйУзелПланаОбмена("СинхронизацияАвтономныхКопий", "000", НСтр("ru='Центральная база'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Возвращает количество узлов всех планов обмена, используемых в синхронизации автононмых копий
//
//Параметры:
//	нет
//
//Возвращаемое значение:
//	Число
//
Функция КоличествоАвтономныхКопий() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Подзапрос.Ссылка) КАК КоличествоУзлов
	|ИЗ
	|	(ВЫБРАТЬ
	|		План.Ссылка КАК Ссылка
	|	ИЗ
	|		ПланОбмена.МобильноеПриложение КАК План
	|	ГДЕ
	|		НЕ План.ЭтотУзел
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		План.Ссылка
	|	ИЗ
	|		ПланОбмена.СинхронизацияАвтономныхКопий КАК План
	|	ГДЕ
	|		НЕ План.ЭтотУзел) КАК Подзапрос";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ?(ЗначениеЗаполнено(Выборка.КоличествоУзлов), Выборка.КоличествоУзлов, 0);
	КонецЕсли;
	
	Возврат 0; 

КонецФункции


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Расширение переопределяемого модуля БСП
//	см. одноименный метод в ОбменДаннымиПереопределяемый
//
Процедура ПолучитьПланыОбмена(ПланыОбменаПодсистемы) Экспорт
	ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.СинхронизацияАвтономныхКопий);
КонецПроцедуры

Процедура ДополнитьПоказателиНачальнойСтраницы(Результат, НастройкиИндикаторов) Экспорт
	
	ИндикаторыРежима = Новый Массив;
	Для каждого СтрокаНастройки Из НастройкиИндикаторов.ИндикаторыДинамики Цикл
		Если СтрокаНастройки.ТипИндикатора = "РежимРаботы" Тогда
			ИндикаторыРежима.Добавить(СтрокаНастройки);
		КонецЕсли;
	КонецЦикла;
	
	Если ИндикаторыРежима.Количество() = 0 Тогда
		// Обновлять нечего
		Возврат;
	КонецЕсли;
	
	ОписаниеРежима = Новый Структура;
	ОписаниеРежима.Вставить("Режим",                 ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения());
	ОписаниеРежима.Вставить("СинхронизацияВключена", Константы.ДеньгиВыбранныйСпособСинхронизации.Получить()<> Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
	
	Если ОписаниеРежима.Режим = "КлиентОблака" Или ОписаниеРежима.Режим = "Разделенный" Тогда
		
		// Аккаунт абонента
		ПараметрыПодключения = ДеньгиВОблаке.ПараметрыСоединенияСОблаком();
		ОписаниеРежима.Вставить("Логин", ?(ПараметрыПодключения = Неопределено Или Не ПараметрыПодключения.Свойство("Логин"),
					"???", ПараметрыПодключения.Логин));
		Если ОписаниеРежима.Режим = "КлиентОблака" Тогда
			ОписаниеРежима.Вставить("ПодключениеВыполнено", ДеньгиВОблакеВызовСервера.ЭтаБазаПодключенаКОблаку(ПараметрыПодключения));
		Иначе
			ОписаниеРежима.Вставить("ПодключениеВыполнено", Истина);
		КонецЕсли;
		
		// Состояние подписок
		ОписаниеРежима.Вставить("ДоступноЛицензий", "Нет данных");
//		ОписаниеРежима.Вставить("ДатаИзменения", Неопределено);
//		ОписаниеРежима.Вставить("ДоступноЛицензийПослеИзменения", 0);
		Если ОписаниеРежима.ПодключениеВыполнено Тогда
	
			Попытка
			
				СвойстваБазыНаСервере = ДеньгиВОблаке.СвойстваЗарегистрированнойБазы(ПараметрыПодключения.КодЭтогоУзла, ПараметрыПодключения);
				Если СвойстваБазыНаСервере.ИБЗапрещена Тогда
					ОписаниеРежима.Вставить("ДоступноЛицензий", НСтр("ru='Запрет соединения на сервере'"));
				ИначеЕсли СвойстваБазыНаСервере.ИБУстаревшая Тогда
					ОписаниеРежима.Вставить("ДоступноЛицензий", НСтр("ru='Эта база устаревшая'"));
				Иначе
					ОписаниеРежима.Вставить("ДоступноЛицензий", ?(СвойстваБазыНаСервере.ВсегоЛицензий = -111, 
							"безлимит", 
							СвойстваБазыНаСервере.ВсегоЛицензий - СвойстваБазыНаСервере.ЗанятоЛицензий));
				КонецЕсли;
			
			Исключение
				// Обработка исключения не требуется
			КонецПопытки; 
				
		КонецЕсли;
		
		
		Если ОписаниеРежима.Режим = "КлиентОблака" Тогда
			// состояние синхронизации в автономной копии
			УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
			ДатаПоследнейСинхронизации = СинхронизацияАвтономныхКопий.ДатаПоследнейУспешнойСинхронизации(УзелЦБ);
			Если ОписаниеРежима.СинхронизацияВключена Тогда
				СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
				ОписаниеРежима.Вставить("ДатаСинхронизации",    ДатаПоследнейСинхронизации);
				ОписаниеРежима.Вставить("ТекущееСостояние",     СостояниеОбмена.ТекстСостояния);
				ОшибкиСинхронизации = "";
				Если Не СостояниеОбмена.ПроцессАктивен Тогда
					Если СостояниеОбмена.ЗавершенСОшибками Тогда
						ОшибкиСинхронизации = НСтр("ru='в послденем обмене возникли ошибки'");
					ИначеЕсли СостояниеОбмена.ЗавершенСПредупреждениями Тогда
						ОшибкиСинхронизации = "";
					КонецЕсли;
				КонецЕсли;
				ОписаниеРежима.Вставить("ОшибкиСинхронизации",  
						ДеньгиКлиентСервер.СокращенноеПредставление(ОшибкиСинхронизации, 50, Ложь));
				
			Иначе
				ОписаниеРежима.Вставить("ДатаСинхронизации",   Неопределено);
				ОписаниеРежима.Вставить("ОшибкиСинхронизации", "синхронизация отключена");
				
			КонецЕсли;
			
		Иначе
			// состояние синхронизации на сервере
		КонецЕсли;
		
	ИначеЕсли ОписаниеРежима.Режим = "ЦентрМобильных" Тогда
		
		Если ОписаниеРежима.СинхронизацияВключена Тогда
			// Состояние синхронизации
			УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("МобильноеПриложение");
			ДатаПоследнейСинхронизации = СинхронизацияАвтономныхКопий.ДатаПоследнейУспешнойСинхронизации(УзелЦБ);
			СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
			ОписаниеРежима.Вставить("ДатаСинхронизации",    ДатаПоследнейСинхронизации);
			ОписаниеРежима.Вставить("ТекущееСостояние",     СостояниеОбмена.ТекстСостояния);
			ОшибкиСинхронизации = "";
			Если Не СостояниеОбмена.ПроцессАктивен Тогда
				Если СостояниеОбмена.ЗавершенСОшибками Тогда
					ОшибкиСинхронизации = НСтр("ru='в послденем обмене возникли ошибки'");
				ИначеЕсли СостояниеОбмена.ЗавершенСПредупреждениями Тогда
					ОшибкиСинхронизации = "";
				КонецЕсли;
			КонецЕсли;
			ОписаниеРежима.Вставить("ОшибкиСинхронизации",  
					ДеньгиКлиентСервер.СокращенноеПредставление(ОшибкиСинхронизации, 50, Ложь));
			
			
		Иначе
			
			ОписаниеРежима.Вставить("ДатаСинхронизации",   Неопределено);
			ОписаниеРежима.Вставить("ОшибкиСинхронизации", "синхронизация отключена");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Добавление результата в струкру выборок
	Для каждого СтрокаИндикатора Из ИндикаторыРежима Цикл
		
		Результат.Вставить("Выборка_" + СтрокаИндикатора.Ключ, ОписаниеРежима);
		
	КонецЦикла;
	
КонецПроцедуры


// Изменяет принзак "Использование" для регламентного задания автоматического обмена данным с центральной базой
//
//Параметры:
//	Использование - булево - новое значение признака
//	УзелЦБ - ПланОбменаСсылка.СинхронизацияАвтономныхКопий - узел центральной базы
//	Останавливать - Булево - нужно ли остановить выполняющееся рег.задание
//
Процедура ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(Использование, УзелЦБ = Неопределено, Останавливать = Ложь) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "КлиентОблака" Тогда
		Возврат;
	КонецЕсли;
	
	РегЗадание = ПроцессыОбменаВызовСервера.РегламентноеЗаданиеОбмена();
	Если РегЗадание <> Неопределено Тогда
		
		Если РегЗадание.Использование <> Использование Тогда
			РегЗадание.Использование = Использование;
			РегЗадание.Записать();
		КонецЕсли;
		
		Если Останавливать 
				И РегЗадание.ПоследнееЗадание <> Неопределено
				И РегЗадание.ПоследнееЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Попытка
				РегЗадание.ПоследнееЗадание.Отменить();
			Исключение
				// Обработка не требуется
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	Константы.ДеньгиПриостановитьАвтосинхронизацию.Установить(Не Использование);
	
КонецПроцедуры

Процедура ОбновитьИндикаторРежимаРаботыНаНачальнойСтранице(Элементы, СтрокаНастройки, СтруктураРезультата, НастройкиИндикаторов, ЦветЗаголовка) Экспорт
	
	// Индикатор показывает текущее состояние информационной базы:
	//	Режим использования: Автономный, В облаке, Синхронизация с облаком, Обмен с мобильными -> включение синхронизации / параметры подключения
	//	Доступность услуг (только для облака или подключения к облаку): срок ближайшего изменения состояния подписок -> управление подписками
	//	Состояние данных: (только если включена синхронизация) последний обмен, наличие ошибок (если есть) -> монитор синхронизации
	
	Префикс = СтрокаНастройки.Ключ + "_";
	
	//ШрифтПоказателя = ШрифтФорматированногоПоказателя(-1);
	ЦветТекста      = ЦветаСтиля.ЦветТекстаФормы;
	
	СтрокиЗаголовок        = Новый Массив;
	СтрокиВыбранныйСпособ  = Новый Массив;
	СтрокиДоступностьУслуг = Новый Массив;
	СтрокиСостояниеДанных  = Новый Массив;
	
	ТекстПодсказкиЗаголовка = "";
	
	СтрокиЗаголовок.Добавить(Новый ФорматированнаяСтрока(СтрокаНастройки.Заголовок + ":", , ЦветЗаголовка));
	СтрокиЗаголовок.Добавить(" ");
	
	Если СтруктураРезультата.Режим = "Независимый" 
		Или СтруктураРезультата.Режим = "КлиентОблака" И Не СтруктураРезультата.ПодключениеВыполнено Тогда
		
		СтрокиЗаголовок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='выключен'"), , ЦветТекста));
		ТекстПодсказкиЗаголовка = НСтр("ru='Эта база не использует синхронизацию и все данные хранятся только в ней'");
		
		СтрокиВыбранныйСпособ.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Включить синхронизацию'"), , , , "mny:#ВключитьСинхронизацию") );
		
	ИначеЕсли СтруктураРезультата.Режим = "Разделенный" Тогда
		
		СтрокиЗаголовок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='в облаке'"), , ЦветТекста));
		ТекстПодсказкиЗаголовка = НСтр("ru='Вы работаете в облачной базе'");
		
		ЗаполнитьСтрокиДостуностиУслуг(СтрокиДоступностьУслуг, СтруктураРезультата);
		
	ИначеЕсли СтруктураРезультата.Режим = "КлиентОблака" Тогда
		
		СтрокиЗаголовок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='синхронизация через сервис автосинхронизации'"), , ЦветТекста));
		ТекстПодсказкиЗаголовка = НСтр("ru='Данные хранятся в облаке, а изменения автоматически синхронизируются со всеми подключенными базами в настольных и мобильных программах'");
		
		СтрокиВыбранныйСпособ.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru='Абонент: %1'") , СтруктураРезультата.Логин), , , , ) );
		СтрокиВыбранныйСпособ.Добавить(",   ");
		
		ЗаполнитьСтрокиДостуностиУслуг(СтрокиВыбранныйСпособ, СтруктураРезультата);
		
		СтрокиСостояниеДанных.Добавить(НСтр("ru='Последняя синхронизация: '"));
		Если Не ЗначениеЗаполнено(СтруктураРезультата.ДатаСинхронизации) Тогда
			СтрокиСостояниеДанных.Добавить(НСтр("ru='нет данных'"));
		ИначеЕсли НачалоДня(СтруктураРезультата.ДатаСинхронизации) = НачалоДня(ТекущаяДата()) Тогда 
			СтрокиСостояниеДанных.Добавить(Формат(СтруктураРезультата.ДатаСинхронизации, "ДФ=ЧЧ.мм.сс"));
		Иначе
			СтрокиСостояниеДанных.Добавить(Формат(СтруктураРезультата.ДатаСинхронизации, "ДФ=дд.ММ.гггг ЧЧ.мм"));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураРезультата.ОшибкиСинхронизации) Тогда
			СтрокиСостояниеДанных.Добавить(" ");
			СтрокиСостояниеДанных.Добавить(Новый ФорматированнаяСтрока(СтруктураРезультата.ОшибкиСинхронизации, , ЦветаСтиля.ЦветОтрицательногоЧисла));
		КонецЕсли;
		СтрокиСостояниеДанных.Добавить("   ");
		СтрокиСостояниеДанных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Управление сервисом'") , , , , "mny:#ОткрытьПодключениеКОблаку") );
		
		
	ИначеЕсли СтруктураРезультата.Режим = "ЦентрМобильных" Тогда
		
		СтрокиЗаголовок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='центральная база для мобильных устройств '"), , ЦветТекста));
		ТекстПодсказкиЗаголовка = НСтр("ru='Данные хранятся только в этой базе, а изменения синхронизируются с мобильными устройствами через файлы'");
		
		СтрокиВыбранныйСпособ.Добавить("   ");
		СтрокиВыбранныйСпособ.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Открыть монитор синхронизации'") , , , , "mny:#ОткрытьМониторСинхронизации") );
		
	КонецЕсли;
	
	
	Элементы[Префикс + "РежимРаботыЗаголовок"].Заголовок = Новый ФорматированнаяСтрока(СтрокиЗаголовок);
	Элементы[Префикс + "РежимРаботыЗаголовок"].Подсказка = ТекстПодсказкиЗаголовка;
	
	Элементы[Префикс + "РежимРаботыВыбранныйСпособ"].Заголовок = Новый ФорматированнаяСтрока(СтрокиВыбранныйСпособ);
	Элементы[Префикс + "РежимРаботыВыбранныйСпособ"].Видимость = СтрокиВыбранныйСпособ.Количество() > 0;
	
	Элементы[Префикс + "РежимРаботыДоступностьУслуг"].Заголовок = Новый ФорматированнаяСтрока(СтрокиДоступностьУслуг);
	Элементы[Префикс + "РежимРаботыДоступностьУслуг"].Видимость = СтрокиДоступностьУслуг.Количество() > 0;
	
	Элементы[Префикс + "РежимРаботыСостояниеДанных"].Заголовок = Новый ФорматированнаяСтрока(СтрокиСостояниеДанных);
	Элементы[Префикс + "РежимРаботыСостояниеДанных"].Видимость = СтрокиСостояниеДанных.Количество() > 0;
	
КонецПроцедуры

Функция ДопускаетсяСинхронизацияСОблаком(ПараметрыСоединения) Экспорт
	
	ПрерватьСинхронизацию   = Ложь;
	ДелатьЗаписьВЖурнал     = Ложь;
	ТекстИнформацииПроверки = НСтр("ru='Проверка этой базы в облаке: %1'");
	
	СвойстваБазы = ДеньгиВОблаке.СвойстваЗарегистрированнойБазы(ПараметрыСоединения.КодЭтогоУзла, ПараметрыСоединения);
	Если Не СвойстваБазы.Существует Тогда
		ПрерватьСинхронизацию = Истина;
		ДелатьЗаписьВЖурнал = Истина;
		ТекстИнформацииПроверки = СтрШаблон(ТекстИнформацииПроверки, НСтр("ru='база не найдена в списке подключенных баз'") );
		
	ИначеЕсли СвойстваБазы.ИБУстаревшая Тогда
		ПрерватьСинхронизацию = Истина;
		ДелатьЗаписьВЖурнал = Истина;
		ТекстИнформацииПроверки = СтрШаблон(ТекстИнформацииПроверки, НСтр("ru='база помечена в облаке как устаревшая'") );
		
	ИначеЕсли СвойстваБазы.ЗанятоЛицензий <> -111 и СвойстваБазы.ЗанятоЛицензий < 0 Тогда
		ТекстИнформацииПроверки = СтрШаблон(ТекстИнформацииПроверки, НСтр("ru='для полного доступа к облаку недостаточно лицензий'") );
		ДелатьЗаписьВЖурнал = Истина;
		
	ИначеЕсли СвойстваБазы.ИБЗапрещена Тогда
		ПрерватьСинхронизацию = Истина;
		ДелатьЗаписьВЖурнал = Истина;
		ТекстИнформацииПроверки = СтрШаблон(ТекстИнформацииПроверки, НСтр("ru='в облаке эта база отмечена как запрещенная. 
				|база очищена от всех записей!'") );
		
		Результат =  ОбщегоНазначенияДеньги.ОчиститьДанныеПодсистемыДеньги(Ложь, "");
		Если Результат Тогда
			Константы.СостояниеПомощникаНачалаРаботы.Установить(Новый ХранилищеЗначения(Неопределено));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДелатьЗаписьВЖурнал Тогда
		КлючСообщения    = ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(
					СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий"), 
					Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
		ЗаписьЖурналаРегистрации(КлючСообщения, УровеньЖурналаРегистрации.Предупреждение, , , ТекстИнформацииПроверки);
	КонецЕсли;
	
	Возврат Не ПрерватьСинхронизацию;
	
КонецФункции 

// Проверяет возможность синхронизации с центральной базой
//
//Параметры:
//	Параметр1- _описаниепараметра_
//
//Возвращаемое значение:
//	Булево - Истина, если синхронизация настроена
//
Функция НастроенаСинхронизацияСЦентральнойБазой(УзелЦБ = Неопределено, ПараметрыСоединения = Неопределено) Экспорт
	
	Результат= Истина;
	КлючСообщения    = ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(
				СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий"), 
				Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "КлиентОблака" Тогда
		ЗаписьЖурналаРегистрации(КлючСообщения, УровеньЖурналаРегистрации.Ошибка, , , 
				СтрШаблон(НСтр("ru='Режим работы приложения ""%1"" не допускает обмен данными с сервисом автоматической синхронизацией'"), Режим));
		Возврат Ложь;
	КонецЕсли;
	
	УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
	Если Не ЗначениеЗаполнено(УзелЦБ) Тогда
		ЗаписьЖурналаРегистрации(КлючСообщения, УровеньЖурналаРегистрации.Ошибка, , , 
				НСтр("ru='Не задан узел центральной базы. Следует заново подключить эту базу к сервису атвоматической синхронизации'") );
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыСоединения = ДеньгиВОблаке.ПараметрыСоединенияСОблаком();
	Если Не ЗначениеЗаполнено(ПараметрыСоединения.АдресСервера) 
		Или Не ЗначениеЗаполнено(ПараметрыСоединения.Логин) 
		Или Не ЗначениеЗаполнено(ПараметрыСоединения.Пароль) Тогда
		ЗаписьЖурналаРегистрации(КлючСообщения, УровеньЖурналаРегистрации.Ошибка, , , 
				НСтр("ru='Не заданы параметры соединения. Следует заново подключить эту базу к сервису атвоматической синхронизации'") );
		Возврат Ложь;
	КонецЕсли;
	
	Если Результат Тогда
		ТекстОшибки = "";
		Результат = СинхронизацияАвтономныхКопий.ПерваяСинхронизацияНастроена(УзелЦБ, ТекстОшибки);
		Если Не Результат Тогда
			ЗаписьЖурналаРегистрации(КлючСообщения, УровеньЖурналаРегистрации.Ошибка, , , 
					ТекстОшибки );
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Функция ПолучитьИтогиЭтойБазы(СтрокаКоманд) 
	
	Результат      = Новый Структура;
	ТипыИнформации = СтрРазделить(СтрокаКоманд, ",", Ложь);
	
	Для каждого ТипИнформации Из ТипыИнформации Цикл
		
		Если СтрНайти(ТипИнформации, "КоличествоЗаписей_") > 0 Тогда
			ИмяТаблицы = СтрЗаменить(Сред(ТипИнформации, 19), "_", ".");
			Результат.Вставить(ТипИнформации, СинхронизацияАвтономныхКопий.КоличествоЗаписейВТаблице(ИмяТаблицы));
		ИначеЕсли СтрНайти(ТипИнформации, "КонтрольРазделаУчета_") > 0 Тогда
			ИмяРазделаУчета = Сред(ТипИнформации, 22);
			Результат.Вставить(ТипИнформации, СинхронизацияАвтономныхКопий.КонтрольныйОстатокРазделаУчета(ИмяРазделаУчета));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Процедура ЗаполнитьСтрокиДостуностиУслуг(СтрокиДоступностьУслуг, СтруктураРезультата)

	Если СтруктураРезультата.ДоступноЛицензий = "Нет данных" Тогда
		
		СтрокиДоступностьУслуг.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='нет информации о доступности облачных услуг.'"), ,  WebЦвета.Серый ));
		
	ИначеЕсли СтруктураРезультата.ДоступноЛицензий <> "безлимит" И СтруктураРезультата.ДоступноЛицензий < 0 Тогда
		
		СтрокиДоступностьУслуг.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='недостаточно лицензий!'"), , ЦветаСтиля.ЦветОтрицательногоЧисла));
		
	Иначе
		
		СтрокиДоступностьУслуг.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='облачные услуги доступны в полном объеме.'")));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти