#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПараметрыСобытийОтчета() Экспорт
	
	ВерсияСобытийОтчета = "1";  // номер версии универсального механизма, с которой совместим отчет
	ПараметрыСобытийОтчета = ОтчетыКлиентСервер.ПараметрыСобытийОтчетаПоУмолчанию(ВерсияСобытийОтчета);
	
	ПараметрыСобытийОтчета.ВыполнятьПриОбработкеПараметраФормыОтбор = Истина;
	
	Возврат ПараметрыСобытийОтчета;
	
КонецФункции

// Вызывается один раз после создания формы, когда уже заполнен Отчет.КомпоновщикНастроек.
//
Процедура ПриОбработкеПараметраФормыОтбор(Отбор, ЭтаФорма) Экспорт
	
	Перем КомпоновщикНастроек;
	
	КомпоновщикНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек;
	
	// Если есть отбор по кошельку, надо проверить вид сравнения 
	Если Отбор.Свойство("Статья") Тогда
		ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Статья");
		Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
			Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.СтатьиРасходов") Тогда
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
