///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуСинхронизации(ОбработчикЗакрытия = Неопределено) Экспорт
	
	Режим = ДеньгиКлиент.ПараметрПриложения("Деньги.Режим", Неопределено);
	Если Режим = Неопределено Тогда
		ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
		Режим = ДеньгиКлиент.ПараметрПриложения("Деньги.Режим", Неопределено);
	КонецЕсли;
	
	Если Режим = "КлиентОблака" Тогда
		ОткрытьФорму("ОбщаяФорма.УправлениеСервисомАвтосинхронизации", , , , , , ОбработчикЗакрытия);
			
	ИначеЕсли Режим = "ЦентрМобильных" Тогда
		ОткрытьФорму("Обработка.МониторСинхронизацииСМобильнымиУстройствами.Форма.Монитор", , , , , , ОбработчикЗакрытия);
			
	ИначеЕсли Режим = "Автономный" Тогда
		ОткрытьФорму("ОбщаяФорма.ВыборСпособаСинхронизации", , , , , , ОбработчикЗакрытия);
			
	Иначе
		ВызватьИсключение НСтр("ru='На сервере не предусмотрена работа с монитором синхронизации'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОповещенияОбИзмененииСостоянияОбмена() Экспорт
	Возврат "Изменилось состояние обмена";
КонецФункции

Процедура ОбновитьСостояниеОбменаНаФорме(Форма, ОбновитьСостояниеВПараметрах = Ложь, НужноОбновлятьДанныеФормы = Ложь) Экспорт
	
	Режим = ДеньгиКлиент.ПараметрПриложения("Деньги.Режим", Неопределено);
	Если Режим = Неопределено Тогда
		ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
	КонецЕсли;
	
	Если ОбновитьСостояниеВПараметрах Тогда
		ОбновитьКлиентскиеПараметрыПриложения();
	КонецЕсли;
	
	КартинкаСостояния = БиблиотекаКартинок.СинхронизацияНетОбмена16;
	ТекстСостояния    = "";
	
	Форма.Элементы.ОбменКартинка.Картинка = КартинкаСостояния;
	Форма.Элементы.ОбменТекст.Заголовок   = ТекстСостояния;
	
	Если Режим <> "КлиентОблака" И Режим <> "ЦентрМобильных" Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеОбмена = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.СостояниеОбмена", Неопределено);
	Если СостояниеОбмена = Неопределено Тогда
		ПроверитьОбработчикОповещенияОбИзмененииСостояния();
		Возврат;
	КонецЕсли;
	
	СвойствоФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	
	Если Не СостояниеОбмена.ИспользоватьСинхронизацию Тогда
		КартинкаСостояния = БиблиотекаКартинок.СинхронизацияОшибка48;
		ТекстСостояния    = НСтр("ru='Синхронизация отключена'");
		
	ИначеЕсли Не СостояниеОбмена.СтатусТранспорта.СоединениеНастроено Тогда
		КартинкаСостояния = БиблиотекаКартинок.СинхронизацияОшибка48;
		ТекстСостояния    = НСтр("ru='Синхронизация не настроена'");
		
	ИначеЕсли СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Выполняется" Тогда
		КартинкаСостояния = БиблиотекаКартинок.СинхронизацияИдетОбмен16;
		ТекстСостояния    = НСтр("ru='синхронизация…'");
		
	ИначеЕсли СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Ошибка" Тогда
		КартинкаСостояния = БиблиотекаКартинок.СинхронизацияОшибка16;
		ТекстСостояния    = НСтр("ru='что-то пошло не так…'");
		
	ИначеЕсли СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Отменено" Тогда
		ТекстСостояния    = НСтр("ru='отменено'");
		
	Иначе
	
		АвтообменИспользуется = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.АвтообменИспользуется", Ложь);
		Если СостояниеОбмена.ПроцессАктивен Тогда
			
			Если АвтообменИспользуется Тогда
				КартинкаСостояния = БиблиотекаКартинок.СинхронизацияИдетОбмен16;
				ТекстСостояния    = НСтр("ru='синхронизация...'");
			Иначе
				КартинкаСостояния = БиблиотекаКартинок.ОформлениеВоcклицательныйЗнак;
				ТекстСостояния    = НСтр("ru='синхронизация остановлена'");
			КонецЕсли;
			
		ИначеЕсли СостояниеОбмена.ЗавершенСОшибками Тогда
			КартинкаСостояния = БиблиотекаКартинок.СинхронизацияОшибка16;
			ТекстСостояния    = ?(ЗначениеЗаполнено(СостояниеОбмена.ТекстСостояния), 
							Нрег(СостояниеОбмена.ТекстСостояния), 
							НСтр("ru='что-то пошло не так...'"));
							
		ИначеЕсли СостояниеОбмена.ЗавершенСПредупреждениями Тогда
			
			Если СостояниеОбмена.ПриостановитьАвтосинхронизацию Тогда
				ТекстСостояния    = ?(ЗначениеЗаполнено(СостояниеОбмена.ТекстСостояния), 
								Нрег(СостояниеОбмена.ТекстСостояния), 
								НСтр("ru='автоматическая синхронизация отключена'"));
			Иначе
				КартинкаСостояния = БиблиотекаКартинок.ОформлениеВоcклицательныйЗнак;
				ТекстСостояния    = ?(ЗначениеЗаполнено(СостояниеОбмена.ТекстСостояния), 
								Нрег(СостояниеОбмена.ТекстСостояния), 
								НСтр("ru='синхронизация не была завершена'"));
			КонецЕсли;
			
		Иначе
			ТекстСостояния    = ?(ЗначениеЗаполнено(СостояниеОбмена.ТекстСостояния), 
							Нрег(СостояниеОбмена.ТекстСостояния), 
							НСтр("ru='синхронизация завершена'"));
							
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не СостояниеОбмена.ПроцессАктивен Тогда
		
		ЭтаСекунда = ТекущаяДата();
		МоментОповещения = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.МоментОповещения", ЭтаСекунда);
		Если ЭтаСекунда - МоментОповещения < 5 Тогда
			НужноОбновлятьДанныеФормы = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.Элементы.ОбменКартинка.Картинка = КартинкаСостояния;
	Форма.Элементы.ОбменТекст.Заголовок   = ТекстСостояния;
	
	ПроверитьОбработчикОповещенияОбИзмененииСостояния();
	
КонецПроцедуры

Процедура ОбновитьКлиентскиеПараметрыПриложения() Экспорт
	
	ПараметрыСсервера = Новый Соответствие();
	ПараметрыСсервера["Деньги.Обмен.ФоновоеЗадание"] = ПараметрыПриложения["Деньги.Обмен.ФоновоеЗадание"];

	ПроцессыОбменаВызовСервера.ОбновитьСостояниеВПараметрахПриложения(ПараметрыСсервера);
	Для Каждого КлючИЗначение Из ПараметрыССервера Цикл
		ПараметрыПриложения[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти