//#Область ОписаниеПеременных
//
//#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Теги", ТегиОтбора);
	Параметры.Свойство("ТекущаяКартинка", ТекущаяКартинка);
	ВРежимеВыбора = Параметры.РежимВыбора;
	ТекущаяСтраница = 1;

	ЭлементовНаСтранице = 40;
	
	ПрочитатьТаблицуКартинок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьСтраницу();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Записан элемент справочника" Тогда
		
		Если ТипЗнч(Параметр) = Тип("СправочникСсылка.КартинкиПриложения") Тогда
			ТекущаяКартинка = Параметр;
		КонецЕсли;
		ПрочитатьТаблицуКартинок();
		ПоказатьСтраницу();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекстСтраницыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Идентификатор = ДеньгиКлиентСервер.ТекстСсылкиИзОбработчикаПриНажатии(Элемент.Имя, 
								ДанныеСобытия, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Или Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьНажатиеИндикатора(Идентификатор);
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
	ПрочитатьТаблицуКартинок();
	ПоказатьСтраницу();
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ПрочитатьТаблицуКартинок();
	ПоказатьСтраницу();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	
	ПараметрыФормы = Новый Структура("Теги", ТегиОтбора);
	ОткрытьФорму("Справочник.КартинкиПриложения.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Процедура ПредыдущаяСтраница(Команда)
	ТекущаяСтраница = Макс(1, ТекущаяСтраница -1);
	ПоказатьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСтраница(Команда)
	ТекущаяСтраница = Мин(ТекущаяСтраница +1, ВсегоСтраниц);
	ПоказатьСтраницу();
КонецПроцедуры


#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере()
	Справочники.КартинкиПриложения.ПроверитьНачальноеЗаполнение();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТаблицуКартинок()
	
	ТаблицаКартинок.Очистить();
	СписокТегов = ?(ПустаяСтрока(ТегиОтбора), Неопределено, СтрРазделить(ТегиОтбора, ";", Ложь));
	
	Запрос = Новый Запрос;
	ТекстУсловияТегов = "";
	Если ЗначениеЗаполнено(СписокТегов) Тогда
		Для Счетчик = 0 По СписокТегов.ВГраница() Цикл
			Тег = СписокТегов[Счетчик];
			ИмяПараметра = "Тег_" + Формат(Счетчик, "ЧДЦ=0; ЧГ=;");
			Запрос.УстановитьПараметр(ИмяПараметра, "%" + Тег + "%");
			ТекстУсловияТегов = ТекстУсловияТегов + ?(ТекстУсловияТегов = "", "", "
				|		ИЛИ ") + " Спр.Теги ПОДОБНО &" + ИмяПараметра;
		КонецЦикла;
	Иначе
		ТекстУсловияТегов = "";
	КонецЕсли;
	ТекстУсловияТегов = ?(ПустаяСтрока(ТекстУсловияТегов), "", " И (" + ТекстУсловияТегов + ")");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Спр.Ссылка,
	|	Спр.Код КАК Код,
	|	Спр.Системная КАК Системная,
	|	Спр.КартинкаBase64 КАК ТекстКартинки
	|ИЗ
	|	Справочник.КартинкиПриложения КАК Спр
	|ГДЕ
	|	Не Спр.ПометкаУдаления
	|	" + ТекстУсловияТегов + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерСтраницы = 1;
	Счетчик = 0;
	НомерИД = 0;
	ТекущаяСтраница = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НомерИД = НомерИД + 1;
		Если Счетчик >= ЭлементовНаСтранице Тогда
			Счетчик = 1;
			НомерСтраницы = НомерСтраницы + 1; 
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		СтрокаКартинки = ТаблицаКартинок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКартинки, Выборка);
		СтрокаКартинки.НомерСтраницы = НомерСтраницы;
		СтрокаКартинки.ИДНаСтранице = СтрШаблон("ИД_%1", Формат(НомерИД, "ЧЦ=6; ЧДЦ=0; ЧН=0; ЧВН=; ЧГ=;"));
		Если ТекущаяКартинка = Выборка.Ссылка Тогда
			ТекущаяСтраница = + НомерСтраницы; 
		КонецЕсли;
		
	КонецЦикла;
	
	ВсегоСтраниц = +НомерСтраницы;
	Если ТекущаяСтраница = 0 Тогда
		ТекущаяСтраница = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницу()
	
	СтилиКартинок = "";
	ТелоСтраницы  = "";
	ТекущаяСтраница = Мин(Макс(ТекущаяСтраница, 1), ВсегоСтраниц); 
	
	СтрокиТаблицы = ТаблицаКартинок.НайтиСтроки(Новый Структура("НомерСтраницы", ТекущаяСтраница));
	Для Каждого Строка Из СтрокиТаблицы Цикл
		
		СтилиКартинок = СтилиКартинок + Символы.ПС
			+ СтрШаблон("
			|.%1 {
			| background-image: %2
			| }
			|", Строка.ИДНаСтранице, Строка.ТекстКартинки);
		
		ТелоСтраницы = ТелоСтраницы + Символы.ПС
			+ СтрШаблон(
				"       <imgBox id=""%1"">
			  	|         <a href=""|%1""><div id=""%1.div"" class=""bkg %1""> </div></a>
			  	|       </imgBox>
			  	|", Строка.ИДНаСтранице);
		
	КонецЦикла;
	
	ТекстСтраницы = ЗаготовкаСтраницы(СтилиКартинок, ТелоСтраницы);
	ТекущаяСтраницаСтрокой = СтрШаблон("%1 из %2", ТекущаяСтраница, ВсегоСтраниц);
	Элементы.СледующаяСтраница.Доступность = ТекущаяСтраница < ВсегоСтраниц;
	Элементы.ПредыдущаяСтраница.Доступность = ТекущаяСтраница > 1;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаготовкаСтраницы(СтилиКартинок, ТекстТела)
	
	Результат = 
	СтрШаблон("<!DOCTYPE html>
	|<html lang=""ru-RU"">
	|  <head>
	|    <meta name=""viewport"" content=""width=device-width, initial-scale=1"">    
	|    <meta http-equiv=""Content-Type"" content=""text/html; charset=UTF-8"" />
	|    <title><!--ИмяСтраницы--></title>
	|    
	|	 <style type=""text/css"">
	|     %1
	|     %2
	|     <!--ТекстСтилей-->
	|	 </style>
	|  </head>
	|
	|<body>
	|  <main>
	|
	|    %3
	|    <!--ТекстТела-->
	|
	|  </main>
	|</body>
	|</html>
	|", ТекстСтилей(), СтилиКартинок, ТекстТела);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстСтилей()
	
	Результат = 
	" body {
	|background: RGB(251, 250, 251);
	|font-family: Tahoma, Geneva, sans-serif;
	|color: rgb(80, 80, 80);
	|}
	|
	|/* построение страницы на гриде */
	|main {
	|display: grid;
	|grid-template-columns: repeat(auto-fill, minmax(80px, 200px));
	|grid-auto-rows: minmax(80px, 200px);
	|grid-gap: 0.3rem;
	|margin-bottom: 2em;
	|}
	|
	|imgBox {
	|background: #fff;
	|box-shadow: 0 3px 10px -2px rgba(0,0,0,0.3);
	|padding: 0 .5em .3em .5em;
	|margin: .5em 0 0 .5em;
	|border-radius: 5px;
	|/*min-height: 50px;*/
	|font-family: Helvetica, Arial, sans-serif;
	|}
	|imgBox:active{
	| background:#faf17b;
	| box-shadow: 0 1px 5px -4px rgba(0,0,0,0.5);
	| top:2px;
	|}
	|imgBox:hover{
	| background:#faf17b;
	| top:2px;
	| cursor: pointer;
	|}
	|
	|.bkg {
	|width: 100%;
	|height: 100%;
	|min-height: 5em;
	|background-repeat: no-repeat;
	|background-position: center;
	|background-size: 95%;
	|}
	|";
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьНажатиеИндикатора(ИД)
	
	Имена = СтрРазделить(ИД, ".", Ложь);
	
	СтрокиКартинки = ТаблицаКартинок.НайтиСтроки(Новый Структура("ИДНаСтранице", Имена[0]));
	Если Не ЗначениеЗаполнено(СтрокиКартинки) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаКартинки = СтрокиКартинки[0];
	Если ВРежимеВыбора Тогда
		ОповеститьОВыборе(СтрокаКартинки.Ссылка);
		Если Открыта() Тогда
			Закрыть(СтрокаКартинки.Ссылка);
		КонецЕсли;
	Иначе
		
		ОткрытьФорму("Справочник.КартинкиПриложения.ФормаОбъекта", 
					Новый Структура("Ключ", СтрокаКартинки.Ссылка),
					ЭтотОбъект,
					СтрокаКартинки.Ссылка)
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция КоличествоЭлементовПоРазмеруЭкрана()
	
	
	
КонецФункции

#КонецОбласти




