
#Область ПрограммныйИнтерфейс

Функция СсылкаНаКартинку(КодКартинки, ЭлементСправочника = Неопределено, ТекстКартинки = Неопределено) Экспорт
	
	ЭлементСправочника = Справочники.КартинкиПриложения.НайтиПоКоду(КодКартинки);
	Если Не ЗначениеЗаполнено(ЭлементСправочника) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСправочника, "КартинкаBase64");
	ТекстКартинки = ?(ЗначениеЗаполнено(ТекстКартинки), ТекстКартинки, "");
	
	Возврат ПолучитьНавигационнуюСсылку(ЭлементСправочника, "Картинка");
	
КонецФункции

Функция ОформлениеОбъекта(Ссылка) Экспорт
	
	Результат = НовыйСтруктураОфрмления();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Оформление.Ссылка,
	|	Оформление.Картинка,
	|	Оформление.ЦветФона,
	|	Оформление.ЦветТекста,
	|	Оформление.АдресКартинки,
	|	НЕ ЕСТЬNULL(Оформление.Картинка.ПометкаУдаления, Истина) КАК ЕстьКартинка,
	|	ЕСТЬNULL(Оформление.Картинка.КартинкаBase64, """") КАК ТекстКартинки
	|ИЗ
	|	РегистрСведений.ОформлениеЗаписей КАК Оформление
	|ГДЕ
	|	Оформление.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОформлениеОбъектаПоУмолчанию(Ссылка) Экспорт
	
	Результат = НовыйСтруктураОфрмления();
	
	Результат.Ссылка = Ссылка;
	ТипСсылка = ТипЗнч(Ссылка);
	Если ТипСсылка = Тип("СправочникСсылка.КошелькиИСчета") Тогда
		КодКартинки = "Бумажник";
	ИначеЕсли ТипСсылка = Тип("СправочникСсылка.Имущество") Тогда
		КодКартинки = "Имущество";
	ИначеЕсли ТипСсылка = Тип("СправочникСсылка.Контакты") Тогда
		КодКартинки = "Контакты";
	ИначеЕсли ТипСсылка = Тип("СправочникСсылка.Долги") Тогда
		КодКартинки = "БанковскиеКредиты";
	ИначеЕсли ТипСсылка = Тип("СправочникСсылка.Валюты") Тогда
		КодКартинки = "Валюты";
	ИначеЕсли ТипСсылка = Тип("СправочникСсылка.СтатьиДоходов") Тогда
		КодКартинки = "СтатьиДоходов";
	ИначеЕсли ТипСсылка = Тип("СправочникСсылка.СтатьиРасходов") Тогда
		КодКартинки = "СтатьиРасходов";
	Иначе
		ВызватьИсключение СтрШаблон( НСтр("ru='Нет картинки по умолчанию для справочника %1'"), ТипСсылка);
	КонецЕсли;
	
	Результат.АдресКартинки = СсылкаНаКартинку(КодКартинки, Результат.Картинка);
	Результат.ЕстьКартинка = ЗначениеЗаполнено(Результат.Картинка);
	Если Результат.ЕстьКартинка Тогда
		Результат.ТекстКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Картинка, "КартинкаBase64");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьОформлениеОбъекта(СсылкаНаОбъект, СсылкаНаКартинку = Неопределено, 
				ЦветФона = Неопределено, ЦветТекста = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СсылкаНаКартинку = Неопределено И ЦветФона = Неопределено И ЦветТекста = Неопределено Тогда
		
		Запись = РегистрыСведений.ОформлениеЗаписей.СоздатьМенеджерЗаписи();
		Запись.Ссылка = СсылкаНаОбъект;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
		Возврат;
		
	КонецЕсли;
	
	Набор = РегистрыСведений.ОформлениеЗаписей.СоздатьНаборЗаписей();
	Набор.Отбор.Ссылка.Установить(СсылкаНаОбъект);
	
	Запись = Набор.Добавить();
	Запись.Ссылка      = СсылкаНаОбъект;
	Запись.Картинка    = СсылкаНаКартинку;
	Запись.ЦветФона    = ЦветФона;
	Запись.ЦветТекста  = ЦветТекста;
	
	Запись.АдресКартинки = ?(ЗначениеЗаполнено(Запись.Картинка), 
				ПолучитьНавигационнуюСсылку(Запись.Картинка, "Картинка"), "");
				
	Набор.Записать();
	
КонецПроцедуры

Процедура ДобавитьСтилиСистемныхКартинок(ТекстСтраницы) Экспорт
	
	ТекстКартинок = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Картинки.Код КАК Код,
	|	Картинки.КартинкаBase64 КАК ТекстКартинки
	|ИЗ
	|	Справочник.КартинкиПриложения КАК Картинки
	|ГДЕ
	|	Картинки.Системная
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстКартинок = ТекстКартинок + ?(ТекстКартинок = "", "", Символы.ПС)
			+ СтрШаблон(
			".%1 {
			| background-repeat: no-repeat;
			| background-position: center;
			| background-size: 48px;
			| background-image: %2
			|}", Выборка.Код, Выборка.ТекстКартинки
			);
	КонецЦикла;
	
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы, 
				"<!--ТекстСтилей-->", 
				ТекстКартинок + Символы.ПС + Символы.ПС + "<!--ТекстСтилей-->");
	
КонецПроцедуры


#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйСтруктураОфрмления() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ссылка", Неопределено);
	Результат.Вставить("ЕстьКартинка", Ложь);
	Результат.Вставить("Картинка", Справочники.КартинкиПриложения.ПустаяСсылка());
	Результат.Вставить("ЦветФона", "");
	Результат.Вставить("ЦветТекста", "");
	Результат.Вставить("АдресКартинки", "");
	Результат.Вставить("ТекстКартинки", "");
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьНачальноеЗаполнениеПодсистемы() Экспорт
	
	Справочники.КартинкиПриложения.ПроверитьНачальноеЗаполнение();
	
КонецПроцедуры

Процедура ОбновитьКартинкуВСтруктуреОформления(СтруктураОформления, НоваяКартинка) Экспорт
	
	Фиксировать = ТипЗнч(СтруктураОформления) = Тип("ФиксированнаяСтруктура");
	Если Фиксировать Тогда
		Оформление = Новый Структура(СтруктураОформления);
	Иначе
		Оформление = (СтруктураОформления);
	КонецЕсли;
	
	Оформление.Картинка = НоваяКартинка;
	Оформление.ЕстьКартинка = ЗначениеЗаполнено(НоваяКартинка);
	Если Оформление.ЕстьКартинка Тогда
		Оформление.АдресКартинки = ПолучитьНавигационнуюСсылку(НоваяКартинка, "Картинка");
		Оформление.ТекстКартинки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяКартинка, "КартинкаBase64");
		
	Иначе
		Оформление.АдресКартинки = "";
		Оформление.ТекстКартинки = "";
		
	КонецЕсли;
	
	Если Фиксировать Тогда
		СтруктураОформления = Новый ФиксированнаяСтруктура(Оформление);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти




#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
