Функция ЗагрузитьДанныеЧекаИзНалоговой() Экспорт
		
	ПараметрыПолученияЧека = ПолучитьПараметрыПолученияЧека();
	ДанныеЧекаИзНалоговой = ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека); 
	
	Если НЕ ЗначениеЗаполнено(ДанныеЧекаИзНалоговой) Тогда
		Возврат Ложь;
	КонецЕсли;	                
	
	ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧекаИзНалоговой);
	
	//Если все ОК - установим признак, что чек загружен, а также запишем документ
	Если money_Номенклатура.Количество() > 0 Тогда
		ЭтотОбъект.money_ЗагруженИзНалоговой = Истина;
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли; 
	
	Возврат Истина;
		
КонецФункции 

Функция ПолучитьОписаниеШапкиЧека()
	
    ШапкаЧека = Новый Структура("Магазин");
	
	Возврат ШапкаЧека;
	
КонецФункции

Функция ПолучитьОписаниеТаблицыТоваров()
	
	Возврат ЭтотОбъект.money_Номенклатура.Выгрузить().СкопироватьКолонки();
	
КонецФункции

Функция ПолучитьПараметрыПолученияЧека()
	
	ПараметрыПолученияЧека = money_РаботаССерверомPython.ПолучитьПараметрыПодключенияКСерверу();
	ПараметрыПолученияЧека.Вставить("Метод", ?(money_Отладка, "debug", "check")); 
	ПараметрыПолученияЧека.Вставить("Параметры", Новый Структура("token, qrraw", Константы.ТокенПроверкаЧеков.Получить(), ЭтотОбъект.QRКод));	
	ПараметрыПолученияЧека.Вставить("ОписаниеШапкиЧека", ПолучитьОписаниеШапкиЧека());
	ПараметрыПолученияЧека.Вставить("ОписаниеТаблицыТоваров", ПолучитьОписаниеТаблицыТоваров());
	
	Возврат ПараметрыПолученияЧека;
	
КонецФункции

Функция ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека)
		
	ОтветИзНалоговой = ЗапросВНалоговую(ПараметрыПолученияЧека);  
	
	Если НЕ ЗначениеЗаполнено(ОтветИзНалоговой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЧека = ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека);
	
	Возврат ДанныеЧека;
	
КонецФункции  

Функция ЗапросВНалоговую(ПараметрыПолученияЧека) 
	
	Ответ = money_РаботаССерверомPython.ЗапросКСерверу(ПараметрыПолученияЧека);
	
	Если Ответ = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если money_Отладка Тогда
		ОбщегоНазначения.СообщитьПользователю(Ответ);
		Возврат Неопределено;		
	КонецЕсли;
	
    Возврат Ответ;
	
КонецФункции

Функция ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека)
	
	ДанныеЧека = Новый Структура("ШапкаЧека, ТаблицаТоваров", 
									ПараметрыПолученияЧека.ОписаниеШапкиЧека, ПараметрыПолученияЧека.ОписаниеТаблицыТоваров); 
	
	Попытка
		СтруктураДанныеЧека = ПрочитатьЗначениеJSON(ОтветИзНалоговой);		
	Исключение
		Возврат ДанныеЧека;		
	КонецПопытки; 
	
	Если СтруктураДанныеЧека.Свойство("detail") Тогда
		ТекстСообщения = "Ошибка получения данных чека";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);  
		Возврат ДанныеЧека;
	КонецЕсли;
	
	Магазин = НайтиСоздатьМагазин(СтруктураДанныеЧека.shop.legal_name);
	
	ДанныеЧека.ШапкаЧека.Магазин = Магазин;
	
	Для Каждого Стр Из СтруктураДанныеЧека.items Цикл
		НоваяСтрока = ДанныеЧека.ТаблицаТоваров.Добавить();
		НоваяСтрока.НоменклатураПоставщика = НайтиСоздатьНоменклатуруПоставщика(Магазин, Стр.name);
		НоваяСтрока.Номенклатура 	= НоваяСтрока.НоменклатураПоставщика.Номенклатура;
		НоваяСтрока.СтатьяРасходов 	= НоваяСтрока.Номенклатура.СтатьяРасходов;
		НоваяСтрока.Количество 		= Стр.quantity;
		НоваяСтрока.Цена 			= Стр.price;    
		НоваяСтрока.Сумма			= Стр.sum;
		
		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		НоваяСтрока.СтатьяРасходов	= НоваяСтрока.Номенклатура.СтатьяРасходов;		
	КонецЦикла;
		
	Возврат ДанныеЧека;	
	
КонецФункции     

Функция НайтиСоздатьМагазин(ОфициальноеНазвание)
	
	ОфициальноеНазвание = СокрЛП(ОфициальноеНазвание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контакты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контакты КАК Контакты
	|ГДЕ
	|	НЕ Контакты.ПометкаУдаления
	|	И НЕ Контакты.ЭтоГруппа
	|	И Контакты.ОфициальноеНазвание = &ОфициальноеНазвание"; 
	
	Запрос.УстановитьПараметр("ОфициальноеНазвание", ОфициальноеНазвание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НовыйКонтакт = Справочники.Контакты.СоздатьЭлемент();
	НовыйКонтакт.ОфициальноеНазвание = ОфициальноеНазвание;
	НовыйКонтакт.Наименование = ОфициальноеНазвание;
	НовыйКонтакт.Активность = Истина;
	НовыйКонтакт.ОбменДанными.Загрузка = Истина;
	
	НовыйКонтакт.Записать();
	
	Возврат НовыйКонтакт.Ссылка;
	
КонецФункции

Функция НайтиСоздатьНоменклатуруПоставщика(Магазин, Наименование)
	
	Наименование = СокрЛП(Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.money_НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НЕ НоменклатураПоставщиков.ПометкаУдаления
	|	И НоменклатураПоставщиков.Наименование = &Наименование
	|	И НоменклатураПоставщиков.Поставщик = &Магазин"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НоваяНоменклатураПоставщика = Справочники.money_НоменклатураПоставщиков.СоздатьЭлемент();
	НоваяНоменклатураПоставщика.Поставщик = Магазин;
	НоваяНоменклатураПоставщика.Наименование = Наименование;
	НоваяНоменклатураПоставщика.ОбменДанными.Загрузка = Истина;
	
	НоваяНоменклатураПоставщика.Записать();
	
	Возврат НоваяНоменклатураПоставщика.Ссылка;
	
КонецФункции

Процедура ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧека)  
	
	//Заполним магазин в шапке документа
	Аналитика = ЭтотОбъект.АналитикаДокумента.Добавить();                       
	Аналитика.ВидАналитики = ПланыВидовХарактеристик.ВидыАналитик.МестоТраты;
	Аналитика.РедактироватьВШапке = Истина;
	Аналитика.ЗначениеАналитикиВШапке = ДанныеЧека.ШапкаЧека.Магазин;
	
	//Заполним номенклатуру
	
	Для Каждого Стр Из ДанныеЧека.ТаблицаТоваров Цикл
		НоваяСтрока = ЭтотОбъект.money_Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура УчетТоваров_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;		
	КонецЕсли;
	
	Если money_РасходыЗаполненыПоНоменклатуре Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ money_НоменклатураОбработана Тогда
		Возврат;
	КонецЕсли;  
	
	Если money_Номенклатура.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	Если Расходы.Итог("Сумма") <> money_Номенклатура.Итог("Сумма") - СуммаСкидки Тогда
		Отказ = Истина; 
		ТекстСообщения = "Расходятся суммы в табличных частях. Операция не будет выполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Расходы.Очистить();

	ТаблицаПоСтатьямРасходов = money_Номенклатура.Выгрузить();
	ТаблицаПоСтатьямРасходов.Свернуть("СтатьяРасходов", "Сумма");
	
	Расходы.Очистить();	
	
	Для Каждого Стр Из ТаблицаПоСтатьямРасходов Цикл
		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.СтатьяРасходаИмущество = Стр.СтатьяРасходов; 
		НоваяСтрока.Сумма = Стр.Сумма;
	КонецЦикла;  
	
	money_РасходыЗаполненыПоНоменклатуре = Истина;
	
КонецПроцедуры
