Функция ЗагрузитьДанныеЧекаИзНалоговой() Экспорт
		
	ПараметрыПолученияЧека = ПолучитьПараметрыПолученияЧека();
	ДанныеЧекаИзНалоговой = ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека); 
	
	Если НЕ ЗначениеЗаполнено(ДанныеЧекаИзНалоговой) Тогда
		Возврат Ложь;
	КонецЕсли;	                
	
	ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧекаИзНалоговой);
	
	//Если все ОК - установим признак, что чек загружен, а также запишем документ
	Если УчетТоваров_Номенклатура.Количество() > 0 Тогда
		ЭтотОбъект.УчетТоваров_ЗагруженИзНалоговой = Истина;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
	Возврат Истина;
		
КонецФункции 

Функция ПолучитьОписаниеШапкиЧека()
	
    ШапкаЧека = Новый Структура("Магазин");
	
	Возврат ШапкаЧека;
	
КонецФункции

Функция ПолучитьОписаниеТаблицыТоваров()
	
	Возврат ЭтотОбъект.УчетТоваров_Номенклатура.Выгрузить().СкопироватьКолонки();
	
КонецФункции

Функция ПолучитьПараметрыПолученияЧека()
	
	ПараметрыПолученияЧека = Новый Структура("Метод, Параметры, Сервер, Порт, ОписаниеШапкиЧека, ОписаниеТаблицыТоваров");
	ПараметрыПолученияЧека.Метод = "nalog";
	ПараметрыПолученияЧека.Параметры = Новый Структура("token, qrraw", Константы.ТокенПроверкаЧеков.Получить(), ЭтотОбъект.QRКод);	
	ПараметрыПолученияЧека.Сервер = "127.0.0.1";
	ПараметрыПолученияЧека.Порт = 8000; 
	ПараметрыПолученияЧека.ОписаниеШапкиЧека = ПолучитьОписаниеШапкиЧека();
	ПараметрыПолученияЧека.ОписаниеТаблицыТоваров = ПолучитьОписаниеТаблицыТоваров();
	
	Возврат ПараметрыПолученияЧека;
	
КонецФункции

Функция ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека)
		
	ОтветИзНалоговой = ЗапросВНалоговую(ПараметрыПолученияЧека);  
	
	Если НЕ ЗначениеЗаполнено(ОтветИзНалоговой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЧека = ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека);
	
	Возврат ДанныеЧека;
	
КонецФункции  

Функция СерверЗапущен() 
	
	СтруктураОтвета = Новый Структура("Соединение, Запущен", Неопределено, Ложь);
	
    Попытка
        Соединение = Новый HTTPСоединение("127.0.0.1", 8000);
        Запрос = Новый HTTPЗапрос("/");
        Ответ = Соединение.Получить(Запрос);
        
		Если Ответ.КодСостояния = 200 Тогда
			СтруктураОтвета.Соединение = Соединение;
			СтруктураОтвета.Запущен = Истина;
            Возврат СтруктураОтвета;
        Иначе
            Возврат СтруктураОтвета;
        КонецЕсли;
    Исключение
        // Сервер не отвечает или порт недоступен 
		ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке().Причина.Описание);
        Возврат СтруктураОтвета;
	КонецПопытки;  
	
КонецФункции

Функция ЗапросВНалоговую(ПараметрыПолученияЧека) 
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПолученияЧека.Сервер) Тогда
		ПараметрыПолученияЧека.Сервер = Константы.СерверФункцийPython.Получить();
	КонецЕсли;
	
	ОтветСервера = СерверЗапущен(); 
	
	Если НЕ ОтветСервера.Запущен Тогда
		ОбщегоНазначения.СообщитьПользователю("Сервер для проверки чеков не запущен!");
		Возврат Неопределено;	
	КонецЕсли;       
	
	Соединение = ОтветСервера.Соединение;
	
	ЗапросСервера = Новый HTTPЗапрос(СтрШаблон("/%1/", ПараметрыПолученияЧека.Метод));
	
	ЗапросСервера.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(ПараметрыПолученияЧека.Параметры));   
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	ЗапросСервера.Заголовки = Заголовки;
	
	Попытка
		ОтветСервера = Соединение.ОтправитьДляОбработки(ЗапросСервера);     
	Исключение
		ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке().Причина.Описание);
		Возврат Неопределено;
	КонецПопытки;     
	
	Возврат ОтветСервера.ПолучитьТелоКакСтроку();
	
КонецФункции

Функция ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека)
	
	ДанныеЧека = Новый Структура("ШапкаЧека, ТаблицаТоваров", 
									ПараметрыПолученияЧека.ОписаниеШапкиЧека, ПараметрыПолученияЧека.ОписаниеТаблицыТоваров); 
	
	Попытка
		СтруктураДанныеЧека = ПрочитатьЗначениеJSON(ОтветИзНалоговой);		
	Исключение
		Возврат ДанныеЧека;		
	КонецПопытки; 
	
	Магазин = НайтиСоздатьМагазин(СтруктураДанныеЧека.shop.legal_name);
	
	ДанныеЧека.ШапкаЧека.Магазин = Магазин;
	
	Для Каждого Стр Из СтруктураДанныеЧека.items Цикл
		НоваяСтрока = ДанныеЧека.ТаблицаТоваров.Добавить();
		НоваяСтрока.НоменклатураПоставщика = НайтиСоздатьНоменклатуруПоставщика(Магазин, Стр.name);
		НоваяСтрока.Номенклатура 	= НоваяСтрока.НоменклатураПоставщика.Номенклатура;
		НоваяСтрока.СтатьяРасходов 	= НоваяСтрока.Номенклатура.СтатьяРасходов;
		НоваяСтрока.Количество 		= Стр.quantity;
		НоваяСтрока.Цена 			= Стр.price;    
		НоваяСтрока.Сумма			= Стр.sum;
		
		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		НоваяСтрока.СтатьяРасходов	= НоваяСтрока.Номенклатура.СтатьяРасходов;		
	КонецЦикла;
		
	Возврат ДанныеЧека;	
	
КонецФункции     

Функция НайтиСоздатьМагазин(ОфициальноеНазвание)
	
	ОфициальноеНазвание = СокрЛП(ОфициальноеНазвание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контакты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контакты КАК Контакты
	|ГДЕ
	|	НЕ Контакты.ПометкаУдаления
	|	И НЕ Контакты.ЭтоГруппа
	|	И Контакты.ОфициальноеНазвание = &ОфициальноеНазвание"; 
	
	Запрос.УстановитьПараметр("ОфициальноеНазвание", ОфициальноеНазвание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НовыйКонтакт = Справочники.Контакты.СоздатьЭлемент();
	НовыйКонтакт.ОфициальноеНазвание = ОфициальноеНазвание;
	НовыйКонтакт.Наименование = ОфициальноеНазвание;
	НовыйКонтакт.Активность = Истина;
	НовыйКонтакт.ОбменДанными.Загрузка = Истина;
	
	НовыйКонтакт.Записать();
	
	Возврат НовыйКонтакт.Ссылка;
	
КонецФункции

Функция НайтиСоздатьНоменклатуруПоставщика(Магазин, Наименование)
	
	Наименование = СокрЛП(Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетТоваров_НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НЕ НоменклатураПоставщиков.ПометкаУдаления
	|	И НоменклатураПоставщиков.Наименование = &Наименование
	|	И НоменклатураПоставщиков.Поставщик = &Магазин"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НоваяНоменклатураПоставщика = Справочники.УчетТоваров_НоменклатураПоставщиков.СоздатьЭлемент();
	НоваяНоменклатураПоставщика.Поставщик = Магазин;
	НоваяНоменклатураПоставщика.Наименование = Наименование;
	НоваяНоменклатураПоставщика.ОбменДанными.Загрузка = Истина;
	
	НоваяНоменклатураПоставщика.Записать();
	
	Возврат НоваяНоменклатураПоставщика.Ссылка;
	
КонецФункции

Процедура ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧека)  
	
	//Заполним магазин в шапке документа
	Аналитика = ЭтотОбъект.АналитикаДокумента.Добавить();                       
	Аналитика.ВидАналитики = ПланыВидовХарактеристик.ВидыАналитик.МестоТраты;
	Аналитика.РедактироватьВШапке = Истина;
	Аналитика.ЗначениеАналитикиВШапке = ДанныеЧека.ШапкаЧека.Магазин;
	
	//Заполним номенклатуру
	
	Для Каждого Стр Из ДанныеЧека.ТаблицаТоваров Цикл
		НоваяСтрока = ЭтотОбъект.УчетТоваров_Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
КонецПроцедуры

&После("ПередЗаписью")
Процедура УчетТоваров_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если УчетТоваров_РасходыЗаполненыПоНоменклатуре Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ УчетТоваров_НоменклатураОбработана Тогда
		Возврат;
	КонецЕсли;  
	
	Если УчетТоваров_Номенклатура.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	Если Расходы.Итог("Сумма") <> УчетТоваров_Номенклатура.Итог("Сумма") Тогда
		Отказ = Истина; 
		ТекстСообщения = "Расходятся суммы в табличных частях. Операция не будет выполнена!";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Расходы.Очистить();

	ТаблицаПоСтатьямРасходов = УчетТоваров_Номенклатура.Выгрузить();
	ТаблицаПоСтатьямРасходов.Свернуть("СтатьяРасходов", "Сумма");
	
	Расходы.Очистить();	
	
	Для Каждого Стр Из ТаблицаПоСтатьямРасходов Цикл
		НоваяСтрока = Расходы.Добавить();
		НоваяСтрока.СтатьяРасходаИмущество = Стр.СтатьяРасходов; 
		НоваяСтрока.Сумма = Стр.Сумма;
	КонецЦикла;  
	
	УчетТоваров_РасходыЗаполненыПоНоменклатуре = Истина;
	
КонецПроцедуры
