Функция ЗагрузитьДанныеЧекаИзНалоговой() Экспорт
	
	СтруктураОтвета = Новый Структура("Ответ, ОписаниеОшибки", Неопределено, "");	
	
	ПараметрыПолученияЧека = ПолучитьПараметрыПолученияЧека();
	ДанныеЧекаИзНалоговой = ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека); 
	
	Если ЗначениеЗаполнено(ДанныеЧекаИзНалоговой.ОписаниеОшибки) Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, ДанныеЧекаИзНалоговой);
		Возврат СтруктураОтвета;
	КонецЕсли;	                
	
	ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧекаИзНалоговой.Ответ);
	
	//Если все ОК - установим признак, что чек загружен, а также запишем документ
	Если НЕ ЗначениеЗаполнено(СтруктураОтвета.ОписаниеОшибки) Тогда
		ЭтотОбъект.УчетТоваров_ЗагруженИзНалоговой = Истина;
		ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции 

Функция ПолучитьОписаниеШапкиЧека()
	
    ШапкаЧека = Новый Структура("Магазин");
	
	Возврат ШапкаЧека;
	
КонецФункции

Функция ПолучитьОписаниеТаблицыТоваров()
	
	Возврат ЭтотОбъект.УчетТоваров_Номенклатура.Выгрузить().СкопироватьКолонки();
	
КонецФункции

Функция ПолучитьПараметрыПолученияЧека()
	
	ПараметрыПолученияЧека = Новый Структура("Метод, Параметры, Сервер, Порт, ОписаниеШапкиЧека, ОписаниеТаблицыТоваров");
	ПараметрыПолученияЧека.Метод = "nalog";
	ПараметрыПолученияЧека.Параметры = Новый Структура("token, qrraw", Константы.ТокенПроверкаЧеков.Получить(), ЭтотОбъект.QRКод);	
	ПараметрыПолученияЧека.Сервер = "127.0.0.1";
	ПараметрыПолученияЧека.Порт = 8000; 
	ПараметрыПолученияЧека.ОписаниеШапкиЧека = ПолучитьОписаниеШапкиЧека();
	ПараметрыПолученияЧека.ОписаниеТаблицыТоваров = ПолучитьОписаниеТаблицыТоваров();
	
	Возврат ПараметрыПолученияЧека;
	
КонецФункции

Функция ПолучитьДанныеЧекаИзНалоговой(ПараметрыПолученияЧека)
	
	СтруктураОтвета = Новый Структура("Ответ, ОписаниеОшибки", Неопределено, "");
	
	ОтветИзНалоговой = ЗапросВНалоговую(ПараметрыПолученияЧека);  
	
	Если ЗначениеЗаполнено(ОтветИзНалоговой.ОписаниеОшибки) Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтвета, ОтветИзНалоговой);
		Возврат СтруктураОтвета
	КонецЕсли;
	
	ДанныеЧека = ОбработатьОтветИзНалоговой(ОтветИзНалоговой.Ответ, ПараметрыПолученияЧека);
	СтруктураОтвета.Ответ = ДанныеЧека;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ЗапросВНалоговую(ПараметрыПолученияЧека) 

	СтруктураОтвета = Новый Структура("Ответ, ОписаниеОшибки", Неопределено, "");	
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПолученияЧека.Сервер) Тогда
		Сервер = Константы.СерверФункцийPython.Получить();
	КонецЕсли;
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		Соединение = Новый HTTPСоединение(ПараметрыПолученияЧека.Сервер, ПараметрыПолученияЧека.Порт); 
	Исключение
		СтруктураОтвета.ОписаниеОшибки = ИнформацияОбОшибке().Причина.Описание;
		Возврат СтруктураОтвета;
	КонецПопытки;
	
	ЗапросСервера = Новый HTTPЗапрос(СтрШаблон("/%1/", ПараметрыПолученияЧека.Метод));
	
	ЗапросСервера.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(ПараметрыПолученияЧека.Параметры));
	ЗапросСервера.Заголовки = Заголовки;
	
	Попытка
		ОтветСервера = Соединение.ОтправитьДляОбработки(ЗапросСервера);     
	Исключение
		СтруктураОтвета.ОписаниеОшибки = ИнформацияОбОшибке().Причина.Описание;
		Возврат СтруктураОтвета;
	КонецПопытки;     
	
	СтруктураОтвета.Ответ = ОтветСервера.ПолучитьТелоКакСтроку();

	Возврат СтруктураОтвета;
	
КонецФункции

Функция ОбработатьОтветИзНалоговой(ОтветИзНалоговой, ПараметрыПолученияЧека)
	
	ДанныеЧека = Новый Структура("ШапкаЧека, ТаблицаТоваров", ПараметрыПолученияЧека.ОписаниеШапкиЧека, ПараметрыПолученияЧека.ОписаниеТаблицыТоваров); 
	
	Попытка
		СтруктураДанныеЧека = ПрочитатьЗначениеJSON(ОтветИзНалоговой);		
	Исключение
		Возврат ДанныеЧека;		
	КонецПопытки; 
	
	Магазин = НайтиСоздатьМагазин(СтруктураДанныеЧека.shop.legal_name);
	
	ДанныеЧека.ШапкаЧека.Магазин = Магазин;
	
	Для Каждого Стр Из СтруктураДанныеЧека.items Цикл
		НоваяСтрока = ДанныеЧека.ТаблицаТоваров.Добавить();
		НоваяСтрока.НоменклатураПоставщика = НайтиСоздатьНоменклатуруПоставщика(Магазин, Стр.name);
		НоваяСтрока.Номенклатура 	= НоваяСтрока.НоменклатураПоставщика.Номенклатура;
		НоваяСтрока.Количество 		= Стр.quantity;
		НоваяСтрока.Цена 			= Стр.price;    
		НоваяСтрока.Сумма			= Стр.sum;
		
		Если НоваяСтрока.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		НоваяСтрока.СтатьяРасходов	= НоваяСтрока.Номенклатура.СтатьяРасходов;		
	КонецЦикла;
		
	Возврат ДанныеЧека;	
	
КонецФункции     

Функция НайтиСоздатьМагазин(ОфициальноеНазвание)
	
	ОфициальноеНазвание = СокрЛП(ОфициальноеНазвание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контакты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контакты КАК Контакты
	|ГДЕ
	|	НЕ Контакты.ПометкаУдаления
	|	И НЕ Контакты.ЭтоГруппа
	|	И Контакты.ОфициальноеНазвание = &ОфициальноеНазвание"; 
	
	Запрос.УстановитьПараметр("ОфициальноеНазвание", ОфициальноеНазвание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НовыйКонтакт = Справочники.Контакты.СоздатьЭлемент();
	НовыйКонтакт.ОфициальноеНазвание = ОфициальноеНазвание;
	НовыйКонтакт.Наименование = ОфициальноеНазвание;
	НовыйКонтакт.Активность = Истина;
	НовыйКонтакт.ОбменДанными.Загрузка = Истина;
	
	НовыйКонтакт.Записать();
	
	Возврат НовыйКонтакт.Ссылка;
	
КонецФункции

Функция НайтиСоздатьНоменклатуруПоставщика(Магазин, Наименование)
	
	Наименование = СокрЛП(Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетТоваров_НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НЕ НоменклатураПоставщиков.ПометкаУдаления
	|	И НоменклатураПоставщиков.Наименование = &Наименование
	|	И НоменклатураПоставщиков.Поставщик = &Магазин"; 
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;				
	КонецЕсли;                 
	
	НоваяНоменклатураПоставщика = Справочники.УчетТоваров_НоменклатураПоставщиков.СоздатьЭлемент();
	НоваяНоменклатураПоставщика.Поставщик = Магазин;
	НоваяНоменклатураПоставщика.Наименование = Наименование;
	НоваяНоменклатураПоставщика.ОбменДанными.Загрузка = Истина;
	
	НоваяНоменклатураПоставщика.Записать();
	
	Возврат НоваяНоменклатураПоставщика.Ссылка;
	
КонецФункции

Процедура ОбработатьДанныеЧекаИЗаполнитьНоменклатуру(ДанныеЧека)  
	
	//Заполним магазин в шапке документа
	Аналитика = ЭтотОбъект.АналитикаДокумента.Добавить();                       
	Аналитика.ВидАналитики = ПланыВидовХарактеристик.ВидыАналитик.МестоТраты;
	Аналитика.РедактироватьВШапке = Истина;
	Аналитика.ЗначениеАналитикиВШапке = ДанныеЧека.ШапкаЧека.Магазин;
	
	//Заполним номенклатуру
	
	Для Каждого Стр Из ДанныеЧека.ТаблицаТоваров Цикл
		НоваяСтрока = ЭтотОбъект.УчетТоваров_Номенклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
КонецПроцедуры