///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
/////////////////////////////////////////////////////////////////////////////////////////////////////V



#Область ПрограммныйИнтерфейс

// Копирует каталог из одного местоположения в новое. Если задано - удаляет оригинальные файлы и каталоги
//
//Параметры:
//	ТекущееИмя - Строка или Файл - каталог-источник файлов
//	НовоеИмя   - Строка или Файл - каталог-назначение копирования или переноса
//	УдалятьОригинал - Булево - если истина, каатлог будет перенесен, а не скопирован
//
Процедура СкопироватьКаталог(ТекущееИмя, НовоеИмя, УдалятьОригинал = Ложь) Экспорт
	
	КаталогИсточник   = ДеньгиРаботаСФайламиКлиентСервер.Файл(ТекущееИмя);
	КаталогНазначение = ДеньгиРаботаСФайламиКлиентСервер.Файл(НовоеИмя);
	
	Если КаталогНазначение.Существует() и КаталогНазначение.ЭтоФайл() Тогда
		ВызватьИсключение СтрШаблон( НСтр("ru='Невозможно скопировать каталог ""%1"" в файл ""%2""'"), ТекущееИмя, НовоеИмя);
	КонецЕсли;
	
	ОписаниеПроблемы = "";
	Если Не ДеньгиРаботаСФайламиКлиентСервер.ПроверитьКаталог(КаталогНазначение, Истина, ОписаниеПроблемы) Тогда
		ВызватьИсключение СтрШаблон( НСтр("ru='Невозможно скопировать каталог ""%1"" в ""%2"":%3%4'"), 
					ТекущееИмя, НовоеИмя, Символы.ПС, ОписаниеПроблемы);
		
	КонецЕсли;
	
	СписокФайлов = НайтиФайлы(КаталогИсточник.ПолноеИмя, "*.*", Истина);
	Для каждого Файл Из СписокФайлов Цикл
		
		НовоеИмяФайла = СтрЗаменить(Файл.ПолноеИмя, ТекущееИмя, НовоеИмя);
		
		Если Файл.ЭтоКаталог() Тогда
			СоздатьКаталог(НовоеИмяФайла);
		ИначеЕсли УдалятьОригинал Тогда 
			ПереместитьФайл(Файл.ПолноеИмя, НовоеИмяФайла);
		Иначе
			КопироватьФайл(Файл.ПолноеИмя, НовоеИмяФайла);
		КонецЕсли;
		
	КонецЦикла;
	
	Если УдалятьОригинал Тогда
		УдалитьФайлы(КаталогИсточник.Путь, КаталогИсточник.Имя);
	КонецЕсли;
	
КонецПроцедуры

Процедура КопироватьФайлНаСервере(Источник, Назначение) Экспорт
	
	КопироватьФайл(Источник, Назначение);
	
КонецПроцедуры

Функция ИмяВременногоФайла(Расширение) Экспорт
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции 


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ТекстИзФайла(ИмяФайла) Экспорт
	Возврат ДеньгиРаботаСФайламиКлиентСервер.ТекстИзФайла(ИмяФайла);
КонецФункции

Процедура ТекстВФайл( Знач ИмяИлиФайл, Знач Текст ) Экспорт
	ДеньгиРаботаСФайламиКлиентСервер.ТекстВФайл(ИмяИлиФайл, Текст);
КонецПроцедуры

Функция ДанныеВФайлJSON(Данные, Знач Файл) Экспорт
	Возврат ДеньгиРаботаСФайламиКлиентСервер.ДанныеВФайлJSON(Данные, Файл);
КонецФункции

Функция РазделитьНаЧасти(ИсходныйФайл, РазмерЧасти = 1, КаталогРезультата = Неопределено) Экспорт
	Возврат ДеньгиРаботаСФайламиКлиентСервер.РазделитьНаЧасти(ИсходныйФайл, РазмерЧасти, КаталогРезультата);
КонецФункции

Процедура ОбъединитьЧасти(СписокИлиМаска, ИмяРезультирующегоФайла) Экспорт
	ДеньгиРаботаСФайламиКлиентСервер.ОбъединитьЧасти(СписокИлиМаска, ИмяРезультирующегоФайла);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти
