///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает регламентное задание в случае синхронизации с облаком Денег или использования обмена
// файлами через облачное хранилище. В остальных случаях будет возвращено Неопределено
//
Функция РегламентноеЗаданиеОбмена() Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		Возврат АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена();
	ИначеЕсли Режим = "ЦентрМобильных" Тогда
		Возврат АвтоматОбменаФайлами.РегламентноеЗаданиеОбмена();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ФоновоеЗаданиеОбмена() Экспорт
	
	Режим           = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Задание         = Неопределено; // регламентное задание
	СвойстваФЗ      = Неопределено; // свойства фонового задания

	Если Режим = "КлиентОблака" Тогда
		Задание    = АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена(Ложь);
	ИначеЕсли Режим = "ЦентрМобильных" Тогда
		Задание    = АвтоматОбменаФайлами.РегламентноеЗаданиеОбмена(Ложь);
	КонецЕсли;

	Если Задание <> Неопределено И Задание.ПоследнееЗадание <> Неопределено Тогда
		СвойстваФЗ = ОбщегоНазначенияДеньги.СтруктраСвойствФоновогоЗадания(Задание.ПоследнееЗадание);
	Иначе
		Если Режим = "КлиентОблака" Тогда
			СвойстваФЗ = АвтоматСинхронизацииССервисом.ФоновоеЗаданиеОбмена(Ложь);
		Иначе
			СвойстваФЗ = АвтоматОбменаФайлами.ФоновоеЗаданиеОбмена(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СвойстваФЗ;
	
КонецФункции

// Возвращает структуру с текущим состоянием обмена данными
//
Функция ТекущееСостояниеОбмена(УзелПланаОбмена = Неопределено, ВидТранспорта = Неопределено) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		Возврат АвтоматСинхронизацииССервисом.СостояниеОбмена(УзелПланаОбмена);
	ИначеЕсли Режим = "ЦентрМобильных" Тогда
		Возврат АвтоматОбменаФайлами.СостояниеОбмена(ВидТранспорта);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Сбрасывает состояние процессов и транспорта обмена
//
Процедура ПеревестиВНачальноеСостояние(СостояниеОбмена = Неопределено, УзелПланаОбмена = Неопределено, ВидТранспорта = Неопределено) Экспорт
	
	Если СостояниеОбмена = Неопределено Тогда
		СостояниеОбмена = ТекущееСостояниеОбмена(УзелПланаОбмена, ВидТранспорта);
		Если СостояниеОбмена = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если СостояниеОбмена.Режим = "КлиентОблака"  Тогда
		АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена);
	ИначеЕсли СостояниеОбмена.Режим = "ЦентрМобильных" Тогда
		АвтоматОбменаФайлами.СброситьСостояние(СостояниеОбмена);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСостояниеОбменаНаСервере() Экспорт
	Возврат АвтоматСинхронизацииССервисом.ПроверитьСостояниеОбменаНаСервере();
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Получает на входе глобальное соответствие ПараметрыПриложения и
// добавляет в него значения с описанием текущего состояния обмена и фонового задания
// 
// 	* Деньги.Обмен.ФоновоеЗадание - Структура или Неопределено - описание активного фонового задания
// 	* Деньги.Обмен.АвтообменИспользуется - Булево - Истина, если установлен режим использования для регламентного задания
// 	* Деньги.Обмен.СоединениеНастроено - Булево - Истина, если настройки обмена заполнены корректно
// 	* Деньги.Обмен.ПроверятьСостояние - Булево - Истина, если используется транспорт, 
// 					для которого предусмотрено регламентное задание
// 	* Деньги.Обмен.МоментИзменения - Дата - максимальная дата изменения в состоянии обмена (начало или завершение Приема или Отправки)
// 	* Деньги.Обмен.СостояниеОбмена - Структура - текущее состояние обмена. См. ПроцессыОбменаСлужебный.НовыйСтуктураСостоянияОбмена()
//
Процедура ОбновитьСостояниеВПараметрахПриложения(Параметры) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	ПрежнееФЗ = Параметры["Деньги.Обмен.ФоновоеЗадание"];
	
	Задание         = Неопределено; // регламентное задание
	СвойстваФЗ      = Неопределено; // свойства фонового задания
	СостояниеОбмена = Неопределено; // структура с описанием состояния обмена
	МоментИзменения = Дата(1,1,1);
	
	Если Режим = "КлиентОблака" Тогда
		Задание    = АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена(Ложь);
		СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	ИначеЕсли Режим = "ЦентрМобильных" Тогда
		Задание    = АвтоматОбменаФайлами.РегламентноеЗаданиеОбмена(Ложь);
		СостояниеОбмена = АвтоматОбменаФайлами.СостояниеОбмена();
	КонецЕсли;
	
	Если Задание <> Неопределено И Задание.ПоследнееЗадание <> Неопределено Тогда
		СвойстваФЗ = ОбщегоНазначенияДеньги.СтруктраСвойствФоновогоЗадания(Задание.ПоследнееЗадание);
	Иначе
		Если Режим = "КлиентОблака" Тогда
			СвойстваФЗ = АвтоматСинхронизацииССервисом.ФоновоеЗаданиеОбмена(Ложь);
		Иначе
			СвойстваФЗ = АвтоматОбменаФайлами.ФоновоеЗаданиеОбмена(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Параметры.Вставить("Деньги.Обмен.АвтообменИспользуется", Задание <> Неопределено И Задание.Использование);
	
	Если СостояниеОбмена = Неопределено Тогда
		Параметры.Вставить("Деньги.Обмен.СоединениеНастроено", Ложь);
		Параметры.Вставить("Деньги.Обмен.ПроверятьСостояние", Ложь);
		
	Иначе
		
		Параметры.Вставить("Деньги.Обмен.СоединениеНастроено", СостояниеОбмена.СтатусТранспорта.СоединениеНастроено);
		Параметры.Вставить("Деньги.Обмен.ПроверятьСостояние", 
				СостояниеОбмена.СтатусТранспорта.СоединениеНастроено
				Или СостояниеОбмена.СтатусТранспорта.СоединениеСФайловымОблакомНастроено);
		Если Режим = "ЦентрМобильных" Тогда
			МоментИзменения = Макс(СостояниеОбмена.НачалоДействия,
					СостояниеОбмена.ЗавершениеДействия);
		Иначе
			МоментИзменения = Макс(СостояниеОбмена.Прием.НачалоДействия,
					СостояниеОбмена.Прием.ЗавершениеДействия,
					СостояниеОбмена.Передача.НачалоДействия,
					СостояниеОбмена.Передача.ЗавершениеДействия);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СвойстваФЗ <> Неопределено Тогда
		НачалоФЗ = ?(СвойстваФЗ.Начало = Неопределено, Дата(1,1,1), СвойстваФЗ.Начало);
		КонецФЗ = ?(СвойстваФЗ.Конец = Неопределено, Дата(1,1,1), СвойстваФЗ.Конец);
		
		// Обновление статуса транспорта данными ошибки фонового задания
		Если СвойстваФЗ.Статус = "Ошибка" И СостояниеОбмена <> Неопределено Тогда
			
			ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
			Если СостояниеОбмена.СтатусТранспорта.КодСостояния <> ВсеКоды.ОшибкаФоновогоЗадания.Код
				И Режим = "КлиентОблака" Тогда
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СвойстваФЗ, "КраткоеПредставлениеОшибки") Тогда
					ТекстОшибки= СвойстваФЗ.КраткоеПредставлениеОшибки;
				Иначе
					ТекстОшибки= НСтр("ru='При выполнении обмена произошла какая-то ошибка'");
				КонецЕсли;
				ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
						ВсеКоды.ОшибкаФоновогоЗадания.Код, 
						ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		НачалоФЗ = Дата(1,1,1);
		КонецФЗ = Дата(1,1,1);
	КонецЕсли;
	
	Если ПрежнееФЗ <> Неопределено И СвойстваФЗ <> Неопределено
		И (ПрежнееФЗ.Статус <> СвойстваФЗ.Статус Или ПрежнееФЗ.Начало <> НачалоФЗ) Тогда
		МоментИзменения = Макс(МоментИзменения, НачалоФЗ, КонецФЗ);
	КонецЕсли;
	
	ДатаСинхронизации = Дата(1,1,1);
	Если СостояниеОбмена <> Неопределено Тогда
		Если Режим = "КлиентОблака" Тогда
			ДатаСинхронизации = СинхронизацияАвтономныхКопий.ДатаПоследнейУспешнойСинхронизации(СостояниеОбмена.УзелКорреспондента);
			ДатаСинхронизации = ?(ЗначениеЗаполнено(ДатаСинхронизации), ДатаСинхронизации, Дата(1,1,1));
			
		ИначеЕсли Режим = "ЦентрМобильных" И ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
			
			Для Каждого Корреспондент Из СостояниеОбмена.Корреспонденты Цикл
				Если Корреспондент <> Неопределено И ЗначениеЗаполнено(Корреспондент.Узел) Тогда
					ДатаСинхронизацииСУзлом = СинхронизацияАвтономныхКопий.ДатаПоследнейУспешнойСинхронизации(Корреспондент.Узел);
					Если ЗначениеЗаполнено(ДатаСинхронизацииСУзлом) Тогда
						ДатаСинхронизации = Макс(ДатаСинхронизации, ДатаСинхронизацииСУзлом);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ДатаСинхронизации = Дата(1,1,1);
			
		КонецЕсли;
	КонецЕсли;
	Параметры.Вставить("Деньги.Обмен.ДатаПоследнейУспешнойСинхронизации", ДатаСинхронизации);
	Если ЗначениеЗаполнено(ДатаСинхронизации) Тогда
		Параметры.Вставить("Деньги.Обмен.ДатаПоследнейУспешнойСинхронизацииСтрокой", 
					Формат(ДатаСинхронизации, "Л=ru_RU; ДФ='dd.MM.yyyy HH.mm.ss'"));
		МоментИзменения = Макс(МоментИзменения, ДатаСинхронизации);
	Иначе
		Параметры.Вставить("Деньги.Обмен.ДатаПоследнейУспешнойСинхронизацииСтрокой", 
					НСтр("ru='нет данных'"));
	КонецЕсли;
	
	Параметры.Вставить("Деньги.Обмен.СостояниеОбмена", СостояниеОбмена);
	Параметры.Вставить("Деньги.Обмен.ФоновоеЗадание", СвойстваФЗ);
	Параметры.Вставить("Деньги.Обмен.МоментИзменения", МоментИзменения);
	
КонецПроцедуры

Функция ОписаниеСостоянияПоКоду(КодРезультата) Экспорт
	Возврат ПроцессыОбменаПовтИсп.ОписаниеСостоянияПоКоду(КодРезультата);
КонецФункции

Функция ОписаниеРезультатаПоКоду(КодРезультата) Экспорт
	Возврат ПроцессыОбменаПовтИсп.ОписаниеСостоянияПоКоду(КодРезультата);
КонецФункции

Функция ВсеКодыСостоянияСервера() Экспорт
	Возврат ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
КонецФункции

Функция ВсеКодыРезультатовДействий() Экспорт
	Возврат ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти