
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ДЕНЬГИ
	Если Параметры.Свойство("ОтчетОткрытИзФормыПомощника") Тогда
		ОтчетОткрытИзФормыПомощника = Параметры.ОтчетОткрытИзФормыПомощника = Истина;
	КонецЕсли;
	// Конец ДЕНЬГИ 
	
	мСкопированаФорма = Неопределено;
	мСохраненныйДок   = Неопределено;
	
	НеОтображатьПредупреждение = Параметры.НеОтображатьПредупреждение;
	мСохраненныйДок			   = Параметры.ЗначениеКопирования;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		И ЗначениеЗаполнено(Объект.ВыбраннаяФорма) Тогда
		
		мСкопированаФорма = Объект.ВыбраннаяФорма;
		
	КонецЕсли;
	
	ИсточникОтчета = "";
	Объект.Свойство("ИсточникОтчета", ИсточникОтчета);
	Если ИсточникОтчета = "РегламентированныйОтчетТорговыйСбор1"
		Или ИсточникОтчета = "РегламентированныйОтчетТорговыйСбор2"
		Или ИсточникОтчета = "РегламентированныйОтчетНевозможностьПредоставления" Тогда 
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Отчет был сохранен в предыдущей редакции конфигурации. Открытие невозможно.'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Если Не(РеквизитФормыВЗначение("Объект").ЭтоНовый()) ИЛИ (мСкопированаФорма <> Неопределено) Тогда
		                     		
		Если Объект.ИсточникОтчета = "РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедицинскойДеятельности" Тогда
			Объект.ИсточникОтчета = "РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедДеятельности";
		КонецЕсли;						  
		
		ПравоДоступаКОтчету = РегламентированнаяОтчетностьВызовСервера.ПравоДоступаКРегламентированномуОтчету(Объект.ИсточникОтчета);
		
		Если ПравоДоступаКОтчету = Ложь Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Недостаточно прав.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		ИначеЕсли ПравоДоступаКОтчету = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не удалось открыть сохраненные данные. Отчет не найден.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		// Возвращает типы ВнешнийОтчетОбъект.<Имя> и ОтчетМенеджер.<Имя>
		ВариантФормыОтчета = Неопределено;
		ОбъектОтчет = РегламентированнаяОтчетность.РеглОтчеты(Объект.ИсточникОтчета);
		
		Если ОбъектОтчет = Неопределено Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не удалось открыть сохраненные данные. Отчет не найден.'");
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецЕсли;
		
		ОткрытьФормуОтчета = Истина;
		ВариантФормыОтчета = ?(СтрНайти(ОбъектОтчет, "ОтчетМенеджер") > 0, "Отчет.", "ВнешнийОтчет.")
		
	ИначеЕсли РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
		
		ОткрытьФормуОтчета = Ложь;
		
	КонецЕсли;
	
	Если НЕ Параметры.ОткрытьФормуОтчета Тогда
		ОткрытьФормуРСВ1 = Ложь;
	Иначе
		ОткрытьФормуРСВ1 = Истина;
	КонецЕсли;
	
	// ДЕНЬГИ ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьКакПрочтенное(Объект.Ссылка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Если ОткрытьФормуОтчета Тогда
		
		СтандартнаяОбработка = Истина;
		
		ПараметрыФормы = Новый Структура;
		
		ПараметрыФормы.Вставить("мДатаНачалаПериодаОтчета", НачалоДня(Объект.ДатаНачала));
		ПараметрыФормы.Вставить("мСкопированаФорма",        мСкопированаФорма);
		ПараметрыФормы.Вставить("мДатаКонцаПериодаОтчета",  КонецДня(Объект.ДатаОкончания));
		ПараметрыФормы.Вставить("мПериодичность",           Объект.Периодичность);
		ПараметрыФормы.Вставить("Организация",              Объект.Организация);
		ПараметрыФормы.Вставить("мВыбраннаяФорма",          Объект.ВыбраннаяФорма);
		ПараметрыФормы.Вставить("ВидДокумента",             Объект.Вид);
		ПараметрыФормы.Вставить("ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417",
			РегламентированнаяОтчетностьКлиент.ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417());
		ПараметрыФормы.Вставить("НеОтображатьПредупреждение", НеОтображатьПредупреждение);
		ПараметрыФормы.Вставить("ПредставлениеВидаОтчета", 	Объект.НаименованиеОтчета);
		ПараметрыФормы.Вставить("мСохраненныйДок", 			мСохраненныйДок);
		ПараметрыФормы.Вставить("ОтчетОткрытИзФормыПомощника",   ОтчетОткрытИзФормыПомощника); // ДЕНЬГИ 
		
		ЭтоСтартоваяФорма = Объект.ВыбраннаяФорма = "ОсновнаяФорма";
		
		Если мСкопированаФорма <> Неопределено Тогда
			Если (ВладелецФормы.ИмяФормы = "Документ.РегламентированныйОтчет.Форма.ФормаСписка") Тогда
				ЭтоСтартоваяФорма = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			
			КлючУникальности = Объект.Ссылка;
			
			Если мСкопированаФорма = Неопределено Тогда
				
				ПараметрыФормы.Вставить("мСохраненныйДок", Объект.Ссылка);
				
				СуфиксФормы = Прав(СокрП(ПараметрыФормы.мВыбраннаяФорма), 7);
				Если Объект.ИспользоватьПомощникЗаполнения И СуфиксФормы < "2021кв1" Тогда
					
					// ДЕНЬГИ открытие старого помощника заполнения
					Если СуфиксФормы = "2014кв1" Тогда
						ВыбраннаяФорма = "ПомощникЗаполнения2011";
					Иначе
						ВыбраннаяФорма = "ПомощникЗаполнения" + СуфиксФормы;
					КонецЕсли;
					//ОткрытьФорму(ВариантФормыОтчета + Объект.ИсточникОтчета + ".Форма." + Объект.ВыбраннаяФорма);
					//Возврат;
					ИмяФормыОтчета = ВариантФормыОтчета + Объект.ИсточникОтчета + ".Форма." + ВыбраннаяФорма;
					
				Иначе
					ИмяФормыОтчета = ВариантФормыОтчета + Объект.ИсточникОтчета + ".Форма." + Объект.ВыбраннаяФорма;
				КонецЕсли; 
				
				Если ЭтоСтартоваяФорма Тогда
					ФормаОтчета = ПолучитьФорму(ИмяФормыОтчета, ПараметрыФормы, , ИмяФормыОтчета);
				Иначе
					ФормаОтчета = ПолучитьФорму(ИмяФормыОтчета, ПараметрыФормы, , КлючУникальности);
				КонецЕсли;
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаОтчета, "СтруктураРеквизитовФормы") Тогда
					ФормаОтчета.СтруктураРеквизитовФормы.Организация = Объект.Организация;
				КонецЕсли;
				
			Иначе
				
				ИмяФормыОтчета = ВариантФормыОтчета + Объект.ИсточникОтчета + ".Форма.ОсновнаяФорма";
				ФормаОтчета = ПолучитьФорму(ИмяФормыОтчета, ПараметрыФормы, , ИмяФормыОтчета);
				ФормаОтчета.Организация = Объект.Организация;
				
			КонецЕсли;
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ИнформацияОбОшибке.Причина = Неопределено Тогда
				Сообщение.Текст = НСтр("ru='При открытии формы регламентированного отчета произошла ошибка.'");
			ИначеЕсли СтрНайти(ИнформацияОбОшибке.Причина.Описание, ".Форма.") > 0 Тогда
				Сообщение.Текст = НСтр("ru='Отчет не может быть открыт. Устаревшая редакция формы отчета не поддерживается текущей версией конфигурации.'");
			Иначе
				Сообщение.Текст = ИнформацияОбОшибке.Причина.Описание;
			КонецЕсли;
			
			Сообщение.Сообщить();
			
			Возврат;
			
		КонецПопытки;
		
		Если СтандартнаяОбработка Тогда
			
			Если ЭтоСтартоваяФорма Тогда
				
				// Сначала попробуем найти его среди открытых стартовых форм.
				// Необходимо для предотвращения открытия нескольких стартовых форм одного отчета.
				НайденоОкно = Ложь;
				
				РегламентированнаяОтчетностьКлиент.ВебКлиентНайтиАктивизироватьОкно(ИмяФормыОтчета, ЭтаФорма, НайденоОкно);
				
				Если НайденоОкно <> Неопределено Тогда
					Если НайденоОкно Тогда
						
						Возврат;
						
					КонецЕсли;
				КонецЕсли;
				
				Если ВладелецФормы <> Неопределено Тогда
					
					ФормаОтчета.ВладелецФормы = ВладелецФормы;
					ВладелецФормы.Активизировать();
					
				КонецЕсли;
				
				ФормаОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
				
			КонецЕсли;
			
			ФормаОтчета.ЗакрыватьПриЗакрытииВладельца = Ложь;
			
			ФормаОтчета.Открыть();
			
		КонецЕсли;
		
	Иначе
		
		ОткрытьФорму("Справочник.РегламентированныеОтчеты.Форма.ФормаСписка");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти