////////////////////////////////////////////////////////////////////////////////
// ДеньгиВОблакеКлиентСервер
// обеспечивает доступ к подсистемам серверной части приложения 
// из автономной копии и из облачногов приложения.
//  
////////////////////////////////////////////////////////////////////////////////



#Область ПрограммныйИнтерфейс

// Возвращает строковое представление количества лицензий
//
//Параметры:
//	Количество
//
//Возвращаемое значение:
//	Строка
//
Функция КоличествоЛицензийСтрокой(Количество, Падеж = "И", Локализация = "ru_RU") Экспорт

	КличествоСтрокой = Формат(Количество, "ЧДЦ=0; ЧН=0; ЧГ=");
	Если Локализация = "ru_RU" Тогда
		
		Предмет = "лицензий";
		Если Прав(КличествоСтрокой, 1) = "1" Тогда
			Если Лев(Прав(КличествоСтрокой, 2), 1) <> 1 Тогда
				Если Падеж = "И" Тогда
					Предмет = "лицензия";
				Иначе
					Предмет = ?(Падеж = "Р", "лицензию", "лицензии");
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрНайти("2,3,4", Прав(КличествоСтрокой, 1)) > 0 Тогда
			Если Лев(Прав(КличествоСтрокой, 2), 1) <> 1 Тогда
				Предмет = "лицензии";
			КонецЕсли;
		Иначе
			Предмет = "лицензий";
		КонецЕсли;
		
		КличествоСтрокой = КличествоСтрокой + " " + Предмет;
		
	КонецЕсли;
	
	Возврат КличествоСтрокой
	
КонецФункции
 

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область Функции_константы

// Значения-константы для использования в других функциях

Функция АдресСервераМС() Экспорт
	Возврат "https://money1c.com/";
КонецФункции
Функция ИмяНастройкиСерверМС() Экспорт
	возврат "Сервер менеджера сервиса";
КонецФункции
Функция ИмяНастройкиСервисБыстройРегистрации() Экспорт
	возврат "Сервис быстрой регистрации";
КонецФункции
Функция ИмяНастройкиСервисВнешнегоИнтрефейса() Экспорт
	возврат "Сервис внешнего интерфейса";
КонецФункции
Функция ИмяНастройкиСервисБиллинга() Экспорт
	возврат "Сервис биллинга приложения";
КонецФункции
Функция ИмяНастройкиКодПриложения() Экспорт
	возврат "Код приложения на сервере";
КонецФункции
Функция ИмяНастройкиКодПромоРегистрации() Экспорт
	возврат "Код сайта промо-регистрации";
КонецФункции
Функция ИмяНастройкиПараметрыСоединения() Экспорт
	возврат "Параметры соединения";
КонецФункции
Функция ИмяНастройкиПараметрыСоединенияНаСервере() Экспорт
	возврат "Параметры соединения в облаке";
КонецФункции



#КонецОбласти 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти








