
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УзелПриИзменении(Элемент)
	УправлениеВидимостьюСервер();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюСервер()
	
	Элементы.КоличествоПериодов.Доступность        = Запись.Узел.МобильноеУстройство;
	Элементы.ВидПериода.Доступность                = Элементы.КоличествоПериодов.Доступность;
	Элементы.ПрежнееКоличествоПериодов.Доступность = Элементы.КоличествоПериодов.Доступность;
	Элементы.ПрежнееВидПериода.Доступность         = Элементы.КоличествоПериодов.Доступность;
	
КонецПроцедуры

