
Процедура РеквизитыОрганизацииСсылкаОбработкаНавигационнойСсылки(Организация, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "РеквизитыОрганизацииСсылка" Тогда
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", Организация);
		
		ФормаОрганизации = ПолучитьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
		
		// Чтобы обратить внимание пользователя на реквизиты основного банковского счета,
		// спозиционируемся в форме организации на поле НомерСчета.
		ЭлементНомерСчета = ФормаОрганизации.Элементы.Найти("Банк");
		Если ЭлементНомерСчета <> Неопределено Тогда
			ФормаОрганизации.ТекущийЭлемент = ЭлементНомерСчета;
		КонецЕсли;
		ФормаОрганизации.Открыть();
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры