#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СохраненныйДок = Неопределено;
	
	Если НЕ Параметры.Свойство("СохраненныйДок", СохраненныйДок) ИЛИ СохраненныйДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокПустой = Истина;
	АдресСвойстваСписокПустой = ПоместитьВоВременноеХранилище(СписокПустой, ЭтотОбъект.УникальныйИдентификатор);
	Список.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить(
		"АдресСвойстваСписокПустой", АдресСвойстваСписокПустой);
	
	Список.Параметры.УстановитьЗначениеПараметра("Организация",      СохраненныйДок.Организация);
	Список.Параметры.УстановитьЗначениеПараметра("ИсточникОтчета",   СохраненныйДок.ИсточникОтчета);
	Список.Параметры.УстановитьЗначениеПараметра("ДокументОтчета",   СохраненныйДок);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачалаНач",    НачалоДня(СохраненныйДок.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачалаКон",    КонецДня(СохраненныйДок.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияНач", НачалоДня(СохраненныйДок.ДатаОкончания));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияКон", КонецДня(СохраненныйДок.ДатаОкончания));
	
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоПоложительныйРезультатСдачи", Ложь);
	
	ПредставлениеПервогоОтчета = РегламентированнаяОтчетностьКлиентСервер.ПредставлениеДокументаРеглОтч(СохраненныйДок);
	ПредставлениеВторогоОтчета = НСтр("ru='< Не выбран >'");
	
	Элементы.ПредставлениеОтчетов.Заголовок = "1  " + ПредставлениеПервогоОтчета + Символы.ПС + "2  " + ПредставлениеВторогоОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокПустой = ПолучитьИзВременногоХранилища(АдресСвойстваСписокПустой);
	
	Если СписокПустой = Истина Тогда
		ПоказатьПредупреждение(, НСтр("ru='Нет доступных отчетов для сравнения в соответствующем периоде.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработатьВыборОтчета(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ПредставлениеВторогоОтчета = Элемент.ТекущиеДанные.ПредставлениеОтчета;
		Элементы.ВыбратьОтчет.Доступность = Истина;
	Иначе
		ПредставлениеВторогоОтчета = НСтр("ru='< Не выбран >'");
		Элементы.ВыбратьОтчет.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.ПредставлениеОтчетов.Заголовок = "1  " + ПредставлениеПервогоОтчета + Символы.ПС
											+ "2  " + ПредставлениеВторогоОтчета;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	СписокПустой = Истина;
	
	Для Каждого СтрокаСписка Из Строки Цикл
		ДокументРеглОтчета = СтрокаСписка.Значение.Данные["РегламентированныйОтчет"];
		Если ТипЗнч(ДокументРеглОтчета) = Тип("ДокументСсылка.РегламентированныйОтчет") Тогда
			СтрокаСписка.Значение.Данные["ПредставлениеОтчета"] =
				РегламентированнаяОтчетностьКлиентСервер.ПредставлениеДокументаРеглОтч(ДокументРеглОтчета);
			СписокПустой = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	АдресСвойстваСписокПустой = "";
	Настройки.ДополнительныеСвойства.Свойство("АдресСвойстваСписокПустой", АдресСвойстваСписокПустой);
	
	Если ЭтоАдресВременногоХранилища(Строка(АдресСвойстваСписокПустой)) Тогда
		ПоместитьВоВременноеХранилище(СписокПустой, АдресСвойстваСписокПустой);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьОтчет(Команда)
	
	ОбработатьВыборОтчета(Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборОтчета(СписокОтчетов)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ДокументОтчетаПравый", СписокОтчетов.ТекущиеДанные.РегламентированныйОтчет);
	
	ЭтаФорма.Закрыть(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти