
//#Область ПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СписокТеговДляКартинки(ВключатьСистемные = Ложь) Экспорт
	
	Результат = Новый Массив();
	Если ВключатьСистемные Тогда
		Результат.Добавить("Разделы"); //0
		Результат.Добавить("Сервис");  //1
	КонецЕсли;
	Результат.Добавить("Статьи");    //2
	Результат.Добавить("Кошельки");  //3
	Результат.Добавить("Контакты");  //4
	Результат.Добавить("Имущество"); //5
	Результат.Добавить("Финцели");   //6
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти
