////////////////////////////////////////////////////////////////////////////////
// АналитикаСтатейВызовСервера: обеспечивает упралвение аналитикой и использование аналитики 
//		в формах операций
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик события изменения статьи
Процедура ПриИзмененииСтатьиВТабличнойЧасти(Форма, Статья, ИмяТабличнойЧасти, ИдентификаторСтроки) Экспорт

	АналитикаСтатей.ПриИзмененииСтатьиВТабличнойЧасти(Форма, Статья, ИмяТабличнойЧасти, ИдентификаторСтроки);

КонецПроцедуры

// Обработчик события формы документов
Процедура ПриИзмененииСтатьиВШапке(Статья, ПакетАналитикиСтатьи) Экспорт
	
	АналитикаСтатей.ПриИзмененииСтатьиВШапке(Статья, ПакетАналитикиСтатьи);
	
КонецПроцедуры


#КонецОбласти

