
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Выполняет проверку корректности записей, исправляет ошибки
Процедура ПроверитьОперацииПоДатамРасписания(БылиОшибки = Ложь) Экспорт
	
	БылиОшибки = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыРасписаний.ВладелецРасписания КАК ВладелецРасписания,
	|	ДатыРасписаний.ПлановаяОперация КАК ПлановаяОперация,
	|	ОперацииШаблонов.Операция КАК ОперацияШаблона,
	|	ДатыРасписаний.ПлановаяДата КАК ПлановаяДата,
	|	ДатыРасписаний.АктуальнаяДата КАК АктуальнаяДата,
	|	ДатыРасписаний.Выполнено КАК Выполнено,
	|	ДатыРасписаний.ПлановаяОперация.Проведен КАК ОперацияПроведена
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииШаблонов КАК ОперацииШаблонов
	|		ПО (ДатыРасписаний.ВладелецРасписания = ОперацииШаблонов.Шаблон
	|		И ДатыРасписаний.ПлановаяДата = ОперацииШаблонов.ПлановаяДата)
	|ГДЕ
	|	ДатыРасписаний.ВладелецРасписания <> Неопределено
	|	И НЕ ДатыРасписаний.ВладелецРасписания.Ссылка ЕСТЬ NULL
	|	И ДатыРасписаний.ПлановаяОперация <> Неопределено
	|	И НЕ ДатыРасписаний.ПлановаяОперация.Ссылка ЕСТЬ NULL
	|	И (ОперацииШаблонов.Операция = Неопределено
	|		ИЛИ ОперацииШаблонов.Операция.Ссылка ЕСТЬ NULL)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
			Набор.Отбор.Шаблон.Установить(Выборка.ВладелецРасписания);
			Набор.Отбор.Операция.Установить(Выборка.ПлановаяОперация);
			
			Запись = Набор.Добавить();
			Запись.Шаблон       = Выборка.ВладелецРасписания;
			Запись.Операция     = Выборка.ПлановаяОперация;
			Запись.ПлановаяДата = Выборка.ПлановаяДата;
	
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,, Выборка.ПлановаяОперация,
				СтрШаблон("Не удалось записать плановую операцию ""%1"" для шаблона ""%2""
				|%2", Выборка.ПлановаяОперация, Выборка.ВладелецРасписания, ПодробноеПредставлениеОшибки(Ошибка))
				);
		КонецПопытки;
		
		Если Выборка.ОперацияПроведена <> Выборка.Выполнено Тогда
			
			Набор = РегистрыСведений.ДатыРасписаний.СоздатьНаборЗаписей();
			Набор.Отбор.ВладелецРасписания.Установить(Выборка.ВладелецРасписания);
			Набор.Отбор.ПлановаяДата.Установить(Выборка.ПлановаяДата);
			Набор.Прочитать();
			Если Не Набор.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Набор[0].Выполнено = Выборка.ОперацияПроведена;
				Набор.Записать(Истина);
			Исключение
				БылиОшибки = Истина;
				Ошибка = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,, Выборка.ПлановаяОперация,
					СтрШаблон("Не удалось записать плановую операцию ""%1"" для шаблона ""%2""
					|%2", Выборка.ПлановаяОперация, Выборка.ВладелецРасписания, ПодробноеПредставлениеОшибки(Ошибка))
					);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатыРасписаний.ВладелецРасписания
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
	|ГДЕ
	|	ДатыРасписаний.ВладелецРасписания.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Не ЗначениеЗаполнено(Выборка.ВладелецРасписания) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Набор = РегистрыСведений.ДатыРасписаний.СоздатьНаборЗаписей();
			Набор.Отбор.ВладелецРасписания.Установить(Выборка.ВладелецРасписания);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить записи даты расписания для шаблона ""%1"" (%2)
				|%3", Выборка.ВладелецРасписания, ТипЗнч(Выборка.ВладелецРасписания), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
		
		Попытка
			Набор = РегистрыНакопления.ОборотыПлановыхОпераций.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.ВладелецРасписания);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить обороты плановых операций для шаблона ""%1"" (%2)
				|%3", Выборка.ВладелецРасписания, ТипЗнч(Выборка.ВладелецРасписания), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли