#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

//@skip-warning
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка И НеВыполнятьПриЗагрузкеДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Отказ И Замещение И ЭтотОбъект.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВладелецРасписания", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ВладелецРасписания.Значение), ЭтотОбъект.Отбор.ВладелецРасписания.Значение, ""));
		Запрос.УстановитьПараметр("ПлановаяДата", ?(ЗначениеЗаполнено(ЭтотОбъект.Отбор.ПлановаяДата.Значение),  ЭтотОбъект.Отбор.ПлановаяДата.Значение, ""));
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыРасписаний.ВладелецРасписания,
		|	ДатыРасписаний.ПлановаяОперация
		|ИЗ
		|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
		|ГДЕ
		|	(&ВладелецРасписания = """"
		|			ИЛИ ДатыРасписаний.ВладелецРасписания = &ВладелецРасписания)
		|	И (&ПлановаяДата = """"
		|			ИЛИ ДатыРасписаний.ПлановаяДата = &ПлановаяДата)
		|	И ДатыРасписаний.ПлановаяОперация <> Неопределено";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ВладелецРасписания) И ЗначениеЗаполнено(Выборка.ПлановаяОперация) Тогда
				Запись = РегистрыСведений.ОперацииШаблонов.СоздатьМенеджерЗаписи();
				Запись.Шаблон   = Выборка.ВладелецРасписания;
				Запись.Операция = Выборка.ПлановаяОперация;
				Запись.Прочитать();
				Если Запись.Выбран() Тогда
					Запись.Удалить();
				КонецЕсли; 
			КонецЕсли; 
		
		КонецЦикла; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка И НеВыполнятьПриЗагрузкеДанных() Тогда
		Возврат;
	КонецЕсли;
	
	СписокОпераций = Новый Массив;
	
	Если НЕ Отказ И ЭтотОбъект.Количество() > 0 Тогда
		
		Для Каждого ЗаписьЭтогоОбъекта Из ЭтотОбъект Цикл
			
			Если ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.АктуальнаяДата) И ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.ПлановаяОперация) Тогда
				
				Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
				Набор.Отбор.Шаблон.Установить(ЗаписьЭтогоОбъекта.ВладелецРасписания);
				Набор.Отбор.Операция.Установить(ЗаписьЭтогоОбъекта.ПлановаяОперация);
				
				ЗаписьОперацииШаблона = Набор.Добавить();
				ЗаписьОперацииШаблона.Шаблон       = ЗаписьЭтогоОбъекта.ВладелецРасписания;
				ЗаписьОперацииШаблона.Операция     = ЗаписьЭтогоОбъекта.ПлановаяОперация;
				ЗаписьОперацииШаблона.ПлановаяДата = ЗаписьЭтогоОбъекта.ПлановаяДата;
				Если ОбменДанными.Загрузка Тогда
					ОбменДаннымиСервер.УстановитьОбменДаннымиЗагрузка(Набор, Истина, Ложь, ОбменДанными.Отправитель);
				КонецЕсли;
				Набор.Записать(Истина);
				
				Если ЗначениеЗаполнено(ЗаписьЭтогоОбъекта.ВладелецРасписания) 
					И ЗаписьЭтогоОбъекта.ВладелецРасписания <> ЗаписьЭтогоОбъекта.ПлановаяОперация Тогда
					СписокОпераций.Добавить(ЗаписьЭтогоОбъекта.ПлановаяОперация);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СписокОпераций) Тогда
			// Поскольку операции добавлены в даты шаблона, они не могут оставаться запланированными без шаблона
			ПлановыеОперации.УдалитьДатуОперацийЗапланированныхБезШаблона(СписокОпераций, 
					ОбменДанными.Загрузка, ОбменДанными.Отправитель);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ВспомогательныйФункционал

Функция НеВыполнятьПриЗагрузкеДанных()
	
	Возврат ЗначениеЗаполнено(ОбменДанными.Отправитель)
		И ТипЗнч(ОбменДанными.Отправитель) = Тип("ПланОбменаСсылка.СинхронизацияАвтономныхКопий")
		И Не ОбменДанными.Отправитель.МобильноеУстройство;
	
КонецФункции

#КонецОбласти

#КонецЕсли
