///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Распарсивает тело запроса и проверяет наличие обязательных параметров
//В случае отсутствия обязательных параметров устанавливается код ошибки в Ответ.general.response и
//флаг "Ошибка" в возвращаемом результате
//
//Параметры:
//	- Запрос - HTTP-запрос
//
//Возвращаемое значение:
//	Структура - содержит объекты запроса и ответа на него
//		* Ошибка - булево - Истина, если запрос содержит ошибку или не может быть прочитан
//		* Ответ - структура, предназначенная для в ответ на запрос
//			*	general - обязательный объект ответа на запрос
//		* СтруктураЗпроса - структура, заполняется из тела запроса
//			*	general - обязательный параметр запроса
//		* Метод - строка - вызываемый метод в execute
//		* РежимОтладки - булево - истина, если в структуре запроса был указан ключ debug
//		* ВсеКодыСостояния - Структура - см. ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера()
//
Функция РазобратьЗапросExecute(Запрос) Экспорт
	
	Результат = НовыйСтруктураЗапросаИОтвета();

	КодОшибкиЗапроса = Результат.ВсеКодыСостояния.ОшибкаЗапроса.Код;
	
	// Получение структуры запроса
	ТекстОшибки = "";
	СтруктураЗапроса = ПрочитатьТелоЗапроса(Запрос, 
					"Дата,ДатаОстатков,НачалоДействия,ЗавершениеДействия,Срок,Старт,Финиш", 
					ТекстОшибки);
	Если СтруктураЗапроса = Неопределено Тогда
		ЗаписатьПроблемуВСтруктуруОтвета(Результат.Ответ, КодОшибкиЗапроса,
			НСтр("ru='Не удалось прочитать тело запроса'"),
			ТекстОшибки);
		 
		Результат.Ошибка = Истина;;
		Возврат Результат;
	КонецЕсли;
	
	// чтение обязательного параметра general
	Если Не СтруктураЗапроса.Свойство("general") Или Не ЗначениеЗаполнено(СтруктураЗапроса.general) Тогда
		ЗаписатьПроблемуВСтруктуруОтвета(Результат.Ответ, КодОшибкиЗапроса,
			НСтр("ru='Неверный формат запроса'"),
			НСтр("ru='В параметрах запроса отстутствует обязательный объект ""general""'"));
		 
		Результат.Ошибка = Истина;;
		Возврат Результат;
	КонецЕсли;
	
	// проверка объекта general
	ОтсутствующиеКлючи = "";
	ПроверитьНаличиеКлючаВСтруктуре(СтруктураЗапроса.general, "ib", ОтсутствующиеКлючи);
	ПроверитьНаличиеКлючаВСтруктуре(СтруктураЗапроса.general, "cib", ОтсутствующиеКлючи);
	ПроверитьНаличиеКлючаВСтруктуре(СтруктураЗапроса.general, "mobile", ОтсутствующиеКлючи);
	ПроверитьНаличиеКлючаВСтруктуре(СтруктураЗапроса.general, "version", ОтсутствующиеКлючи);
	ПроверитьНаличиеКлючаВСтруктуре(СтруктураЗапроса.general, "format", ОтсутствующиеКлючи);
	ПроверитьНаличиеКлючаВСтруктуре(СтруктураЗапроса.general, "method", ОтсутствующиеКлючи);
	Если ЗначениеЗаполнено(ОтсутствующиеКлючи) Тогда
		ЗаписатьПроблемуВСтруктуруОтвета(Результат.Ответ, КодОшибкиЗапроса,
			НСтр("ru='Неверный формат запроса'"),
			СтрШаблон(НСтр("ru='Некорректный запрос: в объекте ""general"" отсутствуют обязательные параметры: %1'"), ОтсутствующиеКлючи));
		 
		Результат.Ошибка = Истина;;
		Возврат Результат;
	КонецЕсли;
	
	// установка режима отладки
	Если СтруктураЗапроса.general.Свойство("debug") Тогда
		СтруктураЗапроса.Вставить("РежимОтладки", Истина);
	КонецЕсли;
	
	// Заполнение остальных параметров запроса
	Результат.СтруктураЗапроса = СтруктураЗапроса;
	Результат.Метод = СтруктураЗапроса.general.method;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие указанных ключей в структуре ЗапросИОтвет.СтруктураЗапроса
//При отсутствии хотя бы одного ключа в Ответ.general.response устанавливается код 10400
//и заполняется информация об ошибке
//
//Параметры:
//	* ЗапросИОтвет - структура, содержащая информацию о запросе и ответе (см. РазобратьЗапросExecute())
//	* ИменаПараметров - строка с именами проверяемых параметров, разделенных запятой
//
//Возвращаемое значение
//	булево - истина, если в ЗапросИОтвет.СтруктураЗапроса указаны все параметры, перечисленные в ИменаПараметров
// 
Функция УказаныПараметрыМетодаExecute(ЗапросИОтвет, ИменаПараметров) Экспорт
	
	МассивИмен = СтрРазделить(ИменаПараметров, ","+Символы.ПС, Ложь);
	ОтсутствующиеПараметры = "";
	Для Каждого ИмяПараметра Из МассивИмен Цикл
		ПроверитьНаличиеКлючаВСтруктуре(ЗапросИОтвет.СтруктураЗапроса, ИмяПараметра, ОтсутствующиеПараметры);
	КонецЦикла;
	
	Результат = Не ЗначениеЗаполнено(ОтсутствующиеПараметры);
	Если Не Результат Тогда
		ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
		ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, ВсеКоды.ОшибкаЗапроса.Код,
			НСтр("ru='В запросе отсутствуют обязательные параметры'"),
			СтрШаблон(НСтр("ru='Для вызова метода %1 в запросе не хватает параметров: %2'"), 
				ЗапросИОтвет.Метод, ОтсутствующиеПараметры));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьПроблемуВСтруктуруОтвета(СтруктураОтвета, Код, Сообщение, ПолныйТекст, Ошибка = Истина) Экспорт
	
	СтруктураОтвета.general.response = Код;
	СтруктураОтвета.general.message = Сообщение;
	СтруктураОтвета.general.errordescription = ПолныйТекст;
	Если Ошибка Тогда
		СтруктураОтвета.general.error = Истина;
	Иначе
		СтруктураОтвета.general.unable = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ОтветМетодаExecute(СтруктураОтвета, Метод, Узел) Экспорт
	
	РезультатСтрокой = "";
		
	#Если ВнешнееСоединение Тогда
		Возврат СтруктураОтвета;
	#Иначе
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Charset", "UTF-8");
		Ответ.Заголовки.Вставить("Accept-Language", "ru-RU");
		Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
		
		ПриведенныйОтвет = ПарсерJSONВызовСервера.ПодготовитьДанныеДляЗаписиВJSON(СтруктураОтвета);
		РезультатСтрокой = ПарсерJSON.ДанныеВСтрокуJSON(ПриведенныйОтвет);
		Ответ.УстановитьТелоИзСтроки(РезультатСтрокой);
		
		ОписаниеОтвета = ПроцессыОбменаПовтИсп.ОписаниеСостоянияПоКоду(СтруктураОтвета.general.response);
		УровеньЖурнала = Неопределено;
		Если ОписаниеОтвета.ЯвляетсяОшибкой Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		ИначеЕсли Не ОписаниеОтвета.ЯвляетсяУспехом Тогда
			УровеньЖурнала = УровеньЖурналаРегистрации.Предупреждение;
		КонецЕсли;
		
		Если УровеньЖурнала <> Неопределено Тогда
			ЗаписьЖурналаРегистрации("Обмен данными.hs/moneysynch/execute." + Метод,
					УровеньЖурнала, , Узел,
					СтрШаблон("Возвращен ответ с кодом: %1 - %2
					|Текстовое представление результата:
					|%3", Формат(СтруктураОтвета.general.response, "ЧДЦ=0; ЧГ=;"), 
							ОписаниеОтвета.ТекстОписания, 
							СокрЛП(Сред(РезультатСтрокой, 1, 1000))));
		КонецЕсли;
		
		Возврат Ответ;
			
	#КонецЕсли 
	
КонецФункции

Функция ПроверитьРегистрациюУзла(ЗапросИОтвет) Экспорт
	
	СтруктураЗапроса = ЗапросИОтвет.СтруктураЗапроса;
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
	КодУзлаКорреспондента = СтруктураЗапроса.general.ib;
	КодЦБ = СтруктураЗапроса.general.cib;
	
	Если КодЦБ <> "000" И КодЦБ <> СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла(ЗапросИОтвет.ИмяПланаОбмена) Тогда
		ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, ВсеКоды.ЧужойСервер.Код, 
				НСтр("ru='Информационная база привязана к другому серверу'"),
				"");
		Возврат Ложь;
	КонецЕсли;
	
	УзелКорреспондента = СинхронизацияАвтономныхКопий.УзелПланаОбменаПоКоду(ЗапросИОтвет.ИмяПланаОбмена, 
				КодУзлаКорреспондента);
	Если Не ЗначениеЗаполнено(УзелКорреспондента) Тогда
		ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, ВсеКоды.НеЗарегистрирован.Код, 
				НСтр("ru='Информационная база не зарегистрирована на сервере'"),
				"");
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросИОтвет.УзелКорреспондента = УзелКорреспондента;
	Возврат Истина;
	
КонецФункции



Функция СтандартныйОтвет(Код, ОбъектРезультата, ИмяСервиса = "HTTP-сервис") Экспорт 
	
	#Если ВнешнееСоединение Тогда
		Возврат ОбъектРезультата;
	#Иначе 
		Ответ = Новый HTTPСервисОтвет(Код);
		Ответ.Заголовки.Вставить("Charset", "UTF-8");
		Ответ.Заголовки.Вставить("Accept-Language", "ru-RU");
		Если ТипЗнч(ОбъектРезультата) = Тип("ДвоичныеДанные") Тогда
			Ответ.УстановитьТелоИзДвоичныхДанных(ОбъектРезультата);
			Ответ.Заголовки.Вставить("Content-Type", "application/octet-stream");
			РезультатСтрокой = "двоичные данные";
			
		ИначеЕсли ТипЗнч(ОбъектРезультата) = Тип("Строка") Тогда
			Ответ.УстановитьТелоИзСтроки(ОбъектРезультата);
			Ответ.Заголовки.Вставить("Content-Type", "text/plain;charset=UTF-8");
			РезультатСтрокой = ОбъектРезультата;
			
		ИначеЕсли ТипЗнч(ОбъектРезультата) = Тип("ИнформацияОбОшибке") Тогда
			Ответ.УстановитьТелоИзСтроки(КраткоеПредставлениеОшибки(ОбъектРезультата));
			Ответ.Заголовки.Вставить("Content-Type", "text/plain;charset=UTF-8");
			РезультатСтрокой = ОбъектРезультата;
			
		Иначе
			РезультатСтрокой = ПарсерJSON.ДанныеВСтрокуJSON(ОбъектРезультата);
			Ответ.УстановитьТелоИзСтроки(РезультатСтрокой);
			Ответ.Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
			
		КонецЕсли;
		
		Если Код < 200 Или Код >= 400 Тогда
			ЗаписьЖурналаРегистрации("Обмен данными.http-сервис." + ИмяСервиса,
					УровеньЖурналаРегистрации.Ошибка, , ,
					СтрШаблон("Возвращен стандартный http-ответ с кодом: %1
					|Текстовое представление результата:
					|%2", Код, СокрЛП(Сред(РезультатСтрокой, 1, 1000))));
		КонецЕсли;
		
		Возврат Ответ;
		
	#КонецЕсли 
	
КонецФункции

// Возвращает значение параметра с указанным именем из параметров http-запроса
//Если заданы допустимые значения (строка, через запятую), значение параметра проверяется на допустимость
Функция ЗначениеПараметраЗапроса(Запрос, ИмяПараметра, ДопустимыеЗначения = Неопределено) Экспорт
	
	Результат = НРег(Запрос["ПараметрыURL"].Получить(ИмяПараметра));
	Если Не ЗначениеЗаполнено(Результат) Или ДопустимыеЗначения = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтрНайти(НРег(ДопустимыеЗначения) + ",", НРег(Результат) + ",") = 0 Тогда
		Возврат NULL;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Пытается прочитать текст запроса
Функция ПрочитатьТелоЗапроса(Запрос, ПоляТипаДаты = "", ТекстОшибки = "") Экспорт

	ТекстОшибки = "";
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(ТелоЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат ПарсерJSON.ДанныеИзСтрокиJSON(ТелоЗапроса, ПоляТипаДаты);
	Исключение
		
		ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось получить данные из json:%1%2'"), Символы.ПС, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено
		
	КонецПопытки; 

КонецФункции

// Возвращает текст, подготовленный для вставки в ответ
//
//Параметры:
//	Ошибка - ИнформацияОбОшибке или Строка 
//	ИмяСервиса - Строка - имя сервиса, который возвращает ошибку
//
//Возвращаемое значение:
//	Строка - описание ошибки
//
Функция ТекстОшибкиДляСтандартногоОтвета(Ошибка, ИмяСервиса) Экспорт
	
	Результат = ИмяСервиса + ": ";
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		Результат = Результат + ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		Результат = Результат + Ошибка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Проверяет наличие обязательных ключей в структуре, полученной из тела запроса.
//Информация об отсутствующих ключах будет указана в параеметре ТекстОшибки
//
//Параметры:
//	СтруктураТела - Структура, которую нужно проверить
//	ОбязательныеКлючи - Строка - имена обязательных ключей через запятую
//	ИмяСервиса - Строка - имя сервиса, который возвращает ошибку
//	Ответ - HTTPСервисОтвет или Неопределено - возвращаемый параметр. 
//		В случае ошибки заполняется HTTPСервисОтвет с информацией об ошибке
//
//Возвращаемое значение:
//	Булево - Истина, если все ключи есть в наличии
//
Функция ПроверитьСтруктуруТелаЗапроса(СтруктураТела, ОбязательныеКлючи, ИмяСервиса, Ответ = Неопределено) Экспорт
	
	Если ТипЗнч(СтруктураТела) <> Тип("Структура") Тогда
		ТекстОшибки = ТекстОшибкиДляСтандартногоОтвета(НСтр("ru='Тело запроса не является структурой'"), ИмяСервиса);
		Ответ = СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбязательныеКлючи) Тогда
		Возврат Истина;
	КонецЕсли;
	
	СписокКлючей = СтрРазделить(ОбязательныеКлючи, ",");
	ТекстОшибки = "";
	Для каждого Ключ Из СписокКлючей Цикл
		Если Не СтруктураТела.Свойство(Ключ) Тогда
			ТекстОшибки = ТекстОшибки 
					+ ?(ТекстОшибки = "", "", ", ")
					+ Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекстОшибки <> "" Тогда
		ТекстОшибки = ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='В теле запроса отсутствуют обязательные параметры: %1'"), ТекстОшибки), 
				ИмяСервиса);
		Ответ = СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат ПустаяСтрока(ТекстОшибки);
	
КонецФункции 


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеКлючаВСтруктуре(Источник, КлючВИсточнике, ОтсутствующиеКлючи)
	
	Если Не Источник.Свойство(КлючВИсточнике) Тогда
		ОтсутствующиеКлючи = ОтсутствующиеКлючи 
			+ ?(ОтсутствующиеКлючи = "", "", ", ")
			+ КлючВИсточнике;
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйGeneralОтветаНаЗапрос()
	
	Результат = Новый Структура;
	Результат.Вставить("response", 10200); // код результата обработки команды
	Результат.Вставить("error", Ложь); // истина, если в запросе или при его обработки обнаружена ошибка
	Результат.Вставить("unable", Ложь); // истина, если невозможно выполнить команду по причинам, не связанным с ошибками
	Результат.Вставить("message", ""); // сообщение пользователю
	Результат.Вставить("errordescription", ""); // полный текст ошибки
	Результат.Вставить("version", Метаданные.Версия); // версия конфигурации на сервере
	Результат.Вставить("format", СинхронизацияАвтономныхКопийКлиентСервер.ТекущаяВерсияФормата()); // версия формата данных в ответе сервера
	Результат.Вставить("cib", СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла()); // ид сервера, с которого возвращается результат
	
	Возврат Результат;
	
КонецФункции

Функция НовыйСтруктураЗапросаИОтвета()
	
	Результат  = Новый Структура;
	Результат.Вставить("Ошибка", Ложь); // устанавливается в Истина, если не пройдены общие проверки запроса
	Результат.Вставить("РежимОтладки", Ложь); // считывается из СтруктураЗапроса.general.debug (не обязательный)
	Результат.Вставить("Ответ", Неопределено);  // Структура, содержит объект general, остальное добавляется
												// обработчиком запроса в ДеньгиСинхронизация.executePOST()
	Результат.Вставить("СтруктураЗапроса", Неопределено); // содержит всю структуру из тела запроса вместе с general
	Результат.Вставить("Метод", ""); // Строка - заполняется из СтруктураЗапроса.general.method. Запрос, на который нужно вернуть ответв
	Результат.Вставить("ВсеКодыСостояния", ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера());
	Результат.Вставить("ВсеКодыРезультатов", ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий());
	Результат.Вставить("ИмяПланаОбмена", ""); // определяется по режиму работы
	Результат.Вставить("УзелКорреспондента", Неопределено); // ссылка на план обмена, если узел зарегистрирован
	
	// Заполнение значениями по умолчанию
	Режим                     = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Результат.ИмяПланаОбмена  = ?(Режим = "ЦентрМобильных", "МобильноеПриложение", "СинхронизацияАвтономныхКопий");
	Результат.Ответ           = Новый Структура("general", НовыйGeneralОтветаНаЗапрос());

	Возврат Результат;
	
КонецФункции
#КонецОбласти