///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

Функция УзелЦентральнойБазы(ИмяПланаОбмена = "СинхронизацияАвтономныхКопий") Экспорт

	Результат = Неопределено;
	МенеджерПланаОбмена = ПланыОбмена[ИмяПланаОбмена];
	Если ЭтоЦентральнаяБаза() Тогда
		
		Результат = МенеджерПланаОбмена.ЭтотУзел();
		Если СтрДлина(СокрП(Результат.Код)) < 30 И Результат.Код <> "000" Тогда
			// код "000" может быть заменен на код из пакета обмена
			СинхронизацияАвтономныхКопийВызовСервера.ОбновитьИнформациюЭтогоУзла(Результат, НСтр("ru='Центральная база'"));
		КонецЕсли;
		
	Иначе
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ДеньгиВОблаке") Тогда
			МодульОбмена = ОбщегоНазначения.ОбщийМодуль("ДеньгиОбменСЦентральнойБазой");
			Результат = МодульОбмена.ПроверитьСоздатьУзелЦентральнойБазы();
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция ЭтоЦентральнаяБаза() Экспорт
	
	Возврат ОбщегоНазначения.РазделениеВключено() 
		Или ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "ЦентрМобильных";
	
КонецФункции

Функция ЭтоАвтономнаяКопия() Экспорт
	
	Возврат Не ОбщегоНазначения.РазделениеВключено() 
		И ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "КлиентОблака";
	
КонецФункции

Функция ПараметрыОбменаСУзлом(УзелКорреспондента, ДляЗаписиВJSON = Ложь) Экспорт
	Возврат СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(УзелКорреспондента, ДляЗаписиВJSON);	
КонецФункции

Функция СценарийОбменаДаннымиСЦентральнойБазой(УзелЦБ = Неопределено) Экспорт
	
	Результат = Справочники.СценарииОбменовДанными.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(УзелЦБ) Тогда
		УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УзелЦБ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелЦБ", УзелЦБ);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СценарииОбменовДаннымиНастройкиОбмена.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СценарииОбменовДанными.НастройкиОбмена КАК СценарииОбменовДаннымиНастройкиОбмена
	|ГДЕ
	|	СценарииОбменовДаннымиНастройкиОбмена.УзелИнформационнойБазы = &УзелЦБ
	|	И СценарииОбменовДаннымиНастройкиОбмена.ВидТранспортаОбмена = Значение(Перечисление.ВидыТранспортаСообщенийОбмена.WS)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти

