&НаКлиенте 
Перем НастройкиЗапуска;
&НаКлиенте 
Перем НачалоОжиданияПлатежнойСсылки;
&НаКлиенте 
Перем СообщитьРезультатПроверкиОплаты;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КоличествоЛицензий.СписокВыбора.Очистить();
	Для Счетчик = 1 По 10 Цикл
		Элементы.КоличествоЛицензий.СписокВыбора.Добавить(Счетчик, ДеньгиВОблакеКлиентСервер.КоличествоЛицензийСтрокой(Счетчик, "И"));
	КонецЦикла;
	Элементы.КоличествоЛицензий.СписокВыбора.Добавить(-111, НСтр("ru='без ограничений'"));
	
	Если Параметры.Свойство("КоличествоЛицензий") И ЗначениеЗаполнено(Параметры.КоличествоЛицензий) Тогда
		КоличествоЛицензий = Параметры.КоличествоЛицензий;
	Иначе
		КоличествоЛицензий = 1;
	КонецЕсли;
	
	
	Сегодня = НачалоДня(ТекущаяДатаКлиентСервер());
	Если Параметры.Свойство("ДатаНачала") И ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
		ДатаНачала = Макс(Параметры.ДатаНачала, Сегодня);
	Иначе
		ДатаНачала = Сегодня;
	КонецЕсли;
	
	Параметры.Свойство("НеиспользованнаяСумма", НеиспользованнаяСумма);
	Параметры.Свойство("СписокТарифов",         СписокТарифов);
	
	ОбновитьСписокВыбораСрока(СписокТарифов, Элементы.ВариантПодписки, КоличествоЛицензий = -111, ВариантПодписки);
	Если Параметры.Свойство("Вариант") И Параметры.Вариант <> Неопределено Тогда
		ВариантПодписки = Параметры.Вариант;
	Иначе
		ВариантПодписки = Элементы.ВариантПодписки.СписокВыбора.Количество() - 1;
	КонецЕсли;
	
	ПересчитатьСтрокиИСуммы(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоЛицензийПриИзменении(Элемент)
	
	Если КоличествоЛицензий = 0 Тогда
		КоличествоЛицензий = -111;
	КонецЕсли;
	
	ОбновитьСписокВыбораСрока(СписокТарифов, Элементы.ВариантПодписки, КоличествоЛицензий = -111, ВариантПодписки);
	ПересчитатьСтрокиИСуммы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПодпискиПриИзменении(Элемент)
	ПересчитатьСтрокиИСуммы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Сегодня = НачалоДня(ТекущаяДатаКлиентСервер());
	Если ДатаНачала < Сегодня Тогда
		ДатаНачала = Сегодня;
	КонецЕсли;
	
	ПересчитатьСтрокиИСуммы(ЭтотОбъект);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОжиданияОплатыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьПлатежнуюСсылку();
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьОжидание(Команда)
	ОтключитьОбработчикОжидания("Подключаемый_ПроверкаЗавершенияОплаты");
	ОтключитьОбработчикОжидания("НачатьФоновоеЗадание");
	ОтменитьФоновоеЗаданиеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВПоддержку(Команда)
	
	ОчиститьСообщения();
	ОтправитьСообщениеВПоддержку();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПодписку(Команда)
	
	ОчиститьСообщения();
	ОтключитьОбработчикОжидания("Подключаемый_ПроверкаЗавершенияОплаты");
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаПокупка;
	
КонецПроцедуры

&НаКлиенте
Процедура Купить(Команда)
	ОчиститьСообщения();
	ПолучитьПлатежнуюСсылку();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОплату(Команда)
	
	ОчиститьСообщения();
	ОтключитьОбработчикОжидания("Подключаемый_ПроверкаЗавершенияОплаты");
	СообщитьРезультатПроверкиОплаты = Истина;
	ПроверитьСозданиеПодписки();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


#Область Обновление_информации_в_фоне

&НаКлиенте
Процедура ПроверитьСозданиеПодписки()
	
	Если Не ЗначениеЗаполнено(ИДУниверсальногоОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	Действие = "Проверка оформления подписки";
	
	Если Элементы.ГруппаСтраницФормы.ТекущаяСтраница <> Элементы.СтраницаОжижанияОплаты Тогда
		Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОжижанияОплаты;
	КонецЕсли;
	Элементы.ИконкаОжиданияОплаты.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
	
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Проверка оформления подписки");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПроверитьСозданиеПодпискиПоЗаявкеВФоне");
	
	НастройкиЗапуска.ПараметрыМетода = Новый Структура;
	НастройкиЗапуска.ПараметрыМетода.Вставить("ИДУниверсальногоОбъекта",  ИДУниверсальногоОбъекта);
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 0.7, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПлатежнуюСсылку()
	
	Действие = "Получение плтежной ссылки из облака";
	
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Получение информации о подписках");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ЗаказатьПлатежнуюСсылкуВФоне");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПроверитьГотовностьПлатежнойСсылкиВФоне");
	
	НастройкиЗапуска.ПараметрыМетода = Новый Структура;
	НастройкиЗапуска.ПараметрыМетода.Вставить("КодТарифа",          КодТарифа);
	НастройкиЗапуска.ПараметрыМетода.Вставить("ВариантПодписки",    ВариантПодписки);
	НастройкиЗапуска.ПараметрыМетода.Вставить("НачалоДействия",     ДатаНачала);
	НастройкиЗапуска.ПараметрыМетода.Вставить("ОкончаниеДействия",  РасчетноеОкончание);
	НастройкиЗапуска.ПараметрыМетода.Вставить("КоличествоЛицензий", КоличествоЛицензий);
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 0.7, Истина);
	
	НачалоОжиданияПлатежнойСсылки = ТекущаяДатаКлиентСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьГотовностьПлатежнойСсылки(ИДУниверсальногоОбъекта)
	
	Если ТекущаяДатаКлиентСервер() - 280 > НачалоОжиданияПлатежнойСсылки  Тогда
		Обращение = НСтр("ru='Извините, сервер не возращает ссылку на оплату. 
			|Попробуйте оплатить подписку позже'"); 
		СообщитьОбОшибкеФоновогоЗадания(Обращение, "");
		Возврат;
	КонецЕсли;
	
	Действие = "Получение плтежной ссылки из облака";
	
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Получение информации о подписках");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПроверитьГотовностьПлатежнойСсылкиВФоне");
	
	НастройкиЗапуска.ПараметрыМетода = Новый Структура;
	НастройкиЗапуска.ПараметрыМетода.Вставить("ИДУниверсальногоОбъекта",   ИДУниверсальногоОбъекта);
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьФоновоеЗадание()
	НастройкиВПараметр = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(НастройкиЗапуска);
	НастройкиЗапуска = Неопределено;
	ДеньгиКлиент.ВыполнитьЭтапФоновогоЗадания(ЭтотОбъект, НастройкиВПараметр, РезультатЗапускаФоновогоЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФоновоеЗаданиеКлиент()
	
	ОчиститьСообщения();
	ДеньгиКлиент.ОтменитьФоновоеЗадание(РезультатЗапускаФоновогоЗадания);
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаПокупка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибкиФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.ФоновоеЗадание.Статус = "Ошибка" Тогда
		
		Обращение = "";
		Ошибка = Результат.ФоновоеЗадание.ПодробноеПредставлениеОшибки;
		
	Иначе
		Обращение = НСтр("ru='Запрос к облаку был отменен пользователем.
				|Пожалуйста, еще раз нажмите ""Купить..."" и дождитесь окончания обработки запроса'");
		Ошибка = "";
		
	КонецЕсли;
	
	СообщитьОбОшибкеФоновогоЗадания(Обращение, Ошибка);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	ОтветСервера = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	
	Если ЗначениеЗаполнено(ОтветСервера.ОписаниеОшибки) Тогда
		СообщитьОбОшибкеФоновогоЗадания("",ОтветСервера.ОписаниеОшибки);
		Результат.НастройкиЗапуска.ПоследовательностьПроцедур.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПроверитьСозданиеПодпискиПоЗаявкеВФоне" Тогда
		
		Если ОтветСервера.ПодпискаСоздана Тогда
			
			Оповестить("ОформленаПодписка");
			Если Открыта() Тогда
				Закрыть();
			КонецЕсли;
			
		Иначе
			
			Элементы.ИконкаОжиданияОплаты.Картинка = БиблиотекаКартинок.БанковскаяКартаСиняя48;
			ПодключитьОбработчикОжидания("Подключаемый_ПроверкаЗавершенияОплаты", 15, Истина);
			Если СообщитьРезультатПроверкиОплаты = Истина Тогда
				ПоказатьПредупреждение(, НСтр("ru='В облаке пока нет подтверждения оплаты'"));
				СообщитьРезультатПроверкиОплаты = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ИДУниверсальногоОбъекта = ОтветСервера.ИДУниверсальногоОбъекта;
		Результат.НастройкиЗапуска.ПараметрыМетода = Новый Структура;
		Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("ИДУниверсальногоОбъекта", ИДУниверсальногоОбъекта);
		//Результат.НастройкиЗапуска.ИнтервалОжидания = 1;
		
		Если Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПроверитьГотовностьПлатежнойСсылкиВФоне" Тогда
			Если ОтветСервера.КодСостояния = 302 Тогда
				// Продолжается ожидание платежной ссылки
				//Результат.НастройкиЗапуска.ПоследовательностьПроцедур.Вставить(0, "ДеньгиВОблаке.ПроверитьГотовностьПлатежнойСсылкиВФоне");
				ПроверитьГотовностьПлатежнойСсылки(ИДУниверсальногоОбъекта);
			Иначе
				// Ссылка получена
				ПлатежнаяСсылка = ОтветСервера.ПлатежнаяСсылка;
				ОбработатьПолучениеПатежнойСсылки();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ОбработатьПолучениеПатежнойСсылки()

	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = элементы.СтраницаОжижанияОплаты;
	Оповещение = Новый ОписаниеОповещения("ОбработатьПолучениеПатежнойСсылкиПродолжение", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение, НСтр("ru='Сейчас в браузере откроется страница платежной системы.
					|После оплаты вернитесь в программу. 
					|Если программа не успеет проверить оплату автоматически, нажмите кнопку ""Проверить оплату""'"));

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеПатежнойСсылкиПродолжение(ДополнительныеПараметры) Экспорт

	ОткрытьПлатежнуюСсылку();

КонецПроцедуры


&НаКлиенте
Процедура СообщитьОбОшибкеФоновогоЗадания(СообщениеПользователю, Ошибка, ТекстЗаголовка = Неопределено)

	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаОшибка;
	
	Если ЗначениеЗаполнено(ТекстЗаголовка) И Элементы.ДекорацияОшибка.Заголовок <> ТекстЗаголовка Тогда
		Элементы.ДекорацияОшибка.Заголовок = ТекстЗаголовка;
	КонецЕсли;
	
	ТекстПользователю = ?(ЗначениеЗаполнено(СообщениеПользователю), СообщениеПользователю, 
				НСтр("ru='Не удалось получить информацию из облака.
						|Пожалуйста, поробуйте выполнить эту операцию позже. '"));
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = ?(ЗначениеЗаполнено(Ошибка), Ошибка, "");
	КонецЕсли;
	Элементы.ГруппаИнформацияДляТехПоддержки.Видимость = ЗначениеЗаполнено(ТекстОшибки);
	Если Элементы.ГруппаИнформацияДляТехПоддержки.Видимость Тогда
		ТекстПользователю = ТекстПользователю + Символы.ПС + НСтр("ru='Если проблема сохранится, передайте информацию в нашу службу поддержки. Постараемся исправить ситуацию как можно быстрей'");
	КонецЕсли;

	Если Элементы.ПредставлениеОшибки.Заголовок <> ТекстПользователю Тогда
		Элементы.ПредставлениеОшибки.Заголовок = ТекстПользователю;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСписокВыбораСрока(ОписанияТарифов, ЭлементВарианта, ЭтоБезлимитный, ВыбранноеЗначение)

	ЭлементВарианта.СписокВыбора.Очистить();
	Если ЭтоБезлимитный Тогда
		МассивВариантов = ОписанияТарифов.БезлимтиныйТариф.ВариантыПодписок;
	Иначе
		МассивВариантов = ОписанияТарифов.ЛимитированныйТариф.ВариантыПодписок;
	КонецЕсли;
	
	Счетчик = 0;
	Для каждого Вариант Из МассивВариантов Цикл
		ЭлементВарианта.СписокВыбора.Добавить(Счетчик, СтрЗаменить(ЧислоПрописью(Вариант.ДлительностьВМесяцах, "Л=ru_RU", "месяц, месяца, месяцев, М, 0"), " 00", ""));
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Если ВыбранноеЗначение > Счетчик Тогда
		ВыбранноеЗначение = Счетчик;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСтрокиИСуммы(Форма)

	Если Форма.КоличествоЛицензий = -111 Тогда
		МассивВариантов = Форма.СписокТарифов.БезлимтиныйТариф.ВариантыПодписок;
		Форма.КодТарифа = Форма.СписокТарифов.БезлимтиныйТариф.КодТарифа;
	Иначе
		МассивВариантов = Форма.СписокТарифов.ЛимитированныйТариф.ВариантыПодписок;
		Форма.КодТарифа = Форма.СписокТарифов.ЛимитированныйТариф.КодТарифа;
	КонецЕсли;
	Форма.ВариантПодписки = ?(Форма.ВариантПодписки > МассивВариантов.Количество() -1, МассивВариантов.Количество() -1, Форма.ВариантПодписки);
	ПараметрыВарианта = МассивВариантов[Форма.ВариантПодписки];
	
	РасчетнаяСтоимость    = ПараметрыВарианта.Стоимость * ?(Форма.КоличествоЛицензий > 0, Форма.КоличествоЛицензий, 1);
	РасчетнаяЦенаМесяца   = Окр(РасчетнаяСтоимость / ПараметрыВарианта.ДлительностьВМесяцах, 2);
	РасчетнаяЦенаЛицензии = Окр(РасчетнаяЦенаМесяца / ?(Форма.КоличествоЛицензий < 1, 1, Форма.КоличествоЛицензий), 0);
	
	Форма.РасчетноеОкончание = НачалоДня(ДобавитьМесяц(Форма.ДатаНачала, ПараметрыВарианта.ДлительностьВМесяцах)) - 1;
	ДобавитьДней       = 0;
	Если Форма.КоличествоЛицензий = -111 И Форма.НеиспользованнаяСумма > 0 Тогда
		ДобавитьДней  = Цел(Форма.НеиспользованнаяСумма / (РасчетнаяЦенаМесяца * 30));
		Форма.РасчетноеОкончание = НачалоДня(Форма.РасчетноеОкончание + ДобавитьДней * 86400);
	КонецЕсли;
	
	Форма.Элементы.Купить.Заголовок = СтрШаблон(НСтр("ru='Купить за %1 руб'"), РасчетнаяСтоимость); 
	Если Форма.КоличествоЛицензий > 1 Или Форма.КоличествоЛицензий <> -111 И ПараметрыВарианта.ДлительностьВМесяцах > 1 Тогда
		Форма.Элементы.ДекорацияКупитьЦенаМесяца.Заголовок = СтрШаблон(НСтр("ru='%1 руб. в месяц за 1 лицензию'"), Формат(РасчетнаяЦенаЛицензии, "ЧДЦ=0") );
	ИначеЕсли Форма.КоличествоЛицензий = -111 Тогда
		Форма.Элементы.ДекорацияКупитьЦенаМесяца.Заголовок = СтрШаблон(НСтр("ru='%1 руб. в месяц за неограниченное количество лицензий'"), Формат(РасчетнаяЦенаМесяца, "ЧДЦ=0") );
	Иначе
		Форма.Элементы.ДекорацияКупитьЦенаМесяца.Заголовок = "";
	КонецЕсли;
	
	Если ДобавитьДней = 0 Тогда
		Форма.Элементы.ДекорацияПродлениеСрока.Заголовок = "";
	Иначе
		Форма.Элементы.ДекорацияПродлениеСрока.Заголовок = СтрШаблон(НСтр("ru='К выбранному сроку будет добавлено &1 дн. неиспользованных подписок'"), ДобавитьДней);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеВПоддержку()

	Состояние(НСтр("ru='Подготовка технологической информации...'"));
	
	ПараметрыФормы = ПараметрыСообщения();
	ПараметрыФормы.Тема = "Ошибка оплаты подписки";
	
	ПараметрыФормы.Тело = "Форма ""Покупка подписки"".
		|Выполняемое действие: " + Действие + " 
		|Ошибка: " + ТекстОшибки + ", 
		|	
		|	" + ТекущаяДатаКлиентСервер() + "
		|---------------------------------------";
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВСлужбуПоддержки", ПараметрыФормы, ЭтотОбъект, Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыСообщения()

	Возврат ПоддержкаПользователейДеньги.НоваяСтруктураСообщения();

КонецФункции

&НаКлиенте
Процедура ОткрытьПлатежнуюСсылку()

	ОчиститьСообщения();
	ОтключитьОбработчикОжидания("Подключаемый_ПроверкаЗавершенияОплаты");
	ЗапуститьПриложение(ПлатежнаяСсылка);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверкаЗавершенияОплаты", 15, Истина);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверкаЗавершенияОплаты()

	ПроверитьСозданиеПодписки();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяДатаКлиентСервер()
	#Если Сервер Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли 
КонецФункции 

#КонецОбласти
