
////////////////////////////////////////////////////////////////////////////////
//Справочник.ГрафыБюджета.ФормаОбъекта
//  Только для просмотра
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	Если Объект.Ссылка.Пустая() Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='В этом справочнике запрещено создавать новые элементы'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.ОтношениеКНакоплениям = 0 Тогда
		Элементы.ДекорацияПояснение2.Заголовок = НСтр("ru='Эта графа используется как для свободных денег, так и для накоплений'"); 
	ИначеЕсли ТекущийОбъект.ОтношениеКНакоплениям < 0 Тогда
		Элементы.ДекорацияПояснение2.Заголовок = НСтр("ru='Эта графа используется только для свободных денег'"); 
	Иначе
		Элементы.ДекорацияПояснение2.Заголовок = НСтр("ru='Эта графа используется только для накоплений'"); 
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


