////////////////////////////////////////////////////////////////////////////////
// ДеньгиВызовСервераПовтИсп: Общий фунционал конфигурации 1С:Деньги
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если используется интерфейс Такси
Функция ИспользуетсяВариантИнтерфейсаТакси() Экспорт

	Возврат КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
	
КонецФункции

Функция ВерсияПлатформы835() Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.5.0") > 0;

КонецФункции

Функция ПланыОбменаБСП() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("МобильноеПриложение");
	
	Возврат Результат;

КонецФункции

// Возвращает строковое представление режима, в котором работает приложение
//	возможные варианты:
//	- "Разделенный" - приложение работает на сервере в разделенном (пользовательском) режиме
//	- "Неразделенный" - приложение работает на сервере в неразделенном режиме
//	- "КлиентОблака" - настольная программа подключена к облаку Денег
//	- "ЦентрМобильных" - настольная программа является центральной базой для обмена с Миниденьгами
//	- "Независимый" - настольная программа не синхронизируется ни с кем
// 
// Возвращаемое значение:
// 	Строка
Функция РежимИспользованияПриложения() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		// приложение работает в облаке
		
		Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
			Возврат "Разделенный";
		Иначе
			Возврат "Неразделенный";
		КонецЕсли;
		
	Иначе
		
		ВыбранныйСпособ = Константы.ДеньгиВыбранныйСпособСинхронизации.Получить();
		Если ВыбранныйСпособ = Перечисления.СпособыСинхронизацииДанных.СинхронизацияССервисом Тогда 
			Возврат "КлиентОблака";
		
		ИначеЕсли ВыбранныйСпособ = Перечисления.СпособыСинхронизацииДанных.ОбменФайлами Тогда 
			Возврат "ЦентрМобильных"
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "Независимый";
	
КонецФункции

Функция РежимСинхронизацииСЦБ() Экспорт
	
	Режим = РежимИспользованияПриложения();
	Возврат Режим = "Разделенный" Или режим = "КлиентОблака";
	
КонецФункции 

Функция ВалютаУчета() Экспорт
	Возврат ПараметрыСеанса.ВалютаУчета;
КонецФункции 

#КонецОбласти


