///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ОбработкаЗапросов


// GET /version
Функция ВерсииGET(Запрос)
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, СписокВерсий(), ИмяСервиса("version"));
КонецФункции

#Область Методы_2_1
	
// POST /execute
Функция executePOST(Запрос)
	
	Ошибка        = Неопределено;
	ДопИнформация = "";
	ИмяМетода     = "";
	
	// Чтение структуры запроса
	Попытка
		ЗапросИОтвет = ДеньгиОбработкаВебЗапросов.РазобратьЗапросExecute(Запрос);
		Если ЗапросИОтвет.Ошибка Тогда
			Возврат ДеньгиОбработкаВебЗапросов.ОтветМетодаExecute(ЗапросИОтвет.Ответ, 
						ЗапросИОтвет.Метод, ЗапросИОтвет.УзелКорреспондента);
		КонецЕсли;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ДопИнформация = "Разбор содержимого запроса";
	КонецПопытки;
	
	Если Ошибка = Неопределено Тогда
		
		ИмяМетода     = НРег(СокрЛП(ЗапросИОтвет.Метод));
		
		// Проверка регистрации узла на сервере
		ПроверятьРегистрациюУзла = ИмяМетода <> "checkregnode";
		Если ПроверятьРегистрациюУзла Тогда
			Попытка
				Если Не ДеньгиОбработкаВебЗапросов.ПроверитьРегистрациюУзла(ЗапросИОтвет) Тогда
					Возврат ДеньгиОбработкаВебЗапросов.ОтветМетодаExecute(ЗапросИОтвет.Ответ, 
							ЗапросИОтвет.Метод, ЗапросИОтвет.УзелКорреспондента);
				КонецЕсли;
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ДопИнформация = "Проверка регистрации узла в плане обмена";
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Ошибка = Неопределено Тогда
		Попытка
			ВыполнитьМетодExecute(ЗапросИОтвет, ИмяМетода);
		Исключение
			Ошибка = ИнформацияОбОшибке();
		КонецПопытки;
	КонецЕсли;
	
	Если Ошибка <> Неопределено Тогда
		ОбработатьИсключениеМетодаExecute(ЗапросИОтвет, Ошибка, ДопИнформация);
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.ОтветМетодаExecute(ЗапросИОтвет.Ответ, ЗапросИОтвет.Метод, ЗапросИОтвет.УзелКорреспондента);
	
КонецФункции

Процедура ВыполнитьМетодExecute(ЗапросИОтвет, ИмяМетода)
	
	Если ИмяМетода = "statusserver" Тогда
		ВыполнитьЗапросСтатусСервера(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "readingpackage" Тогда
		ВыполнитьЗапросЧтениеПолученногоПакета(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "marktransfer" Тогда
		ВыполнитьЗапросОтметкаЗагрузкиДанныхКлиентом(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "checkunloading" Тогда
		ВыполнитьЗапросНеобходимостьВыгрузкиИзменений(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "unloadingchanges" Тогда
		ВыполнитьЗапросВыгрузкаИзменений(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "infosendpack" Тогда
		ВыполнитьЗапросИнформацияОПакетеКОтправке(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "checkregnode" Тогда
		ВыполнитьЗапросПроверитьРегистрациюУзла(ЗапросИОтвет);
		
	ИначеЕсли ИмяМетода = "setregchanges" Тогда
		ВыполнитьЗапросУстановитьРегистрациюОбъектов(ЗапросИОтвет);
	
	ИначеЕсли ИмяМетода = "stopprocess" Тогда
		ВыполнитьЗапросОстановитьПроцессыОбмена(ЗапросИОтвет);
			
	ИначеЕсли ИмяМетода = "getbalances" Тогда
		ВыполнитьЗапросПолучитьОстатки(ЗапросИОтвет);
			
	ИначеЕсли ИмяМетода = "deletepackages" Тогда
		ВыполнитьЗапросУдалитьПакеты(ЗапросИОтвет);
			
	ИначеЕсли ИмяМетода = "resetstatus" Тогда
		ВыполнитьЗапросСброситьСостояниеСинхронизации(ЗапросИОтвет);
			
	ИначеЕсли ИмяМетода = "updateresults" Тогда
		ВыполнитьЗапросОбновитьСостояниеОбменаПоРезультатамСКлиента(ЗапросИОтвет);
			
	Иначе
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, 
					ЗапросИОтвет.ВсеКодыСостояния.КомандаНеПоддерживается.Код, 
					СтрШаблон(НСтр("ru='На сервере нет метода %1'"), ЗапросИОтвет.Метод), 
					СтрШаблон(НСтр("ru='Не найден обработчик для метода %1'"), ЗапросИОтвет.Метод));
	КонецЕсли;
	
КонецПроцедуры

// PUT /upload/{DBID}
Функция ЗагрузитьНаСерверPOST(Запрос)
	Возврат ОбработкаЗагрузкиПакета(Запрос);
КонецФункции
	
// GET /download/{DBID}
Функция ВыгрузкаПакетаДляКлиентаGET(Запрос)
	Возврат ОбработкаВыгрузкиИзменений(Запрос);
КонецФункции

// POST /markdownload/{DBID}
Функция ОтметкаОПолученииПакетаPOST(Запрос)
	Возврат ОбработкаПометкиОтправленногоПакета(Запрос);
КонецФункции

	
#КонецОбласти


#Область Методы_2_0


// GET /allowed/{DBID}
Функция ПроверкаВозможностиСинхронизацииGET(Запрос)
	Возврат СинхронизацияВозможна(Запрос);
КонецФункции

// GET /status/{DBID}
Функция СостояниеGET(Запрос)
	Возврат ОбработкаСостоянияСинхронизации(Запрос);
КонецФункции


// POST /resetstatus/{DBID}
Функция СборсСостоянияСинхронизацииНаСервереPOST(Запрос)
	
	ИмяСервиса = ИмяСервиса("resetstatus");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
		АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена);
	Исключение
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ИнформацияОбОшибке(), ИмяСервиса);
	КонецПопытки;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	
КонецФункции




// DELETE /upload/{DBID}
Функция ЗагрузитьНаСерверDelete(Запрос)
	Возврат ОбработкаЗагрузкиПакета(Запрос);
КонецФункции


// POST /read/{DBID}
Функция ЧтениеЗагруженногоПакетаPOST(Запрос)
	Возврат ОбработкаЧтенияПакета(Запрос);
КонецФункции



// POST /download/{DBID}
Функция ВыгрузкаПакетаДляКлиентаPOST(Запрос)
	Возврат ОбработкаВыгрузкиИзменений(Запрос);
КонецФункции

// DELETE /download/{DBID}
Функция ВыгрузкаПакетаДляКлиентаDELETE(Запрос)
	Возврат ОбработкаВыгрузкиИзменений(Запрос);
КонецФункции


// DELETE /markdownload/{DBID}
Функция ОтметкаОПолученииПакетаDELETE(Запрос)
	Возврат ОбработкаПометкиОтправленногоПакета(Запрос);
КонецФункции


// POST /registerchanges/{DBID}
Функция РегистрацияИзмененийPOST(Запрос)
	
	ИмяСервиса = ИмяСервиса("registerchanges");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		СинхронизацияАвтономныхКопий.ЗарегистрироватьВсеОбъектыДляОтправкиНаУзел(Узел);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	Исключение
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ИнформацияОбОшибке(), ИмяСервиса);
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции


// GET /settings/{DBID}
Функция ОбработкаНастроекСинхронизацииGET(Запрос)
	Возврат ОбработкаНастроекСинхронизации(Запрос);
КонецФункции

// POST /settings/{DBID}
Функция ОбработкаНастроекСинхронизацииPOST(Запрос)
	Возврат ОбработкаНастроекСинхронизации(Запрос);
КонецФункции


// POST /getinfo/{DBID}
// тело запроса - структура:
// * Команды - Массив команд
Функция GetInfoPOST(Запрос)
	
	ИмяСервиса = ИмяСервиса("getinfo");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	
	ТекстОшибки = "";
	СтруктураЗапроса = ДеньгиОбработкаВебЗапросов.ПрочитатьТелоЗапроса(Запрос, "", ТекстОшибки);
	Если СтруктураЗапроса = Неопределено Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
			НСтр("ru='Ошибка чтения тела запроса'") + Символы.ПС + ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Результат = Новый Структура;
	Для каждого Команда Из СтруктураЗапроса.Команды Цикл
		
		Если Команда = "БазаПустая" Тогда
			Результат.Вставить(Команда, ОбщегоНазначенияДеньги.ИнформационнаяБазаПустая());
		ИначеЕсли Команда = "ЕстьИзмененияДляВыгрузки" Тогда
			Результат.Вставить(Команда, ОбменДаннымиСлужебный.ИзмененияЗарегистрированы(Узел)
				Или Узел.ЗатребованныйСценарий = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии);
		ИначеЕсли СтрНайти(Команда, "КоличествоЗаписей_") > 0 Тогда
			ИмяТаблицы = СтрЗаменить(Сред(Команда, 19), "_", ".");
			Результат.Вставить(Команда, СинхронизацияАвтономныхКопий.КоличествоЗаписейВТаблице(ИмяТаблицы));
		ИначеЕсли СтрНайти(Команда, "КонтрольРазделаУчета_") > 0 Тогда
			ИмяРазделаУчета = Сред(Команда, 22);
			Результат.Вставить(Команда, СинхронизацияАвтономныхКопий.КонтрольныйОстатокРазделаУчета(ИмяРазделаУчета));
			
			
		ИначеЕсли СтрНайти(Команда, "СоздатьтестовыеЗаписи") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Модуль.СоздатьтестовыеЗаписиСервера();
				Результат.Вставить(Команда, Истина);
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			
		ИначеЕсли СтрНайти(Команда, "ТестовыеЗаписиСервераДолжныБыть") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Результат.Вставить(Команда, Модуль.ПроверитьКонтрольныеДанныеСервера(Истина));
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			 
		ИначеЕсли СтрНайти(Команда, "ТестовыеЗаписиСервераДолжныОтсутствовать") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Результат.Вставить(Команда, Модуль.ПроверитьКонтрольныеДанныеСервера(Ложь));
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			
		ИначеЕсли СтрНайти(Команда, "ТестовыеЗаписиАвтономнойКопииДолжныБыть") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Результат.Вставить(Команда, Модуль.ПроверитьКонтрольныеДанныеАвтономнойКопии(Истина));
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			
		ИначеЕсли СтрНайти(Команда, "ТестовыеЗаписиАвтономнойКопииДолжныОтсутствовать") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Результат.Вставить(Команда, Модуль.ПроверитьКонтрольныеДанныеАвтономнойКопии(Ложь));
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			
		ИначеЕсли СтрНайти(Команда, "УдалитьТестовыеЗаписиСервера") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Модуль.УдалитьКонтрольныеДанныеСервера();
				Результат.Вставить(Команда, Истина);
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			
		ИначеЕсли СтрНайти(Команда, "УдалитьТестовыеЗаписиАвтономнойКопии") > 0 Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
				Модуль.УдалитьКонтрольныеАвтономнойКопии();
				Результат.Вставить(Команда, Истина);
			Иначе
				Результат.Вставить(Команда, "ERROR: недоступно использование тестовых данных");
			КонецЕсли;
			
		Иначе
			
			Результат.Вставить(Команда, "ERROR: неизвестная команда """ + Команда + """");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Результат, ИмяСервиса);
	
	
КонецФункции


// POST /node/{DBID}
Функция УзелПланаОбменаPOST(Запрос)
	
	ИмяСервиса = ИмяСервиса("node");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ТекстОшибки = "";
	СтруктураЗапроса = ДеньгиОбработкаВебЗапросов.ПрочитатьТелоЗапроса(Запрос, "", ТекстОшибки);
	Если СтруктураЗапроса = Неопределено Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
			НСтр("ru='Ошибка чтения тела запроса'") + Символы.ПС + ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	ОбязательныеКлючи = "Команда,ПланОбмена,КодЦентральнойБазы";
	Если Не ДеньгиОбработкаВебЗапросов.ПроверитьСтруктуруТелаЗапроса(СтруктураЗапроса, 
							ОбязательныеКлючи, ИмяСервиса, Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если Не ПроверитьКодЦентральнойБазы(СтруктураЗапроса.КодЦентральнойБазы,
				СтруктураЗапроса.ПланОбмена, ИмяСервиса, Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	КодЭтогоУзла = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла(СтруктураЗапроса.ПланОбмена);
	СоздаватьНовый = СтруктураЗапроса.КодЦентральнойБазы = "000" Или КодЭтогоУзла = "000"
			Или СтруктураЗапроса.КодЦентральнойБазы = КодЭтогоУзла;
	НаименованиеУзла = Неопределено;
	СтруктураЗапроса.Свойство("НаименованиеУзла", НаименованиеУзла);
	Если Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел, 
				СтруктураЗапроса.ПланОбмена, СоздаватьНовый, НаименованиеУзла) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если СтруктураЗапроса.Команда = "СтатусУзлаНаСервере" Тогда
		Возврат СтатусУзлаНаСервере(СтруктураЗапроса, Узел, ИмяСервиса);
		
	ИначеЕсли СтруктураЗапроса.Команда = "ОтчетОПолученииДанных" Тогда
		Возврат ОбработатьОтчетОПолученииДанных(СтруктураЗапроса, Узел, ИмяСервиса);
		
	Иначе
		
	КонецЕсли;
	
КонецФункции

	
#КонецОбласти

#КонецОбласти



#Область ПодготовкаОтветов


#Область Обработчики_2_1

// Выполняет проверки на достпуность, включенность настроек, наличие подписок и т.п.
// В случае проблем устанавивает для general.response соответствуюший код и возвращает Ложь
//
Функция ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет)
	
	ВсеКоды   = ЗапросИОтвет.ВсеКодыСостояния;
	ИмяМетода = НРег(СокрЛП(ЗапросИОтвет.Метод));
	Режим     = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();

	// проверить доступность сервера
	Если БазаЗаблокированаДляОбновления() Тогда
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.СерверНедоступен.Код,
			НСтр("ru='База заблокирована для обновления'"), 
			НСтр("ru='База заблокирована для обновления'"), Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	// проверить настройки синхронизации
	Если Режим = "ЦентрМобильных" Тогда
		ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
		Если ПараметрыДомашняяСеть.ЗапретитьИспользование Тогда
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
				ВсеКоды.СинхронизацияОтключена.Код,
				НСтр("ru='В настольной программе синхронизация отключена'"), 
				НСтр("ru='В настольной программе синхронизация отключена'"), Ложь);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// проверить доступность узла
	ПроверятьДоступностьУзла = СтрНайти("readingpackage,unloadingchanges,", ИмяМетода + ",") > 0;
	Если ПроверятьДоступностьУзла Тогда
		СвойстваУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросИОтвет.УзелКорреспондента, 
			"Активность,СинхронизацияЗапрещена,ПометкаУдаления");
		Если СвойстваУзла.СинхронизацияЗапрещена Тогда
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
				ВсеКоды.УстаревшаяБаза.Код,
				ВсеКоды.УстаревшаяБаза.ТекстОписания, 
				"Для узла плана обмена установлена отметка ""Синхронизация запрещена""", Ложь);
			Возврат Ложь;
		ИначеЕсли СвойстваУзла.ПометкаУдаления Или Не СвойстваУзла.Активность Тогда
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
				ВсеКоды.УстаревшаяБаза.Код,
				ВсеКоды.УстаревшаяБаза.ТекстОписания, 
				"Узел плана обмена не активен или помечен на удаление", Ложь);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли; 
	
	// проверить наличие лицензий
	Если Режим = "Разделенный" Тогда

		ПроверятьЛицензии = СтрНайти("readingpackage,", ИмяМетода + ",") > 0;
		Если ПроверятьЛицензии Тогда
			МодульБиллинга    = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
			СостояниеПодписки = МодульБиллинга.СостояниеПодпискиНаУслугу(ДеньгиВОблаке.ИмяУслугиАвтоСинхронизация(), 
						ЗапросИОтвет.СтруктураЗапроса.general.ib);
			Если СостояниеПодписки.ВсегоЛицензий <> -111 И СостояниеПодписки.СвободноЛицензий < 0 Тогда
				ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
					ВсеКоды.НетЛицензий.Код,
					ВсеКоды.НетЛицензий.ТекстОписания, 
					СтрШаблон(НСтр("ru='Для выполнения операции не хватает лицензий: %1 шт.'"), 
							-СостояниеПодписки.СвободноЛицензий), 
					Ложь);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверить доступность синхронизации
	ПроверятьВозможностьОбмена = СтрНайти("readingpackage,unloadingchanges,stopprocess,", ИмяМетода + ",") > 0;
	Если ПроверятьВозможностьОбмена Тогда
		
		ЭтаБаза = СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел();
		Если Не РегистрыСведений.КонтрольПроцессовОбменаДанными.ДоступноДляБлокировки(ЭтаБаза, "Прием") Тогда
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
				ВсеКоды.ПолноеПерепроведение.Код,
				ВсеКоды.ПолноеПерепроведение.ТекстОписания, 
				НСтр("ru='База заблокирована для полной обработки или замены данных'"), 
				Ложь);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработатьИсключениеМетодаExecute(ЗапросИОтвет, Ошибка, ДопИнфо = "")
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ОшибкаКратко   = КраткоеПредставлениеОшибки(Ошибка);
		ОшибкаПодробно = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ОшибкаКратко   = Ошибка;
		ОшибкаПодробно = Ошибка;
	КонецЕсли;
	
	ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, 
			ЗапросИОтвет.ВсеКодыСостояния.ОшибкаНаСервере.Код, 
			СтрШаблон(НСтр("ru='Программная ошибка сервера при выполнении метода execute/%1 
			|	%2
			|	Текст ошибки: %3
			|'"), 
				ЗапросИОтвет.Метод,
				?(ДопИнфо = "", "", "доп.информация: " + ДопИнфо), 
				ОшибкаКратко), 
				ОшибкаПодробно);
	
КонецПроцедуры

// Возвращает статус сервера, Свойства узла на сервере, Состояние автомата и Состояние подписок
//При этом general.response всегда равен 10200, а фактическое состояние сервера записывается в Ответ.СтатусСервера
//
Процедура ВыполнитьЗапросСтатусСервера(ЗапросИОтвет)
	
	ВсеКоды = ЗапросИОтвет.ВсеКодыСостояния;
	ЗапросИОтвет.Ответ.Вставить("СтатусСервера", ВсеКоды.Готов.Код);
	
	// общая блокировка ИБ
	Если БазаЗаблокированаДляОбновления() Тогда
		ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.СерверНедоступен.Код;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.СерверНедоступен.Код,
			ВсеКоды.СерверНедоступен.ТекстОписания, 
			НСтр("ru='На сервере выполняется обновление'"), 
			Ложь);
		Возврат;
	КонецЕсли;
	
	// проверка прав пользователя
	Если Не ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.Синхронизировать) Тогда
		ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.НетПрав.Код;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.НетПрав.Код,
			ВсеКоды.НетПрав.ТекстОписания, 
			НСтр("ru='У пользователя нет прав на выполнение синхронизации'"), 
			Ложь);
		Возврат;
	КонецЕсли;
	
	// проверка пометок узла (активность и запрет на синхронизацию)
	Если ЗначениеЗаполнено(ЗапросИОтвет.УзелКорреспондента) Тогда

		СвойстваУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросИОтвет.УзелКорреспондента, 
			"Наименование,Активность,СинхронизацияЗапрещена,ВерсияФорматаОбмена,НомерПринятого,НомерОтправленного");
		ЗапросИОтвет.Ответ.Вставить("СвойстваУзлаНаСервере", СвойстваУзла);
		Если СвойстваУзла.СинхронизацияЗапрещена Или Не СвойстваУзла.Активность Тогда
			
			ТекстСообщения = ?(СвойстваУзла.СинхронизацияЗапрещена, 
					НСтр("ru='синхронизация с этим узлом запрещена на сервере'"), 
					НСтр("ru='узел помечен на сервере устаревшим'"));
			ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.УстаревшаяБаза.Код;
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
				ВсеКоды.УстаревшаяБаза.Код,
				ВсеКоды.УстаревшаяБаза.ТекстОписания,
				ТекстСообщения, 
				Ложь);
			Возврат;
			
		КонецЕсли;

	Иначе
		ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.НеЗарегистрирован.Код;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.НеЗарегистрирован.Код,
			ВсеКоды.НеЗарегистрирован.ТекстОписания, 
			СтрШаблон(НСтр("ru='На сервере не зарегистрирована база с кодом %1'"), 
					ЗапросИОтвет.СтруктураЗапроса.general.ib), 
			Ложь);
		Возврат;
		
	КонецЕсли;
	
	// состояние обмена с узлом
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	ЗапросИОтвет.Ответ.Вставить("НомерПринятого", СостояниеОбмена.НомерПринятого);
	ЗапросИОтвет.Ответ.Вставить("НомерОтправленного", СостояниеОбмена.НомерОтправленного);
	ЗапросИОтвет.Ответ.Вставить("Прием", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Прием));
	ЗапросИОтвет.Ответ.Вставить("Передача", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Передача));
	
	АктивноеФЗ = АктивноеФоновоеЗаданиеВыгрузки(ЗапросИОтвет.СтруктураЗапроса.general.ib, "");
	ЗапросИОтвет.Ответ.Вставить("ФоновоеЗаданиеВыгрузкиАктивно", АктивноеФЗ <> Неопределено И АктивноеФЗ.Выполняется);
	
	АктивноеФЗ = АктивноеФоновоеЗаданиеЗагрузки(ЗапросИОтвет.СтруктураЗапроса.general.ib, "");
	ЗапросИОтвет.Ответ.Вставить("ФоновоеЗаданиеЗагрузкиАктивно", АктивноеФЗ <> Неопределено И АктивноеФЗ.Выполняется);
	
	// разрешение на использование синхронизации
	Если Не СинхронизацияВключенаВНастройках() Тогда
		ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.СинхронизацияОтключена.Код;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.СинхронизацияОтключена.Код,
			ВсеКоды.СинхронизацияОтключена.ТекстОписания, 
			НСтр("ru='В настройках настольной программы отключена синхронизация'"), 
			Ложь);
		Возврат;
	КонецЕсли;
	
	// проверка версии на клиенте
	Если Не ВерсияКлиентаАктуальна(ЗапросИОтвет.СтруктураЗапроса.general) Тогда

		ТекстСообщения = ?(ЗапросИОтвет.СтруктураЗапроса.general.mobile, 
				НСтр("ru='версия мобильного приложения устарела'"), 
				НСтр("ru='версия настольной программы устарела'"));
		ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.КлиентУстарел.Код;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ЗапросИОтвет.Ответ.СтатусСервера,
			ВсеКоды.КлиентУстарел.ТекстОписания, 
			ТекстСообщения, 
			Ложь);
		Возврат;
		
	КонецЕсли;
	
	ЭтаБаза = СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел(ЗапросИОтвет.ИмяПланаОбмена);
	Если Не РегистрыСведений.КонтрольПроцессовОбменаДанными.ДоступноДляБлокировки(ЭтаБаза, "Прием") Тогда
		ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.ПолноеПерепроведение.Код;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.ПолноеПерепроведение.Код,
			ВсеКоды.ПолноеПерепроведение.ТекстОписания, 
			НСтр("ru='На сервере перезаписывается большое количество данных'"), 
			Ложь);
		Возврат;
	КонецЕсли;
	
	Если СостояниеОбмена.Режим = "Разделенный" Тогда
		ДполнитьОтветСтатусомПодписок(ЗапросИОтвет.Ответ, ЗапросИОтвет.СтруктураЗапроса.general.ib);
		Если ЗапросИОтвет.Ответ.СостояниеПодписок.ВсегоЛицензий <> -111 
			И ЗапросИОтвет.Ответ.СостояниеПодписок.СвободноЛицензий < 0 Тогда
			ЗапросИОтвет.Ответ.СтатусСервера = ВсеКоды.НетЛицензий.Код;
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
				ВсеКоды.НетЛицензий.Код, 
				ВсеКоды.НетЛицензий.ТекстОписания, 
				НСтр("ru='Для выполнения операций недостаточно лицензий'"), 
				Ложь);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДполнитьОтветСтатусомПодписок(СтруктураОтвета, КодИб)
	
	МодульБиллинга    = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
	СостояниеПодписки = МодульБиллинга.СостояниеПодпискиНаУслугу(ДеньгиВОблаке.ИмяУслугиАвтоСинхронизация(), 
				КодИб);
	СтруктураОтвета.Вставить("СостояниеПодписок", Новый Структура);
	СтруктураОтвета.СостояниеПодписок.Вставить("ВсегоЛицензий", СостояниеПодписки.ВсегоЛицензий);
	СтруктураОтвета.СостояниеПодписок.Вставить("СвободноЛицензий", СостояниеПодписки.СвободноЛицензий);
	СтруктураОтвета.СостояниеПодписок.Вставить("ЗанятоЛицензий", СостояниеПодписки.ЗанятоЛицензий);
	
КонецПроцедуры


// Проверяет состояние обмена данными, сверяет номера пакетов и запускает 
// фоновое задание чтения полученного пакета
//
Процедура ВыполнитьЗапросЧтениеПолученногоПакета(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, "НомерПакета,") Тогда
		Возврат;
	КонецЕсли;
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ВсеКоды   = ЗапросИОтвет.ВсеКодыСостояния;
	ПараметрыЗапроса = ЗапросИОтвет.СтруктураЗапроса;
	
	// Проверка состояния обмена	
	ВсеКодыРезультатов   = ЗапросИОтвет.ВсеКодыРезультатов;
	СостояниеОбмена      = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	Если СостояниеОбмена.НомерПринятого = ПараметрыЗапроса.НомерПакета Тогда
		// пакет уже загружен в базу
		Если Не СостояниеОбмена.Прием.ПроцессЗавершен Тогда
			АвтоматСинхронизацииССервисом.ОбновитьСтатистикуДействия(СостояниеОбмена, "Прием", ПараметрыЗапроса.НомерПакета, , , , );
			АвтоматСинхронизацииССервисом.ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", 
						ВсеКодыРезультатов.Выполнено.Код, "");
		КонецЕсли;
			
	ИначеЕсли СостояниеОбмена.НомерПринятого > ПараметрыЗапроса.НомерПакета Тогда
		// попытка загрузить устаревший пакет
		АвтоматСинхронизацииССервисом.ОбновитьСтатистикуДействия(СостояниеОбмена, "Прием", ПараметрыЗапроса.НомерПакета, , , , );
		АвтоматСинхронизацииССервисом.ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", 
					ВсеКодыРезультатов.НомерПакетаМеньшеИлиРавен.Код, "");
					
	КонецЕсли;
	
	Если СостояниеОбмена.Прием.ПроцессЗавершен Тогда
		// процесс выполнен или завершен с ошибкой
		ЗапросИОтвет.Ответ.Вставить("Прием", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Прием));
		Возврат;
	КонецЕсли;
	
	// Проверка фонового задания
	КлючФЗ = "";
	АктивноеФЗ = АктивноеФоновоеЗаданиеЗагрузки(СостояниеОбмена.КодУзлаКорреспондента, КлючФЗ);
	Если АктивноеФЗ <> Неопределено И АктивноеФЗ.Выполняется Тогда
		ЗапросИОтвет.Ответ.Вставить("Прием", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Прием));
		Возврат;
	КонецЕсли;
	
	// проверка возможности заблокировать запись для загрузки
	Если Не РегистрыСведений.КонтрольПроцессовОбменаДанными.ДоступноДляБлокировки(ЗапросИОтвет.УзелКорреспондента, "Прием") Тогда
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.СинхронизацияУжеВыполняется.Код,
			ВсеКоды.СинхронизацияУжеВыполняется.ТекстОписания, 
			НСтр("ru='На сервере невозможно запустить чтение полученного пакета: заблокирована контрольная запись процесса ""Прием"" для узла плана обмена'"), 
			Ложь);
		Возврат;
	КонецЕсли;
	
	// Запуск фонового задания загрузки
	ВсеКодыРезультатов   = ЗапросИОтвет.ВсеКодыРезультатов;
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Узел", ЗапросИОтвет.УзелКорреспондента);
	ПараметрыПроцедуры.Вставить("НомерПакета", ПараметрыЗапроса.НомерПакета);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Загрузка данных от узла ""%1""'"), 
					СостояниеОбмена.КодУзлаКорреспондента);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФЗ;
	ПараметрыВыполнения.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне   = Истина;
	
	АктивноеФЗ = ДлительныеОперации.ВыполнитьВФоне(
		"АвтоматСинхронизацииССервисом.ВыполнитьВФонеЗагрузитьДанные",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Если АктивноеФЗ.Статус = "Ошибка" Тогда
		АвтоматСинхронизацииССервисом.ОтметитьЗавершениеДействия(СостояниеОбмена, "Прием", "Загрузка", 
					ВсеКодыРезультатов.ОшибкаНаСервере.Код, АктивноеФЗ.ПодробноеПредставлениеОшибки);
	Иначе
		// Обновление результов загрузки данных
		СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	КонецЕсли;
	
	ЗапросИОтвет.Ответ.Вставить("Прием", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Прием));
	
КонецПроцедуры

Функция АктивноеФоновоеЗаданиеЗагрузки(КодУзлаКорреспондента, КлючФЗ)
	
	КлючФЗ = "Загрузка данных от узла " + КодУзлаКорреспондента;
	Возврат ОбщегоНазначенияДеньги.СвойстваФоновогоЗадания(КлючФЗ, , Истина);
	
КонецФункции

// Устанавливает отметку о завершении загрузки изменений автономной копией
//Очищает пакеты к отправке с указанным номером
Процедура ВыполнитьЗапросОтметкаЗагрузкиДанныхКлиентом(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, "НомерПакета,Результат") Тогда
		Возврат;
	КонецЕсли;
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ВсеКодыРезультатов   = ЗапросИОтвет.ВсеКодыРезультатов;
	
	ПараметрыЗапроса = ЗапросИОтвет.СтруктураЗапроса;
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	Если СостояниеОбмена.Передача.НомерПакета = ПараметрыЗапроса.НомерПакета Тогда
		
		ЗаполнитьЗначенияСвойств(СостояниеОбмена.Передача, ПараметрыЗапроса.Результат, 
				"КодРезультатаДействия,ТекстОшибки");
		СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка;
		СостояниеОбмена.Передача.ПроцессЗавершен = ЗначениеЗаполнено(СостояниеОбмена.Передача.КодРезультатаДействия);
		
		ПроцессыОбменаСлужебный.ЗаписатьСостояниеВРегистр(СостояниеОбмена, "Передача");
		
	КонецЕсли;
	
	Если СостояниеОбмена.НомерОтправленного <= ПараметрыЗапроса.НомерПакета
		И СостояниеОбмена.Передача.КодРезультатаДействия = ВсеКодыРезультатов.Выполнено.Код Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(ЗапросИОтвет.УзелКорреспондента, СостояниеОбмена.НомерОтправленного);
		
		ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(ЗапросИОтвет.УзелКорреспондента);
		Если ПараметрыОбмена.ЗатребованныйСценарий = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии 
			Тогда
			СинхронизацияАвтономныхКопий.УстановитьСтандартныйСценарийЗапросаДанных(ЗапросИОтвет.УзелКорреспондента);
		КонецЕсли;
		
	КонецЕсли;
	
	РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(ЗапросИОтвет.УзелКорреспондента, 
			ПараметрыЗапроса.НомерПакета);
	
КонецПроцедуры


// Проверяет необходимость выполнить выгрузку на сервере
//
Процедура ВыполнитьЗапросНеобходимостьВыгрузкиИзменений(ЗапросИОтвет)
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ложь;
	Если ОбменДаннымиСлужебный.ИзмененияЗарегистрированы(ЗапросИОтвет.УзелКорреспондента) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если Не Результат Тогда
		ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(ЗапросИОтвет.УзелКорреспондента);
		Если ПараметрыОбмена.ЗатребованныйСценарий <> Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных
			Или ПараметрыОбмена.СценарийПереданныхДанных <> Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных
			Или ПараметрыОбмена.СценарийЗапрашиваемыхДанных <> Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЗапросИОтвет.Ответ.Вставить("НужнаВыгрузкаНаСервере", Результат);
	
	
КонецПроцедуры


// Проверяет состояние выгрузки на сервере и, при необходимости, запускает фоновое задание выгрузки изменений
//
Процедура ВыполнитьЗапросВыгрузкаИзменений(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, "НомерПакета") Тогда
		Возврат;
	КонецЕсли;
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ВсеКодыРезультатов   = ЗапросИОтвет.ВсеКодыРезультатов;
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	
	// Проверка фонового задания
	//(следует выполнять до проверки номеров пакетов, т.к. НомерОтправленного устанавливается после выгрузки)
	КлючФЗ = "";
	АктивноеФЗ = АктивноеФоновоеЗаданиеВыгрузки(СостояниеОбмена.КодУзлаКорреспондента, КлючФЗ);
	Если АктивноеФЗ <> Неопределено И АктивноеФЗ.Выполняется Тогда
		ЗапросИОтвет.Ответ.Вставить("Передача", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Передача));
		Возврат;
	КонецЕсли;
	
	// Проверка результата фонового задания
	Если СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка
		И ЗначениеЗаполнено(СостояниеОбмена.Передача.КодРезультатаДействия)
		И ЗначениеЗаполнено(СостояниеОбмена.Передача.НомерПакета)
		И СостояниеОбмена.Передача.НомерПакета = СостояниеОбмена.НомерОтправленного Тогда
		
		ЗапросИОтвет.Ответ.Вставить("Передача", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Передача));
		Возврат;
			
	КонецЕсли;
	
	// проверка зарегистрированных изменений
	Если СостояниеОбмена.СценарийОбмена = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных
		И Не ОбменДаннымиСлужебный.ИзмененияЗарегистрированы(ЗапросИОтвет.УзелКорреспондента) Тогда
		
		АвтоматСинхронизацииССервисом.ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Загрузка", 
					ВсеКодыРезультатов.ОтсутствуютДанныеДляВыгрузки.Код, 
					НСтр("ru='На сервере нет записей, зарегистрированных для выгрузки'"));
		ЗапросИОтвет.Ответ.Вставить("Передача", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Передача));
		Возврат;
		
	КонецЕсли;
	
	// проверка возможности заблокировать запись для загрузки
	Если Не РегистрыСведений.КонтрольПроцессовОбменаДанными.ДоступноДляБлокировки(ЗапросИОтвет.УзелКорреспондента, "Передача") Тогда
		ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера();
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.СинхронизацияУжеВыполняется.Код,
			ВсеКоды.СинхронизацияУжеВыполняется.ТекстОписания, 
			НСтр("ru='На сервере невозможно запустить выгрузку изменений: заблокирована контрольная запись ""Передача"" для узла плана обмена'"), 
			Ложь);
		Возврат;
	КонецЕсли;
	
	// Запуск фонового задания выгрузки
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Узел", ЗапросИОтвет.УзелКорреспондента);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Выгрузка данных для узла ""%1""'"), 
					СостояниеОбмена.КодУзлаКорреспондента);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФЗ;
	ПараметрыВыполнения.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне   = Истина;
	
	АктивноеФЗ = ДлительныеОперации.ВыполнитьВФоне(
		"АвтоматСинхронизацииССервисом.ВыполнитьВФонеВыгрузитьДанные",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	Если АктивноеФЗ.Статус = "Ошибка" Тогда
		АвтоматСинхронизацииССервисом.ОтметитьЗавершениеДействия(СостояниеОбмена, "Передача", "Выгрузка", 
					ВсеКодыРезультатов.ОшибкаНаСервере.Код, АктивноеФЗ.ПодробноеПредставлениеОшибки);
	Иначе
		// Обновление результов загрузки данных
		СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	КонецЕсли;
	
	ЗапросИОтвет.Ответ.Вставить("Передача", ПодготовитьСтруктуруКПередачеВJSON(СостояниеОбмена.Передача));
	
КонецПроцедуры

Функция АктивноеФоновоеЗаданиеВыгрузки(КодУзлаКорреспондента, КлючФЗ)
	
	КлючФЗ = "Выгрузка данных для узла " + КодУзлаКорреспондента;
	Возврат ОбщегоНазначенияДеньги.СвойстваФоновогоЗадания(КлючФЗ, , Истина);
	
КонецФункции

// Возвращает номер пакета и количество частей, подготовленных к отправке
Процедура ВыполнитьЗапросИнформацияОПакетеКОтправке(ЗапросИОтвет)
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	Пакеты = РегистрыСведений.ПакетыСинхронизацииКОтправке.ОчередьПакетовДляУзла(ЗапросИОтвет.УзелКорреспондента,
						Неопределено, Истина);
	
	ПакетКОтправке = Неопределено;
	Если ЗначениеЗаполнено(Пакеты) Тогда
		ПакетКОтправке = Новый Структура("НомерПакета,ВсегоЧастей,ТипПакета,ДатаВыгрузки");
		ПакетКОтправке.НомерПакета  = Пакеты[0].НомерПакетаКОтправке;
		ПакетКОтправке.ВсегоЧастей  = Пакеты[0].ВсегоЧастей;
		ПакетКОтправке.ТипПакета    = Пакеты[0].ТипПакета;
		ПакетКОтправке.ДатаВыгрузки = Пакеты[0].ДатаВыгрузки;
	КонецЕсли;
	
	ЗапросИОтвет.Ответ.Вставить("ПакетКОтправке", ПакетКОтправке);
	
КонецПроцедуры


// Проверяет регистрацию узла в плане обмена и, по необходимости, обновляет параметры обмена, полученные от устройства
//
Процедура ВыполнитьЗапросПроверитьРегистрациюУзла(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, 
				"Наименование") Тогда
		Возврат;
	КонецЕсли;

	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	КодУзлаКорреспондента = ЗапросИОтвет.СтруктураЗапроса.general.ib;
	ЗапросИОтвет.УзелКорреспондента = СинхронизацияАвтономныхКопий.УзелПланаОбменаПоКоду(ЗапросИОтвет.ИмяПланаОбмена, 
				КодУзлаКорреспондента);
	
	Если Не ЗначениеЗаполнено(ЗапросИОтвет.УзелКорреспондента) Тогда
		
		// Проверка привязки клиента к центральной базе
		КодЦБ = ЗапросИОтвет.СтруктураЗапроса.general.cib;
		КодЭтогоУзла = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла(ЗапросИОтвет.ИмяПланаОбмена);
		Если КодЦБ <> "000" И КодЦБ <> КодЭтогоУзла Тогда
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, 
					ЗапросИОтвет.ВсеКодыСостояния.ЧужойСервер.Код, 
					ЗапросИОтвет.ВсеКодыСостояния.ЧужойСервер.ТекстОписания, 
					НСтр("ru='Информационная база привязана к другому серверу'"),
					Истина);
			Возврат;
		КонецЕсли;
		
		// требуется зарегистрировать новый узел
		Если Не ЗарегистрироватьУстройствоВПланеОбмена(ЗапросИОтвет) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверка и обновление значений узла плана обмена
	Если ЗапросИОтвет.СтруктураЗапроса.Свойство("ПараметрыОбмена") Тогда
		Если Не ОбновитьПараметрыОбменаУзла(ЗапросИОтвет) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	// подготовка ответа
	ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(ЗапросИОтвет.УзелКорреспондента, Истина);
	ПараметрыКОтправке = Новый Структура("Наименование,Активность,СинхронизацияЗапрещена,МобильноеУстройство,ПользовательБазы,
			|ВерсияФорматаОбмена,ЗатребованныйСценарий,НомерОтправленного,НомерПринятого,СценарийПереданныхДанных,
			|СценарийЗапрашиваемыхДанных,КоличествоПериодов,ВидПериода");
	ЗаполнитьЗначенияСвойств(ПараметрыКОтправке, ПараметрыОбмена);
	
	ЗапросИОтвет.Ответ.Вставить("ПараметрыОбмена", ПараметрыКОтправке);
	
КонецПроцедуры

Функция ЗарегистрироватьУстройствоВПланеОбмена(ЗапросИОтвет)
	
	КодУзлаКорреспондента = ЗапросИОтвет.СтруктураЗапроса.general.ib;
	СвойстваУзла = Новый Структура;
	СвойстваУзла.Вставить("Наименование", ЗапросИОтвет.СтруктураЗапроса.Наименование);
	СвойстваУзла.Вставить("МобильноеУстройство", ЗапросИОтвет.ИмяПланаОбмена = "МобильноеПриложение" 
												Или ЗапросИОтвет.СтруктураЗапроса.General.mobile);
	СвойстваУзла.Вставить("Активность", Истина);
	СвойстваУзла.Вставить("ВерсияФорматаОбмена", ЗапросИОтвет.СтруктураЗапроса.General.format);

	Попытка
		ЗапросИОтвет.УзелКорреспондента = СинхронизацияАвтономныхКопий.НовыйУзелПланаОбмена(
				ЗапросИОтвет.ИмяПланаОбмена,
				КодУзлаКорреспондента, 
				ЗапросИОтвет.СтруктураЗапроса.Наименование, 
				СвойстваУзла, 
				Истина);
				
	Исключение
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, 
				ЗапросИОтвет.ВсеКодыСостояния.ОшибкаНаСервере.Код, 
				СтрШаблон(НСтр("ru='Не удалось зарегистрировать узел ""%1"" на сервере'"), КодУзлаКорреспондента), 
				СтрШаблон(НСтр("ru='На сервере при регистрации узла ""%1"" в плане обмена ""%2"" возникла ошибка:
				|%3'"), КодУзлаКорреспондента, ЗапросИОтвет.ИмяПланаОбмена, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), 
				Истина);
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ОбновитьПараметрыОбменаУзла(ЗапросИОтвет)
	
	КодУзлаКорреспондента = ЗапросИОтвет.СтруктураЗапроса.general.ib;
	ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(ЗапросИОтвет.УзелКорреспондента);
	Изменения = Новый Структура;
	Для Каждого КлючИЗначение Из ЗапросИОтвет.СтруктураЗапроса.ПараметрыОбмена Цикл
		
		ЗначениеРеквизита = Неопределено;
		Если КлючИЗначение.Ключ = "ЗатребованныйСценарий" Тогда
			
			Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				ЗначениеРеквизита = Неопределено;
			Иначе
				Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
				Если Режим = "ЦентрМобильных" Тогда
					ЗначениеРеквизита = Перечисления.СценарииОбменаСМобильнымПриложением[КлючИЗначение.Значение];
				Иначе
					ЗначениеРеквизита = Перечисления.СценарииСинхронизацииАвтономныхКопий[КлючИЗначение.Значение];
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли КлючИЗначение.Ключ = "СценарийПереданныхДанных"
			Или КлючИЗначение.Ключ = "СценарийЗапрашиваемыхДанных" Тогда
			
			Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				ЗначениеРеквизита = Неопределено;
			ИначеЕсли КлючИЗначение.Значение = "ЗаменитьВсеВАвтономнойКопии"
					Или КлючИЗначение.Значение = "МобильныеЗаменитьНастольными" Тогда 
				ЗначениеРеквизита = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии;
			ИначеЕсли КлючИЗначение.Значение = "НастольныеЗаменитьМобильными"
					Или КлючИЗначение.Значение = "МобильныеЗаменитьНастольными" Тогда 
				ЗначениеРеквизита = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе;
			Иначе
				ЗначениеРеквизита = Перечисления.СценарииСинхронизацииАвтономныхКопий[КлючИЗначение.Значение];
			КонецЕсли;
			
		ИначеЕсли КлючИЗначение.Ключ = "ВидПериода" Тогда
			
			Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				ЗначениеРеквизита = Неопределено;
			Иначе
				ЗначениеРеквизита = Перечисления.Периодичность[КлючИЗначение.Значение];
			КонецЕсли;
			
		ИначеЕсли КлючИЗначение.Ключ = "ПользовательБазы" Тогда
			
			Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				ЗначениеРеквизита = СинхронизацияАвтономныхКопий.ОпределитьПользователяПоСтруктуреКлючевыхСвойств(
									ЗапросИОтвет.УзелКорреспондента, КлючИЗначение.Значение);
			КонецЕсли;

		ИначеЕсли КлючИЗначение.Ключ = "НомерПринятого" Или КлючИЗначение.Ключ = "НомерОтправленного" Тогда
			Продолжить;

		Иначе
			ЗначениеРеквизита = КлючИЗначение.Значение;
		КонецЕсли;
		
		Если ПараметрыОбмена.Свойство(КлючИЗначение.Ключ) 
			И ПараметрыОбмена[КлючИЗначение.Ключ] <> ЗначениеРеквизита Тогда
			Изменения.Вставить(КлючИЗначение.Ключ, ЗначениеРеквизита);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Изменения) Тогда	
		
		Попытка
			СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(ЗапросИОтвет.УзелКорреспондента, Изменения);;
		Исключение
			ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ, 
				ЗапросИОтвет.ВсеКодыСостояния.ОшибкаНаСервере.Код, 
				СтрШаблон(НСтр("ru='на сервере не удалось обновить параметры обмена для узла ""%1""'"), КодУзлаКорреспондента), 
				СтрШаблон(НСтр("ru='На сервере при записи параметров обмена узла ""%1"" плана обмена ""%2"" возникла ошибка:
				|%3'"), КодУзлаКорреспондента, ЗапросИОтвет.ИмяПланаОбмена, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), 
				Истина);
			Возврат Ложь;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


// Регистрирует или отменяет регистрацию объктов для указанного узла плана обмена
//
Процедура ВыполнитьЗапросУстановитьРегистрациюОбъектов(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, 
				"ВариантРегистрации") Тогда
		Возврат;
	КонецЕсли;

	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ВариантРегистрации = Нрег(СокрЛП(ЗапросИОтвет.СтруктураЗапроса.ВариантРегистрации));
	Если ВариантРегистрации = "зарегистрировать все" Тогда
		
		ПланыОбмена.ЗарегистрироватьИзменения(ЗапросИОтвет.УзелКорреспондента);
		
	ИначеЕсли ВариантРегистрации = "отменить регистрацию всего" Тогда
	
		ПланыОбмена.УдалитьРегистрациюИзменений(ЗапросИОтвет.УзелКорреспондента);
			
	Иначе
		ВсеКоды = ЗапросИОтвет.ВсеКодыСостояния;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ВсеКоды.ОшибкаЗапроса.Код,
			СтрШаблон(НСтр("ru='Неизвестный вариант регистрации изменений: ""%1""'"), ЗапросИОтвет.СтруктураЗапроса.ВариантРегистрации), 
			СтрШаблон(НСтр("ru='Для команды setregchanges значение параметра ""ВариантРегистрации"" имеет некорректное значение ""%1""'"), 
					ЗапросИОтвет.СтруктураЗапроса.ВариантРегистрации), 
			Истина);
		Возврат;
		
	КонецЕсли;
	
	// значение не возвращается
	
КонецПроцедуры


// Останавливает (если это возможно) процессы обмена, обнуляет состояние обмена и очищает пакеты
//
Процедура ВыполнитьЗапросОстановитьПроцессыОбмена(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, 
				"Процесс") Тогда
		Возврат;
	КонецЕсли;

	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	
	Процесс = Нрег(СокрЛП(ЗапросИОтвет.СтруктураЗапроса.Процесс));
	Если Процесс = "прием" Или Не ЗначениеЗаполнено(Процесс) Тогда
		Если Не ОтменитьПроцессПриема(ЗапросИОтвет, СостояниеОбмена) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если Процесс = "передача" Или Не ЗначениеЗаполнено(Процесс) Тогда
		Если Не ОтменитьПроцессПередачи(ЗапросИОтвет, СостояниеОбмена) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// значение не возвращается
	
КонецПроцедуры

Функция ОтменитьПроцессПриема(ЗапросИОтвет, СостояниеОбмена)
	
	// Проверка фонового задания
	КлючФЗ = "";
	АктивноеФЗ = АктивноеФоновоеЗаданиеЗагрузки(ЗапросИОтвет.СтруктураЗапроса.general.ib, КлючФЗ);
	Если АктивноеФЗ <> Неопределено И АктивноеФЗ.Выполняется Тогда
		ВсеКоды = ЗапросИОтвет.ВсеКодыСостояния;
		ДеньгиОбработкаВебЗапросов.ЗаписатьПроблемуВСтруктуруОтвета(ЗапросИОтвет.Ответ,
			ВсеКоды.СинхронизацияУжеВыполняется.Код,
			ВсеКоды.СинхронизацияУжеВыполняется.ТекстОписания, 
			НСтр("ru='Невозможно отменить процесс приема: на сервере выполняется фоновое задание чтения данных'"), 
			Ложь);
		Возврат Ложь;
	КонецЕсли;
	
	АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена, "Прием");

	Возврат Истина;
	
КонецФункции

Функция ОтменитьПроцессПередачи(ЗапросИОтвет, СостояниеОбмена)
	
	// Проверка фонового задания
	КлючФЗ = "";
	АктивноеФЗ = АктивноеФоновоеЗаданиеВыгрузки(ЗапросИОтвет.СтруктураЗапроса.general.ib, КлючФЗ);
	Если АктивноеФЗ <> Неопределено И АктивноеФЗ.Выполняется Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(АктивноеФЗ.УникальныйИдентификатор);
	КонецЕсли;
	
	АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена, "Передача");
	
	Возврат Истина;
	
КонецФункции


// Возвращает массив остатков на указанную дату
//
Процедура ВыполнитьЗапросПолучитьОстатки(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, 
				"ДатаОстатков") Тогда
		Возврат;
	КонецЕсли;

	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОстатков", НачалоДня(ЗапросИОтвет.СтруктураЗапроса.ДатаОстатков)-1);
	Запрос.УстановитьПараметр("СчетКапитал", ПланыСчетов.РазделыУчета.Капитал);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЖурналОперацийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.ПроцентыПоДолгам)
	|		ИЛИ ЖурналОперацийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.ОсновныеСуммыДолгов)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Долги)
	|		ИНАЧЕ ЖурналОперацийОстатки.Счет
	|	КОНЕЦ КАК РазделУчета,
	|	ЖурналОперацийОстатки.Субконто1 КАК ОбъектУчета,
	|	ЖурналОперацийОстатки.Субконто2 КАК ФинансоваяЦель,
	|	ЖурналОперацийОстатки.Валюта КАК Валюта,
	|	СУММА(ВЫБОР
	|		КОГДА ЖурналОперацийОстатки.Счет <> ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.ПроцентыПоДолгам)
	|			ТОГДА ЖурналОперацийОстатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА ЖурналОперацийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.ПроцентыПоДолгам)
	|			ТОГДА ЖурналОперацийОстатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаПроцентов
	|ИЗ
	|	РегистрБухгалтерии.ЖурналОпераций.Остатки(&ДатаОстатков, Счет <> &СчетКапитал,,) КАК ЖурналОперацийОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ЖурналОперацийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.ПроцентыПоДолгам)
	|		ИЛИ ЖурналОперацийОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.ОсновныеСуммыДолгов)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.РазделыУчета.Долги)
	|		ИНАЧЕ ЖурналОперацийОстатки.Счет
	|	КОНЕЦ,
	|	ЖурналОперацийОстатки.Субконто1,
	|	ЖурналОперацийОстатки.Субконто2,
	|	ЖурналОперацийОстатки.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазделУчета,
	|	ОбъектУчета,
	|	ФинансоваяЦель,
	|	Валюта";
	
	МассивОстатков = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОстатков.Добавить(ВыгрузкаОстатка(Выборка));
	КонецЦикла;
	
	ЗапросИОтвет.Ответ.Вставить("ОстаткиПоРазделамУчета", МассивОстатков);
	
КонецПроцедуры

Функция ВыгрузкаОстатка(Выборка)
	
	Результат = Новый Структура("РазделУчета,ОбъектУчета,ФинансоваяЦель,Валюта,Сумма,СуммаПроцентов");
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	Возврат Результат;
	
КонецФункции


// Удаляет пакеты не более указанного номера (или все) из РС ПакетыСинхронизацииКОтправке 
// или ПакетыСинхронизацииПолученные
Процедура ВыполнитьЗапросУдалитьПакеты(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, "НомерПакета,ТипПакетов") Тогда
		Возврат;
	КонецЕсли;
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ЗапросИОтвет.СтруктураЗапроса;
	Если Нрег(ПараметрыЗапроса.ТипПакетов) = "полученные" Тогда
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(ЗапросИОтвет.УзелКорреспондента, 
				ПараметрыЗапроса.НомерПакета);
	Иначе
		РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(ЗапросИОтвет.УзелКорреспондента, 
				ПараметрыЗапроса.НомерПакета);
	КонецЕсли;
	
	ЗапросИОтвет.Ответ.Вставить("Результат", Истина);
	
КонецПроцедуры


// Очищает и заполняет значениями по умолчанию состояние синхронизации для указанного процесса (или для обоих процессов) 
// 
Процедура ВыполнитьЗапросСброситьСостояниеСинхронизации(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, "ПроцессНаСервере") Тогда
		Возврат;
	КонецЕсли;
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ЗапросИОтвет.СтруктураЗапроса;
	СостояниеОбменаВЭтойБазе = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	СостояниеОбменаНаКлиенте = Неопределено;
	ПроверятьСостояния = ПараметрыЗапроса.Свойство("СостояниеОбмена", СостояниеОбменаНаКлиенте) 
							И СостояниеОбменаНаКлиенте <> Неопределено;
	
	Если ПроверятьСостояния Тогда
		ПроверитьСосояниеОбменаПолученноеОтКлиента(СостояниеОбменаВЭтойБазе, 
					СостояниеОбменаНаКлиенте, 
					ПараметрыЗапроса.ПроцессНаСервере,
					ЗапросИОтвет.УзелКорреспондента);
	КонецЕсли;
	
	АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбменаВЭтойБазе, ПараметрыЗапроса.ПроцессНаСервере);
	
	ЗапросИОтвет.Ответ.Вставить("Результат", Истина);
	
КонецПроцедуры


// Проверяет состояние обмена, переданное с клиента, и, при необходимости, обновляет параметры
// и регистрацию объектов на сервере
//
Процедура ВыполнитьЗапросОбновитьСостояниеОбменаПоРезультатамСКлиента(ЗапросИОтвет)
	
	// проверка обязательных параметров в запросе
	Если Не ДеньгиОбработкаВебЗапросов.УказаныПараметрыМетодаExecute(ЗапросИОтвет, "ПроцессНаСервере,СостояниеОбмена") Тогда
		Возврат;
	КонецЕсли;
	
	// проверка доступности сервера
	Если Не ПроверитьПередВыполнениемМетодаExecute(ЗапросИОтвет) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = ЗапросИОтвет.СтруктураЗапроса;
	СостояниеОбменаВЭтойБазе = АвтоматСинхронизацииССервисом.СостояниеОбмена(ЗапросИОтвет.УзелКорреспондента);
	СостояниеОбменаНаКлиенте = ПараметрыЗапроса.СостояниеОбмена;
	ПроверитьСосояниеОбменаПолученноеОтКлиента(СостояниеОбменаВЭтойБазе, 
					СостояниеОбменаНаКлиенте, 
					ПараметрыЗапроса.ПроцессНаСервере,
					ЗапросИОтвет.УзелКорреспондента);
	
	ЗапросИОтвет.Ответ.Вставить("Результат", Истина);
	
КонецПроцедуры

Процедура ПроверитьСосояниеОбменаПолученноеОтКлиента(СостояниеОбменаВЭтойБазе, СостояниеОбменаНаКлиенте, Процесс, УзелКорреспондента)
	
	ПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(УзелКорреспондента);
	
	Если Процесс = "" Или Нрег(Процесс) = "передача" Тогда
		// Проверка передачи с сервера на клиент 
		
		Если СостояниеОбменаНаКлиенте.НомерПринятого > 0
			И СостояниеОбменаНаКлиенте.НомерПринятого <= СостояниеОбменаВЭтойБазе.НомерОтправленного Тогда
			
			// клиент загрузил пакет, полученный с сервера
			ПланыОбмена.УдалитьРегистрациюИзменений(СостояниеОбменаВЭтойБазе.УзелКорреспондента, СостояниеОбменаНаКлиенте.НомерПринятого);
			РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(УзелКорреспондента, 
					СостояниеОбменаНаКлиенте.НомерПринятого);
			
			// если установлен нестандартный сценарий и пакет >= котрольный номер
			СценарийНестандартный = (ПараметрыОбмена.ЗатребованныйСценарий =
						Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии
				Или ПараметрыОбмена.ЗатребованныйСценарий = 
						Перечисления.СценарииОбменаСМобильнымПриложением.МобильныеЗаменитьНастольными);
			
			Если СценарийНестандартный И СостояниеОбменаНаКлиенте.НомерДляУстановленногоСценария > 0
				И СостояниеОбменаНаКлиенте.НомерДляУстановленногоСценария <= СостояниеОбменаНаКлиенте.НомерПринятого Тогда
				
				СинхронизацияАвтономныхКопий.УстановитьСтандартныйСценарийЗапросаДанных(УзелКорреспондента);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Обновление процесса
		ЗаполнитьСостояниеПроцессаДаннымиСКлиента(СостояниеОбменаВЭтойБазе, СостояниеОбменаНаКлиенте, "Передача");
		
	КонецЕсли;
	
	Если Процесс = "" Или Нрег(Процесс) = "прием" Тогда
		// Прием данных на сервере
		
		Если СостояниеОбменаВЭтойБазе.НомерПринятого > 0 
			И СостояниеОбменаВЭтойБазе.НомерПринятого <= СостояниеОбменаНаКлиенте.НомерОтправленного Тогда
			
			// на сервере загружен пакет от клиента
			РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(УзелКорреспондента, 
					СостояниеОбменаВЭтойБазе.НомерПринятого);
			
		КонецЕсли;
		
		ЗаполнитьСостояниеПроцессаДаннымиСКлиента(СостояниеОбменаВЭтойБазе, СостояниеОбменаНаКлиенте, "Прием");
		
	КонецЕсли;
	
	ПроцессыОбменаСлужебный.ЗаписатьСостояниеВРегистр(СостояниеОбменаВЭтойБазе, Процесс);
	
КонецПроцедуры

Процедура ЗаполнитьСостояниеПроцессаДаннымиСКлиента(СостояниеВЭтойБазе, СостояниеНаКлиенте, Процесс)
	
	СостояниеПроцессаВЭтойБазе = СостояниеВЭтойБазе[Процесс];
	СостояниеПроцессаНаКлиенте = СостояниеНаКлиенте[?(Нрег(Процесс) = "прием", "Передача", "Прием")];
	
	СтруктураПолей = Новый Структура("КодРезультатаДействия,НомерПакета,Количество,НомерОбработанного,ОбъектовВсего,ОбъектовОбработано,ТекстОшибки");
	ЗаполнитьЗначенияСвойств(СтруктураПолей, СостояниеПроцессаНаКлиенте);
	Для Каждого КлючИЗначение Из СтруктураПолей Цикл
		Если КлючИЗначение.Значение <> Неопределено Тогда
			СостояниеПроцессаВЭтойБазе[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если СостояниеПроцессаНаКлиенте.Свойство("ДействиеПроцесса") Тогда 
	
		ДействиеНаКлиенте = СостояниеПроцессаНаКлиенте.ДействиеПроцесса;
		Если ТипЗнч(ДействиеНаКлиенте) = Тип("Строка") Тогда
		// Получение на сервере - это отправка на клиенте и наоборот
		
			Если Не ЗначениеЗаполнено(ДействиеНаКлиенте) Тогда
				СостояниеПроцессаВЭтойБазе.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.ПустаяСсылка(); 
			ИначеЕсли ДействиеНаКлиенте = "Отправка" Тогда
				СостояниеПроцессаВЭтойБазе.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение;
			ИначеЕсли ДействиеНаКлиенте = "Получение" Тогда
				СостояниеПроцессаВЭтойБазе.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка;
			Иначе
				СостояниеПроцессаВЭтойБазе.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена[ДействиеНаКлиенте];
			КонецЕсли;
			
		Иначе
			СостояниеПроцессаВЭтойБазе.ДействиеПроцесса = ДействиеНаКлиенте;
		КонецЕсли;
		
	КонецЕсли;
	
 	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СостояниеПроцессаВЭтойБазе.ПроцессЗавершен = Ложь;
	Если СостояниеПроцессаВЭтойБазе.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка
				И СостояниеПроцессаВЭтойБазе.КодРезультатаДействия = ВсеКоды.Выполнено.Код
				Или ЗначениеЗаполнено(СостояниеПроцессаВЭтойБазе.КодРезультатаДействия) 
					И СостояниеПроцессаВЭтойБазе.КодРезультатаДействия <> ВсеКоды.Выполнено.Код Тогда
		СостояниеПроцессаВЭтойБазе.ПроцессЗавершен = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Обработчики_2_0

Функция ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел = Неопределено, ИмяПланаОбмена = Неопределено, СоздаватьНовый = Ложь, Наименование = Неопределено) 
	
	Ответ = Неопределено;
	
	КодУзла = ДеньгиОбработкаВебЗапросов.ЗначениеПараметраЗапроса(Запрос, "DBID");
	Если Не ЗначениеЗаполнено(КодУзла) Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе остутствуют код информационной базы'"), ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Узел = СинхронизацияАвтономныхКопий.УзелПланаОбменаПоКоду(ИмяПланаОбмена, 
						КодУзла, СоздаватьНовый, Наименование);
	ТекстОшибки = "";
	Кодошибки   = 0;
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='На сервере не найден узел для информационной базы %1'"), КодУзла), ИмяСервиса);
		КодОшибки = 404;
	ИначеЕсли Узел.СинхронизацияЗапрещена Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='На сервере установлен запрет на синхронизацию с базой %1'"), КодУзла), ИмяСервиса);
		КодОшибки = 403;
	ИначеЕсли Не Узел.Активность Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='На сервере база с кодом %1 отмечена устаревшей'"), КодУзла), ИмяСервиса);
		КодОшибки = 403;
	КонецЕсли;
	
	Если Кодошибки <> 0 Тогда
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(Кодошибки, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ = Неопределено;
	
КонецФункции

Функция ПроверитьКодЦентральнойБазы(КодЦентральнойБазы, ПланОбмена, ИмяСервиса, Ответ) 
	
	Если КодЦентральнойБазы = "000" Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодЭтогоУзла = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла(ПланОбмена);
	Если КодЭтогоУзла = "000" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Ответ = Неопределено;
	Если КодЦентральнойБазы <> КодЭтогоУзла Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='Эта информационная база привязана к другой настольной программе или облачному сервису'"), 
				ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(403, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ = Неопределено;
	
КонецФункции 

Функция ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
	Результат = Истина;
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "ЦентрМобильных" Тогда
		ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
		Если ПараметрыДомашняяСеть.ЗапретитьИспользование Тогда
			ТекстОшибки = НСтр("ru='В настольной программе отключена синхронизация в домашней сети.
				|Включить ее можно в настольной программе в меню ""Сервис"" - ""Синхронизация с мобильными устройствами""'");
			Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(409, ТекстОшибки, ИмяСервиса);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Не СинхронизацияАвтономныхКопийВызовСервера.ЭтоЦентральнаяБаза() Тогда
		
		Если Режим = "КлиентОблака" Тогда
			ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
					НСтр("ru='Настольная программа не может использоваться для синхронизации мобильных устройств.
						|Измените способ синхронизации в настольной программе'") , 
					ИмяСервиса);
		Иначе
			ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
					СтрШаблон(НСтр("ru='Удаленная информационная база не является центральным узлом синхронизации.
					|Она работает в режиме ""%1"".
					|Пожалуйста, обратитесь в службу поддержки за помощью в устранении этой проблемы'"), Режим) , 
					ИмяСервиса);
		КонецЕсли;
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(409, ТекстОшибки, ИмяСервиса);
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция СинхронизацияВозможна(Запрос) 
	
	ИмяСервиса = ИмяСервиса("allowed");
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	// Проверка того, что информационная база является центральной для остальных баз.
	Если Не СинхронизацияАвтономныхКопийВызовСервера.ЭтоЦентральнаяБаза() Тогда
		Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
		Если Режим = "КлиентОблака" Тогда
			ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
					НСтр("ru='Настольная программа не может использоваться для синхронизации мобильных устройств.
						|Измените способ синхронизации в настольной программе'") , 
					ИмяСервиса);
		Иначе
			ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
					СтрШаблон(НСтр("ru='Удаленная информационная база не является центральным узлом синхронизации.
					|Она работает в режиме ""%1"".
					|Пожалуйста, обратитесь в службу поддержки за помощью в устранении этой проблемы'"), Режим) , 
					ИмяСервиса);
		КонецЕсли;
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	// Проверка прав для выполнения обмена.
	Попытка
		ОбменДаннымиСервер.ПроверитьВозможностьВыполненияОбменов(Истина);
	Исключение
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(ИнформацияОбОшибке(), ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ТекстОшибки, ИмяСервиса);
	КонецПопытки;
	
	Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	
	Возврат Ответ;
	
КонецФункции 

Функция ОбработкаСостоянияСинхронизации(Запрос) 
	
	ИмяСервиса = ИмяСервиса("status");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, 
			СостояниеСинхронизацииСУзлом(Узел), 
			ИмяСервиса);
	
КонецФункции 

//Обеспечение обратной совместимости контроля состояния обмена
//
Функция СостояниеСинхронизацииСУзлом(Узел, Этап = Неопределено, Действие = Неопределено) 
	
	ВсеКодыРезультатов = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);

	Результат = Новый Структура;
	// акутальные номера
	Результат.Вставить("НомерПринятого",            СостояниеОбмена.НомерПринятого);
	Результат.Вставить("НомерОтправленного",        СостояниеОбмена.НомерОтправленного);
	Результат.Вставить("ПланОбмена",                СостояниеОбмена.ИмяПланаОбмена);
	Результат.Вставить("НаименованиеУзлаНаСервере", СокрЛП(Узел));
	
	// Текущее действие синхронизации и ошибки последнего действия
	Результат.Вставить("ОчередностьЭтапов", Перечисления.ОчередностьЭтаповОбменаДанными.СначалаЗагрузка);
	Результат.Вставить("Этап", Этап);
	Результат.Вставить("Действие", Действие);
	Результат.Вставить("Результат", Неопределено);
	Результат.Вставить("ТекстПредупреждения", "");
	Результат.Вставить("КодОшибки", 0);
	
	Результат.Вставить("ВыгрузкаРезультат",           "");
	Результат.Вставить("ВыгрузкаПредставлениеОшибки", "");
	Результат.Вставить("ВыгрузкаТекстОшибки",         "");
	Результат.Вставить("ВыгрузкаКоличество",          0);
	Результат.Вставить("ВыгрузкаНомерПакета",         "");
	Результат.Вставить("ВыгрузкаДата",                Дата(1,1,1));
	
	Результат.Вставить("ЗагрузкаРезультат",           "");
	Результат.Вставить("ЗагрузкаПредставлениеОшибки", "");
	Результат.Вставить("ЗагрузкаТекстОшибки",         "");
	Результат.Вставить("ЗагрузкаКоличество",          0);
	Результат.Вставить("ЗагрузкаНомерПакета",         "");
	Результат.Вставить("ЗагрузкаДата",                Дата(1,1,1));
	
	
	// Заполнение старого формата из нового РС
	Если ЗначениеЗаполнено(СостояниеОбмена.Передача.ДействиеПроцесса) Тогда
		// выполняется передача данных с сервера на клиент
		Результат.Этап = Перечисления.ДействияПриОбмене.ВыгрузкаДанных;
		Результат.ВыгрузкаНомерПакета = СостояниеОбмена.Передача.НомерПакета;
		
		Если СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
			Результат.Действие = Перечисления.ДействияПроцессаСинхронизации.ВыгрузкаНаСервере;
		ИначеЕсли СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка Тогда
			Результат.Действие = Перечисления.ДействияПроцессаСинхронизации.ПолучениеССервера;
		КонецЕсли;
		
		Если СостояниеОбмена.Передача.ПроцессЗавершен Тогда
			
			Результат.Вставить("ВыгрузкаДата", СостояниеОбмена.Передача.ЗавершениеДействия);
			ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(
					СостояниеОбмена.Передача.КодРезультатаДействия);
					
			Если ОписаниеРезультата.ЯвляетсяУспехом Тогда
				Результат.ВыгрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.Выполнено;
				
			ИначеЕсли ОписаниеРезультата.ЯвляетсяОшибкой Тогда
				Результат.ВыгрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ЗавершеноСОшибкой;
				Результат.КодОшибки = СостояниеОбмена.Передача.КодРезультатаДействия;
				
			ИначеЕсли СостояниеОбмена.Передача.КодРезультатаДействия = ВсеКодыРезультатов.ОтсутствуютДанныеДляВыгрузки.Код
				Или СостояниеОбмена.Передача.КодРезультатаДействия = ВсеКодыРезультатов.ОтсутствуютДанныеДляЗагрузки.Код Тогда
				Результат.ВыгрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ПропущеноИзЗаОтсутствияДанных;
				
			ИначеЕсли СостояниеОбмена.Передача.КодРезультатаДействия = ВсеКодыРезультатов.НетЛицензий.Код Тогда
				Результат.ВыгрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ОтсутствуютЛицензии;
				
			Иначе
				Результат.ВыгрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ЗавершеноСОшибкой;
				
			КонецЕсли;
			
			Результат.Результат = Результат.ВыгрузкаРезультат;
			
			Если Не ОписаниеРезультата.ЯвляетсяУспехом Тогда
				Результат.ВыгрузкаТекстОшибки = СостояниеОбмена.Передача.ТекстОшибки;
				Результат.ВыгрузкаПредставлениеОшибки = ОписаниеРезультата.ТекстОписания 
					+ Символы.ПС + СостояниеОбмена.Передача.ТекстОшибки;
			КонецЕсли;
			
		Иначе
			
			Результат.ВыгрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.Выполняется;
			Результат.ВыгрузкаДата = СостояниеОбмена.Передача.НачалоДействия;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СостояниеОбмена.Прием.ДействиеПроцесса) Тогда
		// выполняется передача данных с сервера на клиент
		Результат.Этап = Перечисления.ДействияПриОбмене.ЗагрузкаДанных;
		Результат.ЗагрузкаНомерПакета = СостояниеОбмена.Прием.НомерПакета;
		
		Если СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
			Результат.Действие = Перечисления.ДействияПроцессаСинхронизации.ЗагрузкаНаСервере;
		ИначеЕсли СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение Тогда
			Результат.Действие = Перечисления.ДействияПроцессаСинхронизации.ОтправкаНаСервер;
		КонецЕсли;
		
		// Зарузка на сервере
		Если СостояниеОбмена.Прием.ПроцессЗавершен Тогда
			
			ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(
					СостояниеОбмена.Прием.КодРезультатаДействия);
			Если ОписаниеРезультата.ЯвляетсяУспехом Тогда
				Результат.ЗагрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.Выполнено;
			
			ИначеЕсли ОписаниеРезультата.ЯвляетсяОшибкой Тогда
				Результат.КодОшибки = СостояниеОбмена.Прием.КодРезультатаДействия;
				Результат.ЗагрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ЗавершеноСОшибкой;
			
			ИначеЕсли СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКодыРезультатов.НетЛицензий.Код Тогда
				Результат.ЗагрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ОтсутствуютЛицензии;
			
			Иначе
				Результат.ЗагрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.ЗавершеноСОшибкой;
			КонецЕсли;
			
			Результат.Результат = Результат.ЗагрузкаРезультат;
			
			Если Не ОписаниеРезультата.ЯвляетсяУспехом Тогда
				Результат.ЗагрузкаТекстОшибки = СостояниеОбмена.Прием.ТекстОшибки;
				Результат.ЗагрузкаПредставлениеОшибки = ОписаниеРезультата.ТекстОписания 
					+ Символы.ПС + СостояниеОбмена.Прием.ТекстОшибки;
			КонецЕсли;
			
		Иначе
			
			Результат.ЗагрузкаРезультат = Перечисления.РезультатыДействийСинхронизации.Выполняется;
			Результат.ЗагрузкаДата = СостояниеОбмена.Прием.НачалоДействия;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СериализоватьСостояние(Результат);
	
	Результат.Вставить("ИзмененияЗарегистрированы", ОбменДаннымиСлужебный.ИзмененияЗарегистрированы(Узел)
			Или Узел.ЗатребованныйСценарий = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии);
	
	// Информация о полученных и подготовленных пакетах
	Результат.Вставить("ПолученныеПакеты", РегистрыСведений.ПакетыСинхронизацииПолученные.ОчередьПакетовДляУзла(Узел, 0, Истина));
	Результат.Вставить("ПолученныеПакетыИнформация", 
			Новый Структура("НомерПакета,ГотовоЧастей,ВсегоЧастей", 0,0,0));
	Если ЗначениеЗаполнено(Результат.ПолученныеПакеты) Тогда
		Результат.ПолученныеПакетыИнформация.НомерПакета  = Результат.ПолученныеПакеты[0].НомерПакетаКПолучению;
		Результат.ПолученныеПакетыИнформация.ГотовоЧастей = Результат.ПолученныеПакеты.Количество();
		Результат.ПолученныеПакетыИнформация.ВсегоЧастей  = Результат.ПолученныеПакеты[0].ВсегоЧастей;
	КонецЕсли;
	
	Результат.Вставить("ПакетыКОтправке", РегистрыСведений.ПакетыСинхронизацииКОтправке.ОчередьПакетовДляУзла(Узел, 0, Истина));
	Результат.Вставить("ПакетыКОтправкеИнформация", 
			Новый Структура("НомерПакета,ГотовоЧастей,ВсегоЧастей", 0,0,0));
	Если ЗначениеЗаполнено(Результат.ПакетыКОтправке) Тогда
		Результат.ПакетыКОтправкеИнформация.НомерПакета  = Результат.ПакетыКОтправке[0].НомерПакетаКОтправке;
		Результат.ПакетыКОтправкеИнформация.ГотовоЧастей = Результат.ПакетыКОтправке.Количество();
		Результат.ПакетыКОтправкеИнформация.ВсегоЧастей  = Результат.ПакетыКОтправке[0].ВсегоЧастей;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура СериализоватьСостояние(Состояние) 
	
	Для каждого КлючИЗначение Из Состояние Цикл
		
		ОбъектМД = Метаданные.НайтиПоТипу(ТипЗнч(КлючИЗначение.Значение));
		Если ОбъектМД <> Неопределено И Метаданные.Перечисления.Содержит(ОбъектМД) Тогда
			Состояние[КлючИЗначение.Ключ] = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
					ОбщегоНазначения.ИмяЗначенияПеречисления(КлючИЗначение.Значение), "");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
 

Функция ОбработкаЗагрузкиПакета(Запрос) 
	
	ИмяСервиса = ИмяСервиса("upload");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если НРег(Запрос.HTTPМетод) = "delete" Тогда
		Ответ = УдалитьПолученныеПакеты(Запрос, Узел, ИмяСервиса);
	ИначеЕсли НРег(Запрос.HTTPМетод) = "put" Тогда
		Ответ = ЗаписатьПолученныйПакет(Запрос, Узел, ИмяСервиса);
	Иначе
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='сервис не поддерживает метод %1'"), Запрос.HTTPМетод), ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции 

Функция УдалитьПолученныеПакеты(Запрос, Узел, ИмяСервиса) 
	
	// свойсвта полученного пакета из параметров
	НомерПакета    = Запрос.ПараметрыЗапроса.Получить("sentno");
	Если НомерПакета = Неопределено Тогда
		
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе на удаление пакетов, отправленных на сервер, не хватает параметров.
				|В строке запроса должны быть параметры: sentno'"),
				ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Ответ = Неопределено;
	Если Не ПроверитьНомерПакета(НомерПакета, 
			НСтр("ru='В запросе на удаление пакетов, отправленных на сервер, номер пакета (%1) не является числом'"),
			Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(Узел, НомерПакета);
	Исключение
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(ИнформацияОбОшибке(), ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ТекстОшибки, ИмяСервиса);
	КонецПопытки; 
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	
КонецФункции 

Функция ЗаписатьПолученныйПакет(Запрос, Узел, ИмяСервиса) 
	
	
	// свойства полученного пакета из параметров
	НомерПакета    = Запрос.ПараметрыЗапроса.Получить("sentno");
	НомерЧасти     = Запрос.ПараметрыЗапроса.Получить("partno");
	ВсегоЧастей    = Запрос.ПараметрыЗапроса.Получить("total");
	ТипПакета      = Запрос.ПараметрыЗапроса.Получить("type");
	ДатаВыгрузки   = Запрос.ПараметрыЗапроса.Получить("date");
	Если НомерПакета = Неопределено Или НомерЧасти = Неопределено Или ВсегоЧастей = Неопределено
		Или ТипПакета = Неопределено Или ДатаВыгрузки = Неопределено Тогда
		
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе на отправку пакета на сервер не хватает параметров.
				|В строке запроса должны быть параметры: sentno, partno, total, type, date'"),
				ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Ответ = Неопределено;
	Если Не ПроверитьНомерПакета(НомерПакета, 
			НСтр("ru='В запросе на отправку пакета на сервер номер пакета (%1) не является числом'"),
			Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	Если Не ПроверитьНомерЧастиПакета(НомерЧасти, 
			НСтр("ru='В запросе на отправку пакета на сервер номер части (%1) не является числом или словом ""all""'"),
			Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	Если Не ПроверитьНомерПакета(ВсегоЧастей, 
			НСтр("ru='В запросе на отправку пакета на сервер количество частей (%1) не является числом'"),
			Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
	Если СостояниеОбмена <> Неопределено 
		И СостояниеОбмена.Прием.ДействиеПроцесса <> Перечисления.ДействияПроцессовОбмена.Получение Тогда
		АвтоматСинхронизацииССервисом.ОтметитьНачалоДействия(СостояниеОбмена, "Прием", "Получение", 
					НомерПакета, ВсегоЧастей, 0, 0, 0);
	КонецЕсли;
	
	Запись = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьМенеджерЗаписи();
	Запись.УзелКорреспондента      = Узел;
	Запись.НомерПакетаКПолучению   = НомерПакета;
	Запись.НомерЧастиПакета        = НомерЧасти;
	Запись.ВсегоЧастей             = Число(ВсегоЧастей);
	Запись.ТипПакета               = Перечисления.ТипыПакетовСинхронизации[ТипПакета];
	Запись.ДатаВыгрузки            = Дата(ДатаВыгрузки);
	Запись.ДанныеПакета            = Новый ХранилищеЗначения(Запрос.ПолучитьТелоКакДвоичныеДанные(), Новый СжатиеДанных(9));
	Запись.Записать();
	
	Если СостояниеОбмена <> Неопределено Тогда
		ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбмена, "Прием", НомерПакета, ВсегоЧастей, НомерЧасти);
	КонецЕсли;

	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(201, Истина, ИмяСервиса);
	
КонецФункции 


Функция ОбработкаЧтенияПакета(Запрос) 
	
	ИмяСервиса = ИмяСервиса("read");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	НомерПакета    = Запрос.ПараметрыЗапроса.Получить("sentno");
	Если НомерПакета = Неопределено Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе на чтение данных на сервере не хватает параметров.
				|В строке запроса должны быть параметры: sentno'"),
				ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Если Не ПроверитьНомерПакета(НомерПакета, 
				НСтр("ru='В запросе на чтение данных на сервере номер пакета (%1) не является числом'"),
				Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если НРег(Запрос.HTTPМетод) = "post" Тогда
		Ответ = ПроверитьЗапуститьЧтение(Узел, НомерПакета, ИмяСервиса);
	Иначе
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='сервис не поддерживает метод %1'"), Запрос.HTTPМетод), ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПроверитьЗапуститьЧтение(Узел, НомерПакета, ИмяСервиса) 
	
	Результат = Неопределено;
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
				
	Если СостояниеОбмена.НомерПринятого = НомерПакета Тогда
		// загружен пакет, полученный от клиента. Сообщить клиенту о завершении
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, "Завершено", ИмяСервиса);
		
	Иначе
		
		// анализ состояния фонового задания
		ТекущееЗадание = ФоновоеЗаданиеЗагрузки(Узел, НомерПакета, Ложь);
		Если ТекущееЗадание <> Неопределено Тогда
			Возврат ОтветПоСостояниюФоновогоЗаданияЧтения(ТекущееЗадание, Узел, ИмяСервиса);
		КонецЕсли;
		
		// фонового задания нет, анализировать текущее состояние
		Если СостояниеОбмена.Прием.ПроцессЗавершен
			И СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
			// процесс приема завершен до окончания чтения полученного пакета
			
			Если СостояниеОбмена.Прием.НомерПакета = НомерПакета Тогда
				// Сообщить клиенту о возникших проблемах
				
				ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(
													СостояниеОбмена.Прием.КодРезультатаДействия);
				
				КодОтвета = 500;
				Результат = ?(ЗначениеЗаполнено(ОписаниеРезультата.ТекстОписания),
								ОписаниеРезультата.ТекстОписания,
								НСтр("ru = 'На сервере при загрузке данных возникли проблемы'") );
				ТекстОшибки = ?(ЗначениеЗаполнено(СостояниеОбмена.Прием.ТекстОшибки), 
								СостояниеОбмена.Прием.ТекстОшибки,
								НСтр("ru='подробностей нет'"));
				СинхронизацияАвтономныхКопийВызовСервера.ЗарегистрироватьОшибкуОбменаСУзлом(
							ТекстОшибки, 
							Узел, 
							"ЗагрузкаДанных", 
							Результат);
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					Результат = Результат + Символы.ПС + ТекстОшибки;
				КонецЕсли;
				
				Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(КодОтвета, Результат, ИмяСервиса); 
				
			ИначеЕсли ЗначениеЗаполнено(СостояниеОбмена.Прием.НомерПакета) Тогда
				
				АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка блокировки
	Если Не РегистрыСведений.КонтрольПроцессовОбменаДанными.ДоступноДляБлокировки(Узел, "Прием") Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, "Выполняется", ИмяСервиса);
	КонецЕсли;
	
	// запуск и анализ нового фонового задания загрузки данных
	ФоновоеЗадание = НовоеФоновоеЗаданиеЗагрузки(Узел, НомерПакета);
	Результат = "";
	КодОтвета = 200;
	
	Если ФоновоеЗадание.Статус = "Выполняется" Тогда
		Результат = "Выполняется";
	ИначеЕсли ФоновоеЗадание.Статус = "Выполнено" Тогда
		Результат = "Завершено";
	Иначе
		КодОтвета = 500;
		Результат = НСтр("ru = 'На сервере возникла ошибка при загрузке данных'");
		СинхронизацияАвтономныхКопийВызовСервера.ЗарегистрироватьОшибкуОбменаСУзлом(
					ФоновоеЗадание.ПодробноеПредставлениеОшибки, Узел, "ЗагрузкаДанных", Результат);
		Если ЗначениеЗаполнено(ФоновоеЗадание.ПодробноеПредставлениеОшибки) Тогда
			Результат = Результат + Символы.ПС + ФоновоеЗадание.ПодробноеПредставлениеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(КодОтвета, Результат, ИмяСервиса); 
	
КонецФункции

Функция ОтветПоСостояниюФоновогоЗаданияЧтения(СтруктураФЗ, Узел, ИмяСервиса)
	
	Результат = "";
	КодОтвета = 200;
	
	Если СтруктураФЗ.Статус = "Выполняется" Тогда
		Результат = "Выполняется";
	ИначеЕсли СтруктураФЗ.Статус = "Выполнено" Тогда
		Результат = "Завершено";
	Иначе
		КодОтвета = 500;
		Результат = НСтр("ru = 'На сервере возникла ошибка при загрузке данных'");
		СинхронизацияАвтономныхКопийВызовСервера.ЗарегистрироватьОшибкуОбменаСУзлом(
					СтруктураФЗ.ПодробноеПредставлениеОшибки, Узел, "ЗагрузкаДанных", Результат);
		Если ЗначениеЗаполнено(СтруктураФЗ.ПодробноеПредставлениеОшибки) Тогда
			Результат = Результат + Символы.ПС + СтруктураФЗ.ПодробноеПредставлениеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(КодОтвета, Результат, ИмяСервиса); 
	
КонецФункции

Функция ОтветПоСостояниюФоновогоЗаданияВыгрузки(Результат, СтруктураФЗ, Узел, ИмяСервиса)
	
	Результат.СостояниеЗадания = "";
	КодОтвета = 200;
	
	Если СтруктураФЗ.Статус = "Выполняется" Тогда
		Результат.СостояниеЗадания = "Выполняется";
	ИначеЕсли СтруктураФЗ.Статус = "Выполнено" Тогда
		Результат.СостояниеЗадания = "Завершено";
	Иначе
		КодОтвета = 500;
		Результат.СостояниеЗадания = НСтр("ru = 'На сервере возникла ошибка при выгрузке данных'");
		СинхронизацияАвтономныхКопийВызовСервера.ЗарегистрироватьОшибкуОбменаСУзлом(
					СтруктураФЗ.ПодробноеПредставлениеОшибки, Узел, "ЗагрузкаДанных", Результат.СостояниеЗадания);
		Если ЗначениеЗаполнено(СтруктураФЗ.ПодробноеПредставлениеОшибки) Тогда
			Результат.СостояниеЗадания = Результат.СостояниеЗадания + Символы.ПС + СтруктураФЗ.ПодробноеПредставлениеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(КодОтвета, Результат, ИмяСервиса); 
	
КонецФункции

Функция ОбработкаВыгрузкиИзменений(Запрос) 
	
	ИмяСервиса = ИмяСервиса("download");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если НРег(Запрос.HTTPМетод) = "post" Тогда
		Ответ = ПроверитьЗапуститьВыгрузку(Узел, ИмяСервиса);
		
	ИначеЕсли НРег(Запрос.HTTPМетод) = "delete" Тогда
		Ответ = УдалитьОтправленныеПакеты(Запрос, Узел, ИмяСервиса);
		
	ИначеЕсли НРег(Запрос.HTTPМетод) = "get" Тогда
		Ответ = ОтдатьЧастьПакетаКОТправке(Запрос, Узел, ИмяСервиса);
		
	Иначе
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='сервис не поддерживает метод %1'"), Запрос.HTTPМетод), ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции 

Функция УдалитьОтправленныеПакеты(Запрос, Узел, ИмяСервиса) 
	
	Ответ = Неопределено;
	НомерПакета    = Запрос.ПараметрыЗапроса.Получить("receivedno");
	Если НомерПакета = Неопределено Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе удаление отправленного пакета на сервере не хватает параметров.
				|В строке запроса должны быть параметры: receivedno'"),
				ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Если Не ПроверитьНомерПакета(НомерПакета, 
				НСтр("ru='В запросе на удаление отправленного пакета номер пакета (%1) не является числом'"),
				Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(Узел, НомерПакета);
	Исключение
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(ИнформацияОбОшибке(), ИмяСервиса); 
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ТекстОшибки, ИмяСервиса);
	КонецПопытки; 
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	
КонецФункции 

Функция ПроверитьЗапуститьВыгрузку(Узел, ИмяСервиса) 
	
	Результат = Новый Структура("СостояниеЗадания,НомерПакета", "Выполняется", 0);
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
	Если ЗначениеЗаполнено(СостояниеОбмена.Передача.НомерПакета) Тогда
		// Состояние процесса не сброшено
		Результат.НомерПакета = СостояниеОбмена.Передача.НомерПакета;
		
		Если СостояниеОбмена.НомерОтправленного = СостояниеОбмена.Передача.НомерПакета
			И СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка
			И СостояниеОбмена.Передача.ПроцессЗавершен Тогда
			
			// Сообщить клиенту о результате выгрузки
			ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(
							СостояниеОбмена.Передача.КодРезультатаДействия);
							
			Если ОписаниеРезультата.ЯвляетсяУспехом Тогда
				
				КодОтвета             = 200;
				Результат.НомерПакета = Узел.НомерОтправленного;
				Результат.СостояниеЗадания = "Завершено";
				
			Иначе
				
				КодОтвета             = 500;
				Результат.НомерПакета = Узел.НомерОтправленного;
				Результат.СостояниеЗадания = ?(ЗначениеЗаполнено(ОписаниеРезультата.ТекстОписания),
								ОписаниеРезультата.ТекстОписания,
								НСтр("ru = 'На сервере при выгрузке данных возникли проблемы'") );
				ТекстОшибки = ?(ЗначениеЗаполнено(СостояниеОбмена.Прием.ТекстОшибки), 
								СостояниеОбмена.Прием.ТекстОшибки,
								НСтр("ru='подробностей нет'"));
				СинхронизацияАвтономныхКопийВызовСервера.ЗарегистрироватьОшибкуОбменаСУзлом(
							ТекстОшибки, 
							Узел, 
							"ВыгрузкаДанных", 
							Результат.СостояниеЗадания);
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда
					Результат.СостояниеЗадания = Результат.СостояниеЗадания + Символы.ПС + ТекстОшибки;
				КонецЕсли;
				
				Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(КодОтвета, Результат, ИмяСервиса);
				 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Анализ состояния фонового задания
	ТекущееЗадание = ФоновоеЗаданиеВыгрузки(Узел, Ложь);
	Если ТекущееЗадание <> Неопределено Тогда
		Возврат ОтветПоСостояниюФоновогоЗаданияВыгрузки(Результат, ТекущееЗадание, Узел, ИмяСервиса);
	КонецЕсли;
	
	// Запуск нового фонового задания

	// Проверка блокировки
	Если Не РегистрыСведений.КонтрольПроцессовОбменаДанными.ДоступноДляБлокировки(Узел, "Передача") Тогда
		Результат.СостояниеЗадания = "Выполняется";
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Результат, ИмяСервиса);
	КонецЕсли;
	
	Результат.НомерПакета = Узел.НомерОтправленного + 1;
	ФоновоеЗадание        = НовоеФоновоеЗаданиеВыгрузки(Узел);
	Возврат ОтветПоСостояниюФоновогоЗаданияВыгрузки(Результат, ФоновоеЗадание, Узел, ИмяСервиса);
	
КонецФункции

Функция ОтдатьЧастьПакетаКОТправке(Запрос, Узел, ИмяСервиса) 
	
	ИмяПроцесса = "Передача";
	ИмяДейсвтия = "Отправка";
	
	// свойсвта полученного пакета из параметров
	НомерПакета    = Запрос.ПараметрыЗапроса.Получить("receivedno");
	НомерЧасти     = Запрос.ПараметрыЗапроса.Получить("partno");
	Если НомерПакета = Неопределено Или НомерЧасти = Неопределено Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе на получение части пакета с сервера не хватает параметров.
				|В строке запроса должны быть параметры: receivedno, partno'"),
				ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Ответ = Неопределено;
	ТекстОшибки = НСтр("ru='В запросе на получение пакета с сервера номер пакета (%1) не является числом'"); 
	Если Не ПроверитьНомерПакета(НомерПакета, ТекстОшибки, Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	ТекстОшибки = НСтр("ru='В запросе на получение пакета с сервера номер части (%1) не является числом или словом ""all""'"); 
	Если Не ПроверитьНомерЧастиПакета(НомерЧасти, ТекстОшибки, Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	ВсеКоды     = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
	Если СостояниеОбмена <> Неопределено 
		И СостояниеОбмена.Передача.ДействиеПроцесса <> Перечисления.ДействияПроцессовОбмена.Отправка Тогда
		АвтоматСинхронизацииССервисом.ОтметитьНачалоДействия(СостояниеОбмена, ИмяПроцесса, ИмяДейсвтия);
	КонецЕсли;

	Запись = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьМенеджерЗаписи();
	Запись.УзелКорреспондента   = Узел;
	Запись.НомерПакетаКОтправке = НомерПакета;
	Запись.НомерЧастиПакета     = НомерЧасти;
	Запись.Прочитать();
	Если Не Запись.Выбран() Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='На сервере не найдена часть #%1 пакета #%2.'"), НомерЧасти, НомерПакета),
				ИмяСервиса);
		
		Если СостояниеОбмена <> Неопределено Тогда
			АвтоматСинхронизацииССервисом.ОтметитьЗавершениеДействия(СостояниеОбмена, ИмяПроцесса, ИмяДейсвтия,
				ВсеКоды.ОшибкаПрограммы.Код, ТекстОшибки);
		КонецЕсли;
		
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(404, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Запись.ДанныеПакета.Получить(), ИмяСервиса);
	
КонецФункции 


Функция ОбработкаПометкиОтправленногоПакета(Запрос) 
	
	ИмяСервиса = ИмяСервиса("markdownload");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	// свойсвта полученного пакета из параметров
	НомерПакета    = Запрос.ПараметрыЗапроса.Получить("receivedno");
	НомерЧасти     = Запрос.ПараметрыЗапроса.Получить("partno");
	Если НомерПакета = Неопределено Или НомерЧасти = Неопределено Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru='В запросе на подтверждение получения пакета с сервера не хватает параметров.
				|В строке запроса должны быть параметры: receivedno, partno'"),
				ИмяСервиса);
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Если Не ПроверитьНомерПакета(НомерПакета, 
			НСтр("ru='В запросе на отметку о получении части пакета номер пакета (%1) не является числом'"),
			Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	Если Не ПроверитьНомерЧастиПакета(НомерЧасти, 
			НСтр("ru='В запросе на отметку о получении части пакета номер части (%1) не является числом или словом ""all""'"),
			Ответ, ИмяСервиса) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если НРег(Запрос.HTTPМетод) = "delete" Тогда
		Ответ = ИзменитьПометкуОтправкиЧастейПакета(Узел, НомерПакета, НомерЧасти, Ложь, ИмяСервиса);
	ИначеЕсли НРег(Запрос.HTTPМетод) = "post" Тогда
		Ответ = ИзменитьПометкуОтправкиЧастейПакета(Узел, НомерПакета, НомерЧасти, Истина, ИмяСервиса);
	Иначе
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='сервис не поддерживает метод %1'"), Запрос.HTTPМетод), ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции 

Функция ИзменитьПометкуОтправкиЧастейПакета(Узел, НомерПакета, НомерЧасти, ПометкаОбОтправке, ИмяСервиса) 
	
	ВсеЧасти =  НРег(НомерЧасти) = "all";
	
	Набор = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьНаборЗаписей();
	Набор.Отбор.УзелКорреспондента.Установить(Узел);
	Набор.Отбор.НомерПакетаКОтправке.Установить(НомерПакета);
	Если ВсеЧасти Тогда
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='На сервере не найден пакет #%1 отправляемый на узел ""%2""'"), 
						НомерПакета, Строка(Узел)),
				ИмяСервиса);
	Иначе
		Набор.Отбор.НомерЧастиПакета.Установить(НомерЧасти);
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='На сервере не найдена часть #%1 пакета %2 отправляемого на узел ""%3""'"), 
						Номерчасти, НомерПакета, Строка(Узел)),
				ИмяСервиса);
	КонецЕсли;
	Набор.Прочитать();
	ВсегоЧастей = Набор.Количество();
	
	Если Не Набор.Выбран() Или ВсегоЧастей = 0 Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Если ПометкаОбОтправке Тогда
		
		// клиент подтвердил получение части (или всех частей)
		Если ВсеЧасти Тогда
			Набор.Очистить();
		Иначе
			Набор[0].Отправлено = Истина;
		КонецЕсли;
		
		СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
		Если СостояниеОбмена <> Неопределено 
			И СостояниеОбмена.Передача.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка Тогда
			ОбработаннаяЧасть = ?(ВсеЧасти, ВсегоЧастей, НомерЧасти);
			АвтоматСинхронизацииССервисом.ОбновитьСтатистикуДействия(СостояниеОбмена, "Передача", 
						НомерПакета, ВсегоЧастей, ОбработаннаяЧасть, , );
		КонецЕсли;
		
	Иначе
		// клиент потерял одну или все части пакета
		Для каждого Запись Из Набор Цикл
			Запись.Отправлено = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		Набор.Записать(Истина);
	Исключение
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, ИнформацияОбОшибке(), ИмяСервиса);
	КонецПопытки; 
	
	Если ВсеЧасти И ПометкаОбОтправке Тогда
		// очистка состояния синхронизации
		ОчиститьСостояниеСинхронизации(Узел);
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	
КонецФункции 


Функция ОбработкаНастроекСинхронизации(Запрос) 
	
	ИмяСервиса = ИмяСервиса("settings");
	Узел       = Неопределено;
	Ответ      = Неопределено;
	
	Если Не ПроверитьЭтуБазу(ИмяСервиса, Ответ) 
		Или Не ПроверитьУзелВАдресеЗапроса(Запрос, ИмяСервиса, Ответ, Узел) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если БазаЗаблокированаДляОбновления(Ответ) Тогда
		Возврат Ответ;
	КонецЕсли;
	
	Если НРег(Запрос.HTTPМетод) = "post" Тогда
		Ответ = ПрименитьНастройкиСинхронизации(Запрос, Узел, ИмяСервиса);
	ИначеЕсли НРег(Запрос.HTTPМетод) = "get" Тогда
		Ответ = ТекущиеНастройкиСервера(Узел, ИмяСервиса);
	Иначе
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				СтрШаблон(НСтр("ru='сервис не поддерживает метод %1'"), Запрос.HTTPМетод), ИмяСервиса);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// В теле запроса передается структура, в которой ключ - имя команды, значение - ее параметры
//За один запрос может быть выполнено несколько команд
Функция ПрименитьНастройкиСинхронизации(Запрос, Узел, ИмяСервиса) 
	
	ТекстОшибки = "";
	Команды = ДеньгиОбработкаВебЗапросов.ПрочитатьТелоЗапроса(Запрос, "", ТекстОшибки);
	Если Команды = Неопределено Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
			НСтр("ru='Ошибка чтения тела запроса'") + Символы.ПС + ТекстОшибки, ИмяСервиса);
	КонецЕсли;
	
	РезультатВыплнения = Истина;
	Для каждого Команда Из Команды Цикл
		
		РезультатВыплнения = Неопределено;
		
		Если Команда.Ключ = "ИзменитьНастройкиУзла" Тогда
			РезультатВыплнения = ИзменитьНастройкиУзла(Узел, Команда.Значение, ИмяСервиса);
			
		ИначеЕсли Команда.Ключ = "ИзменитьНомераПакетов" Тогда 
			РезультатВыплнения = ИзменитьНомераПакетов(Узел, Команда.Значение, ИмяСервиса);
			
		Иначе
			Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
					СтрШаблон(НСтр("ru='Неизвестная команда ""%1""'"), Команда.Ключ), 
					ИмяСервиса);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, РезультатВыплнения, ИмяСервиса);
	
КонецФункции

Функция ИзменитьНастройкиУзла(Узел, Настройки, ИмяСервиса) 
	
	Результат = Новый Структура("Выполнено,Ошибка,ОписаниеОшибки,Результат", Ложь, Ложь);
	Попытка
		// Десериализация
		Если ТипЗнч(Узел) = Тип("ПланОбменаСсылка.МобильноеПриложение") Тогда
			ДесериализоватьЗначениеНастройки(Настройки, "Узел", Тип("ПланОбменаСсылка.МобильноеПриложение"));
			Если Настройки.Свойство("ЗатребованныйСценарий") Тогда
				Если Настройки.ЗатребованныйСценарий = "ОбъединениеДанных" Тогда
					Настройки.ЗатребованныйСценарий = Перечисления.СценарииОбменаСМобильнымПриложением.ОбъединениеДанных;
				ИначеЕсли Настройки.ЗатребованныйСценарий = "ЗаменитьВсеВАвтономнойКопии" Тогда
					Настройки.ЗатребованныйСценарий = Перечисления.СценарииОбменаСМобильнымПриложением.МобильныеЗаменитьНастольными;
				ИначеЕсли Настройки.ЗатребованныйСценарий = "ЗаменитьВсеВЦентральнойБазе" Тогда
					Настройки.ЗатребованныйСценарий = Перечисления.СценарииОбменаСМобильнымПриложением.НастольныеЗаменитьМобильными;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			ДесериализоватьЗначениеНастройки(Настройки, "Узел", Тип("ПланОбменаСсылка.СинхронизацияАвтономныхКопий"));
			ДесериализоватьЗначениеНастройки(Настройки, "ЗатребованныйСценарий", Тип("ПеречислениеСсылка.СценарииСинхронизацииАвтономныхКопий"));
			
		КонецЕсли;
		ДесериализоватьЗначениеНастройки(Настройки, "СценарийПереданныхДанных", Тип("ПеречислениеСсылка.СценарииСинхронизацииАвтономныхКопий"));
		ДесериализоватьЗначениеНастройки(Настройки, "СценарийЗапрашиваемыхДанных", Тип("ПеречислениеСсылка.СценарииСинхронизацииАвтономныхКопий"));
		ДесериализоватьЗначениеНастройки(Настройки, "ВидПериода", Тип("ПеречислениеСсылка.Периодичность"));
		
		// Сохранение новых значений настроек
		СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(Узел, Настройки);
		Результат.Выполнено = Истина;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(Ошибка);
		ЗаписьЖурналаРегистрации("Обмен данными.http-сервис." + ИмяСервиса,
				УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон(НСтр("ru='Ошибка выполнения команды ""%1"":
				|%2'"), "ИзменитьНастройкиУзла",ПодробноеПредставлениеОшибки(Ошибка)) );
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции 

Функция ИзменитьНомераПакетов(Узел, Настройки, ИмяСервиса) 
	
	Результат = Новый Структура("Выполнено,Ошибка,ОписаниеОшибки,Результат", Ложь, Ложь);
	Попытка
		
		УзелОбъект = Узел.ПолучитьОбъект();
		Если Настройки.Свойство("НомерПринятого") Тогда
			УзелОбъект.НомерПринятого = Настройки.НомерПринятого;
		КонецЕсли;
		Если Настройки.Свойство("НомерОтправленного") Тогда
			УзелОбъект.НомерОтправленного = Настройки.НомерОтправленного;
		КонецЕсли;
		
		Если УзелОбъект.Модифицированность() Тогда
			УзелОбъект.Записать();
		КонецЕсли;
		
		Результат.Выполнено = Истина;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Результат.Ошибка = Истина;
		Результат.ОписаниеОшибки = КраткоеПредставлениеОшибки(Ошибка);
		ЗаписьЖурналаРегистрации("Обмен данными.http-сервис." + ИмяСервиса,
				УровеньЖурналаРегистрации.Ошибка, , ,
				СтрШаблон(НСтр("ru='Ошибка выполнения команды ""%1"":
				|%2'"), "ИзменитьНастройкиУзла",ПодробноеПредставлениеОшибки(Ошибка)) );
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции 

Функция ТекущиеНастройкиСервера(Узел, ИмяСервиса) 
	
	Настройки = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(Узел, Истина);
	Если Настройки = Неопределено Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
			НСтр("ru='Ошибка получения настроек синхронизации на сервере'"), ИмяСервиса);
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Настройки, ИмяСервиса);
	
	
КонецФункции 

// Проверяет/обновляет параметры обмена с узлом и возвращает текущие значения параметров обмена
Функция СтатусУзлаНаСервере(СтруктураЗапроса, УзелКорреспондента, ИмяСервиса)
	
	СообщениеОбОшибке = "";
	
	#Область ПроверкаВходящихПараметров
		
	ИмяПлана = СокрЛП(СтруктураЗапроса.ПланОбмена);
	Если НРег(ИмяПлана) <> "мобильноеприложение" И НРег(ИмяПлана) <> "синхронизацияавтономныхкопий" Тогда
		СообщениеОбОшибке = НСтр("ru='Указано некорректное имя плана обмена'"); 
	КонецЕсли;
	
	КодЦБИзпараметров = СокрЛП(СтруктураЗапроса.КодЦентральнойБазы);
	Если КодЦБИзпараметров <> "000" И СтрДлина(КодЦБИзпараметров) <> 36 Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + ?(СообщениеОбОшибке = "", "", Символы.ПС) 
					+ НСтр("ru='Указан некорректный код центральной базы'"); 
	КонецЕсли;
	КодЦентральнойБазы = СинхронизацияАвтономныхКопийВызовСервера.КодЦентральнойБазы(ИмяПлана);
	
	ПараметрыОбменаИзЗапроса = ?(СтруктураЗапроса.Свойство("ПараметрыУзла"), 
							СтруктураЗапроса.ПараметрыУзла, Новый Структура);
	Если ТипЗнч(ПараметрыОбменаИзЗапроса) <> Тип("Структура") Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + ?(СообщениеОбОшибке = "", "", Символы.ПС) 
					+ НСтр("ru='Передано неверное значение параметров узла'"); 
	КонецЕсли;
	
	Если Не ПустаяСтрока(СообщениеОбОшибке) Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
			ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(СообщениеОбОшибке, ИмяСервиса),
			ИмяСервиса);
	КонецЕсли;
	
	#КонецОбласти 
	
	Если КодЦентральнойБазы = "000" Тогда
		// установка нового кода для узлов плана обмена
		КодЦентральнойБазы = ?(КодЦБИзпараметров = "000", СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы(), КодЦБИзпараметров);
		
		Попытка
			СинхронизацияАвтономныхКопийВызовСервера.ЗаменитьКодЦентральнойБазы(КодЦентральнойБазы);
		Исключение
			СообщениеОбОшибке = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(ИнформацияОбОшибке(), ИмяСервиса);
			Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, СообщениеОбОшибке, ИмяСервиса);
		КонецПопытки;
		
	КонецЕсли;
	
	// Текущие значения параметров обмена
	ТекущиеПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(УзелКорреспондента);
	
	// Обновление параметров обмена
	НовыеЗначения = Новый Структура;
	
	Если ЗначениеЗаполнено(СтруктураЗапроса.НаименованиеУзла) 
		И ТекущиеПараметрыОбмена.Наименование <> СтруктураЗапроса.НаименованиеУзла Тогда
		НовыеЗначения.Вставить("Наименование", СтруктураЗапроса.НаименованиеУзла);
	КонецЕсли;
	
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "ВерсияФорматаОбмена");
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "ЗатребованныйСценарий");
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "СценарийПереданныхДанных");
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "СценарийЗапрашиваемыхДанных");
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "ВидПериода");
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "КоличествоПериодов");
	ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеПараметрыОбмена, ПараметрыОбменаИзЗапроса, НовыеЗначения, "КоличествоПериодов");
	
	НомерПринятогоУзлом = Неопределено;
	Если ПараметрыОбменаИзЗапроса.Свойство("НомерПринятого", НомерПринятогоУзлом)
		И НомерПринятогоУзлом <> Неопределено И НомерПринятогоУзлом >  ТекущиеПараметрыОбмена.НомерОтправленного Тогда
		НовыеЗначения.Вставить("НомерОтправленного", НомерПринятогоУзлом);
	КонецЕсли;
	
	НомерОтправленногоУзлом = Неопределено;
	Если ПараметрыОбменаИзЗапроса.Свойство("НомерОтправленного", НомерОтправленногоУзлом)
		И НомерОтправленногоУзлом <> Неопределено И НомерОтправленногоУзлом <  ТекущиеПараметрыОбмена.НомерПринятого Тогда
		НовыеЗначения.Вставить("НомерПринятого", НомерОтправленногоУзлом);
	КонецЕсли;
	
	Если НовыеЗначения.Количество() > 0 Тогда
		Попытка
			СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(УзелКорреспондента, НовыеЗначения);
			ТекущиеПараметрыОбмена = СинхронизацияАвтономныхКопий.ПараметрыОбменаСУзлом(УзелКорреспондента);
		Исключение
			СообщениеОбОшибке = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(ИнформацияОбОшибке(), ИмяСервиса);
			Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(500, СообщениеОбОшибке, ИмяСервиса);
		КонецПопытки; 
	КонецЕсли;
	
	
	Результат = Новый Структура;
	// код для автоматической регистрации центральной базы в плане обмена корреспондента:
	Результат.Вставить("КодЦентральнойБазы", КодЦентральнойБазы); 
	// сценарий, по которому узел корреспондента должен отправить данные на сервер 
	Если ЗначениеЗаполнено(ТекущиеПараметрыОбмена.СценарийЗапрашиваемыхДанных) Тогда
		Результат.Вставить("ЗатребованныйСценарий", ОбщегоНазначения.ИмяЗначенияПеречисления(ТекущиеПараметрыОбмена.СценарийЗапрашиваемыхДанных)); 
	Иначе
		Результат.Вставить("ЗатребованныйСценарий", ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных)); 
	КонецЕсли;
	Результат.Вставить("Активность",             ТекущиеПараметрыОбмена.Активность); 
	Результат.Вставить("СинхронизацияЗапрещена", ТекущиеПараметрыОбмена.СинхронизацияЗапрещена); 
	Результат.Вставить("НомерОтправленного",     ТекущиеПараметрыОбмена.НомерОтправленного); 
	Результат.Вставить("НомерПринятого",         ТекущиеПараметрыОбмена.НомерПринятого); 
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Результат, ИмяСервиса);
	
КонецФункции

Функция ОбработатьОтчетОПолученииДанных(СтруктураЗапроса, УзелКорреспондента, ИмяСервиса) 
	
	СообщениеОбОшибке = "";
	
	#Область ПроверкаВходящихПараметров
		
	ИмяПлана = СокрЛП(СтруктураЗапроса.ПланОбмена);
	Если НРег(ИмяПлана) <> "мобильноеприложение" И НРег(ИмяПлана) <> "синхронизацияавтономныхкопий" Тогда
		СообщениеОбОшибке = НСтр("ru='Указано некорректное имя плана обмена'"); 
	КонецЕсли;
	
	НомерПринятогоУзлом = ?(СтруктураЗапроса.Свойство("НомерПринятого"), 
							СтруктураЗапроса.НомерПринятого, 0);
	Если Не ЗначениеЗаполнено(НомерПринятогоУзлом) Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + ?(СообщениеОбОшибке = "", "", Символы.ПС) 
					+ НСтр("ru='Передано неверное значение ""НомерПринятого""'"); 
	КонецЕсли;
	
	Если Не ПустаяСтрока(СообщениеОбОшибке) Тогда
		Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, 
			ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(СообщениеОбОшибке, ИмяСервиса),
			ИмяСервиса);
	КонецЕсли;
	
	#КонецОбласти 
	
	Если УзелКорреспондента.НомерОтправленного <= НомерПринятогоУзлом Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелКорреспондента, НомерПринятогоУзлом);
		
		Если УзелКорреспондента.НомерОтправленного < НомерПринятогоУзлом Тогда
			Попытка
				ЗаблокироватьДанныеДляРедактирования(УзелКорреспондента);
			Исключение
				Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(403, 
					ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
							НСтр("ru='На сервере не удалось обновить номер отправленного - узел заблокирован'"),
							ИмяСервиса), ИмяСервиса);
			КонецПопытки; 
			
			ОбъектУзла = УзелКорреспондента.ПолучитьОбъект();
			ОбъектУзла.НомерОтправленного = НомерПринятогоУзлом;
			ОбъектУзла.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(200, Истина, ИмяСервиса);
	
КонецФункции 

#КонецОбласти

#КонецОбласти




#Область СлужебныеПроцедурыИФункции

Функция ИмяСервиса(КонечнаяТочка) 
	Возврат "hs/moneysynch/" + КонечнаяТочка;
КонецФункции

Функция СписокВерсий() 
	
	Возврат ОбщегоНазначенияДеньги.СписокВерсий();
	
КонецФункции

Функция БазаЗаблокированаДляОбновления(СтандартныйОтвет = Неопределено) 
	
	Если ЗначениеЗаполнено(ОбновлениеИнформационнойБазыСлужебный.ИнформационнаяБазаЗаблокированаДляОбновления()) Тогда
		
		ИмяСервиса = ИмяСервиса("");
		ТекстОшибки = ДеньгиОбработкаВебЗапросов.ТекстОшибкиДляСтандартногоОтвета(
				НСтр("ru = 'Синхронизация временно недоступна в связи с обновлением приложения на сервере'"), 
				ИмяСервиса);
		СтандартныйОтвет = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(503, ТекстОшибки, ИмяСервиса);
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции 

Функция ФоновоеЗаданиеЗагрузки(Узел, НомерПакета, ЗапускатьЕслиОтсутствует = Истина) 
	
	КлючФоновогоЗадания = КлючФоновогоЗаданияЗагрузки(Узел);
	ОтборФЗ = Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно);
	УстановитьПривилегированныйРежим(Истина);
	НайденныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	Если НайденныеЗадания.Количество() > 0 Тогда
		Возврат СвойстваФоновогоЗадания(НайденныеЗадания[0]);
	КонецЕсли;
	
	Если Не ЗапускатьЕслиОтсутствует Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НовоеФоновоеЗаданиеЗагрузки(Узел, НомерПакета);
	
КонецФункции 

Функция КлючФоновогоЗаданияЗагрузки(Узел)
	Возврат СтрШаблон("СинхронизацияАвтономныхКопий: КодУзла=%1 Действие=Загрузка", Узел.Код);
КонецФункции

Функция НовоеФоновоеЗаданиеЗагрузки(Узел, НомерПакета)
	
	КлючФоновогоЗадания = КлючФоновогоЗаданияЗагрузки(Узел);

	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Узел", Узел);
	ПараметрыПроцедуры.Вставить("НомерПакета", НомерПакета);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Загрузка данных от узла ""%1""'"), Узел.Код);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне   = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"АвтоматСинхронизацииССервисом.ВыполнитьВФонеЗагрузитьДанные",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
КонецФункции


Функция ФоновоеЗаданиеВыгрузки(Узел, ЗапускатьЕслиОтсутствует = Истина) 
	
	КлючФоновогоЗадания = КлючФоновогоЗаданияВыгрузки(Узел);
	ОтборФЗ = Новый Структура("Ключ,Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно);
	УстановитьПривилегированныйРежим(Истина);
	НайденныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ОтборФЗ);
	Если НайденныеЗадания.Количество() > 0 Тогда
		Возврат СвойстваФоновогоЗадания(НайденныеЗадания[0]);
	КонецЕсли;
	
	Если Не ЗапускатьЕслиОтсутствует Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НовоеФоновоеЗаданиеВыгрузки(Узел);
	
КонецФункции 


Функция КлючФоновогоЗаданияВыгрузки(Узел)
	Возврат СтрШаблон("СинхронизацияАвтономныхКопий: КодУзла=%1 Действие=Выгрузка", Узел.Код);
КонецФункции

Функция НовоеФоновоеЗаданиеВыгрузки(Узел)
	
	КлючФоновогоЗадания = КлючФоновогоЗаданияВыгрузки(Узел);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Узел", Узел);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Выгрузка данных для узла ""%1""'"), Узел.Код);
	ПараметрыВыполнения.КлючФоновогоЗадания = КлючФоновогоЗадания;
	ПараметрыВыполнения.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне   = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"АвтоматСинхронизацииССервисом.ВыполнитьВФонеВыгрузитьДанные",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
КонецФункции



Функция СвойстваФоновогоЗадания(ФоновоеЗадание)
	
	Возврат ОбщегоНазначенияДеньги.СтруктраСвойствФоновогоЗадания(ФоновоеЗадание);
	
КонецФункции

Функция ПроверитьНомерПакета(НомерПакета, ОписаниеОшибки, Ответ, ИмяСервиса) 
	
	Попытка
		НомерПакета = Число(НомерПакета);
	Исключение
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, НомерПакета);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ОписаниеОшибки, ИмяСервиса);
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции 

Функция ПроверитьНомерЧастиПакета(НомерЧасти, ШаблонОписанияОшибки, Ответ, ИмяСервиса) 
	
	Если НРег(НомерЧасти) = "all" Тогда
		НомерЧасти = НРег(НомерЧасти);
		Возврат Истина;
	КонецЕсли;
	
	Попытка
		НомерЧасти = Число(НомерЧасти);
	Исключение
		ОписаниеОшибки = СтрШаблон(ШаблонОписанияОшибки, НомерЧасти);
		Ответ = ДеньгиОбработкаВебЗапросов.СтандартныйОтвет(400, ОписаниеОшибки, ИмяСервиса);
		Возврат Ложь;
	КонецПопытки; 
	
	Возврат Истина;
	
КонецФункции 

Процедура ДесериализоватьЗначениеНастройки(Настройки, Имя, Тип) 
	
	ЗначениеНастройки = Неопределено;
	Если Не Настройки.Свойство(Имя, ЗначениеНастройки) Или Не ЗначениеЗаполнено(ЗначениеНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		Настройки[Имя] = Перечисления[ОбъектМетаданных.Имя][ЗначениеНастройки];
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		Настройки[Имя] = СинхронизацияАвтономныхКопий.УзелПланаОбменаПоКоду(
				ОбъектМетаданных.Имя, ЗначениеНастройки, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьСостояниеСинхронизации(Узел) 
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена(Узел);
	АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена);
	
КонецПроцедуры

Процедура ПроверитьНовоеЗначениеПараметраОбмена(ТекущиеЗначения, НовыеЗначения, ИзмененныеЗначения, ИмяПараметра) 
	
	НовоеЗначениеПараметра = Неопределено;
	Если Не НовыеЗначения.Свойство(ИмяПараметра, НовоеЗначениеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ИмяПараметра, "Сценарий") > 0 Тогда
		Если НовоеЗначениеПараметра = "НастольныеЗаменитьМобильными" Тогда
			НовоеЗначениеПараметра = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе;
		ИначеЕсли НовоеЗначениеПараметра = "МобильныеЗаменитьНастольными" Тогда
			НовоеЗначениеПараметра = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии;
		ИначеЕсли ЗначениеЗаполнено(НовоеЗначениеПараметра) Тогда 
			НовоеЗначениеПараметра = Перечисления.СценарииСинхронизацииАвтономныхКопий[НовоеЗначениеПараметра];
		Иначе
			НовоеЗначениеПараметра = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных;
		КонецЕсли;
		
	ИначеЕсли ИмяПараметра = "ВидПериода" И ЗначениеЗаполнено(НовоеЗначениеПараметра) Тогда
		НовоеЗначениеПараметра = Перечисления.Периодичность[НовоеЗначениеПараметра];
		
	КонецЕсли;
	
	Если ТекущиеЗначения[ИмяПараметра] <> НовоеЗначениеПараметра Тогда
		ИзмененныеЗначения.Вставить(ИмяПараметра, НовоеЗначениеПараметра);
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьСтруктуруКПередачеВJSON(Структура)
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из Структура Цикл
		
		ТипЭлемента = ТипЗнч(КлючИЗначение.Значение);
		Если ТипЭлемента = Тип("Структура") Или ТипЭлемента = Тип("ФиксированнаяСтруктура") Тогда
			Результат.Вставить(КлючИЗначение.Ключ, ПодготовитьСтруктуруКПередачеВJSON(КлючИЗначение.Значение));
			
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЭлемента) Тогда
			
			 Если ОбщегоНазначения.ЭтоПеречисление(КлючИЗначение.Значение.Метаданные()) Тогда
			 	ЗначениеПеречисления = ?(ЗначениеЗаполнено(КлючИЗначение.Значение), 
			 			ОбщегоНазначения.ИмяЗначенияПеречисления(КлючИЗначение.Значение), "");
			 	Результат.Вставить(КлючИЗначение.Ключ, ЗначениеПеречисления);
			 КонецЕсли;
			 
		Иначе
			Результат.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Функция СинхронизацияВключенаВНастройках() 
	Результат = Истина;
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "ЦентрМобильных" Тогда
		ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
		Если ПараметрыДомашняяСеть.ЗапретитьИспользование Тогда
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ВерсияКлиентаАктуальна(ОсновныеДанные)
	
	МинимальнаяВерсия = СинхронизацияАвтономныхКопий.МинимальнаяВерсияАвтономногоКлиента(ОсновныеДанные.mobile);
	ВерсияКлиента = ОсновныеДанные.version;
	Возврат ДеньгиКлиентСервер.СравнитьВерсии(ВерсияКлиента, МинимальнаяВерсия) >= 0;
	
КонецФункции

#КонецОбласти 
