

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСостояниеСинхронизации();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьРезультаты(Команда)
	ОбновитьСостояниеСинхронизации();
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСостояниеСинхронизации()
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	
	Состояние = АвтоматСинхронизацииССервисом.СостояниеОбмена(Объект.Ссылка);

	ВыгрузкаДата = Состояние.Передача.ЗавершениеДействия;
	ВыгрузкаКоличество = Состояние.Передача.ОбъектовВсего;
	ВыгрузкаКодРезультата = Состояние.Передача.КодРезультатаДействия;
	ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(ВыгрузкаКодРезультата);
	ВыгрузкаРезультат = ОписаниеРезультата.ТекстОписания;
	ВыгрузкаРекомендации = СтрШаблон("Результат: %1%2%3", 
				ВыгрузкаРезультат, Символы.ПС + Символы.ПС, 
				ОписаниеРезультата.ТекстРекомендации);
	Если ВыгрузкаКодРезультата = ВсеКоды.Выполнено.Код Тогда
		ВыгрузкаТекстОшибки = "";
		ВыгрузкаПредставлениеОшибки = ""; 
	Иначе
		ВыгрузкаТекстОшибки = Состояние.Передача.ТекстОшибки;
		ВыгрузкаПредставлениеОшибки = ОписаниеРезультата.ТекстОписания; 
	КонецЕсли;
	
	ЗагрузкаДата = Состояние.Прием.ЗавершениеДействия;
	ЗагрузкаКоличество = Состояние.Прием.ОбъектовВсего;
	ЗагрузкаКодРезультата = Состояние.Прием.КодРезультатаДействия;
	ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(ЗагрузкаКодРезультата);
	ЗагрузкаРезультат    = ОписаниеРезультата.ТекстОписания;
	ЗагрузкаРекомендации = СтрШаблон("Результат: %1%2%3", 
				ЗагрузкаРезультат, Символы.ПС + Символы.ПС, 
				ОписаниеРезультата.ТекстРекомендации);
	Если ЗагрузкаКодРезультата = ВсеКоды.Выполнено.Код Тогда
		ЗагрузкаТекстОшибки = "";
		ЗагрузкаПредставлениеОшибки = ""; 
	Иначе
		ЗагрузкаТекстОшибки = Состояние.Прием.ТекстОшибки;
		ЗагрузкаПредставлениеОшибки = ОписаниеРезультата.ТекстОписания; 
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Состояние);
	
	Элементы.НадписьВыгрузкаНетОшибок.Видимость  = Не ЗначениеЗаполнено(ВыгрузкаТекстОшибки)
				И Не ЗначениеЗаполнено(ВыгрузкаПредставлениеОшибки);
	Элементы.ГруппаВыгрузкаОшибка.Видимость      = Не Элементы.НадписьВыгрузкаНетОшибок.Видимость;
	Элементы.ГруппаВыгрузкаТекстОшибки.Видимость = ЗначениеЗаполнено(ВыгрузкаТекстОшибки);
	
	Элементы.НадписьЗагрузкаНетОшибок.Видимость  = Не ЗначениеЗаполнено(ЗагрузкаТекстОшибки)
				И Не ЗначениеЗаполнено(ЗагрузкаПредставлениеОшибки);
	Элементы.ГруппаЗагрузкаОшибка.Видимость      = Не Элементы.НадписьЗагрузкаНетОшибок.Видимость;
	Элементы.ГруппаЗагрузкаТекстОшибки.Видимость = ЗначениеЗаполнено(ЗагрузкаТекстОшибки);
	
	
	ПоследняяУспешнаяВыгрузка = НСтр("ru='нет данных'") ;
	ПоследняяУспешнаяЗагрузка = НСтр("ru='нет данных'") ;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СостоянияУспешныхОбменовДанными.ДействиеПриОбмене КАК ДействиеПриОбмене,
	|	СостоянияУспешныхОбменовДанными.ДатаОкончания КАК ДатаСинхронизации
	|ИЗ
	|	[СостоянияУспешныхОбменовДанными] КАК СостоянияУспешныхОбменовДанными
	|ГДЕ
	|	СостоянияУспешныхОбменовДанными.УзелИнформационнойБазы = &Узел";
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[СостоянияУспешныхОбменовДанными]", "РегистрСведений.СостоянияУспешныхОбменовДаннымиОбластейДанных");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[СостоянияУспешныхОбменовДанными]", "РегистрСведений.СостоянияУспешныхОбменовДанными");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Узел", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДействиеПриОбмене = Перечисления.ДействияПриОбмене.ВыгрузкаДанных Тогда
			ПоследняяУспешнаяВыгрузка = ?(ЗначениеЗаполнено(Выборка.ДатаСинхронизации), 
					Выборка.ДатаСинхронизации, НСтр("ru='нет данных'") );
		Иначе
			ПоследняяУспешнаяЗагрузка = ?(ЗначениеЗаполнено(Выборка.ДатаСинхронизации), 
					Выборка.ДатаСинхронизации, НСтр("ru='нет данных'") );
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры


#КонецОбласти