
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Процесс = Параметры.Процесс;
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	
	Описание = ПоддержкаПользователейДеньгиКлиентСервер.ТекстОписанияСостоянияОбмена(СостояниеОбмена, Процесс);
	ЕстьОшибки = ПоддержкаПользователейДеньгиКлиентСервер.СостояниеСодержитОшибки(СостояниеОбмена, Процесс);
	Элементы.СообщитьВСлужбуПоддержки.Видимость = ЕстьОшибки;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура ОписаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Ссылка =  Нрег(ДанныеСобытия.Href);
	
	// на некоторых устройствах слеш в конце обрезается, на других наоборот, подсталвяется
	Если СтрНайти(Ссылка, "mm1c://guide_") = 1 Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиКРазделуРуководства(Сред(Ссылка, 14));
	Иначе
		СтандартнаяОбработка = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СообщитьВСлужбуПоддержки(Команда)
	ОтправитьСообщениеОбОшибке();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПерейтиКРазделуРуководства(ИмяРаздела)
	
	ПоддержкаПользователейДеньгиКлиент.ОткрытьОписаниеРаздела(ИмяРаздела);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьСообщениеОбОшибке()
	
	Если СостояниеОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	Состояние(НСтр("ru='Подготовка технологической информации...'"));
	
	ПараметрыФормы = ПараметрыСообщения();
	ПараметрыФормы.Тема = "1С:Деньги. Ошибка синхронизации";
	
	ПредставлениеОшибки = "";
	ТехнологическаяИнформация = ПоддержкаПользователейДеньгиКлиентСервер.ТекстСостоянияДляТехподдержки(СостояниеОбмена, ПредставлениеОшибки);
	
	ПараметрыФормы.Тело = "При синхронизации возникли ошибки.
		| 
		|"+ ТехнологическаяИнформация + "
		|	
		|	* дата: " + ТекущаяДата();
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВСлужбуПоддержки", ПараметрыФормы, ЭтотОбъект, Истина);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыСообщения()

	Возврат ПоддержкаПользователейДеньги.НоваяСтруктураСообщения();

КонецФункции

#КонецОбласти
