//////////////////////////////////////////////////////////////////////////////////////////
// Клиентский интерфейс инструментов управления и работы с push-уведомлениями
//////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьПараметрыРассылки() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИмяОтправителя", "1С:Деньги 8, ред. 2.0");
	Результат.Вставить("КлючОтправителя", "PUSH_SRV_API_KEY_24FEDACB_C2A7_45F4_90AA_B0F69AB35B56");
	Результат.Вставить("ИдентификаторМобильногоПриложения", "com.e1c.money");
	
	Возврат Результат;
КонецФункции

Функция ОтправитьУведомление(Знач Уведомления) Экспорт
	ПараметрыРассылки = ПолучитьПараметрыРассылки();
	#Если НЕ ВебКлиент Тогда
	ОтправкаДоставляемыхУведомлений.Отправить(Уведомления, ПараметрыРассылки.КлючОтправителя, , Истина);
	#КонецЕсли
КонецФункции

// Создает экземпляр уведомления
//
// Параметры:
//  Заголовок			 - Строка - Заголовок уведомления
//  Текст				 - Строка - Текст уведомления
//  Данные				 - Строка - Данные уведомления
//  ДатаСрабатывания	 - Дата - Дата срабатывания уведомления. Если = Неопределено, то сообщение отображается мгновенно
//  ИнтервалПовторения	 - Число - Интервал повторения уведомления в секундах
//  ОповеститьЗвуком	 - Булево - Ложь, когда надо оповестить пользователя без звука
// 
// Возвращаемое значение:
//  ДоставляемоеУведомление - созданный экземпляр объекта уведомления
//
Функция СоздатьУведомление(Знач Заголовок, Знач Текст, Знач Данные = "", Знач ДатаСрабатывания = Неопределено, Знач ИнтервалПовторения = 0, Знач ОповеститьЗвуком = Ложь) Экспорт
	
	#Если (Не ВебКлиент) Тогда
		
	Уведомление = Новый ДоставляемоеУведомление;
    Уведомление.Заголовок = Заголовок;
    Уведомление.Текст = Текст;
    Уведомление.Данные = Данные;
		
	Если ДатаСрабатывания <> Неопределено Тогда
    	Уведомление.ДатаПоявленияУниверсальноеВремя = УниверсальноеВремя(ДатаСрабатывания);
	КонецЕсли;

    Уведомление.ИнтервалПовтора = ИнтервалПовторения;
	
	
	Возврат Уведомление;
	
	#КонецЕсли
	
КонецФункции
