&НаКлиенте 
Перем ЗакрытиеОбработано;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, 
			"УзелИнформационнойБазы,ВидТранспорта,ВыполнятьВыгрузку,ВыполнятьЗагрузку,ИмяФайлаВыгрузки,
			|ПричинаПропускаВыгрузки,ПричинаПропускаЗагрузки");
	Параметры.Свойство("ЗакрыватьПоЗавершении", ЗакрыватьПоЗавершении);
	Если ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.WS Тогда
		Заголовок = НСтр("ru='Синхронизация с сервером'");
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
		Заголовок = НСтр("ru='Обмен через файл на диске'");
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.Dropbox Тогда
		Заголовок = НСтр("ru='Обмен файлами через Dropbox'");
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.ЯндексДиск Тогда
		Заголовок = НСтр("ru='Обмен файлами через Яндекс.Диск'");
	ИначеЕсли ВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.GoogleDrive Тогда
		Заголовок = НСтр("ru='Обмен файлами через Google Drive'");
	КонецЕсли;
	
	Если ВыполнятьВыгрузку И Не ВыполнятьЗагрузку Тогда
		ПредставлениеДействия = НСтр("ru='Выполняется выгрузка данных. 
				|Пожалуйста подождите…'");
		ПредставлениеУспех  = "Данные выгружены";
		ПредставлениеОшибка = "Не удалось выгрузить данные";
	ИначеЕсли Не ВыполнятьВыгрузку И ВыполнятьЗагрузку Тогда
		ПредставлениеДействия = НСтр("ru='Выполняется загрузка данных. 
				|Пожалуйста подождите…'");
		ПредставлениеУспех = "Данные загружены";
		ПредставлениеОшибка = "Не удалось загрузить данные";
	Иначе
		ПредставлениеДействия = НСтр("ru='Выполняется синхронизация данных. 
				|Пожалуйста подождите…'");
		ПредставлениеУспех = "Синхронизация выполнена";
		ПредставлениеОшибка = "Не удалось синхронизировать данные";
	КонецЕсли;
	
	Элементы.СтатусДлительнойОперации.Заголовок = ПредставлениеДействия;
	Элементы.ОбменЗавершенСОшибкойДляАдминистратора.Видимость = Ложь;
	
	Элементы.СтатусОбменЗавершенСОшибкойДляАдминистратора.Заголовок = ПредставлениеОшибка;
	Элементы.СтатусОбменЗавершенУспешно.Заголовок = ПредставлениеУспех;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("НачатьСинхронизацию", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФоновоеЗаданиеИдентификатор) Или ЗакрытиеОбработано = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Синхронизация данных еще не завершилась
		|Рекомендуется дождаться окончания синхронизации, иначе есть риск потерять часть записей информационной базы
		|
		|Прервать синхронизацию?'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПрерватьСинхронизациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Прервать'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФоновоеЗаданиеИдентификатор) Тогда
		ЗавершитьВыполнениеДлительнойОперации(ФоновоеЗаданиеИдентификатор);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ПроцессыОбменаКлиент.КлючОповещенияОбИзмененииСостоянияОбмена() Тогда
		
		ОбновитьСостояниеОменаКлиент();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


&НаКлиенте
Процедура СтатусДлительнойОперацииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "http://transport" Тогда
		// описание для транспорта обмена
		ПоказатьОписаниеСостоянияОбмена("Транспорт");	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "http://receiving" Тогда
		// описание для процесса Прием
		ПоказатьОписаниеСостоянияОбмена("Прием");	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "http://sending" Тогда
		// описание для процесса Передача
		ПоказатьОписаниеСостоянияОбмена("Передача");	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДлительнаяОперацияНажатие(Элемент)
	ПоказатьОписаниеСостоянияОбмена("");
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ПерейтиВЖурналРегистрации(Команда)
	ПараметрыФормы = ДанныеОтбораЖурналаРегистрации(УзелИнформационнойБазы, МоментЗавершенияЗадания);
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСинхронизацию()
	
	ТекстОшибки = "";
	Элементы.Группа1.Доступность = Ложь;
	
	Если ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE") Тогда
	
		ВыполнитьОбменЧерезФайл();
		Если ВыполнятьЗагрузку Тогда
			Оповестить("ВыполненОбменДанными");
		КонецЕсли;
	
		Возврат;
	
	КонецЕсли;
	
	ФоновоеЗадание = НовоеЗаданиеОбмена();
	
	ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
	ПроверитьОбработчикОповещенияОбИзмененииСостояния();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФоновоеЗаданиеИдентификатор = ФоновоеЗадание.ИдентификаторФоновогоЗадания;
	
	Если ФоновоеЗадание.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания  = Ложь;
		ПараметрыОжидания.ВыводитьСообщения     = Истина;
		
		ОбновитьСостояниеОбмена();
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеФоновогоЗадания", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоновоеЗадание, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		ФоновоеЗаданиеРезультатВыполнения = ФоновоеЗадание;
		ПодключитьОбработчикОжидания("РезультатВыполненияФоновогоЗадания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменЧерезФайл()
	
	Если СостояниеОбмена = Неопределено Тогда
		ПеревестиАвтоматВначальноеСостояние();
	КонецЕсли;
	
	ОписаниеОшибки = "";
	Отказ = Ложь;
	Если ВыполнятьВыгрузку Тогда
	
		ПроцессыОбменаСлужебный.ВыполнитьВыгрузкуВФайлВРучномРежиме(ИмяФайлаВыгрузки, 
					СостояниеОбмена, Отказ, ОписаниеОшибки);
		ТекстОшибки = НСтр("ru='Выгрузка изменений в файл завершилась ошибкой.
			|='") + ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, 
					НСтр("ru='Подробности можно посмотреть в журнале регистрации'") );
	
	ИначеЕсли ВыполнятьЗагрузку Тогда
		
		ПроцессыОбменаСлужебный.ВыполнитьЗагрузкуИзФайлаВРучномРежиме(ИмяФайлаВыгрузки, 
					СостояниеОбмена, Отказ, ОписаниеОшибки);
		ТекстОшибки = НСтр("ru='Загрузка данных из файла завершилась ошибкой.
		|='") + ?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, 
				НСтр("ru='Подробности можно посмотреть в журнале регистрации'") );
		
	КонецЕсли;
	
	МоментЗавершенияЗадания = ТекущаяДата();
	
	Если Отказ Тогда
		Элементы.ОбменЗавершенСОшибкойДляАдминистратора.Видимость = Истина;
		Элементы.ОбменЗавершенУспешно.Видимость = Ложь;
	КонецЕсли; 
	
	Элементы.Группа1.Доступность = Отказ;
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаРезультат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеФоновогоЗадания(РезультатЗадания, ДополнительныеПараметры) Экспорт
	
	ФоновоеЗаданиеРезультатВыполнения = РезультатЗадания;
	РезультатВыполненияФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеОменаКлиент()
	
	ФоновоеЗаданиеРезультатВыполнения = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	
	СостояниеОбмена = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.СостояниеОбмена", Неопределено);
	Если СостояниеОбмена = Неопределено Тогда
		ОбновитьСостояниеОбмена();
		Возврат;
	КонецЕсли;
	
	ОбновитьСтатусДлительнойОперации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыполненияФоновогоЗадания()
	
	Выполнено       = Ложь;
	ВыполненУспешно = Ложь;
	Если ФоновоеЗаданиеРезультатВыполнения = Неопределено Тогда
		
		Элементы.СтатусОбменЗавершенСОшибкойДляАдминистратора.Заголовок = НСтр("ru='Не получен результат длительной операции'");
		Элементы.ОбменЗавершенСОшибкойДляАдминистратора.Видимость = Истина;
		Элементы.ОбменЗавершенУспешно.Видимость = Ложь;
		
	ИначеЕсли ФоновоеЗаданиеРезультатВыполнения.Статус = "Ошибка" Тогда 
		
		Элементы.ОбменЗавершенСОшибкойДляАдминистратора.Видимость = Истина;
		Элементы.ОбменЗавершенУспешно.Видимость = Ложь;
		ТекстОшибки = ФоновоеЗаданиеРезультатВыполнения.КраткоеПредставлениеОшибки;
		
	Иначе
		
		ОбновитьСостояниеОбмена();
		
		Выполнено = СостояниеОбмена <> Неопределено И Не СостояниеОбмена.ПроцессАктивен;
		ВыполненУспешно = Выполнено И Не СостояниеОбмена.ЗавершенСОшибками 
							И Не СостояниеОбмена.ЗавершенСПредупреждениями;
		ФоновоеЗаданиеИдентификатор  = Неопределено;
		ФоновоеЗаданиеАдресХранилища = Неопределено;
		
		
		Если ВыполненУспешно Тогда
			Элементы.ОбменЗавершенСОшибкойДляАдминистратора.Видимость = Ложь;
			Элементы.ОбменЗавершенУспешно.Видимость = Истина;
			
		ИначеЕсли Выполнено Тогда
			Элементы.ОбменЗавершенСОшибкойДляАдминистратора.Видимость = Истина;
			Элементы.ОбменЗавершенУспешно.Видимость = Ложь;
			ТекстОшибки = СостояниеОбмена.Передача.ТекстОшибки 
					+ ?(ЗначениеЗаполнено(СостояниеОбмена.Передача.ТекстОшибки) 
							И ЗначениеЗаполнено(СостояниеОбмена.Прием.ТекстОшибки), Символы.ПС, "")
					+ СостояниеОбмена.Прием.ТекстОшибки;
			
		Иначе
			НачатьСинхронизацию();
			Возврат;
		КонецЕсли;
		
		Оповестить("ВыполненОбменДанными");
		
	КонецЕсли;
	
	Элементы.Группа1.Доступность = ЗначениеЗаполнено(ТекстОшибки);
	
	Элементы.ГруппаСтраницФормы.ТекущаяСтраница = Элементы.СтраницаРезультат;
	МоментЗавершенияЗадания = ТекущаяДата();
	Если ВыполнятьЗагрузку Тогда
		Оповестить("Выполнена очистка ИБ"); // для обновления ссылок в настройках
	КонецЕсли;
	
	Если ВыполненУспешно И ЗакрыватьПоЗавершении И Открыта() Тогда
		ЗакрытиеОбработано = Истина;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеОбмена()
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	ОбновитьСтатусДлительнойОперации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСтатусДлительнойОперации(Форма)
	
	СостояниеОбмена = форма.СостояниеОбмена;
	
	СтрокиСостояния = Новый Массив;
	СтрокиСостояния.Добавить(СостояниеОбмена.СтруктураПредставления.СостояниеТранспорта);
	СтрокиСостояния.Добавить(Символы.ПС);
	СтрокиСостояния.Добавить(СостояниеОбмена.СтруктураПредставления.СостояниеПередача);
	СтрокиСостояния.Добавить(Символы.ПС);
	СтрокиСостояния.Добавить(СостояниеОбмена.СтруктураПредставления.СостояниеПрием);
	
	форма.Элементы.СтатусДлительнойОперации.Заголовок = Новый ФорматированнаяСтрока(СтрокиСостояния);
	
КонецПроцедуры

&НаСервере
Функция НовоеЗаданиеОбмена()
	
	Если СостояниеОбмена = Неопределено Тогда
		ПеревестиАвтоматВначальноеСостояние();
	КонецЕсли;
	
	Возврат АвтоматСинхронизацииССервисом.ОбменСОблачнымХранилищемВручную(ЭтотОбъект);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗавершитьВыполнениеДлительнойОперации(ИдентификаторЗадания)
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеОтбораЖурналаРегистрации(УзелИнформационнойБазы, МоментЗавершенияЗадания)
	
	ОтбираемыеСобытия = Новый Массив;
	ОтбираемыеСобытия.Добавить(ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(УзелИнформационнойБазы, Перечисления.ДействияПриОбмене.ЗагрузкаДанных));
	ОтбираемыеСобытия.Добавить(ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(УзелИнформационнойБазы, Перечисления.ДействияПриОбмене.ВыгрузкаДанных));
	
	СостоянияОбменовДаннымиЗагрузка = ОбменДаннымиСервер.СостоянияОбменовДанными(УзелИнформационнойБазы, Перечисления.ДействияПриОбмене.ЗагрузкаДанных);
	СостоянияОбменовДаннымиВыгрузка = ОбменДаннымиСервер.СостоянияОбменовДанными(УзелИнформационнойБазы, Перечисления.ДействияПриОбмене.ВыгрузкаДанных);
	
	Результат = Новый Структура;
	Результат.Вставить("СобытиеЖурналаРегистрации", ОтбираемыеСобытия);
	Результат.Вставить("ДатаНачала",    Мин(СостоянияОбменовДаннымиЗагрузка.ДатаНачала, СостоянияОбменовДаннымиВыгрузка.ДатаНачала));
	Результат.Вставить("ДатаОкончания", Макс(СостоянияОбменовДаннымиЗагрузка.ДатаОкончания, СостоянияОбменовДаннымиВыгрузка.ДатаОкончания, МоментЗавершенияЗадания));
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПрерватьСинхронизациюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытиеОбработано = Истина;
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеревестиАвтоматВначальноеСостояние()
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьОписаниеСостоянияОбмена(ИмяПроцесса)
	
	ПараметрыФормы = Новый Структура("Процесс", ИмяПроцесса);
	ОткрытьФорму("ОбщаяФорма.СостояниеОбменаДанными", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
