
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Если Переключатель = ТекущийФорматВыгрузки(Организация) Тогда
			Модифицированность = Ложь;
		Иначе
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	СтруктураФорматовВыгрузки = ХранилищеНастроекДанныхФорм.Загрузить(
		"Обработка.ОбщиеОбъектыРеглОтчетности.Форма.НастройкиФорматаВыгрузкиОтчетовСтатистики",
		"ФорматыВыгрузкиСтатистическойОтчетностиВЭлектронномВиде");
	
	Если ТипЗнч(СтруктураФорматовВыгрузки) <> Тип("Структура") Тогда
		СтруктураФорматовВыгрузки = Новый Структура;
		СтруктураФорматовВыгрузки.Вставить("Формат1", Новый Массив);
		СтруктураФорматовВыгрузки.Вставить("Формат2", Новый Массив);
	КонецЕсли;
	
	МассивОрганизацийСФорматомВыгрузки1 = СтруктураФорматовВыгрузки["Формат1"];
	МассивОрганизацийСФорматомВыгрузки2 = СтруктураФорматовВыгрузки["Формат2"];
	
	Если Переключатель = 1 Тогда
		
		Если МассивОрганизацийСФорматомВыгрузки1.Найти(Организация) = Неопределено Тогда
			МассивОрганизацийСФорматомВыгрузки1.Добавить(Организация);
		КонецЕсли;
		
		Если МассивОрганизацийСФорматомВыгрузки2.Найти(Организация) <> Неопределено Тогда
			МассивОрганизацийСФорматомВыгрузки2.Удалить(МассивОрганизацийСФорматомВыгрузки2.Найти(Организация));
		КонецЕсли;
		
	ИначеЕсли Переключатель = 2 Тогда
		
		Если МассивОрганизацийСФорматомВыгрузки2.Найти(Организация) = Неопределено Тогда
			МассивОрганизацийСФорматомВыгрузки2.Добавить(Организация);
		КонецЕсли;
		
		Если МассивОрганизацийСФорматомВыгрузки1.Найти(Организация) <> Неопределено Тогда
			МассивОрганизацийСФорматомВыгрузки1.Удалить(МассивОрганизацийСФорматомВыгрузки1.Найти(Организация));
		КонецЕсли;
		
	КонецЕсли;
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Обработка.ОбщиеОбъектыРеглОтчетности.Форма.НастройкиФорматаВыгрузкиОтчетовСтатистики",
		"ФорматыВыгрузкиСтатистическойОтчетностиВЭлектронномВиде",
		СтруктураФорматовВыгрузки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	ПредупредитьОПовторномВыполнении = Параметры.ПредупредитьОПовторномВыполнении;
	Элементы.Организация.Доступность = Параметры.ОрганизацияДоступна;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ТекущийФорматВыгрузки = ТекущийФорматВыгрузки(Организация);
		
		Если ТекущийФорматВыгрузки = Неопределено Тогда
			Переключатель = 1;
			Модифицированность = Истина;
		Иначе
			Переключатель = ТекущийФорматВыгрузки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекущийФорматВыгрузки = ТекущийФорматВыгрузки(Организация);
		Если ТекущийФорматВыгрузки = 2 Тогда
			Переключатель = 2;
			Модифицированность = Ложь;
		ИначеЕсли ТекущийФорматВыгрузки = 1 Тогда
			Переключатель = 1;
			Модифицированность = Ложь;
		Иначе
			Переключатель = 2;
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		Переключатель = 2;
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ТекущийФорматВыгрузки(Организация)
	
	Возврат РегламентированнаяОтчетность.ФорматВыгрузкиСтатистическойОтчетностиВЭлектронномВиде(Организация);
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Перем ТекущийФорматВыгрузки;
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекущийФорматВыгрузки = ТекущийФорматВыгрузки(Организация);
		Если ТекущийФорматВыгрузки = Неопределено Тогда
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Если Не ЗначениеЗаполнено(Организация) Тогда
			ПоказатьПредупреждение(,НСтр("ru='Не указана организация/подразделение, настройки формата выгрузки статистических отчетов не сохранены.'"));
			Возврат;
		КонецЕсли;
		
		Отказ = Истина;
		
		ДополнительныеПараметры = Новый Структура("ТекущийФорматВыгрузки", ТекущийФорматВыгрузки);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Настройки были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ТекущийФорматВыгрузки = ДополнительныеПараметры.ТекущийФорматВыгрузки;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьИЗакрытьЗавершение", ЭтотОбъект);
		
		// В настройках сохраняем выбранный пользователем формат.
		Если Переключатель = 2 Тогда
			
			ТекстПредупреждения = НСтр("ru='Для организации """ + СокрЛП(Организация)
				+ """ сохранены настройки выгрузки стат. отчетности в формате ПО ""Заполнение форм статистической отчетности"", версии 2.4.4.'");
			
		ИначеЕсли Переключатель = 1 Тогда
			
			ТекстПредупреждения = НСтр("ru='Для организации """ + СокрЛП(Организация)
				+ """ сохранены настройки выгрузки стат. отчетности в формате ПО ""Формы статотчетности (предприятие)"", версии 1.21.'");
			
		КонецЕсли;
		
		Если ПредупредитьОПовторномВыполнении Тогда
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС +"Повторно выполните операцию выгрузки.";
		КонецЕсли;
		
		ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		
		Если ТекущийФорматВыгрузки = Неопределено Тогда
			
			Переключатель = 1;
			ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьИЗакрытьЗавершение", ЭтотОбъект);
			
			// В настройках принудительно сохраняем наиболее распространенный - "старый" формат.
			ТекстПредупреждения = НСтр("ru='Для организации """ + СокрЛП(Организация)
				+ """ сохранены настройки выгрузки стат. отчетности в формате ПО ""Формы статотчетности (предприятие)"", версии 1.21.
				|Для изменения формата выгрузки перейдите в форму настроек журнала ""Регламентированная и финансовая отчетность"".'");
			
			Если ПредупредитьОПовторномВыполнении Тогда
				ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Символы.ПС +"Повторно выполните операцию выгрузки.";
			КонецЕсли;
			
			ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения);
			
		Иначе
			Модифицированность = Ложь;
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьЗавершение(ДополнительныеПараметры) Экспорт
	
	СохранитьНастройки();
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти