&НаСервере
Процедура УчетТоваров_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЗагрузкиИзНалоговой();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЗагрузкиИзНалоговой()   
	
	ДоступнаЗагрузкаИзНалоговой = НЕ Объект.УчетТоваров_ЗагруженИзНалоговой;
	
	Элементы.QRКод.Доступность = ДоступнаЗагрузкаИзНалоговой;
	Элементы.ФормаУчетТоваров_ЗагрузитьДанныеЧекаИзНалоговой.Доступность = ДоступнаЗагрузкаИзНалоговой;
		
КонецПроцедуры

//////////////////////////////////<<ЗАГРУЗКА ЧЕКА ИЗ НАЛОГОВОЙ/////////////////////////////////////////////////
&НаКлиенте
Процедура ЗагрузитьДанныеЧекаИзНалоговойПосле(Команда)
	
	Результат = ЗагрузитьДанныеЧекаИзНалоговойНаСервере();
	
	ОписаниеОшибки = Результат.ОписаниеОшибки;	
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Сообщить(ОписаниеОшибки);
	Иначе                                                 
		УстановитьДоступностьЗагрузкиИзНалоговой();
		Сообщить("Данные успешно загружены");		
	КонецЕсли;

КонецПроцедуры     

&НаСервере
Функция ЗагрузитьДанныеЧекаИзНалоговойНаСервере()
	
	СтруктураОтвета = Новый Структура("Ответ, ОписаниеОшибки", Неопределено, "");	
	
	ПроверитьЗаполнениеПараметровПодключения(СтруктураОтвета);
	
	Если ЗначениеЗаполнено(СтруктураОтвета.ОписаниеОшибки) Тогда
		Возврат СтруктураОтвета;		
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.Расход"));
	СтруктураОтвета = ДокументОбъект.ЗагрузитьДанныеЧекаИзНалоговой();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Возврат СтруктураОтвета;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеПараметровПодключения(СтруктураОтвета)
	
	Если НЕ ЗначениеЗаполнено(Константы.ТокенПроверкаЧеков.Получить()) Тогда
		СтруктураОтвета.ОписаниеОшибки = "Укажите токен подключения к сервису проверки чеков";		
	КонецЕсли;
	
КонецПроцедуры
//////////////////////////////////ЗАГРУЗКА ЧЕКА ИЗ НАЛОГОВОЙ>>/////////////////////////////////////////////////

//////////////////////////////////<<РАБОТА С НОМЕНКЛАТУРОЙ/////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоНоменклатуреПоставщика(Команда)
	ЗаполнитьНоменклатуруПоНоменклатуреПоставщикаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПоНоменклатуреПоставщикаНаСервере()

	Для Каждого Стр Из Объект.Номенклатура Цикл
		Стр.Номенклатура = Стр.НоменклатураПоставщика.Номенклатура;		
		
		Если Стр.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		Стр.СтатьяРасходов	= Стр.Номенклатура.СтатьяРасходов;				
	КонецЦикла;        
	
	Модифицированность = Истина;

КонецПроцедуры
//////////////////////////////////РАБОТА С НОМЕНКЛАТУРОЙ>>/////////////////////////////////////////////////