&НаСервере
Процедура УчетТоваров_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьЗагрузкиИзНалоговой();   
	УстановитьДоступностьЗаполненияРасходовПоНоменклатуре();
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЗагрузкиИзНалоговой()   
	
	ДоступнаЗагрузкаИзНалоговой				 = НЕ Объект.УчетТоваров_ЗагруженИзНалоговой;
	
	Элементы.QRКод.Доступность = ДоступнаЗагрузкаИзНалоговой;
	Элементы.ФормаУчетТоваров_ЗагрузитьДанныеЧекаИзНалоговой.Доступность = ДоступнаЗагрузкаИзНалоговой; 
		
КонецПроцедуры  

&НаСервере
Процедура УстановитьДоступностьЗаполненияРасходовПоНоменклатуре()   
	
	ДоступноЗаполнениеРасходовПоНоменклатуре = НЕ Объект.УчетТоваров_РасходыЗаполненыПоНоменклатуре;
	
	Элементы.РасходыУчетТоваров_ЗаполнитьРасходыПоНоменклатуре.Доступность = ДоступноЗаполнениеРасходовПоНоменклатуре;
		
КонецПроцедуры

//////////////////////////////////<<ЗАГРУЗКА ЧЕКА ИЗ НАЛОГОВОЙ/////////////////////////////////////////////////
&НаКлиенте
Процедура ЗагрузитьДанныеЧекаИзНалоговойПосле(Команда)
	
	Если ЗагрузитьДанныеЧекаИзНалоговойНаСервере() Тогда
		УстановитьДоступностьЗагрузкиИзНалоговой();
		Сообщить("Данные успешно загружены");		
	КонецЕсли;

КонецПроцедуры     

&НаСервере
Функция ЗагрузитьДанныеЧекаИзНалоговойНаСервере()
		
	Если НЕ ПроверитьЗаполнениеПараметровПодключения() Тогда 
		Возврат Ложь;		
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.Расход"));
	ДокументОбъект.ЗагрузитьДанныеЧекаИзНалоговой();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеПараметровПодключения() 
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Константы.ТокенПроверкаЧеков.Получить()) Тогда
		ТекстОшибки = "Укажите токен подключения к сервису проверки чеков";	
		ОбщегоНазначенияКлиентСервер.СообщитьНаСервере(ТекстОшибки); 
		Результат = Ложь;
	КонецЕсли;   
	
	Возврат Результат;
	
КонецФункции
//////////////////////////////////ЗАГРУЗКА ЧЕКА ИЗ НАЛОГОВОЙ>>/////////////////////////////////////////////////

//////////////////////////////////<<РАБОТА С НОМЕНКЛАТУРОЙ/////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоНоменклатуреПоставщика(Команда)
	ЗаполнитьНоменклатуруПоНоменклатуреПоставщикаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПоНоменклатуреПоставщикаНаСервере()

	Для Каждого Стр Из Объект.Номенклатура Цикл
		Стр.Номенклатура = Стр.НоменклатураПоставщика.Номенклатура;		
		
		Если Стр.Номенклатура.Пустая() Тогда
			Продолжить;			
		КонецЕсли;     
		
		Стр.СтатьяРасходов	= Стр.Номенклатура.СтатьяРасходов;				
	КонецЦикла;        
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура УчетТоваров_ЗаполнитьРасходыПоНоменклатуреПосле(Команда)

	ЗаполнитьРасходыПоНоменклатуреНаСервере();
	УстановитьДоступностьЗаполненияРасходовПоНоменклатуре();
		
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьРасходыПоНоменклатуреНаСервере()
		
	Если Объект.УчетТоваров_Номенклатура.Количество() = 0 Тогда                     
		ТекстСообщения = "В табличной части 'Номенклатура' нет строк. Операция не будет выполнена!";
		ОбщегоНазначенияКлиентСервер.СообщитьНаСервере(ТекстСообщения);
		Возврат;		
	КонецЕсли;
			
	Если ЕстьНоменклатураСПустымиРасходами() Тогда              
		ТекстСообщения = "В табличной части 'Номенклатура' не во всех строках заполнены статьи расходов. Операция не будет выполнена!";
		ОбщегоНазначенияКлиентСервер.СообщитьНаСервере(ТекстСообщения);
		Возврат;		
	КонецЕсли;      
	
	Если Объект.Расходы.Итог("Сумма") <> Объект.УчетТоваров_Номенклатура.Итог("Сумма") Тогда
		ТекстСообщения = "Расходятся суммы в табличных частях. Операция не будет выполнена!";
		ОбщегоНазначенияКлиентСервер.СообщитьНаСервере(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТаблицаПоСтатьямРасходов = Объект.УчетТоваров_Номенклатура.Выгрузить();
	ТаблицаПоСтатьямРасходов.Свернуть("СтатьяРасходов", "Сумма");
	
	Объект.Расходы.Очистить();	
	
	Для Каждого Стр Из ТаблицаПоСтатьямРасходов Цикл
		НоваяСтрока = Объект.Расходы.Добавить();
		НоваяСтрока.СтатьяРасходаИмущество = Стр.СтатьяРасходов; 
		НоваяСтрока.Сумма = Стр.Сумма;
	КонецЦикла;       
	
	Объект.УчетТоваров_РасходыЗаполненыПоНоменклатуре = Истина; 
		
КонецПроцедуры   

&НаСервере
Функция ЕстьНоменклатураСПустымиРасходами()

	Возврат Объект.УчетТоваров_Номенклатура.НайтиСтроки(
		Новый Структура("СтатьяРасходов", Справочники.СтатьиРасходов.ПустаяСсылка())).Количество() > 0;
		
КонецФункции

&НаКлиенте
Процедура УчетТоваров_НоменклатураНоменклатураПриИзмененииПосле(Элемент)

	ТекущиеДанные = Элементы.УчетТоваров_Номенклатура.ТекущиеДанные;
	ТекущиеДанные.СтатьяРасходов = ПолучитьРеквизитОбъекта(ТекущиеДанные.Номенклатура, "СтатьяРасходов");

КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитОбъекта(Знач Объект, Реквизит)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, Реквизит);
	
КонецФункции

&НаКлиенте
Процедура УчетТоваров_НоменклатураПриИзмененииПосле(Элемент)

	Объект.УчетТоваров_НоменклатураОбработана = НЕ ЕстьНоменклатураСПустымиРасходами(); 	

КонецПроцедуры

&НаКлиенте
Процедура УчетТоваров_НоменклатураНоменклатураПоставщикаПриИзмененииПосле(Элемент)

	ТекущиеДанные = Элементы.УчетТоваров_Номенклатура.ТекущиеДанные;
	ТекущиеДанные.Номенклатура = ПолучитьРеквизитОбъекта(ТекущиеДанные.НоменклатураПоставщика, "Номенклатура"); 
	ТекущиеДанные.СтатьяРасходов = ПолучитьРеквизитОбъекта(ТекущиеДанные.Номенклатура, "СтатьяРасходов");
	
КонецПроцедуры
//////////////////////////////////РАБОТА С НОМЕНКЛАТУРОЙ>>/////////////////////////////////////////////////