///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает признак того, что в сборке использованы библиотеки разделенного режима
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	Нет
//
//Возвращаемое значение:
//	Булево - Истина, если сборка предназначена для работы в облаке
//
Функция ИспользуютсяПодсистемыОблака() Экспорт
	Возврат ОбщегоНазначения.ПодсистемаСуществует("ОблачныеСервисыДенег"); //ОСД
КонецФункции

// Возвращает имя режима, в котором используется приложение
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	Нет
//
//Возвращаемое значение:
//	Строка - один из следующих вариантов:
//		 - "Независимый"     - настольная программа без синхронизации с другими программами
//		 - "ЦентрМобильных"  - настольная программа, является центральной базой для мобильных приложений
//		 - "Неразделенный"   - облачное приложение в неразделенном режиме
//		 - "Разделенный"     - облачное приложение в разделенном режиме
//		 - "КлиентОблака"    - автономная копия, синхронизируемая с облаком
//
Функция РежимИспользованияПриложения() Экспорт
	Возврат ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
КонецФункции


#Область Настройки_соединения_с_облаком

// Возвращает параметры соединения с сервером облачного приложения
//
//Параметры:
//	нет
//
//Возвращаемое значение:
//	Структура - см. НовыйПараметрыСоединенияСОблаком()
//
Функция ПараметрыСоединенияСОблаком() Экспорт
	Возврат ДеньгиВОблакеПовтИсп.ПараметрыСоединенияСОблаком();
КонецФункции

// Очищает параметры соединения с сервером облачного приложения
//
//Параметры:
//	нет
//
Процедура ОчиститьПараметрыСоединенияСОблаком() Экспорт

	ПустыеПараметры = ДеньгиВОблаке.НовыйПараметрыСоединенияСОблаком();
	ПустыеПараметры.Отключено = Истина;
	РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаписатьНастройку(
				ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединения(), 
				ПустыеПараметры);
	ПланыОбмена.СинхронизацияАвтономныхКопий.ОчиститьКодЦентральнойБазы();
	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

// Записывает параметры соединения с сервером облачного приложения
//
//Параметры:
//	ПолныйПутьКБазе - Строка - URL доступа к базе на сервере
//	Логин  - Строка - логин пользователя абонента
//	Пароль - Строка - пароль пользователя абонента
//	НомерОбласти - Число - номер области данных на сервере
//	КодАбонента - Число - код абонента на сервере
//
Процедура ЗаписатьПараметрыСоединенияСОблаком(ПолныйПутьКБазе, Логин, Пароль, НомерОбласти, ИмяЭтойБазы, КодАбонента, Отключено) Экспорт
	
	СтруктураАдсера = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПолныйПутьКБазе);
	
	Настройка = НовыйПараметрыСоединенияСОблаком();
	Настройка.ПолныйПутьКБазе = ПолныйПутьКБазе;
	Настройка.АдресСервера    = СтруктураАдсера.ИмяСервера;
	Настройка.Логин           = ?(ЗначениеЗаполнено(Логин), Логин, СтруктураАдсера.Логин);
	Настройка.Пароль          = ?(ЗначениеЗаполнено(Пароль), Пароль, СтруктураАдсера.Пароль);
	Настройка.НомерОбласти    = НомерОбласти;
	Настройка.ИмяЭтойБазы     = ИмяЭтойБазы;
	Настройка.КодАбонента     = КодАбонента;
	Настройка.Отключено       = Отключено;
	
	РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединения(), Настройка);
	
	// Обновление настроек WS-соединения с узлом плана обмена
	УзелСервера = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Корреспондент",     УзелСервера);
	СтруктураЗаписи.Вставить("WSURLВебСервиса",   ПолныйПутьКБазе);
	СтруктураЗаписи.Вставить("WSЗапомнитьПароль", Истина);
	СтруктураЗаписи.Вставить("WSИмяПользователя", Настройка.Логин);
	СтруктураЗаписи.Вставить("WSПароль",          Настройка.Пароль);
	СтруктураЗаписи.Вставить("ВидТранспортаСообщенийОбменаПоУмолчанию", Перечисления.ВидыТранспортаСообщенийОбмена.WS);
	
	РегистрыСведений.НастройкиТранспортаОбменаДанными.ОбновитьЗапись(СтруктураЗаписи);
	
	ЭтотУзел = СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел();
	Если ЭтотУзел.Наименование <> ИмяЭтойБазы Тогда
		ЭтотУзелОбъект = ЭтотУзел.ПолучитьОбъект();
		ЭтотУзелОбъект.Наименование = ИмяЭтойБазы;
		ЭтотУзелОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотУзелОбъект.Записать();
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Обновляет значение "ЗапрещеноНаСервере" в параметрах облачного приложения
//
//Параметры:
//	ПараметрыПриложения - Структура - см. НовыйПараметрыСоединенияСОблаком();
//	ДоступностьНаСервере - Булево - доступность или недоступность на сервере
//
Процедура ЗаписатьДоступностьЭтойБазыНаСервере(ПараметрыПриложения, ЗапрещеноНаСервере) Экспорт
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = ПараметрыСоединенияСОблаком();
	КонецЕсли;
	Если ПараметрыПриложения.ЗапрещеноНаСервере = ЗапрещеноНаСервере Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПриложения.ЗапрещеноНаСервере = ЗапрещеноНаСервере;
	РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединения(), ПараметрыПриложения);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

// Обновляет значение "Отключено" в параметрах облачного приложения
//
//Параметры:
//	ПараметрыПриложения - Структура - см. НовыйПараметрыСоединенияСОблаком();
//
Процедура ИзменитьПометкуОтключенияЭтойБазы(Отключено, ПараметрыПриложения = Неопределено) Экспорт
	
	Режим = РежимИспользованияПриложения();
	Если Режим = "Неразделенный" Или Режим = "Разделенный" Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = ПараметрыСоединенияСОблаком();
	КонецЕсли;
	
	Если ПараметрыПриложения.Отключено <> Отключено Тогда
		ПараметрыПриложения.Отключено = Отключено;
		РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаписатьНастройку(ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединения(), ПараметрыПриложения);
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает адрес менеджера сервсиса - в разделенном режиме из модулей БТС,
//	в автономной копии - из значений настроек
//
Функция СерверМенеджераСервиса() Экспорт
	
	Если ИспользуютсяПодсистемыОблака() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДСервер");
		Возврат  Модуль.СерверМенеджераСервиса();
	Иначе
		Возврат РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСерверМС(), ДеньгиВОблакеКлиентСервер.АдресСервераМС());
	КонецЕсли;
	
КонецФункции


// Процедуры-обертки для получения настроек из РС ЗначенияНастроекИнтеграции

Функция КодПриложенияНаСервере() Экспорт
	Возврат РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиКодПриложения(), "money");
КонецФункции

Функция КодСайтаПромоРегистрации() Экспорт
	Возврат РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиКодПромоРегистрации(), 1);
КонецФункции

Функция АдресСервисаРегистрации() Экспорт
	Возврат РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСервисБыстройРегистрации(), Неопределено);
КонецФункции

Функция АдресСервисаВнешнийИнтерфейс() Экспорт
	Возврат РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСервисВнешнегоИнтрефейса(), Неопределено);
КонецФункции

Функция АдресСервисаБиллинга() Экспорт
	Возврат РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ДеньгиВОблакеКлиентСервер.ИмяНастройкиСервисБиллинга(), Неопределено);
КонецФункции

Функция АдресСервисаСинхронизации() Экспорт
	Возврат "hs/moneysynch/";
КонецФункции

#КонецОбласти 


#Область Подключение_к_облаку

// Записывает в облаке изменения свойств информационной базы в фоновом режиме
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//		ПараметрыПодключения - Структура, содержит новые значения параметров подключения
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ИзменитьПарольИИмяБазыВОблакеВФоне(ПараметрыМетода, АдресРезультата, ДополнительныйАдрес = Неопределено) Экспорт
	
	ПараметрыПодключения = Неопределено;
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, "", Истина);
	
	НовыеЗначения = ПараметрыМетода;
	НовыйПароль = Неопределено;
	НовыеЗначения.Свойство("Пароль", НовыйПароль);
	НовоеИмя = Неопределено;
	НовыеЗначения.Свойство("ИмяЭтойБазы", НовоеИмя);
	
	Если ЗначениеЗаполнено(НовыйПароль) И НовыйПароль <> ПараметрыПодключения.Пароль Тогда
		
		ОписаниеОшибки     = "";
		РезультатИзменений = СменитьПарольПользователяВОблаке(НовыйПароль);
		//РезультатИзменений = ЗаменитьПарольНаСервере(ПараметрыПодключения.Логин, 
		//		ПараметрыПодключения.Пароль, НовыйПароль, ПараметрыПодключения.КодАбонента, ОписаниеОшибки);
		Если РезультатИзменений.КодСостояния = 200 Тогда
			ПараметрыПодключения.Пароль = РезультатИзменений.Пароль;
			ЗаписатьПараметрыСоединенияСОблаком(ПараметрыПодключения.ПолныйПутьКБазе, ПараметрыПодключения.Логин, 
						ПараметрыПодключения.Пароль, ПараметрыПодключения.НомерОбласти, ПараметрыПодключения.ИмяЭтойБазы,
						ПараметрыПодключения.КодАбонента, ПараметрыПодключения.Отключено);
		Иначе
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовоеИмя) И НовоеИмя <> ПараметрыПодключения.ИмяЭтойБазы Тогда
		
		НовыеСвойства      = Новый Структура("Наименование", НовоеИмя);
		РезультатИзменений = ИзменитьСвойстваИБВОблаке(ПараметрыПодключения.КодЭтогоУзла, НовыеСвойства, ПараметрыПодключения);
		Если РезультатИзменений = Истина Тогда
			ПараметрыПодключения.ИмяЭтойБазы  = НовоеИмя;
		КонецЕсли;
		
	КонецЕсли;
	
	// Фиксация изменений в локальных настройках
	ЗаписатьПараметрыСоединенияСОблаком(ПараметрыПодключения.ПолныйПутьКБазе, ПараметрыПодключения.Логин, 
					ПараметрыПодключения.Пароль,
					ПараметрыПодключения.НомерОбласти, 
					?(ЗначениеЗаполнено(НовоеИмя), НовоеИмя, ПараметрыПодключения.ИмяЭтойБазы),
					ПараметрыПодключения.КодАбонента, ПараметрыПодключения.Отключено);
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Истина, АдресРезультата);
	
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура НачатьРегистрациюАбонентаВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	АдресРезультата = ПоместитьВоВременноеХранилище(НачатьРегистрациюНовогоАбонента(ПараметрыМетода.Логин), АдресРезультата);
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПроверитьСостояниеРегистрацииНовогоАбонентаВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	ТекстОшибки = "";
	Результат   = СостояниеРегистрацииНовогоАбонента(ПараметрыМетода.АдресЗавершенияРегистрации, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	АдресРезультата = ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ИзменитьПарольПользователяВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	ТекстОшибки = "";
	Результат = СменитьПарольПользователяВОблаке(ПараметрыМетода.НовыйПароль, ПараметрыМетода.ТекущийПароль, ПараметрыМетода.Логин, ТекстОшибки);
	//Результат   = ЗаменитьПарольНаСервере(ПараметрыМетода.Логин, ПараметрыМетода.ТекущийПароль, 
	//						ПараметрыМетода.НовыйПароль, ПараметрыМетода.КодАбонента, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	АдресРезультата = ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПроверитьРегистрациюБазыНаСервереВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	АдресРезультата = ПоместитьВоВременноеХранилище(РегистрацияЭтойБазыНаСервере(ПараметрыМетода.ПараметрыПодключения), АдресРезультата);
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПодключитьБазуКАбонентуВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	ТекстОшибки = "";
	Результат   = ПараметрыАбонентаПоЛогинуПользователя(ПараметрыМетода.Логин, ПараметрыМетода.Пароль, ТекстОшибки);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	АдресРезультата = ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПолучитьСвойстваЭтойБазыИзОблакаВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	АдресРезультата = ПоместитьВоВременноеХранилище(СвойстваЗарегистрированнойБазы(СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла()), АдресРезультата);
КонецПроцедуры

// Запускает фоновое задание
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ОбновитьСвойстваБазыВОблакеВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	ПараметрыПодключения = Неопределено;
	ПараметрыМетода.Свойство("ПараметрыПодключения", ПараметрыПодключения);
	НовыеСвойства = Неопределено;
	ПараметрыМетода.Свойство("СвойстваБазы", НовыеСвойства);
	
	Если Не ЗначениеЗаполнено(НовыеСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСвойстваИБВОблаке(ПараметрыМетода.КодИБ, НовыеСвойства, ПараметрыПодключения);
	
	Если ПараметрыМетода.КодИБ = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла() Тогда
		
		НовоеНаименование           = Неопределено;
		НовыеСвойства.Свойство("Наименование", НовоеНаименование);
		НовоеСинхронизацияЗапрещена = Неопределено;
		НовыеСвойства.Свойство("СинхронизацияЗапрещена", НовоеСинхронизацияЗапрещена);
		Если ЗначениеЗаполнено(НовоеНаименование) Или НовоеСинхронизацияЗапрещена <> Неопределено Тогда
			// Фиксация изменений в локальных настройках
			ЗаписатьПараметрыСоединенияСОблаком(ПараметрыПодключения.ПолныйПутьКБазе, ПараметрыПодключения.Логин, 
							ПараметрыПодключения.Пароль,
							ПараметрыПодключения.НомерОбласти, 
							?(ЗначениеЗаполнено(НовоеНаименование), НовоеНаименование, ПараметрыПодключения.ИмяЭтойБазы),
							ПараметрыПодключения.КодАбонента, 
							?(НовоеСинхронизацияЗапрещена = Неопределено, ПараметрыПодключения.Отключено, НовоеСинхронизацияЗапрещена)
							);
		КонецЕсли;
		
	КонецЕсли;
	
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Истина, АдресРезультата);
	
КонецПроцедуры



// Выполняет запрос регистрации приложения на сервере. В случае успеха заполняет АдресЗавершения
//и возвращает:
//		* 200 - регистрация выполнена, область готова. В параметр АдресЗавершения попмещена ссылка на приложение в облаке
//		* 302 - регистрация выполнена, нужно ожидать завершение подготовки области. В параметр АдресЗавершения попмещена ссылка на завершение регистрации
//	В случае ошибки заполняет ОписаниеОшибки и возвращает код ошибки:
//		* 500 - прочие ошибки
//		* 501 - почтовый адрес неправильный
//		* 502 - указанный адрес уже используется
//	Доступность: Автономная копия
//
//Параметры:
//	ПочтаАбонента - Строка - e-mail, онже логин абонента
//	ИмяПользователя - Строка - имя пользователя-владельца абонента для регистрации в списке пользователей
//	ТелефонАбонента - Строка - номер телефона владельца абонента
//	
//Возвращаемое значение
//	Структура
//		* КодСостояния - Число - код из ответа сервера
//		* АдресЗавершенияРегистрации - Строка или Неопределено - http адрес страницы ожидания завершения регистрации
//		* ОписаниеОшибки - Строка - описание ошибки ответа
//
Функция НачатьРегистрациюНовогоАбонента(ПочтаАбонента, ИмяПользователя = "", ТелефонАбонента = "") Экспорт

	СтруктураЗапроса = НовыйСтруктураЗапросаРегистрации();
	
	СтрокаТела = СтрШаблон("name=%1&email=%2&phone=%3&promo=%4&promouser=ExtRegMoney", 
				"""" + ?(ЗначениеЗаполнено(ИмяПользователя), ИмяПользователя, СтрШаблон(НСтр("ru='Владелец абонента %1'"), ПочтаАбонента)) + """",
				ПочтаАбонента, "", Строка(КодСайтаПромоРегистрации()));
	СтрокаТела = СтрокаТела + "&userExistsErrorRedirectUrl=userExists" // редирект для существующего пользователя
				+ "&unknownErrorRedirectUrl=unknownError" // редирект для неопределенной ошибки на сервере
				+ "&promocodeNotFoundRedirectUrl=promocodeNotFound" // редирект для промокода, котороый не найден
				+ "&promocodeBlockedRediretUrl=promocodeBlocked" // редирект для заблокированного промокода
				+ "&promocodeExpiredRedirectUrl=promocodeExpired"; // редирект для промокода, у которого истек срок
				
	Ответ = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, СтрокаТела, "Биллинг.Регистрация абонента");
	
	Результат = Новый Структура("КодСостояния,АдресЗавершенияРегистрации,ОписаниеОшибки");
	Результат.КодСостояния   = Ответ.КодСостояния;
	Результат.АдресЗавершенияРегистрации = "";
	Результат.ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	
	Если Результат.КодСостояния = 302 И Ответ.ОтветСервера.Заголовки["Location"] <> Неопределено Тогда
		
		
		АдресРедиректа = Ответ.ОтветСервера.Заголовки["Location"];
		Если СтрНайти(АдресРедиректа, "/userExists") > 0 Тогда
			Результат.КодСостояния = 403;
			Результат.ОписаниеОшибки = НСтр("ru='Пользователь с таким логином (e-mail) уже существует'");
		ИначеЕсли СтрНайти(АдресРедиректа, "/promocodeNotFound") > 0 Тогда
			Результат.КодСостояния = 422;
			Результат.ОписаниеОшибки = НСтр("ru='Промо-код не найден'");
		ИначеЕсли СтрНайти(АдресРедиректа, "/promocodeBlocked") > 0 Тогда
			Результат.КодСостояния = 423;
			Результат.ОписаниеОшибки = НСтр("ru='Промо-код заблокирован'");
		ИначеЕсли СтрНайти(АдресРедиректа, "/promocodeExpired") > 0 Тогда
			Результат.КодСостояния = 500;
			Результат.ОписаниеОшибки = НСтр("ru='Истек срок действия промо-кода'");
		ИначеЕсли СтрНайти(АдресРедиректа, "/unknownError") > 0 Тогда
			Результат.КодСостояния = 500;
			Результат.ОписаниеОшибки = НСтр("ru='На сервере произошла неизвестная ошибка'");
		Иначе
			Результат.АдресЗавершенияРегистрации = АдресРедиректа;
		КонецЕсли;
		
	ИначеЕсли Результат.КодСостояния = 400 Тогда
		
		Результат.ОписаниеОшибки = НСтр("ru='Регистрация не выполнена из-за проблем с логином или паролем!'");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет завершение регистрации по ссылке, полученной в  НачатьРегистрациюНовогоАбонента();
//	Доступность: Автономная копия
//
//Параметры:
//	АдресЗавершенияРегистрации - Строка - возвращаемый параметр, заполняется ссылкой на завершение регистрации в случае успеха
//	ОписаниеОшибки  - Строка - возвращаемый параметр, заполняется описанием ошибки в случае проблем 
//	
//Возвращаемое значение
//	Структура
//		* КодСостояния
//			* 200 - регистрация выполнена, область готова. В параметр АдресЗавершенияРегистрации попмещена ссылка на приложение в облаке
//			* 302 - регистрация выполнена, нужно ожидать завершение подготовки области. В параметр АдресЗавершенияРегистрации попмещена ссылка на завершение регистрации
//			* другое значение - ответ сервреа с заполнением параметра ОписаниеОшибки
//		* ПолныйПутьКБазе
//		* Логин
//		* Пароль
//		* НомерОбласти
//		* КодАбонента
//		* АдресЗавершенияРегистрации - Строка - заполняется только если КодСостояния = 302
//
Функция СостояниеРегистрацииНовогоАбонента(АдресЗавершенияРегистрации, ОписаниеОшибки = "", HTTPСоединение = Неопределено) Экспорт

	Результат = Новый Структура("КодСостояния,ПолныйПутьКБазе,Логин,Пароль,НомерОбласти,КодАбонента");
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресЗавершенияРегистрации);
	Попытка
		
		Если HTTPСоединение = Неопределено Тогда
			HTTPСоединение = Новый HTTPСоединение(
				СтруктураURI.Хост,
				СтруктураURI.Порт,
				СтруктураURI.Логин,
				СтруктураURI.Пароль,
				RESTВызовСервера.ИнтернетПроксиПоНастройкам(),
				40,
				?(СтруктураURI.Порт = 443 Или НРег(СтруктураURI.Схема) = "https", Новый ЗащищенноеСоединениеOpenSSL(), Неопределено)
			);
		КонецЕсли;
		
		HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);
		РезультатЗапроса = HTTPСоединение.Получить(HTTPЗапрос);
		Ответ = РезультатЗапроса.ПолучитьТелоКакСтроку();
		
	Исключение
		
		ТекстОшибки = СтрШаблон("Ошибка выполнения HTTP-запроса:
				| запрос = ""%1""
				| ошибка: %2", 
				СтруктураURI.ПутьНаСервере, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ДеньгиВОблакеВызовСервера.ЗарегистрироватьОшибкуВЖурнале(
					ТекстОшибки, НСтр("ru='Регистрация нового абонента'"));
		ОписаниеОшибки = НСтр("ru='Сервис регистрации временно недоступен, попробуйте немного позднее.'");
		Результат.КодСостояния = -100;
		Возврат Результат;
		
	КонецПопытки;
	
	ЧтениеHTML = Новый ЧтениеHTML();
	ЧтениеHTML.УстановитьСтроку(Ответ);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	Адрес = "";
	usr = "";
	pwd = "";

	Если ДокументDOM.Формы.Количество() > 0
		И ДокументDOM.Формы[0].Идентификатор = "login" Тогда
		Для каждого ТекЭлемент ИЗ ДокументDOM.Формы[0].Элементы Цикл
			Если ТекЭлемент.Имя = "usr" Тогда
				usr = ТекЭлемент.Значение;
			ИначеЕсли ТекЭлемент.Имя = "pwd" тогда
				pwd = ТекЭлемент.Значение;
			Конецесли;
		КонецЦикла;
		Адрес = ДокументDOM.Формы[0].Действие;
	КонецЕсли;
	
	Адрес = СтрЗаменить(Адрес, "?OIDA-", "");
	
	Если Адрес <> "/e1cib/start" Тогда
		
		Результат.ПолныйПутьКБазе = СтрЗаменить(Адрес, "/e1cib/start", "");
		Результат.Логин           = usr;
		Результат.Пароль          = pwd;
		Результат.КодСостояния    = 200;
		
		ПозицияРазделителя = СтрНайти(Результат.ПолныйПутьКБазе, "/", НаправлениеПоиска.СКонца);
		ОбластьСтрокой = Прав(Результат.ПолныйПутьКБазе, СтрДлина(Результат.ПолныйПутьКБазе) - ПозицияРазделителя);
		Если Не ПустаяСтрока(ОбластьСтрокой) И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ОбластьСтрокой) Тогда
			Результат.НомерОбласти = Число(ОбластьСтрокой);
		КонецЕсли;
		
		// Определение кода абонента
		Если ЗначениеЗаполнено(usr) Тогда
			Абоненты = АбонентыПользователя(usr, pwd, ОписаниеОшибки);
			Если ТипЗнч(Абоненты) = Тип("Массив") И Абоненты.Количество() > 0 Тогда
				Результат.КодАбонента = Абоненты[0].id;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Результат.КодСостояния = 302;
		Результат.Вставить("АдресЗавершенияРегистрации", АдресЗавершенияРегистрации);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список абонентов пользователя
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	ПользовательАбонента - Строка - Логин пользователя абонента
//	ПарольПользователя - Строка - пароль пользователя абонента
//	ОписаниеОшибки  - Строка - возвращаемый параметр, заполняется описанием ошибки в случае проблем 
//
//Возвращаемое значение:
//	Массив структур, описывающих абонентов пользователя:
//		* id - число - код абонента
//		* name - Строка - Наименование
//		* role - Строка - РолиПользователя
//
Функция АбонентыПользователя(ПользовательАбонента, ПарольПользователя, ОписаниеОшибки = "") Экспорт

	СтруктураЗапроса = НовыйСтруктураЗапросаВнешнегоИнтерфейса(ПользовательАбонента, ПарольПользователя);
	
	ПараметрыЗапроса = Новый Структура("general", Новый Структура);
	ПараметрыЗапроса.general.Вставить("type", "ext");
	ПараметрыЗапроса.general.Вставить("method", "account/list");
	
	Ответ           = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), "Биллинг.Получение списка абонентов");
	ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Возврат Неопределено;
	ИначеЕсли Ответ.КодСостояния = 401 Тогда 
		ОписаниеОшибки = НСтр("ru='Ошибка авторизации: неверный адрес почты или пароль'");
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(Ответ.ЗначениеОтвета) <> Тип("Структура")
		Или Не Ответ.ЗначениеОтвета.Свойство("account") Тогда 
		ОписаниеОшибки = НСтр("ru='Сервер вернул неправильный ответ'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СкопироватьРекурсивно(Ответ.ЗначениеОтвета.account);

КонецФункции

// Возвращает список областей указанного абонента
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	ПользовательАбонента - Строка - Логин пользователя абонента
//	ПарольПользователя - Строка - пароль пользователя абонента
//	КодАбонента - Число - код абонента менеджера сервиса
//	ОписаниеОшибки  - Строка - возвращаемый параметр, заполняется описанием ошибки в случае проблем 
//
//Возвращаемое значение:
//	Массив структур, описывающих абонентов пользователя:
//		* КодАбонента - число
//		* Наименование - Строка
//		* РолиПользователя - Строка
//
Функция ОбластиАбонента(ПользовательАбонента, ПарольПользователя, КодАбонента, ОписаниеОшибки = "") Экспорт

	СтруктураЗапроса = НовыйСтруктураЗапросаВнешнегоИнтерфейса(ПользовательАбонента, ПарольПользователя);
	
	ПараметрыЗапроса = Новый Структура("general", Новый Структура);
	ПараметрыЗапроса.general.Вставить("type", "ext");
	ПараметрыЗапроса.general.Вставить("method", "tenant/list");
	
	ПараметрыЗапроса.Вставить("auth", Новый Структура);
	ПараметрыЗапроса.auth.Вставить("account", КодАбонента);
	
	Ответ  = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), "Биллинг.Получение областей абонента");
	ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СкопироватьРекурсивно(Ответ.ЗначениеОтвета.tenant);

КонецФункции

// Возвращает структуру с параметрами подключения, восстановленную по логину и паролю пользователя менеджера сервиса
//Для успешного выполнения пользователь должен быть владельцем абонента
//	Доступность: Автономная копия
//
//Параметры:
//	ПользовательАбонента - Строка - Логин пользователя абонента
//	ПарольПользователя - Строка - пароль пользователя абонента
//	ОписаниеОшибки  - Строка - возвращаемый параметр, заполняется описанием ошибки в случае проблем 
//
//Возвращаемое значение:
//	Струкутура - см. НовыйПараметрыСоединенияСОблаком() Или Неопределено в случае ошибки
//
//
Функция ПараметрыАбонентаПоЛогинуПользователя(Логин, Пароль, ОписаниеОшибки = "") Экспорт

	Результат = НовыйПараметрыСоединенияСОблаком();
	Результат.Логин  = Логин;
	Результат.Пароль = Пароль;
	
	СписокАбонентов = АбонентыПользователя(Логин, Пароль, ОписаниеОшибки);
	Если Не ЗначениеЗаполнено(СписокАбонентов) Тогда
		ОписаниеОшибки = НСтр("ru='Для указанного пользователя невозможно получить список абонентов. Пожалуйста, укажите логин и пароль владельца абонента'"); 
		Возврат Неопределено;
	КонецЕсли;
	
	КодПриложенияНаСервере = КодПриложенияНаСервере();
	Для каждого Абонент Из СписокАбонентов Цикл
		
		Если Абонент = Неопределено Или Не ЗначениеЗаполнено(Абонент.id) Тогда
			Продолжить;
		КонецЕсли;
		
		Области = ОбластиАбонента(Логин, Пароль, Абонент.id, ОписаниеОшибки);
		Если Области = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Для каждого Область Из Области Цикл
			Если Область.application = КодПриложенияНаСервере Тогда
				Результат.КодАбонента     = Абонент.id;
				Результат.НомерОбласти    = Область.id;
				Результат.ПолныйПутьКБазе = Область.url;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выполняет запрос на замену пароля пользователя для входа в сервис. Возвращает код состояния сервера:
//	200 - пароль изменен
//	- другие значения
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	Логин - Строка - e-mail, онже логин абонента
//	ТекущийПароль - Строка - текущий пароль пользоватаеля абонента
//	НовыйПароль - Строка - пароль, который нужно установить
//	КодАбонента - Число - код абонента пользователя
//	ОписаниеОшибки  - Строка - возвращаемый параметр, заполняется описанием ошибки в случае проблем 
//
//Возвращаемое значение:
//	Структура
//		* КодСостояния
//			* 200 - пароль изменен
//			* другое значение - ответ сервреа с заполнением параметра ОписаниеОшибки
//		* Логин
//		* Пароль
//
Функция ЗаменитьПарольНаСервере(Логин, ТекущийПароль, НовыйПароль, КодАбонента, ОписаниеОшибки = "") Экспорт

	СтруктураЗапроса = НовыйСтруктураЗапросаВнешнегоИнтерфейса(Логин, ТекущийПароль);
	
	ПараметрыЗапроса = Новый Структура("auth,general", Новый Структура, Новый Структура);
	ПараметрыЗапроса.auth.Вставить("account", КодАбонента);
	ПараметрыЗапроса.general.Вставить("type", "ext");
	ПараметрыЗапроса.general.Вставить("method", "user/change_password");
	
	ПараметрыЗапроса.Вставить("password", ТекущийПароль);
	ПараметрыЗапроса.Вставить("new_password", НовыйПароль);
	
	Ответ           = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), "Биллинг.Смена пароля пользователя сервиса");
	ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", ?(Ответ.КодСостояния = 200, НовыйПароль, ТекущийПароль));
	
	Возврат Результат;
	
КонецФункции

// Возвращает структуру для описания параметров подключения к облаку
//	Доступность: Автономная копия
Функция НовыйПараметрыСоединенияСОблаком() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("АдресСервера", ); 
	Результат.Вставить("УзелСервера", ); // ссылка на узел плана обмена
	Результат.Вставить("Логин", );
	Результат.Вставить("Пароль", );
	Результат.Вставить("НомерОбласти",    ); // число
	Результат.Вставить("ПолныйПутьКБазе", );
	Результат.Вставить("ИмяЭтойБазы",   ИмяКомпьютера());
	Результат.Вставить("КодАбонента",   "");
	Результат.Вставить("Отключено", Истина); // используется ли синхронизация с облаком?
	Результат.Вставить("ЗапрещеноНаСервере", Ложь); // в плане обмена на сервере установлен запрет на синхронизацию для этого узла
	Результат.Вставить("АдресСервисаСинхронизации", "");

	Возврат Результат;
	
КонецФункции

// Проверяет корректность параметров подключения, если указано - вызывает исключение при обнаружении ошибок
//	Доступность: Автономная копия
//
//Параметры:
//	ПараметрыПодключения - структура с параметрами подключения к облаку см. ДеньгиДоступКОблакуВызовСервера.ПараметрыСоединенияСОблаком()
//	ТекстОшибки - Строка - заполняется описанием ошибок, если таковые находятся
//	ВызыватьИсключание - Булево - нужно ли вызывать исключение при обнаружении ошибки
//
//Возвращаемое значение:
//	Булево - Истина, если параметры подключения успешно прошли проверку
//
Функция ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, ТекстОшибки = "", ВызыватьИсключение = Ложь) Экспорт

	Если ПараметрыПодключения = Неопределено Тогда
		ПараметрыПодключения = ПараметрыСоединенияСОблаком();
	КонецЕсли;
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(ПараметрыПодключения.ПолныйПутьКБазе) Тогда
		ТекстОшибки = НСтр("ru='Не указан URL облака'"); 
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыПодключения.Логин) Или Не ЗначениеЗаполнено(ПараметрыПодключения.Пароль) Тогда
		ТекстОшибки = ТекстОшибки + ?(ТекстОшибки="", "", Символы.ПС) + НСтр("ru='Логин/пароль пользователя облака не заданы, или указаны некорректно'"); 
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекстОшибки = "";

КонецФункции

#КонецОбласти 


#Область Взаимодействие_с_биллингом

// Получает с сервера в фоновом режиме информацию для оформления подписок: актуальные тарифы с ценами, 
//остатки неиспльзоавнных подписок
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПолучитьТарифыИОстаткиПодписокВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(ТарифыИОстаткиПодписок(), АдресРезультата);
	
КонецПроцедуры

// Получает ссылку на страницу оплаты по указанным параметрам подписки
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ЗаказатьПлатежнуюСсылкуВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(
			ЗаказатьПлатежнуюСсылку(ПараметрыМетода.КодТарифа, ПараметрыМетода.ВариантПодписки, 
					ПараметрыМетода.НачалоДействия, ПараметрыМетода.ОкончаниеДействия, ПараметрыМетода.КоличествоЛицензий), 
			АдресРезультата);
	
КонецПроцедуры

// Проверяет наличие платежной ссылки в универсальном объекте. 
//В хранилище значения помещает ответ сервера с кодом состояния. Если код состояния 302, значит, ссылка еще не готова и следует повторить запрос
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПроверитьГотовностьПлатежнойСсылкиВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(
			ПолучитьПлатежнуюСсылку(ПараметрыМетода.ИДУниверсальногоОбъекта), 
			АдресРезультата);
	
КонецПроцедуры

// Проверяет оформление подписки по заявке с указанными ID
//В хранилище помещает структуру с кодом состояния и результатом проверки. Если код состояния 302, значит заявка еще не обработана юиллинговой подсистемой
//
//Параметры:
//	ПараметрыМетода - Структута - параметры выполняемого задания
//	АдресРезультата - Строка - адрес, в который будет помещен результат выполнения задания
//
Процедура ПроверитьСозданиеПодпискиПоЗаявкеВФоне(ПараметрыМетода, АдресРезультата) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(
			ПодпискаПоЗаявкеСоздана(ПараметрыМетода.ИДУниверсальногоОбъекта), 
			АдресРезультата);
	
КонецПроцедуры


// Регистрирует эту информационную базу на сервере и возвращает параметры, 
//	Доступность: Автономная копия
//
//Параметры:
//	ПараметрыПодключения - структура с параметрами подключения к облаку см. ПараметрыСоединенияСОблаком()
//
//Возвращаемое значение:
//	Структура - обработанный результат метода POST http-сервиса moneybill/connectIB
//
Функция РегистрацияЭтойБазыНаСервере(ПараметрыПодключения = Неопределено) Экспорт

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураЗапроса = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), 
							"connectIB/registration/" + ПараметрыПодключения.КодЭтогоУзла);
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ServerID", ПараметрыПодключения.КодЦентральнойБазы);
	
	Если Не ЗначениеЗаполнено(ПараметрыПодключения.ИмяЭтойБазы) Тогда
		ПараметрыПодключения.ИмяЭтойБазы = ИмяКомпьютера();
	КонецЕсли;
	
	СвойстваИБ = Новый Структура;
	СвойстваИБ.Вставить("Наименование",         ПараметрыПодключения.ИмяЭтойБазы);
	СвойстваИБ.Вставить("МобильноеУстройство",  Ложь);
	ПараметрыЗапроса.Вставить("PropertiesIB",   СвойстваИБ);
	
	СвойстваПодкючения = Новый Структура("Логин,Пароль,НомерОбласти,КодАбонента,ПолныйПутьКБазе");
	ЗаполнитьЗначенияСвойств(СвойстваПодкючения,   ПараметрыПодключения);
	ПараметрыЗапроса.Вставить("PropertiesConnect", СвойстваПодкючения);
	
	ПараметрыЗапроса.Вставить("ClientUIDS",   ИдентификаторыКлиента());
	
	Ответ           = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), "Биллинг.Регистрация ИБ");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ИзменитьПометкуОтключенияЭтойБазы(Истина, ПараметрыПодключения);
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	РезультатОбработки = Ответ.ЗначениеОтвета;
	Если ПараметрыПодключения.КодЦентральнойБазы = "000" И СтрДлина(РезультатОбработки.КодЦБ) >= 36 Тогда
		СинхронизацияАвтономныхКопийВызовСервера.ЗаменитьКодЦентральнойБазы(РезультатОбработки.КодЦБ);
		ПараметрыПодключения.КодЦентральнойБазы = РезультатОбработки.КодЦБ;
	КонецЕсли;
	
	Если ПараметрыПодключения.ЗапрещеноНаСервере <> РезультатОбработки.ИБЗапрещена Тогда
		ЗаписатьДоступностьЭтойБазыНаСервере(ПараметрыПодключения, РезультатОбработки.ИБЗапрещена);
	КонецЕсли;

	Возврат РезультатОбработки;

КонецФункции

// Возвращает структуру с описанием разрешений и количества доступных лицензий
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	КодИБ - Строка - код проверяемой ИБ
//
//Возвращаемое значение:
//	Структура
//		* КодЦБ - Строка - Код текущей центральной базы
//		* ИБЗапрещена - Булево - Истина, если пользователь запретил синхронизацию с узлом
//		* ИБУстаревшая - Булево - активна ли база или помечена как устаревшая
//		* ПредлагатьСтартовуюПодписку - Булево - можно ли предлагать стартовую подписку
//		* ВсегоЛицензий - Число - кол-во доступных лицензий. (-111 = без ограничений)
//		* СвободноЛицензий - Число - кол-во неиспользованных доступных лицензий. (-111 = без ограничений)
//		* ЗанятоЛицензий - Число - кол-во занятых лицензий (-111 = без ограничений)
//		* НомерПринятого - число - номер принятого на сервере пакета
//		* НомерОтправленного - число - номер отправленного сервером пакета
//
Функция СвойстваЗарегистрированнойБазы(КодИБ, ПараметрыПодключения = Неопределено) Экспорт
	
	Режим = РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		Возврат ПолучитьСвойстваЭтойБазыВОблаке(КодИБ, ПараметрыПодключения);
	ИначеЕсли Режим = "Разделенный" Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Возврат  Модуль.СвойстваЗарегистрированнойБазы(КодИБ);
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

// Вызывает метод hs-сервиса для звписи изменений свойств узла на сервере
//
//Параметры:
//	КодИБ - Строка - код узла ЭтотУзел() в плане обмена СинхронизацияАвтономныхКопий
//	НовыеСвойства - Структура - содежит измененные свойства для записи в облаке
//
//Возвращаемое значение:
//	Структура
//		КодСостояния - Число - 200, если выполнено без ошибок
//		ОписаниеОшибки - Строка - информация об ошибке, если код состояния <> 200
//
Функция ИзменитьСвойстваИБВОблаке(КодУзла, НовыеСвойства, ПараметрыПодключения = Неопределено) Экспорт

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
					АдресСервисаБиллинга(), 
					"connectIB/change/"+ ?(ЗначениеЗаполнено(КодУзла), КодУзла, ПараметрыПодключения.КодЭтогоУзла));
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ServerID", ПараметрыПодключения.КодЦентральнойБазы);
	
	ПараметрыЗапроса.Вставить("PropertiesIB",   НовыеСвойства);
	
	СвойстваПодкючения = Новый Структура("Логин,Пароль,НомерОбласти,КодАбонента");
	ЗаполнитьЗначенияСвойств(СвойстваПодкючения,   ПараметрыПодключения);
	ПараметрыЗапроса.Вставить("PropertiesConnect", СвойстваПодкючения);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураПодключения, 
					ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), 
					"Биллинг.Изменение свойств узла");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Ответ.ЗначениеОтвета;

КонецФункции

// Выполняет запрос в облако для изменения признака "Устарела"
//
//Параметры:
//	КодИБ - Строка - код узла ЭтотУзел() в плане обмена СинхронизацияАвтономныхКопий
//	ЗначениеПризнака - Булево - значение признака "Устарела"
//
Функция ИзменитьПризнакУстарелаВОблаке(КодИБ, ЗначениеПризнака, ПараметрыПодключения = Неопределено) Экспорт
	
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
					АдресСервисаБиллинга(), 
					"connectIB/" + ?(ЗначениеПризнака, "outdate", "update") + "/"
						+ ?(ЗначениеЗаполнено(КодИБ), КодИБ, ПараметрыПодключения.КодЭтогоУзла));
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ServerID", ПараметрыПодключения.КодЦентральнойБазы);
	ПараметрыЗапроса.Вставить("CurrentIB", ПараметрыПодключения.КодЭтогоУзла);
	
	СвойстваПодкючения = Новый Структура("Логин,Пароль,НомерОбласти,КодАбонента");
	ЗаполнитьЗначенияСвойств(СвойстваПодкючения,   ПараметрыПодключения);
	ПараметрыЗапроса.Вставить("PropertiesConnect", СвойстваПодкючения);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураПодключения, 
					ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), 
					"Биллинг.Изменение признака ""устаревшая""");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Ответ.ЗначениеОтвета;
	
КонецФункции

// Выполняет запрос в облако для изменения признака "СинхронизацияЗапрещена"
//
//Параметры:
//	КодИБ - Строка - код узла ЭтотУзел() в плане обмена СинхронизацияАвтономныхКопий
//	ЗначениеПризнака - Булево - значение признака "СинхронизацияЗапрещена"
//
Функция ИзменитьЗапретСоединенияВОблаке(КодИБ, ЗначениеПризнака, ПараметрыПодключения = Неопределено) Экспорт
	
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
					АдресСервисаБиллинга(), 
					"connectIB/" + ?(ЗначениеПризнака, "ban", "unban") + "/"
						+ ?(ЗначениеЗаполнено(КодИБ), КодИБ, ПараметрыПодключения.КодЭтогоУзла));
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ServerID", ПараметрыПодключения.КодЦентральнойБазы);
	ПараметрыЗапроса.Вставить("CurrentIB", ПараметрыПодключения.КодЭтогоУзла);
	
	СвойстваПодкючения = Новый Структура("Логин,Пароль,НомерОбласти,КодАбонента");
	ЗаполнитьЗначенияСвойств(СвойстваПодкючения,   ПараметрыПодключения);
	ПараметрыЗапроса.Вставить("PropertiesConnect", СвойстваПодкючения);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураПодключения, 
					ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), 
					"Биллинг.Изменение признака ""Синхронизация запрещена""");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Ответ.ЗначениеОтвета;
	
КонецФункции

// Выполняет проверку состояния подписки на услугу
//
//Параметры:
//	ТипУслуги - Строка - "Загрузка", "Выгрузка"
//	ИмяПланаОбмена - Строка - имя плана обмена, которому принадлежит узел
//	КодУзлаИнформационнойБазы - Строка
//
Процедура ПроверитьСостояниеПодпискиНаУслугу(ТипУслуги, ИмяПланаОбмена, КодУзлаИнформационнойБазы) Экспорт
	
	СостояниеПодписки = СостояниеПодпискиНаУслугу(ИмяУслугиАвтоСинхронизация(), КодУзлаИнформационнойБазы);
	
	Если СостояниеПодписки.ИБЗапрещена Тогда
		Если ИмяПланаОбмена = "МобильноеПриложение" Тогда
			ВызватьИсключение НСтр("ru='Запрещено подключение этого мобильного устройства к облаку'");
		Иначе
			ВызватьИсключение НСтр("ru='Запрещено подключение этой информационной базы к облаку'");;
		КонецЕсли;
	КонецЕсли;
	
	Если СостояниеПодписки.ИБУстаревшая И ТипУслуги <> "ВыгрузкаРезервнойКопии" Тогда
		Если ИмяПланаОбмена = "МобильноеПриложение" Тогда
			ВызватьИсключение НСтр("ru='В облаке это мобильное устройство отмечено как устаревшее. 
				|Вернуть устройство в рабочее состояние можно из настольной программы или другого мобильного устройства, подключенных к облаку'");
		Иначе
			ВызватьИсключение НСтр("ru='В облаке эта информационная база отмечена как устаревшая. 
				|Вернуть базу в рабочее состояние можно из другой базы или с мобильного устройства, подключенных к облаку'");
		КонецЕсли;
	КонецЕсли;
	
	Если СостояниеПодписки.ВсегоЛицензий <> -111 И СостояниеПодписки.СвободноЛицензий < 0 Тогда
		
		НеХватаетЛицензий = -СостояниеПодписки.СвободноЛицензий;
		ВызватьИсключение СтрШаблон(НСтр("ru='Для выполнения синхронизации не хватает лицензий (%1 шт.)'"), НеХватаетЛицензий);
		
	КонецЕсли;
	
КонецПроцедуры
 

// Возвращает состояние подписки на услугу для указанной информационной базы
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	ИмяУслуги - Строка - наименование услуги, заданное на сервере
//	КодИБ - Строка - код узла ЭтотУзел() в плане обмена СинхронизацияАвтономныхКопий
//
//Возвращаемое значение:
//	Структура - см. ДеньгиБиллинг.СостояниеПодпискиНаУслугу()
//
Функция СостояниеПодпискиНаУслугу(ИмяУслуги, КодИБ, КлючЛицензии = Неопределено) Экспорт

	Режим = РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		Возврат ПолучитьСостояниеПодпискиИзОблака(ИмяУслуги, КодИБ, КлючЛицензии);
	ИначеЕсли Режим = "Разделенный" Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Возврат  Модуль.СостояниеПодпискиНаУслугу(ИмяУслуги, КодИБ, КлючЛицензии);
	КонецЕсли;
	
	ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает использование дополнительных лицензий'"), Режим);

КонецФункции

// Возвращает список актуальных подписок на услуги
//
//Параметры:
//	Параметр1- _описаниепараметра_
//
//Возвращаемое значение:
//	ТаблицаЗначений - список активных подписок на тарифы
//
Функция АктивныеПодписки() Экспорт

	Режим = РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		
		Возврат СписокАктуальныхПодписокИзОблака();
		
	ИначеЕсли Режим = "Разделенный" Тогда 
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Возврат Модуль.ВсеПодпискиАбонента();
		
	КонецЕсли;
	
	ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает использование дополнительных лицензий'"), );

КонецФункции

// Возвращает список информационных баз, подключенных к облаку
//	Доступность: Автономная копия
//
//Параметры:
//	Нет
//
//Возвращаемое значение:
//	ТаблицаЗначений
//
Функция СписокПодключенныхБаз() Экспорт

	ПараметрыПодключения = Неопределено;
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), 
				"connectIB/list/" + ПараметрыПодключения.КодЭтогоУзла);
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение списка баз");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	РезультатОбработки = Ответ.ЗначениеОтвета;
	
	Возврат РезультатОбработки;

КонецФункции

// Изменяет пароль пользователя облачного приложения
//
//Параметры:
//	НовыйПароль - Строка - пароль, который нунжно установить
//	
//
//Возвращаемое значение:
//	Структура
//		* КодСостояния
//			* 200 - пароль изменен
//			* другое значение - ответ сервреа с заполнением параметра ОписаниеОшибки
//		* Логин
//		* Пароль
//
Функция СменитьПарольПользователяВОблаке(НовыйПароль, ТекущийПароль = Неопределено, Логин = Неопределено, ОписаниеОшибки = "") Экспорт

	ПараметрыПодключения = Неопределено;
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), 
				"connectIB/changepass/" + ПараметрыПодключения.КодЭтогоУзла);
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	ПараметрыЗапроса.Вставить("newPassword", НовыйПароль);
	ПараметрыЗапроса.Вставить("password",    ?(ТекущийПароль = Неопределено, ПараметрыПодключения.Пароль, ТекущийПароль));
	ПараметрыЗапроса.Вставить("login",       ?(Логин = Неопределено, ПараметрыПодключения.Логин, Логин));
	
	СтруктураПодключения.Пароль = ПараметрыЗапроса.password;
	
	Для Счетчик = 1 По 3 Цикл
	
		Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураПодключения, 
						ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), 
						"Биллинг.Изменение свойств узла");
		ОписаниеОшибки = Ответ.ОписаниеОшибки;
		Если Ответ.КодСостояния = 200 Тогда
			Прервать;
		Иначе
			ОбщегоНазначенияДеньги.Пауза(2);
		КонецЕсли;
			
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	Результат.Вставить("Логин",        ПараметрыЗапроса.login);
	Результат.Вставить("Пароль",      ?(Ответ.КодСостояния = 200, НовыйПароль, ПараметрыЗапроса.password));
	
	Возврат Результат;

КонецФункции

// Возвращает структуру с информацией, достаточной для оформления подписки
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	ТолькоДоступные - Булево - если Истина, в выводе останется только возможные тарифы и варианты подписок
//
//Возвращаемое значение:
//	Структура или Неопределено
//
Функция ТарифыДляПодписки(ТолькоДоступные = Ложь) Экспорт

	Режим = РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		
		Возврат ПолучитьСписокТарифовИзОблака(ТолькоДоступные);
		
	ИначеЕсли Режим = "Разделенный" Тогда 
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		ТекстОшибки = "";
		Модуль.СписокТарифовДляПодписки(ТолькоДоступные, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ДеньгиВОблакеВызовСервера.ЗарегистрироватьОшибкуВЖурнале(ТекстОшибки, "Получение списка тарифов");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Возврат Истина;
		
	КонецЕсли;
	
	ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает тарификацию облачных услуг'"), );

КонецФункции

// Получает с сервера в фоновом режиме информацию для оформления подписок: актуальные тарифы с ценами, 
//остатки неиспльзоавнных подписок
//
//Параметры:
//	Нет
//
//Возвращаемое значение:
//	Структура
//
Функция ТарифыИОстаткиПодписок() Экспорт

	Режим = РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		
		Возврат ТарифыИОстаткиПодписокИзОблака();
		
	ИначеЕсли Режим = "Разделенный" Тогда 
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Возврат Модуль.ТарифыИОстаткиПодписок();
		
	КонецЕсли;
	
	ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает использование дополнительных лицензий'"), );

КонецФункции

// Отправляет в МС запрос на платежную ссылку. Возвращает идентификатор для отслеживания результата
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	КодТарифа - Строка - код тарифа, как он задан в менеджете сервиса
//	ВариантПодписки - Число - идентификатор выбранной пользователем длительности подписки (см. массив "ВариантыПодписок" в сведниях о тарифах)
//	НачалоДействия - Дата - с которой (включительно) должна начаться подписка. Запрещено использовать прошедшие периоды
//	ОкончаниеДействия - Дата - по которую (включительно) должна действовать подписка. Рассчитывается с учетом остатка неиспользованных подписок
//	КоличествоЛицензий - Число - сколько подписок нужно сделать с заданными условиями
//
//Возвращаемое значение:
//	Структура:
//		* КодСостояния - Число - 200, если заказ выполнен успешно и др. коды в случае проблем
//		* ИДУниверсальногоОбъекта - Строка - идентификатор, по которому можно отслеживать в МС состояние оплаты
//
Функция ЗаказатьПлатежнуюСсылку(КодТарифа, ВариантПодписки, НачалоДействия, ОкончаниеДействия, КоличествоЛицензий) Экспорт

	Режим = РежимИспользованияПриложения();
	Если Режим = "КлиентОблака" Тогда
		
		Возврат ИдентификаторДляПлатежнойСсылкиИзОблака(КодТарифа, ВариантПодписки, НачалоДействия, ОкончаниеДействия, КоличествоЛицензий);
		
	ИначеЕсли Режим = "Разделенный" Тогда 
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		ТекстОшибки = "";
		
		ИД = Модуль.ИдентификаторДляПлатежнойСсылки(КодТарифа, ВариантПодписки, НачалоДействия, ОкончаниеДействия, КоличествоЛицензий, ТекстОшибки);
		Результат = Новый Структура("КодСостояния,ИДУниверсальногоОбъекта,ОписаниеОшибки");
		Если ЗначениеЗаполнено(ИД) Тогда
			Результат.КодСостояния            = 200;
			Результат.ИДУниверсальногоОбъекта = ИД;
		Иначе
			Результат.КодСостояния            = 500;
			Результат.ОписаниеОшибки          = ТекстОшибки;
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает использование дополнительных лицензий'"), );

КонецФункции

// Получает из МС универсальный объект и проверяет в нем наличие платежной ссылки. 
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	ИДУниверсальногоОбъекта - Строка - идентификатор универсального объекта в менеджере сервиса
//
//Возвращаемое значение:
//	Структура:
//		* ПлатежнаяСсылка - Строка - адрес ссылки, которую нужно показать пользователю для оплаты
//		* ИдентификаторПлатежа - Строка - идентификатор, по которому можно отслеживать в МС состояние оплаты
//
Функция ПолучитьПлатежнуюСсылку(ИДУниверсальногоОбъекта) Экспорт

	Режим = РежимИспользованияПриложения();
	
	Результат = Новый Структура("КодСостояния,ИДУниверсальногоОбъекта,ПлатежнаяСсылка,ОписаниеОшибки");
	Результат.Вставить("ИДУниверсальногоОбъекта", ИДУниверсальногоОбъекта);
	УниверсальныйОбъект = Неопределено;
	
	Если Режим = "КлиентОблака" Тогда
		
		ОтветСервера = УниверсальныйОбъектИнтеграцииИзОблака(ИДУниверсальногоОбъекта);
		ЗаполнитьЗначенияСвойств(Результат, ОтветСервера, "КодСостояния,ОписаниеОшибки");
		Если Результат.КодСостояния = 200 Тогда
			УниверсальныйОбъект = ОтветСервера.ЗначениеОтвета;
		КонецЕсли;
		
	ИначеЕсли Режим = "Разделенный" Тогда 
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		УниверсальныйОбъект = Модуль.ОбъектЗаявкиНаПодписку(ИДУниверсальногоОбъекта, Результат.ОписаниеОшибки);
		Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
			Результат.КодСостояния   = 500;
		Иначе
			Результат.КодСостояния   = 200;
		КонецЕсли;
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает использование дополнительных лицензий'"), );
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УниверсальныйОбъект) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не УниверсальныйОбъект.Свойство("СтруктураДанных") 
			Или Не ЗначениеЗаполнено(УниверсальныйОбъект.СтруктураДанных) Тогда
		Результат.КодСостояния   = 500;
		Результат.ОписаниеОшибки = НСтр("ru='С сервера не возвращена структура универсального объекта'");
		
	ИначеЕсли УниверсальныйОбъект.СтруктураДанных.Свойство("Ошибка") 
			И УниверсальныйОбъект.СтруктураДанных.Ошибка Тогда
		Результат.КодСостояния   = 500;
		Если УниверсальныйОбъект.СтруктураДанных.Свойство("ОписаниеОшибки")
				И ЗначениеЗаполнено(УниверсальныйОбъект.СтруктураДанных.ОписаниеОшибки)Тогда
			Результат.ОписаниеОшибки = УниверсальныйОбъект.СтруктураДанных.ОписаниеОшибки;
		Иначе
			Результат.ОписаниеОшибки = НСтр("ru='На сервере произошла неизвестная ошибка (возвращен признак оошибки но нет ее описания)'") ;
		КонецЕсли;
		
	ИначеЕсли Не УниверсальныйОбъект.СтруктураДанных.Свойство("ПлатежнаяСсылка")
		Или Не ЗначениеЗаполнено(УниверсальныйОбъект.СтруктураДанных.ПлатежнаяСсылка) Тогда
		Результат.КодСостояния   = 302;
		
	Иначе
		Результат.КодСостояния   = 200;
		Результат.ПлатежнаяСсылка = УниверсальныйОбъект.СтруктураДанных.ПлатежнаяСсылка;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Проверяет на сервере создание подписки по заявке с указанными ИБ
//	Доступность: Облако, Автономная копия
//
//Параметры:
//	ИДУниверсальногоОбъекта - Строка - идентификатор универсального объекта в менеджере сервиса
//
//Возвращаемое значение:
//	Структура:
//		* ПодпискаСоздана - Булево - Истина, если создана
//		* КодСостояния - 200, если проверка выполнена, или другой код в случае ошибки
//		* ОписаниеОшибки - Строка - имеет смысл только если КодСостояния <> 200
//
Функция ПодпискаПоЗаявкеСоздана(ИДУниверсальногоОбъекта) Экспорт

	Режим = РежимИспользованияПриложения();
	
	Результат  = Новый Структура("КодСостояния,ПодпискаСоздана,ОписаниеОшибки");
	
	Если Режим = "КлиентОблака" Тогда
		
		ОтветСервера = ПодпискаПоЗаявкеСозданаИзОблака(ИДУниверсальногоОбъекта);
		ЗаполнитьЗначенияСвойств(Результат, ОтветСервера, "КодСостояния,ОписаниеОшибки");
		Если Результат.КодСостояния = 200 Тогда
			Результат.ПодпискаСоздана = ОтветСервера.ЗначениеОтвета;
		КонецЕсли;
		
	ИначеЕсли Режим = "Разделенный" Тогда 
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		Результат.ПодпискаСоздана = Модуль.ПодпискаПоЗаявкеСоздана(ИДУниверсальногоОбъекта, Результат.ОписаниеОшибки);
		Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
			Результат.КодСостояния   = 500;
		Иначе
			Результат.КодСостояния   = 200;
		КонецЕсли;
		
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru='Режим работы ""%1"" не предполагает использование дополнительных лицензий'"), );
	КонецЕсли;
	
	Возврат Результат;

КонецФункции



#КонецОбласти 



#Область Взаимодействие_с_синхронизацией

// Отмечает на сервере все записи базы для выгрузки в указанный узел
//
//Параметры:
//	ПараметрыПодключения - Структура или непоределено
//	Узел - ПланОбменаСсылка
//
//Возвращаемое значение:
//		* ЗначениеОтвета - структура или неопределено
//		* КодСостояния - 200 в случае успеха или другой код в случае ошибки
//		* ОписаниеОшибки - Строка - имеет смысл только если КодСостояния <> 200
//
Функция ПолучитьССервераИнформацию(ПараметрыПодключения, МассивКоманд) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЗначениеОтвета", Неопределено); 
	Результат.Вставить("КодСостояния",   200); 
	Результат.Вставить("ОписаниеОшибки", ""); 
	
	ПараметрыЗапроса = Новый Структура("Команды", МассивКоманд);
	ТекстЗапроса = ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса);
	
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураЗапроса = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаСинхронизации(), 
							"/getinfo/" + ПараметрыПодключения.КодЭтогоУзла);
	Ответ = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураЗапроса, ТекстЗапроса, 
					"Обмен данными.СинхронизацияАвтономныхКопий.Управление", "200");
	
	Результат.КодСостояния    = Ответ.КодСостояния;
	Результат.ОписаниеОшибки  = Ответ.ОписаниеОшибки;
	Если Результат.КодСостояния = 200 Тогда
		Результат.ЗначениеОтвета   = Ответ.ЗначениеОтвета;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти 


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из одноименного метода общего модуля ОбновлениеИнформационнойБазыДеньги
Процедура ЗаполнитьПустуюИБ() Экспорт
	
	РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаполнитьЗначениямиПоУмолчанию();
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиИнтеграцииПоУмолчанию() Экспорт
	
	// Заполнение настроек интеграции с облачным приложением
	РегистрыСведений.ЗначенияНастроекИнтеграции.ЗаполнитьЗначениямиПоУмолчанию();
	
КонецПроцедуры

Процедура ПроверитьСценарииАвтономногоКлиента() Экспорт
	
	СинхронизацияАвтономныхКопий.УдалитьЛишниеРегламетныеЗадания();
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Неразделенный" Или Режим = "Разделенный"  Тогда
		Возврат;
	КонецЕсли;
	
	УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УзелЦБ", УзелЦБ);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СценарииОбменовДаннымиНастройкиОбмена.Ссылка КАК Ссылка,
	|	СценарииОбменовДаннымиНастройкиОбмена.Ссылка.РегламентноеЗаданиеGUID КАК РегламентноеЗаданиеGUID,
	|	СценарииОбменовДаннымиНастройкиОбмена.Ссылка.ТранспортОбменаДанными КАК ТранспортОбменаДанными
	|ИЗ
	|	Справочник.СценарииОбменовДанными.НастройкиОбмена КАК СценарииОбменовДаннымиНастройкиОбмена
	|ГДЕ
	|	СценарииОбменовДаннымиНастройкиОбмена.УзелИнформационнойБазы = &УзелЦБ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Сценарий  = ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
	ИспользоватьРегламентноеЗадание = Ложь; //(Режим = "КлиентОблака");
	Расписание = Справочники.СценарииОбменовДанными.РасписаниеРегламентногоЗаданияПоУмолчанию();
	Расписание.ПериодПовтораВТечениеДня = 120;
	
	Если ЗначениеЗаполнено(Сценарий) Тогда
		
		ОбъектСценария =  Сценарий.ПолучитьОбъект();
		ОбъектСценария.ИспользоватьРегламентноеЗадание = ИспользоватьРегламентноеЗадание;
		Отказ = Ложь;
		Справочники.СценарииОбменовДанными.ОбновитьДанныеРегламентногоЗадания(Отказ, Расписание, ОбъектСценария);
		Если Не Отказ И ОбъектСценария.Модифицированность() Тогда
			ОбъектСценария.Записать();
		КонецЕсли;
		
	Иначе
		
		Справочники.СценарииОбменовДанными.СоздатьСценарий(УзелЦБ, Расписание, ИспользоватьРегламентноеЗадание);
		
	КонецЕсли;
	
	ЗаписьНастройки = РегистрыСведений.НастройкиТранспортаОбменаДанными.СоздатьМенеджерЗаписи();
	ЗаписьНастройки.Корреспондент = УзелЦБ;
	ЗаписьНастройки.Прочитать();
	Если Не ЗаписьНастройки.Выбран() 
		Или ЗаписьНастройки.ВидТранспортаСообщенийОбменаПоУмолчанию <> Перечисления.ВидыТранспортаСообщенийОбмена.WS Тогда
		
		ЗаписьНастройки.Корреспондент = УзелЦБ;
		ЗаписьНастройки.ВидТранспортаСообщенийОбменаПоУмолчанию = Перечисления.ВидыТранспортаСообщенийОбмена.WS;
		ЗаписьНастройки.WSИспользоватьПередачуБольшогоОбъемаДанных = Истина;
		ЗаписьНастройки.WSЗапомнитьПароль = Истина;
		ЗаписьНастройки.FILEКаталогОбменаИнформацией = КаталогВременныхФайлов();
		ЗаписьНастройки.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывает исключение в случае некорркетного ответа сервера
// Используется для проверки ответов на метод POST execute
//
Процедура ПроверитьОтветСервера(СостояниеОбмена, ОтветСервера, ОписаниеОперации, Процесс) Экспорт
	
	Если ОтветСервера.КодСостояния <> 200 Тогда
		
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизация автономных копий." + Процесс, 
				УровеньЖурналаРегистрации.Ошибка,
				, 
				, 
				СтрШаблон("Ошибка выполнения операции ""%1"":
				|http-запрос к серверу вернул результат с кодом %2
				|и описанием: %3
				|", ОписаниеОперации, ОтветСервера.КодСостояния, ОтветСервера.ОписаниеОшибки));
		
		Если СостояниеОбмена <> Неопределено Тогда
			ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
					ОтветСервера.КодСостояния, 
					ОтветСервера.ОписаниеОшибки);
		КонецЕсли;
		
		ВызватьИсключение СтрШаблон(НСтр("ru='Ошибка процесса синхронизации ""%1"":
			|http-запрос завершился с кодом состояния %2 
			|описание: %3'"), Процесс, ОтветСервера.КодСостояния, ОтветСервера.ОписаниеОшибки);
	
	КонецЕсли;
	
	ТипОтвета = ТипЗнч(ОтветСервера.ОтветСервера);
	Если ТипОтвета <> Тип("Структура") И ТипОтвета <> Тип("ФиксированнаяСтруктура") Тогда
	
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизация автономных копий." + Процесс, 
				УровеньЖурналаРегистрации.Ошибка,
				, 
				, 
				СтрШаблон("Ошибка выполнения операции ""%1"":
				|http-запрос к серверу вернул результат с типом %2 вместо структуры
				|", ОписаниеОперации, ТипОтвета));
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось выполнить операцию ""%1"":
			|http-запрос вернул ответ некорректного типа %2 
			|описание: '"), ОписаниеОперации, ТипОтвета);
		Если СостояниеОбмена <> Неопределено Тогда
			ПроцессыОбменаСлужебный.ОтметитьСтатусТранспорта(СостояниеОбмена, 
					500, 
					ТекстСообщения);
		КонецЕсли;
		
		ВызватьИсключение ТекстСообщения;
	
	КонецЕсли;
	
КонецПроцедуры



// Возвращает структуру запроса, заполненную настройками сервиса внешнего интерфейса
//
//Параметры:
//	Логин - Логин пользователя менеджера сервиса
//	Пароль - Логин пользователя менеджера сервиса
//
//Возвращаемое значение:
//	Струкура
//
Функция НовыйСтруктураЗапросаРегистрации() Экспорт

	Результат = RESTВызовСервера.НовыйСтруктураЗапроса(СерверМенеджераСервиса());
	Результат.АдресСервиса = АдресСервисаРегистрации();
	Результат.АдресЗапроса = "register";
	Возврат Результат;

КонецФункции

// Возвращает структуру запроса, заполненную настройками сервиса внешнего интерфейса
//
//Параметры:
//	Логин - Логин пользователя менеджера сервиса
//	Пароль - Логин пользователя менеджера сервиса
//
//Возвращаемое значение:
//	Струкура
//
Функция НовыйСтруктураЗапросаВнешнегоИнтерфейса(Логин = "", Пароль = "") Экспорт

	Результат = RESTВызовСервера.НовыйСтруктураЗапроса(СерверМенеджераСервиса(), Логин, Пароль);
	Результат.АдресСервиса = АдресСервисаВнешнийИнтерфейс();
	Результат.АдресЗапроса = "execute";
	Возврат Результат;

КонецФункции

// Возвращает структуру запроса, заполненную настройками подключения к области абонента
//
//Параметры:
//	ПараметрыПодключения - структура с параметрами подключения к облаку см. ПараметрыСоединенияСОблаком()
//
//Возвращаемое значение:
//	Струкура
//
Функция НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервиса = Неопределено, АдресЗапроса = Неопределено) Экспорт

	Результат = RESTВызовСервера.НовыйСтруктураЗапроса(ПараметрыПодключения.ПолныйПутьКБазе, 
					ПараметрыПодключения.Логин, ПараметрыПодключения.Пароль);
	
	Если АдресСервиса <> Неопределено Тогда
		Результат.АдресСервиса = АдресСервиса;
	КонецЕсли;
	Если АдресЗапроса <> Неопределено Тогда
		Результат.АдресЗапроса = АдресЗапроса;
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ИмяУслугиАвтоСинхронизация() Экспорт
	Возврат "Автоматическая синхронизация";
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции


Функция ПолучитьСостояниеПодпискиИзОблака(ИмяУслуги, КодИБ, КлючЛицензии, ПараметрыПодключения = Неопределено) 

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), "subscription/prop");
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("Plan",        ПараметрыПодключения.ИмяПланаОбмена);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("NodeID",      КодИБ);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServiceName", ИмяУслуги);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("LicenseKey",  КлючЛицензии);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение свойств подписки");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	РезультатОбработки = Ответ.ЗначениеОтвета;
	
	Возврат РезультатОбработки;

КонецФункции

Функция СписокАктуальныхПодписокИзОблака(ПараметрыПодключения = Неопределено) 

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), "subscription/list");
	СтруктураПодключения.ИменаПолейТипаДата = "ДатаПодписки,НачалоДействия,ОкончаниеДействия";
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("Plan",        ПараметрыПодключения.ИмяПланаОбмена);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("NodeID",      ПараметрыПодключения.КодЭтогоУзла);

	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение списка подписок");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	РезультатОбработки = Ответ.ЗначениеОтвета;
	
	Возврат РезультатОбработки;

КонецФункции

Функция ПолучитьСвойстваЭтойБазыВОблаке(КодИБ, ПараметрыПодключения = Неопределено) 

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), "connectIB/all/" + КодИБ);
	СтруктураПодключения.Заголовки.Вставить("Content-Type", "ru-RU");
	СтруктураПодключения.Заголовки.Вставить("Accept-Language", "application/json;charset=UTF-8");
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID", ПараметрыПодключения.КодЦентральнойБазы);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("NodeID", КодИБ);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение свойств ИБ");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	РезультатОбработки = Ответ.ЗначениеОтвета;
	
	Возврат РезультатОбработки;

КонецФункции

Функция ПолучитьСписокТарифовИзОблака(ТолькоДоступные, ПараметрыПодключения = Неопределено) 
	
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), 
					?(ТолькоДоступные, "tariff/listpossible", "tariff/list"));
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение списка тарифов");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Ответ.ЗначениеОтвета;
	
КонецФункции

Функция ТарифыИОстаткиПодписокИзОблака(ПараметрыПодключения = Неопределено) 

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, 
			АдресСервисаБиллинга(), 
			"subscription/balances");
	СтруктураПодключения.ИменаПолейТипаДата = "ДатаПодписки,НачалоДействия,ОкончаниеДействия,БлижайшаяДатаИзменения,ДатаХронологии";
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение тарифов и остатков подписок");
	Если ЗначениеЗаполнено(Ответ.ОписаниеОшибки) Тогда
		ВызватьИсключение Ответ.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Ответ.ЗначениеОтвета;

КонецФункции

Функция ИдентификаторДляПлатежнойСсылкиИзОблака(КодТарифа, ВариантПодписки, НачалоДействия, ОкончаниеДействия, КоличествоЛицензий, ПараметрыПодключения = Неопределено) 
	
	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), "subscription/paymentlink");
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("ServerID",   ПараметрыПодключения.КодЦентральнойБазы);
	ПараметрыЗапроса.Вставить("TariffID",   КодТарифа);
	ПараметрыЗапроса.Вставить("OptionID",   ВариантПодписки);
	ПараметрыЗапроса.Вставить("StartData",  НачалоДействия);
	ПараметрыЗапроса.Вставить("EndData",    ОкончаниеДействия);
	ПараметрыЗапроса.Вставить("Count",      КоличествоЛицензий);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("POST", СтруктураПодключения, 
					ПарсерJSON.ДанныеВСтрокуJSON(ПараметрыЗапроса), 
					"Биллинг.Создание платежной ссылки");
	
	Результат = Новый Структура("КодСостояния,ИДУниверсальногоОбъекта,ОписаниеОшибки");
	ЗаполнитьЗначенияСвойств(Результат, Ответ, "КодСостояния,ОписаниеОшибки");
	Результат.ИДУниверсальногоОбъекта = Ответ.ЗначениеОтвета;
	
	Возврат Результат;
	
КонецФункции

Функция УниверсальныйОбъектИнтеграцииИзОблака(ИДУниверсальногоОбъекта, ТекстОшибки = "", ПараметрыПодключения = Неопределено) 

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), "subscription/request");
	СтруктураПодключения.ИменаПолейТипаДата = "НачалоПодписки";
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("RequestID",   ИДУниверсальногоОбъекта);

	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Получение объекта подписки");
	
	Возврат Ответ;

КонецФункции

Функция ПодпискаПоЗаявкеСозданаИзОблака(ИДУниверсальногоОбъекта, ТекстОшибки = "", ПараметрыПодключения = Неопределено) 

	ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Истина);
	СтруктураПодключения = НовыйСтруктураЗапросаОбласти(ПараметрыПодключения, АдресСервисаБиллинга(), "subscription/check");
	
	СтруктураПодключения.ПараметрыЗапроса.Вставить("ServerID",    ПараметрыПодключения.КодЦентральнойБазы);
	СтруктураПодключения.ПараметрыЗапроса.Вставить("RequestID",   ИДУниверсальногоОбъекта);
	
	Ответ    = RESTВызовСервера.РезультатHTTPЗапроса("GET", СтруктураПодключения, 
					"", 
					"Биллинг.Проверка создания подписки");
	
	Возврат Ответ;

КонецФункции

Функция ИдентификаторыКлиента() 
	
	Результат = Новый Массив;
	
	СисИнфо = Новый СистемнаяИнформация();
	
	Результат.Добавить(Новый Структура("Идентификатор, ТипИдентификатора", КонтрольнаяСумма(СисИнфо.ИдентификаторКлиента), "системная информация"));
	Результат.Добавить(Новый Структура("Идентификатор, ТипИдентификатора", 
				КонтрольнаяСумма(СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла("СинхронизацияАвтономныхКопий")), "план обмена"));
	
	Возврат Результат;
	
КонецФункции

Функция КонтрольнаяСумма(Знач Значение) 
	Возврат ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(Значение), 64);
КонецФункции 


#КонецОбласти