#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Начисление = Неопределено;
	КодДохода = Неопределено;
	МесяцНачисления = Неопределено;
	НалоговыйПериод = Неопределено;
	ВычетКДоходу = Неопределено;
	ГруппаВычета = Неопределено;
	
	Параметры.Свойство("Начисление", Начисление);
	Параметры.Свойство("КодДохода", КодДохода);
	Параметры.Свойство("МесяцНачисления", МесяцНачисления);
	Параметры.Свойство("НалоговыйПериод", НалоговыйПериод);
	Параметры.Отбор.Свойство("ВычетКДоходу", ВычетКДоходу);
	Параметры.Отбор.Свойство("ГруппаВычета", ГруппаВычета);
	
	Если МесяцНачисления <> Неопределено И НалоговыйПериод = Неопределено Тогда
		НалоговыйПериод = Год(МесяцНачисления)
	КонецЕсли;
	Если Начисление <> Неопределено Тогда
		КодДохода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Начисление, "КодДоходаНДФЛ");
	КонецЕсли;
	
	Если ВычетКДоходу = Истина И КодДохода <> Неопределено И НалоговыйПериод <> Неопределено Тогда 
		
		ВычетыКДоходам = УчетНДФЛ.ВычетыКДоходам(НалоговыйПериод);
		ДоступныеВычеты = ВычетыКДоходам.Получить(КодДохода);
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Если ДоступныеВычеты <> Неопределено Тогда 
			
			ЗаполнитьДанныеВыбораПоДоступнымВычетам(ДанныеВыбора, ДоступныеВычеты, Параметры, СтандартнаяОбработка)
			
		КонецЕсли;	
		
		Если ДанныеВыбора.Количество() = 0 Тогда
			ДанныеВыбора.Добавить(НСтр("ru='Нет вычетов к доходу'") + " " + СокрЛП(КодДохода));
		КонецЕсли; 
		
		СтандартнаяОбработка = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
	Если ВычетКДоходу <> Истина И НалоговыйПериод <> Неопределено Тогда
		
		ДанныеВыбора = Новый СписокЗначений;

		ДоступныеВычеты = УчетНДФЛ.ВычетыНалогоплательщика(НалоговыйПериод, ГруппаВычета);
		ЗаполнитьДанныеВыбораПоДоступнымВычетам(ДанныеВыбора, ДоступныеВычеты, Параметры, СтандартнаяОбработка);
		СтандартнаяОбработка = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьКодыВычетовНДФЛ();
	
КонецПроцедуры

Процедура ЗаполнитьКодыВычетовНДФЛ() Экспорт
	
	ГруппыВычетов = Перечисления.ГруппыВычетовПоНДФЛ;
	
	// АПК:1297-выкл Не локализуется, т.к. является частью регламентированной формы, применяемой в РФ.
	
	ОписатьКодВычетаНДФЛ("Код108", "126/114", "На первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет родителю, супруге (супругу) родителя, усыновителю, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"108", "114", "114", "126", , 2);
	ОписатьКодВычетаНДФЛ("Код110", "134/118", "В двойном размере на первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному родителю, усыновителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"110", "118", "118", "134", , 3);
	ОписатьКодВычетаНДФЛ("Код111", "142/122", "В двойном размере на первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из родителей по их выбору на основании заявления об отказе одного из родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"111", "122", "122", "142", , 4);
	ОписатьКодВычетаНДФЛ("Код115", "127/115", "На второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет родителю, супруге (супругу) родителя, усыновителю, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "115",	"115", "127", , 5);
	ОписатьКодВычетаНДФЛ("Код119", "136/119", "В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному родителю, усыновителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "119", "119", "136", , 6);
	ОписатьКодВычетаНДФЛ("Код123", "144/123", "В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из родителей по их выбору на основании заявления об отказе одного из родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "123", "123", "144", , 7);
	ОписатьКодВычетаНДФЛ("Код116", "128/116", "На третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет родителю, супруге (супругу) родителя, усыновителю, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "116", "116", "128", , 8);
	ОписатьКодВычетаНДФЛ("Код120", "138/120", "В двойном размере на третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному родителю, усыновителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "120", "120", "138", , 9);
	ОписатьКодВычетаНДФЛ("Код124", "146/124", "В двойном размере на третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из родителей по их выбору на основании заявления об отказе одного из родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "124", "124", "146", , 10);
	ОписатьКодВычетаНДФЛ("Код109", "129/117", "На ребенка-инвалида в возрасте до 18 лет или учащегося очной формы обучения, аспиранта, ординатора, интерна, студента в возрасте до 24 лет, являющегося инвалидом I или II группы родителю, супруге (супругу) родителя, усыновителю, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"109", "117", "117", "129", , 11);
	ОписатьКодВычетаНДФЛ("Код112", "140/121", "В двойном размере на ребенка-инвалида в возрасте до 18 лет или учащегося очной формы обучения, аспиранта, ординатора, интерна, студента в возрасте до 24 лет, являющегося инвалидом I или II группы единственному родителю, усыновителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"112", "121", "121", "140", , 12);
	ОписатьКодВычетаНДФЛ("Код113", "148/125", "В двойном размере на ребенка-инвалида в возрасте до 18 лет или учащегося очной формы обучения, аспиранта, ординатора, интерна, студента в возрасте до 24 лет, являющегося инвалидом I или II группы, одному из родителей по их выбору на основании заявления об отказе одного из родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"113", "125", "125", "148", , 13);

	ОписатьКодВычетаНДФЛ("Код130", "130", "На первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "114", "114", "130", , 14);
	ОписатьКодВычетаНДФЛ("Код135", "135", "В двойном размере на первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному опекуну, попечителю, приемному родителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "118", "118", "135", , 15);
	ОписатьКодВычетаНДФЛ("Код143", "143", "В двойном размере на первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "122", "122", "143", , 16);
	ОписатьКодВычетаНДФЛ("Код131", "131", "На второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "115", "115", "131", , 17);
	ОписатьКодВычетаНДФЛ("Код137", "137", "В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному опекуну, попечителю, приемному родителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "119", "119", "137", , 18);
	ОписатьКодВычетаНДФЛ("Код145", "145", "В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "123", "123", "145", , 19);
	ОписатьКодВычетаНДФЛ("Код132", "132", "На третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "116", "116", "132", , 20);
	ОписатьКодВычетаНДФЛ("Код139", "139", "В двойном размере на третьего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному опекуну, попечителю, приемному родителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "120", "120", "139", , 21);
	ОписатьКодВычетаНДФЛ("Код147", "147", "В двойном размере на третьего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "124", "124", "147", , 22);
	ОписатьКодВычетаНДФЛ("Код117о", "133", "На ребенка-инвалида в возрасте до 18 лет или учащегося очной формы обучения, аспиранта, ординатора, интерна, студента в возрасте до 24 лет, являющегося инвалидом I или II группы опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "117", "117", "133", , 23);
	ОписатьКодВычетаНДФЛ("Код121о", "141", "В двойном размере на ребенка-инвалида в возрасте до 18 лет или учащегося очной формы обучения, аспиранта, ординатора, интерна, студента в возрасте до 24 лет, являющегося инвалидом I или II группы единственному опекуну, попечителю, приемному родителю", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "121", "121", "141", , 24);
	ОписатьКодВычетаНДФЛ("Код125о", "149", "В двойном размере на ребенка-инвалида в возрасте до 18 лет или учащегося очной формы обучения, аспиранта, ординатора, интерна, студента в возрасте до 24 лет, являющегося инвалидом I или II группы, одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета", 
	Ложь, ГруппыВычетов.СтандартныеНаДетей, 
	"-", "125", "125", "149", , 25);
	
	ОписатьКодВычетаНДФЛ("Код103", "103", "400 руб. на налогоплательщика, не относящегося к категориям, перечисленным в пп. 1-2 п. 1 ст. 218 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.Стандартные,
	"103","103","-","-", , 26);
	ОписатьКодВычетаНДФЛ("Код104", "104", "500 рублей на налогоплательщика, относящегося к категориям, перечисленным в пп. 2 п. 1 ст. 218 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.Стандартные,
	"104","104","104","104", , 26);
	ОписатьКодВычетаНДФЛ("Код105", "105", "3000 рублей на налогоплательщика, относящегося к категориям, перечисленным в пп. 1 п. 1 ст. 218 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.Стандартные,
	"105","105","105","105", , 26);
	
	ОписатьКодВычетаНДФЛ("Код201", "201", "Расходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг",
	,,
	"201","201","201","201");
	ОписатьКодВычетаНДФЛ("Код202", "202", "Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг",
	,,
	"202","202","202","202");
	ОписатьКодВычетаНДФЛ("Код203", "203", "Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг",
	,,
	"203","203","203","203");
	ОписатьКодВычетаНДФЛ("Код204", "204", "Сумма убытка по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг, уменьшающая налоговую базу по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг",
	,,
	"204","-","-","-");
	ОписатьКодВычетаНДФЛ("Код205", "205", "Сумма убытка по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, уменьшающая налоговую базу по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы",
	,,
	"205","205","205","205");
	ОписатьКодВычетаНДФЛ("Код206", "206", "Расходы по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы",
	,,
	"206","206","206","206");
	ОписатьКодВычетаНДФЛ("Код207", "207", "Расходы по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых не являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы",
	,,
	"207","207","207","207");
	ОписатьКодВычетаНДФЛ("Код208", "208", "Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде, после уменьшения налоговой базы по операциям с производными финансовыми инструментами, обращающаяся на организованном рынке, уменьшающая налоговую базу по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг",
	,,
	"208","208","-","208");
	ОписатьКодВычетаНДФЛ("Код209", "209", "Сумма убытка по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых не являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, уменьшающая налоговую базу по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке",
	,,
	"209","209","209","209");
	ОписатьКодВычетаНДФЛ("Код210", "210", "Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке и базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, уменьшающая налоговую базу по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке",
	, ,
	"-","210","210","210"); 
	ОписатьКодВычетаНДФЛ("Код211", "211", "Расходы в виде процентов по займу, произведенные по совокупности операций РЕПО",
	, , 
	"-","211","211","211"); 
	ОписатьКодВычетаНДФЛ("Код212", "212", "Сумма превышения расходов по операциям РЕПО над доходами по операциям РЕПО, уменьшающая налоговую базу по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца третьего пункта 6 статьи 214.3 Налогового кодекса Российской Федерации",
	, , 
	"-", "212", "-", "-"); 
	ОписатьКодВычетаНДФЛ("Код213", "213", "Расходы по операциям, связанным с закрытием короткой позиции, и затраты, связанные с приобретением и реализацией ценных бумаг, являющимся объектом операций РЕПО",
	, , 
	"-","213","213","213");
	ОписатьКодВычетаНДФЛ("Код214", "214", "Убытки по операциям, связанным с закрытием короткой позиции, и затраты, связанные с приобр-ем и реализацией ценных бумаг, явл. объектом операций РЕПО",
	, , 
	"-", "214", "-","-");
	ОписатьКодВычетаНДФЛ("Код215", "215", "Расходы в виде процентов, уплаченных в налоговом периоде по совокупности договоров займа",
	, , 
	"-","215","215","215"); 
	ОписатьКодВычетаНДФЛ("Код216", "216", "Сумма превышения расходов в виде процентов, уплаченных по совокупности договоров займа над доходами, полученными по совокупности договоров займа, уменьшающая налоговую базу по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца шестого пункта 5 статьи 214.4 Налогового кодекса Российской Федерации",
	, , 
	"-","216","216","216"); 
	ОписатьКодВычетаНДФЛ("Код217", "217", "Сумма превышения расходов в виде процентов, уплаченных по совокупности договоров займа над доходами, полученными по совокупности договоров займа, уменьшающая налоговую базу по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца шестого пункта 5 статьи 214.4 Налогового кодекса Российской Федерации",
	, , 
	"-","217","217","217"); 
	ОписатьКодВычетаНДФЛ("Код218", "218", "Процентный (купонный) расход, признаваемый налогоплательщиком в случае открытия короткой позиции по ценным бумагам, обращающимся на организованном рынке ценных бумаг, по которым предусмотрено начисление процентного (купонного) дохода",
	, , 
	"-","218","218","218"); 
	ОписатьКодВычетаНДФЛ("Код219", "219", "Процентный (купонный) расход, признаваемый налогоплательщиком в случае открытия короткой позиции по ценным бумагам, не обращающимся на организованном рынке ценных бумаг, по которым предусмотрено начисление процентного (купонного) дохода",
	, , 
	"-","219","219","219"); 
	ОписатьКодВычетаНДФЛ("Код220", "220", "Сумма расхода по операциям с производными финансовыми инструментами, не обращающимися на организованном рынке",
	, , 
	"-","220","220","220");
	ОписатьКодВычетаНДФЛ("Код222", "222", "Сумма убытка по операциям РЕПО, принимаемого в уменьшение доходов по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как отношение стоимости ценных бумаг, являющихся объектом операций РЕПО, обращающихся на организованном рынке ценных бумаг, к общей стоимости ценных бумаг, являющихся объектом операций РЕПО",
	, , 
	"-","222","222","222"); 
	ОписатьКодВычетаНДФЛ("Код223", "223", "Сумма убытка по операциям РЕПО, принимаемого в уменьшение доходов по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как отношение стоимости ценных бумаг, являющихся объектом операций РЕПО, не обращающихся на организованном рынке ценных бумаг, к общей стоимости ценных бумаг, являющихся объектом операций РЕПО",
	, , 
	"-","223","223","223"); 
	ОписатьКодВычетаНДФЛ("Код224", "224", "Сумма отрицательного финансового результата, полученного в налоговом периоде по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, уменьшающего финансовый результат, полученный в налоговом периоде по отдельным операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг",
	, , 
	"-","224","224","224");
	ОписатьКодВычетаНДФЛ("Код221", "225", "Расходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","221","225");
	
	ОписатьКодВычетаНДФЛ("Код226", "226", "Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","226"); 
	ОписатьКодВычетаНДФЛ("Код227", "227", "Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","227"); 
	ОписатьКодВычетаНДФЛ("Код228", "228", "Расходы по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","228"); 
	ОписатьКодВычетаНДФЛ("Код229", "229", "Расходы по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых не являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","229"); 
	ОписатьКодВычетаНДФЛ("Код230", "230", "Расходы в виде процентов по займу, произведенные по совокупности операций РЕПО, учитываемых на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","230"); 
	ОписатьКодВычетаНДФЛ("Код231", "231", "Расходы по операциям, связанным с закрытием короткой позиции, и затраты, связанные с приобретением и реализацией ценных бумаг, являющимся объектом операций РЕПО, учитываемых на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","231"); 
	ОписатьКодВычетаНДФЛ("Код232", "232", "Расходы в виде процентов, уплаченных в налоговом периоде по совокупности договоров займа, учитываемых на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","232"); 
	ОписатьКодВычетаНДФЛ("Код233", "233", "Процентный (купонный) расход, признаваемый налогоплательщиком в случае открытия короткой позиции по ценным бумагам, обращающимся на организованном рынке ценных бумаг, по которым предусмотрено начисление процентного (купонного) дохода, учитываемый на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","233"); 
	ОписатьКодВычетаНДФЛ("Код234", "234", "Процентный (купонный) расход, признаваемый налогоплательщиком в случае открытия короткой позиции по ценным бумагам, не обращающимся на организованном рынке ценных бумаг, по которым предусмотрено начисление процентного (купонного) дохода, учитываемый на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","234"); 
	ОписатьКодВычетаНДФЛ("Код235", "235", "Суммы расходов по операциям с производными финансовыми инструментами, не обращающимися на организованном рынке, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","235"); 
	ОписатьКодВычетаНДФЛ("Код236", "236", "Сумма отрицательного финансового результата, полученного в налоговом периоде по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, уменьшающая финансовый результат, полученный в налоговом периоде по отдельным операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг, учитываемая на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","236"); 
	ОписатьКодВычетаНДФЛ("Код237", "237", "Сумма превышения расходов в виде процентов, уплаченных по совокупности договоров займа над доходами, полученными по совокупности договоров займа, уменьшающая налоговую базу по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца шестого пункта 5 статьи 214.4 Налогового кодекса Российской Федерации",
	, , 
	"-","-","-","237"); 
	ОписатьКодВычетаНДФЛ("Код238", "238", "Сумма превышения расходов в виде процентов, уплаченных по совокупности договоров займа над доходами, полученными по совокупности договоров займа, уменьшающая налоговую базу по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, не обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца шестого пункта 5 статьи 214.4 Налогового кодекса Российской Федерации",
	, , 
	"-","-","-","238"); 
	ОписатьКодВычетаНДФЛ("Код239", "239", "Сумма убытка по операциям РЕПО, учитываемым на индивидуальном инвестиционном счете, принимаемого в уменьшение доходов по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как отношение стоимости ценных бумаг, являющихся объектом операций РЕПО, обращающихся на организованном рынке ценных бумаг, к общей стоимости ценных бумаг, являющихся объектом операций РЕПО",
	, , 
	"-","-","-","239"); 
	ОписатьКодВычетаНДФЛ("Код240", "240", "Сумма убытка по операциям РЕПО, учитываемым на индивидуальном инвестиционном счете, принимаемого в уменьшение доходов по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, не обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как отношение стоимости ценных бумаг, являющихся объектом операций РЕПО, не обращающихся на организованном рынке ценных бумаг, к общей стоимости ценных бумаг, являющихся объектом операций РЕПО",
	, , 
	"-","-","-","240"); 
	ОписатьКодВычетаНДФЛ("Код241", "241", "Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, уменьшающего налоговую базу по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке ценных бумаг, учитываемые на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","241"); 
	ОписатьКодВычетаНДФЛ("Код250", "250", "Сумма убытка по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, уменьшающая финансовый результат по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","250"); 
	ОписатьКодВычетаНДФЛ("Код251", "251", "Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, после уменьшения финансового результата по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, уменьшающая финансовый результат по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","251"); 
	ОписатьКодВычетаНДФЛ("Код252", "252", "Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых не являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, уменьшающая финансовый результат по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","-","252"); 
	
	ОписатьКодВычетаНДФЛ("Код319", "327", "Сумма уплаченных налогоплательщиком в налоговом периоде пенсионных взносов по договору (договорам) негосударственного пенсионного обеспечения, заключенному (заключенным) налогоплательщиком с негосударственным пенсионным фондом в свою пользу и (или) в пользу членов семьи и (или) близких родственников в соответствии с Семейным кодексом Российской Федерации (супругов, родителей и детей, в том числе усыновителей и усыновленных, дедушки, бабушки и внуков, полнородных и неполнородных (имеющих общих отца или мать) братьев и сестер), детей-инвалидов, находящихся под опекой (попечительством), и (или) в сумме уплаченных налогоплательщиком в налоговом периоде страховых взносов по договору (договорам) добровольного пенсионного страхования, заключенному (заключенным) со страховой организацией в свою пользу и (или) в пользу супруга (в том числе вдовы, вдовца), родителей (в том числе усыновителей), детей-инвалидов (в том числе усыновленных, находящихся под опекой (попечительством), - в размере фактически произведенных расходов с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.Социальные,
	"319", "319","327","327");
	ОписатьКодВычетаНДФЛ("Код320", "328", "Сумма уплаченных налогоплательщиком в налоговом периоде дополнительных страховых взносов на накопительную пенсию в соответствии с Федеральным законом от 30.04.2008 N 56-ФЗ ""О дополнительных страховых взносах на накопительную пенсию и государственной поддержке формирования пенсионных накоплений"" - в размере фактически произведенных расходов с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.Социальные,
	"-", "620","328","328");
	ОписатьКодВычетаНДФЛ("Код326", "326", "Сумма расходов по дорогостоящему лечению в медицинских организациях, у индивидуальных предпринимателей, осуществляющих медицинскую деятельность, - в размере фактически произведенных расходов", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО, 
	"-", "-", "326", "326", , 27);	
	ОписатьКодВычетаНДФЛ("Код325", "325", "Суммы страховых взносов, уплаченные налогоплательщиком в налоговом периоде по договорам добровольного личного страхования, а также по договорам добровольного страхования своих супруга (супруги), родителей, детей (в том числе усыновленных) в возрасте до 18 лет, подопечных в возрасте до 18 лет, заключенным им со страховыми организациями, имеющими лицензии на ведение соответствующего вида деятельности, предусматривающим оплату такими страховыми организациями исключительно медицинских услуг в размере фактически произведенных расходов, но с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО, 
	"-", "-", "325", "325", , 28);	
	ОписатьКодВычетаНДФЛ("Код321", "321", "Сумма, уплаченная налогоплательщиком-родителем за обучение своих детей в возрасте до 24 лет, налогоплательщиком-опекуном (налогоплательщиком-попечителем) за обучение своих подопечных в возрасте до 18 лет по очной форме обучения в образовательных учреждениях, налогоплательщиком, осуществляющим обязанности опекуна или попечителя над гражданами, бывшими их подопечными, после прекращения опеки или попечительства в случаях оплаты налогоплательщиком обучения граждан в возрасте до 24 лет по очной форме обучения в образовательных учреждениях - в размере фактически произведенных расходов на обучение, но с учетом ограничения, установленного подпунктом 2 пункта 1 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО, 
	"-", "-", "321", "321", , 31);	
	ОписатьКодВычетаНДФЛ("Код320о", "320", "Сумма, уплаченная налогоплательщиком в налоговом периоде за свое обучение в образовательных учреждениях, за обучение брата (сестры) в возрасте до 24 лет по очной форме обучения в образовательных учреждениях - в размере фактически произведенных расходов на обучение с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО,
	"-", "-", "320", "320", , 32);	
	
	ОписатьКодВычетаНДФЛ("Код312", "312", "Сумма, направленная на погашение процентов по целевым займам (кредитам), фактически израсходованным на новое строительство либо приобретение на территории Российской Федерации жилого дома, квартиры, комнаты или доли (долей) в них, приобретение земельных участков или доли (долей) в них, предоставленных для индивидуального жилищного строительства, и земельных участков или доли (долей) в них, на которых расположены приобретаемые жилые дома или доля (доли) в них, а также на погашение процентов по кредитам, полученным от банков в целях рефинансирования (перекредитования) кредитов на новое строительство либо приобретение на территории Российской Федерации указанных объектов", 
	Ложь, ГруппыВычетов.Имущественные,
	"312","312","312","312", , 33);
	ОписатьКодВычетаНДФЛ("Код318", "318", "Сумма процентов по кредитам в целях перекредитования кредитов на новое строительство или приобретение на территории РФ жилого дома, квартиры", 
	Ложь, ГруппыВычетов.Имущественные,
	"318","318","312", "312", , 34);
	ОписатьКодВычетаНДФЛ("Код311", "311", "Сумма, израсходованная налогоплательщиком на новое строительство либо приобретение на территории Российской Федерации жилых домов, квартир, комнат или доли (долей) в них, приобретение земельных участков или доли (долей) в них, предоставленных для индивидуального жилищного строительства, и земельных участков или доли (долей) в них, на которых расположены приобретаемые жилые дома или доля (доли) в них", 
	Ложь, ГруппыВычетов.Имущественные,
	"311","311","311","311", , 35);
	
	ОписатьКодВычетаНДФЛ("Код403", "403", "Сумма фактически произведенных и документально подтвержденных расходов, непосредственно связанных с выполнением работ (оказанием услуг) по договорам гражданско-правового характера",
	,,
	"403","403","403","403", Истина);
	ОписатьКодВычетаНДФЛ("Код404", "404", "Сумма фактически произведенных и документально подтвержденных расходов, связанных с получением авторских вознаграждений или вознаграждений за создание, исполнение или иное использование произведений науки, литературы и искусства, вознаграждений авторам открытий, изобретений, полезных моделей и промышленных образцов",
	,,
	"404","404","404","404", Истина);
	ОписатьКодВычетаНДФЛ("Код405", "405", "Сумма в пределах нормативов затрат, связанных с получением авторских вознаграждений и вознаграждений за создание, исполнение или иное использование произведений науки, литературы и искусства, вознаграждений авторам открытий, изобретений, полезных моделей и промышленных образцов (в процентах к сумме начисленного дохода)",
	,,
	"405","405","405","405", Истина);
	ОписатьКодВычетаНДФЛ("Код501", "501", "Вычет из стоимости подарков, полученных от организаций и индивидуальных предпринимателей",
	,,
	"501","501","501","501");
	ОписатьКодВычетаНДФЛ("Код502", "502", "Вычет из стоимости призов в денежной и натуральной формах, полученных на конкурсах и соревнованиях, проводимых в соответствии с решениями Правительства Российской Федерации, законодательных (представительных) органов государственной власти или представительных органов местного самоуправления",
	,,
	"502","502","502","502");
	ОписатьКодВычетаНДФЛ("Код503", "503", "Вычет из суммы материальной помощи, оказываемой работодателями своим работникам, а также бывшим своим работникам, уволившимся в связи с выходом на пенсию по инвалидности или по возрасту",
	,,
	"503","503","503","503");
	ОписатьКодВычетаНДФЛ("Код504", "504", "Вычет из суммы возмещения (оплаты) работодателями своим работникам, их супругам, родителям и детям, бывшим своим работникам (пенсионерам по возрасту), а также инвалидам стоимости приобретенных ими (для них) медикаментов, назначенных им лечащим врачом",
	,,
	"504","504","504","504");
	ОписатьКодВычетаНДФЛ("Код505", "505", "Вычет из стоимости выигрышей и призов, полученных на конкурсах, играх и других мероприятиях в целях рекламы товаров (работ, услуг)",
	,,
	"505","505","505","505");
	ОписатьКодВычетаНДФЛ("Код506", "506", "Вычет из суммы материальной помощи, оказываемой инвалидам общественными организациями инвалидов",
	,,
	"506","506","506","506");
	ОписатьКодВычетаНДФЛ("Код507", "507", "Вычет из суммы помощи (в денежной и натуральной формах), а также стоимости подарков, полученных ветеранами Великой Отечественной войны, инвалидами Великой Отечественной войны, вдовами военнослужащих, погибших в период войны с Финляндией, Великой Отечественной войны, войны с Японией, вдовами умерших инвалидов Великой Отечественной войны и бывшими узниками нацистских концлагерей, тюрем и гетто, а также бывшими несовершеннолетними узниками концлагерей, гетто и других мест принудительного содержания, созданных фашистами и их союзниками в период Второй мировой войны",
	,,
	"507","507","507","507");
	ОписатьКодВычетаНДФЛ("Код508", "508", "Вычет из суммы единовременной материальной помощи, оказываемой работодателями работникам (родителям, усыновителям, опекунам) при рождении (усыновлении (удочерении)) ребенка",
	,,
	"508","508","508","508");
	ОписатьКодВычетаНДФЛ("Код509", "509", "Вычет из суммы доходов, полученных работниками в натуральной форме в качестве оплаты труда от организаций сельскохозяйственных товаропроизводителей, определяемых в соответствии с пунктом 2 статьи 346.2 Налогового кодекса Российской Федерации, крестьянских (фермерских) хозяйств в виде сельскохозяйственной продукции их собственного производства и (или) работ (услуг), выполненных (оказанных) такими организациями и крестьянскими (фермерскими) хозяйствами в интересах работника, имущественных прав, переданных указанными организациями и крестьянскими (фермерскими) хозяйствами работнику",
	,,
	"509","509","509","509");
	ОписатьКодВычетаНДФЛ("Код511", "512", "Вычет из суммы материальной помощи, оказываемой образовательной организацией студентам (курсантам), аспирантам, адъюнктам, ординаторам и ассистентам-стажерам",
	,,
	"-","-","-","512");
	ОписатьКодВычетаНДФЛ("Код601", "601", "Сумма, уменьшающая налоговую базу по доходам, полученным в виде дивидендов",
	,,
	"601","601","601","601", Истина);
	ОписатьКодВычетаНДФЛ("Код607", "510", "Вычет в сумме уплаченных работодателем страховых взносов за работника в соответствии с Федеральным законом 30.04.2008 N 56-ФЗ ""О дополнительных страховых взносах на накопительную пенсию и государственной поддержке формирования пенсионных накоплений"", но не более 12000 рублей в год",
	,, 
	"607","607","510","510");
	ОписатьКодВычетаНДФЛ("Код617", "617", "(не используется с 2016 года)Вычет в сумме доходов, полученных по операциям, учитываемым на индивидуальном инвестиционном счете",
	, , 
	"-","-","617","-");	
	ОписатьКодВычетаНДФЛ("Код618", "618", "Вычет в сумме положительного финансового результата, полученного налогоплательщиком в налоговом периоде от реализации (погашения) ценных бумаг, обращающихся на организованном рынке ценных бумаг, указанных в подпунктах 1 и 2 пункта 3 статьи 214.1 Налогового кодекса Российской Федерации и находившихся в собственности налогоплательщика более трех лет",
	, , 
	"-","-","618","618");	
	ОписатьКодВычетаНДФЛ("Код620", "620", "Иные суммы, уменьшающие налоговую базу в соответствии с положениями главы 23 ""Налог на доходы физических лиц"" части второй Налогового кодекса Российской Федерации",
	,,
	"620","620","620","620");

	ОписатьВычеты2021();
	ОписатьВычеты2022();
	
	// АПК:1297-вкл
	
КонецПроцедуры	


Процедура ОписатьВычетДляМатериальнойПомощиСтудентам() Экспорт 

	// АПК:1297-выкл Не локализуется, т.к. является частью регламентированной формы, применяемой в РФ.
	
	ОписатьКодВычетаНДФЛ("Код511", "512", "Вычет из суммы материальной помощи, оказываемой образовательной организацией студентам (курсантам), аспирантам, адъюнктам, ординаторам и ассистентам-стажерам",
	,,
	"-","-","-","512");

	// АПК:1297-вкл
	
КонецПроцедуры

Процедура ОписатьВычеты2021() Экспорт 

	// АПК:1297-выкл Не локализуется, т.к. является частью регламентированной формы, применяемой в РФ.
	
	ОписатьКодВычетаНДФЛ("Код260", "260", "Суммы фактически осуществленных и документально подтвержденных расходов, связанных с приобретением и хранением ценных бумаг",
	,,
	"-","-","-","260");

	ОписатьКодВычетаНДФЛ("Код280", "280", "Сумма ставки или интерактивной ставки, уменьшающая сумму выигрышей от участия в азартных играх, проводимых в букмекерской конторе и тотализаторе",
	,,
	"-","-","-","280");

	ОписатьКодВычетаНДФЛ("Код511ПоВыигрышам", "511", "Вычеты из суммы доходов в виде выигрышей, полученных участниками азартных игр и участниками лотерей",
	,,
	"-","-","-","511");

	// АПК:1297-вкл
	
КонецПроцедуры

Процедура ОписатьВычеты2022() Экспорт 

	ГруппыВычетов = Перечисления.ГруппыВычетовПоНДФЛ;
	
	// АПК:1297-выкл Не локализуется, т.к. является частью регламентированной формы, применяемой в РФ.
	
	ОписатьКодВычетаНДФЛ("Код324", "324", "Сумма, уплаченная налогоплательщиком в налоговом периоде за медицинские услуги, оказанные медицинскими организациями, индивидуальными предпринимателями, осуществляющими медицинскую деятельность, ему, его супругу (супруге), родителям, детям (в том числе усыновленным) в возрасте до 18 лет, подопечным в возрасте до 18 лет (в соответствии с перечнем медицинских услуг, утвержденным Правительством Российской Федерации) с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО, 
	"-", "-", "324", "324", , 30);	
	
	ОписатьКодВычетаНДФЛ("Код329", "Стр.жизни", "Сумма страховых взносов по договору (договорам) добровольного страхования жизни, если такие договоры заключаются на срок не менее пяти лет, заключенному (заключенным) со страховой организацией в свою пользу и (или) в пользу супруга (в том числе вдовы, вдовца), родителей (в том числе усыновителей), детей (в том числе усыновленных, находящихся под опекой (попечительством))", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО,
	"-", "-", "-", "327", , 29);
	
	ОписатьКодВычетаНДФЛ("Код323", "323", "Стоимость приобретенных налогоплательщиком, за счет собственных средств, лекарственных препаратов для медицинского применения, назначенных лечащим врачом ему, его супругу (супруге), родителям, детям (в том числе усыновленным) в возрасте до 18 лет, подопечным в возрасте до 18 лет - в размере фактически произведенных расходов, но с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО, 
	"-", "-", "-", "323", , 36);	

	ОписатьКодВычетаНДФЛ("Код329Спорт", "329", "Сумма уплаченных налогоплательщиком в налоговом периоде за счет собственных средств за физкультурно-оздоровительные услуги, оказанные ему, его детям (в том числе усыновленным) в возрасте до 18 лет, подопечным в возрасте до 18 лет физкультурно-спортивными организациями, индивидуальными предпринимателями, осуществляющими деятельность в области физической культуры и спорта в качестве основного вида деятельности, - в размере фактически произведенных расходов с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
	Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО, 
	"-", "-", "-", "329", , 37);	

	// АПК:1297-вкл
	
КонецПроцедуры

Процедура ОписатьКодВычетаНДФЛ(ИмяПредопределенныхДанных, Код, Наименование, ВычетКДоходу = Истина, ГруппаВычета = Неопределено, Код2010 = "", Код2011 = "", Код2015 = "", Код2016 = "", НеПредоставляетсяНерезидентам = Ложь, ПорядковыйНомерВРасчетеНалога = 0) 

	// АПК:1327-выкл используется при начальном заполнении ИБ.
	
	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыВычетовНДФЛ." + ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
	Иначе
		Элемент = Справочники.ВидыВычетовНДФЛ.СоздатьЭлемент();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Если Элемент.Код <> Код Тогда
		Элемент.Код = Код
	КонецЕсли;
	Если Элемент.Наименование <> Наименование Тогда
		Элемент.Наименование = Наименование
	КонецЕсли;
	Если Элемент.ПолноеНаименование <> Наименование Тогда
		Элемент.ПолноеНаименование = Наименование
	КонецЕсли;
	Если Элемент.ВычетКДоходу <> ВычетКДоходу Тогда
		Элемент.ВычетКДоходу = ВычетКДоходу
	КонецЕсли;
	Если Элемент.ГруппаВычета <> ГруппаВычета Тогда
		Элемент.ГруппаВычета = ГруппаВычета	
	КонецЕсли;
	Если Элемент.НеПредоставляетсяНерезидентам <> НеПредоставляетсяНерезидентам Тогда
		Элемент.НеПредоставляетсяНерезидентам = НеПредоставляетсяНерезидентам	
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2010Года <> Код2010 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2010Года = Код2010
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года <> Код2011 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года = Код2011
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года <> Код2015 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года = Код2015
	КонецЕсли;
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2016Года <> Код2016 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2016Года = Код2016
	КонецЕсли;
	Если Элемент.ПорядковыйНомерВРасчетеНалога <> ПорядковыйНомерВРасчетеНалога Тогда
		Элемент.ПорядковыйНомерВРасчетеНалога = ПорядковыйНомерВРасчетеНалога
	КонецЕсли;
	
	Если Элемент.Модифицированность() Тогда
		Элемент.ОбменДанными.Загрузка = Истина;
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Записать();
	КонецЕсли;

	// АПК:1327-вкл
	
КонецПроцедуры

Процедура ЗаполнитьДанныеВыбораПоДоступнымВычетам(ДанныеВыбора, ДоступныеВычеты, Параметры, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.СтрокаПоиска) Тогда 
		
		ЗначенияРеквизитовВычетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДоступныеВычеты, "Код,Наименование");
		Для Каждого Вычет Из ДоступныеВычеты Цикл
			ЗначенияРеквизитовВычета = ЗначенияРеквизитовВычетов.Получить(Вычет);
			ДанныеВыбора.Добавить(Вычет, СокрЛП(ЗначенияРеквизитовВычета.Код) + " (" + ЗначенияРеквизитовВычета.Наименование + ")");
		КонецЦикла;
		
	Иначе 	
		Параметры.Отбор.Вставить("Ссылка", Новый ФиксированныйМассив(ДоступныеВычеты));
		Деньги3НДФЛ.ЗаполнитьДляКлассификатораСПорядкомПоКоду(
			Справочники.ВидыВычетовНДФЛ,
			ДанныеВыбора, Параметры, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
