
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПриЗаписи(Отказ)
	
	СинхронизацияАвтономныхКопий.ОпределитьФункциоанльныеОпцииЭтойБазы(ЭтотОбъект.Значение);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ОбменСЦентральнойБазой") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ДеньгиОбменСЦентральнойБазой");
		// не включать атвоматический обмен до указания сценария
		Модуль.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(Ложь); 
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли