
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Состояние(НСтр("ru='Подготовка технологической информации...'"));
	ПараметрыФормы = ПараметрыСообщения(ПараметрыИсточникаДляПередачиНаСервер(ПараметрыВыполненияКоманды.Источник));
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВСлужбуПоддержки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры



&НаКлиенте
Функция ПараметрыИсточникаДляПередачиНаСервер(Источник)
	Перем Результат;
	
	Если ТипЗнч(Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("ИмяФормы", Источник.ИмяФормы);
		
		Если Источник.ИмяФормы = "Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации" Тогда
			// Список ошибок не собираем, выгружаем отобранные записи журнала регистрации.
			Результат.Вставить("Журнал", Источник.Журнал);
			Результат.Вставить("ПредставлениеОтбора", Источник.ПредставлениеОтбора);
			
		ИначеЕсли Источник.ИмяФормы = "Обработка.ЖурналРегистрации.Форма.Событие" Тогда
			
			Результат.Вставить("Дата", Источник.Дата);
			Результат.Вставить("Сеанс", Источник.Сеанс);
			Результат.Вставить("ИмяПользователя", Источник.ИмяПользователя);
			
		КонецЕсли;
		
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПараметрыСообщения(Знач Источник)

	Возврат ПоддержкаПользователейДеньги.НоваяСтруктураСообщения(Источник);

КонецФункции
