///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ОрганизацияПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(РегламентированныйОтчет.Организация, Организации.Ссылка) КАК Организация
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РегламентированныйОтчет.Организация = Организации.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегламентированныйОтчет.Дата УБЫВ,
	|	Организации.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Организация;
	КонецЕсли;
	
	Возврат Справочники.Организации.ПустаяСсылка();
	
КонецФункции

Функция РеквизитыНалогоплательщикаНДФЛ(Организация, ДатаЗначения, СписокПоказателей) Экспорт
	
	Перем ОргСведения;
	Перем Значение;
	
	// Структура, в которой будут возвращаться найденные значения
	ОргСведения = Новый Структура;
	
	Если ДатаЗначения = Неопределено Тогда
		ДатаЗначения = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗначения = КонецДня(ДатаЗначения);
	
	ПустойАдрес = ",,,,,,,,,";
	
	Организация = Организация.ПолучитьОбъект();
	Организация.Прочитать();
	
	Кэш = Новый Структура;
	Кэш.Вставить("Организация", Организация);
	Кэш.Вставить("ДатаЗначения", ДатаЗначения);
	
	ПБОЮЛ = Организация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	Кэш.Вставить("ПБОЮЛ", ПБОЮЛ);
	
	Если СписокПоказателей = Неопределено Тогда
		
		СписокПоказателей = Новый Массив;
		
		// БП
		СписокПоказателей.Добавить("ТипНП");
		СписокПоказателей.Добавить("КатНП");
		СписокПоказателей.Добавить("НаимНО");
		СписокПоказателей.Добавить("НаименованиеНалоговогоОргана");
		СписокПоказателей.Добавить("КодНО");
		СписокПоказателей.Добавить("КодНалоговогоОргана");
		СписокПоказателей.Добавить("ОснВидДеят");
		СписокПоказателей.Добавить("ОснВидДеят2");
		СписокПоказателей.Добавить("ОКВЭД");
		СписокПоказателей.Добавить("ОКВЭД2");
		СписокПоказателей.Добавить("ДополнительныеКодыОКВЭД2");
		СписокПоказателей.Добавить("ОГРН");
		СписокПоказателей.Добавить("ОКАТО");
		СписокПоказателей.Добавить("КодПоОКАТО");
		СписокПоказателей.Добавить("ОКТМО");
		СписокПоказателей.Добавить("КодПоОКТМО");
		СписокПоказателей.Добавить("ОКПО");
		СписокПоказателей.Добавить("ОКОПФ");
		СписокПоказателей.Добавить("ОКФС");
		СписокПоказателей.Добавить("ДатаРегистрации");
		
		СписокПоказателей.Добавить("АдрПочт");
		СписокПоказателей.Добавить("АдрПочт_XML");
		СписокПоказателей.Добавить("АдрПочт_JSON");
		СписокПоказателей.Добавить("ПолныйАдрПочт");
		СписокПоказателей.Добавить("АдрЮР");
		СписокПоказателей.Добавить("АдрЮР_XML");
		СписокПоказателей.Добавить("АдрЮР_JSON");
		СписокПоказателей.Добавить("ПолныйАдрЮР");
		
		СписокПоказателей.Добавить("СвидСН");
		СписокПоказателей.Добавить("СвидДВ");
		СписокПоказателей.Добавить("СвидНО");
		СписокПоказателей.Добавить("СвидНОКод");
		
		СписокПоказателей.Добавить("АдрФакт");
		СписокПоказателей.Добавить("АдрФакт_XML");
		СписокПоказателей.Добавить("АдрФакт_JSON");
		СписокПоказателей.Добавить("ОргИндекс");
		СписокПоказателей.Добавить("ОргСубъект");
		СписокПоказателей.Добавить("ОргКодСубъект");
		СписокПоказателей.Добавить("ОргРайон");
		СписокПоказателей.Добавить("ОргГород");
		СписокПоказателей.Добавить("ОргНПункт");
		СписокПоказателей.Добавить("ОргУлица");
		СписокПоказателей.Добавить("ОргДом");
		СписокПоказателей.Добавить("ОргКорпус");
		СписокПоказателей.Добавить("ОргКвартира");
		
		СписокПоказателей.Добавить("ФИО");
		СписокПоказателей.Добавить("ФИООтпрФЛ");
		СписокПоказателей.Добавить("ФамилияИП");
		СписокПоказателей.Добавить("ИмяИП");
		СписокПоказателей.Добавить("ОтчествоИП");
		СписокПоказателей.Добавить("ИНН");
		СписокПоказателей.Добавить("ИННФЛ");
		СписокПоказателей.Добавить("СНИЛС");
		СписокПоказателей.Добавить("ДатаРожд");
		СписокПоказателей.Добавить("МестоРожд");
		СписокПоказателей.Добавить("МестоРождИП");
		СписокПоказателей.Добавить("АдресЭлПочтыИП");
		СписокПоказателей.Добавить("Гражд");
		СписокПоказателей.Добавить("ГраждСтрана");
		
		СписокПоказателей.Добавить("КодУдЛичн");
		СписокПоказателей.Добавить("ВидУдЛичн");
		СписокПоказателей.Добавить("ОрганВыданУдЛичн");
		СписокПоказателей.Добавить("КодПодрУдЛичн");
		СписокПоказателей.Добавить("СерияУдЛичн");
		СписокПоказателей.Добавить("НомерУдЛичн");
		СписокПоказателей.Добавить("ДатаУдЛичн");
		
		СписокПоказателей.Добавить("АдрПрописки");
		СписокПоказателей.Добавить("АдрПрописки_XML");
		СписокПоказателей.Добавить("АдрПрописки_JSON");
		
		СписокПоказателей.Добавить("АдрМЖ");
		СписокПоказателей.Добавить("АдрМЖ_XML");
		СписокПоказателей.Добавить("АдрМЖ_JSON");
		СписокПоказателей.Добавить("ИндексМЖ");
		СписокПоказателей.Добавить("СубъектМЖ");
		СписокПоказателей.Добавить("КодСубъектМЖ");
		СписокПоказателей.Добавить("РайонМЖ");
		СписокПоказателей.Добавить("ГородМЖ");
		СписокПоказателей.Добавить("НПунктМЖ");
		СписокПоказателей.Добавить("УлицаМЖ");
		СписокПоказателей.Добавить("ДомМЖ");
		СписокПоказателей.Добавить("КорпусМЖ");
		СписокПоказателей.Добавить("КвартираМЖ");
		
		СписокПоказателей.Добавить("ТелСлуж");
		СписокПоказателей.Добавить("ТелДом");
		СписокПоказателей.Добавить("ТелОрганизации");
		СписокПоказателей.Добавить("АдресЭлектроннойПочтыОрганизации");
		
		СписокПоказателей.Добавить("БанкСчетВидСчета");
		СписокПоказателей.Добавить("БанкСчетНомер");
		СписокПоказателей.Добавить("БанкСчетНаимБанка");
		СписокПоказателей.Добавить("БанкСчетКоррСчетБанка");
		СписокПоказателей.Добавить("БанкСчетБИКБанка");
		
		СписокПоказателей.Добавить("КодОКОНХ");
		СписокПоказателей.Добавить("КодОснВидаДеятельностиНФО");
		СписокПоказателей.Добавить("КодыИныхВидовДеятельностиНФО");
		
		// ДЕНЬГИ 
		СписокПоказателей.Добавить("КатегорияПлательщикаНДФЛ");
		//@skip-warning
		СписокПоказателей.Вставить("ЮридическоеФизическоеЛицо", Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
		
		
	КонецЕсли;
	
	РоссийскийАдрес = Новый Соответствие;
	РоссийскийАдрес.Вставить("Индекс",          "");
	РоссийскийАдрес.Вставить("Регион",          "");
	РоссийскийАдрес.Вставить("КодРегиона",      "");
	РоссийскийАдрес.Вставить("Район",           "");
	РоссийскийАдрес.Вставить("Город",           "");
	РоссийскийАдрес.Вставить("НаселенныйПункт", "");
	РоссийскийАдрес.Вставить("Улица",           "");
	РоссийскийАдрес.Вставить("Дом",             "");
	РоссийскийАдрес.Вставить("Корпус",          "");
	РоссийскийАдрес.Вставить("Квартира",        "");
	
	ЭтоМассив = (ТипЗнч(СписокПоказателей) = Тип("Массив"));
	
	Для Каждого Показатель Из СписокПоказателей Цикл

		ИмяПоказателя = ?(ЭтоМассив, Показатель, Показатель.Представление);
		
		Если ИмяПоказателя = "ТипНП" Тогда
			
			Если Организация.ИностраннаяОрганизация Тогда
				Значение = 5;
			Иначе
				Если Организация.ГоловнаяОрганизация = Организация.Ссылка Тогда
					Если ПБОЮЛ Тогда
						Значение = 3;
					Иначе
						Значение = 1;
					КонецЕсли;
				Иначе
					Значение = 2;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КатНП" Тогда
			
			Значение = Деньги3НДФЛКлиентСервер.КодНалогоплательщиваПоЕгоКатегории(Организация.КатегорияПлательщикаНДФЛ) //"01";
			
		ИначеЕсли ИмяПоказателя = "КатегорияПлательщикаНДФЛ" Тогда
			
			Значение = Организация.КатегорияПлательщикаНДФЛ;
			
		ИначеЕсли Имяпоказателя = "НаимНО" Или ИмяПоказателя = "НаименованиеНалоговогоОргана" Тогда
			
			Значение = "";
			Если Организация.РегистрацияВНалоговомОргане.Пустая() Тогда
				Значение = Организация.НаименованиеНалоговогоОргана;
			Иначе
				Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация.Ссылка, "РегистрацияВНалоговомОргане.НаименованиеИФНС");
			КонецЕсли;
			
		ИначеЕсли Имяпоказателя = "КодНО" Или ИмяПоказателя = "КодНалоговогоОргана" Тогда
			
			Значение = "";
			Если Организация.РегистрацияВНалоговомОргане.Пустая() Тогда
				Значение = Организация.КодНалоговогоОргана;
			Иначе
				Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация.Ссылка, "РегистрацияВНалоговомОргане.Код");
			КонецЕсли;
			
		ИначеЕсли Имяпоказателя = "ОснВидДеят" Тогда
			
			Значение = Организация.НаименованиеОКВЭД;
			
		ИначеЕсли Имяпоказателя = "ОснВидДеят2" Тогда
			
			Значение = Организация.НаименованиеОКВЭД2;
			
		ИначеЕсли Имяпоказателя = "ОКВЭД" Тогда
			
			Значение = Организация.КодОКВЭД;
			
		ИначеЕсли Имяпоказателя = "ОКВЭД2" Тогда
			
			Значение = Организация.КодОКВЭД2;
			
		ИначеЕсли Имяпоказателя = "ДополнительныеКодыОКВЭД2" Тогда
			
			Значение = Организация.ДополнительныеКодыОКВЭД2;
			
		ИначеЕсли ИмяПоказателя	= "ОГРН" Тогда
			
			Значение = Организация.ОГРН;
			
		ИначеЕсли ИмяПоказателя = "ОКАТО" Или ИмяПоказателя = "КодПоОКАТО" Тогда
			
			Значение = Организация.КодПоОКАТО;
			
		ИначеЕсли ИмяПоказателя = "ОКТМО" Или ИмяПоказателя = "КодПоОКТМО" Тогда
			
			Значение = Организация.КодПоОКТМО;
			
		ИначеЕсли ИмяПоказателя = "ОКПО" Или ИмяПоказателя = "КодПоОКПО" Тогда
			
			Значение = Организация.КодПоОКПО;
			
		ИначеЕсли ИмяПоказателя = "ОргПравФорм" Тогда
			
			Значение = Организация.НаименованиеОКОПФ;
			
		ИначеЕсли ИмяПоказателя = "ОКОПФ" Или ИмяПоказателя = "КодОКОПФ" Тогда
			
			Значение  = Организация.КодОКОПФ;
			
		ИначеЕсли ИмяПоказателя = "ФормСобств" Тогда
			
			Значение = Организация.НаименованиеОКФС;
			
		ИначеЕсли ИмяПоказателя = "ОКФС" Или ИмяПоказателя = "КодОКФС" Тогда
			
			Значение = Организация.КодОКФС;
			
		ИначеЕсли ИмяПоказателя = "ОКОНХ" Или ИмяПоказателя = "КодОКОНХ" Тогда
			
			Значение = Организация.КодОКОНХ;
			
		ИначеЕсли ИмяПоказателя = "ДатаРегистрации" Тогда
			
			Значение = Организация.ДатаРегистрации;
			
		ИначеЕсли ИмяПоказателя = "НаименованиеРегистрирующегоОргана" Тогда
			
			Значение = Организация.НаименованиеРегистрирующегоОргана;
			
		ИначеЕсли ИмяПоказателя = "Сервис_УказываетсяНаименованиеРегистрирующегоОргана" Тогда
			
			Значение = Истина;

		ИначеЕсли ИмяПоказателя = "АдрПочт" Тогда
			
			ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
			
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ИмяПредопределенного);
			
			Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат[0]);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПочт_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрПочт_JSON" Тогда
			
			Значение = АдресВJSON(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ПолныйАдрПочт" Тогда
			
			ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ИмяПредопределенного);
			
			Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = Результат[0].Представление;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдресЭлектроннойПочтыОрганизации" Тогда
			
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	
			Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = Результат[0].Представление;
			Иначе
				Значение = "";
			КонецЕсли;	
			
		ИначеЕсли ИмяПоказателя = "СвидСН" Тогда
			
			Значение = Организация.СвидетельствоСерияНомер;
			
		ИначеЕсли ИмяПоказателя = "СвидДВ" Тогда
			
			Значение = Организация.СвидетельствоДатаВыдачи;
			
		ИначеЕсли ИмяПоказателя = "СвидНО" Тогда
			
			Значение = Организация.СвидетельствоНаименованиеОргана;
			
		ИначеЕсли ИмяПоказателя = "СвидНОКод" Тогда
			
			Значение = Организация.СвидетельствоКодОргана;
			
		ИначеЕсли ИмяПоказателя = "НаимЮЛПол" Тогда
			
			Значение = ?(ПустаяСтрока(Организация.НаименованиеПолное), 
					Организация.Наименование, 
					Организация.НаименованиеПолное);
			
		ИначеЕсли ИмяПоказателя = "НаимЮЛСокр" Тогда
			
			Значение = ?(ПустаяСтрока(Организация.НаименованиеСокращенное), 
					Организация.Наименование, 
					Организация.НаименованиеСокращенное);
			
		ИначеЕсли ИмяПоказателя = "ИННЮЛ" Тогда
			
			Значение = СокрЛП(Организация.ИНН);
			
		ИначеЕсли ИмяПоказателя = "КППЮЛ" Тогда
			
			Значение = Организация.КПП;
			
		ИначеЕсли ИмяПоказателя = "КодОснВидаДеятельностиНФО" Тогда
			
			Значение = Организация.КодОсновногоВидаДеятельностиНФО;
			
		ИначеЕсли ИмяПоказателя = "КодыИныхВидовДеятельностиНФО" Тогда
			
			Значение = Организация.КодИныхВидовДеятельностиНФО;
			
		ИначеЕсли ИмяПоказателя = "АдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрЮР_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрЮР_JSON" Тогда
			
			Значение = АдресВJSON(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ПолныйАдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Представление;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрФакт" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ФактАдресОрганизации");
			Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрФакт_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрФакт_JSON" Тогда
			
			Значение = АдресВJSON(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ТелОрганизации" Или ИмяПоказателя = "ТелефонОрганизации" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");
			
			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФаксОрганизации" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ФаксОрганизации");
			
			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргИндекс" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Индекс;
			
		ИначеЕсли ИмяПоказателя = "ОргСубъект" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Регион;
			
		ИначеЕсли ИмяПоказателя = "ОргКодСубъект" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.КодРегиона;
			
		ИначеЕсли ИмяПоказателя = "ОргРайон" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Район;
			
		ИначеЕсли ИмяПоказателя = "ОргГород" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Город;
			
		ИначеЕсли ИмяПоказателя = "ОргНПункт" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.НаселенныйПункт;
			
		ИначеЕсли ИмяПоказателя = "ОргУлица" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Улица;
			
		ИначеЕсли ИмяПоказателя = "ОргДом" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Дом;
			
		ИначеЕсли ИмяПоказателя = "ОргКорпус" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Корпус;
			
		ИначеЕсли ИмяПоказателя = "ОргКвартира" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Квартира;
			
			
		//***************************************************сведения об индивидуальном предпринимателе			
		ИначеЕсли ИмяПоказателя = "ФИО" ИЛИ ИмяПоказателя = "ФИООтпрФЛ" Тогда
			
			Значение = Организация.НаименованиеПолное;
			
		ИначеЕсли ИмяПоказателя = "ФамилияИП" Тогда
			
			Значение = Организация[ИмяПоказателя];
			
		ИначеЕсли ИмяПоказателя = "ИмяИП" Тогда
			
			Значение = Организация[ИмяПоказателя];
			
		ИначеЕсли ИмяПоказателя = "ОтчествоИП" Тогда
			
			Значение = Организация[ИмяПоказателя];
			
		ИначеЕсли ИмяПоказателя = "ИННФЛ" Или ИмяПоказателя = "ИНН" Тогда
			
			Значение = СокрЛП(Организация["ИНН"]);
			
		ИначеЕсли ИмяПоказателя = "ДатаРожд" Тогда
			
			Значение = Организация["ДатаРождения"];
			
		ИначеЕсли ИмяПоказателя = "МестоРожд" Тогда
			
			Значение = СокрЛП(Организация["МестоРождения"]);
			
		ИначеЕсли ИмяПоказателя = "МестоРождИП" Тогда
			
			Значение = СокрЛП(Организация["МестоРождения"]);
			
		ИначеЕсли ИмяПоказателя = "Гражд" Тогда
			
			Значение = "";
			Если ЗначениеЗаполнено(Организация.Гражданство) Тогда
				Значение = Организация.Гражданство.Код;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтрана" Тогда
			
			Значение = Организация[ИмяПоказателя];
			
		ИначеЕсли ИмяПоказателя = "КодУдЛичн" Тогда
			
			Значение = СокрЛП(Организация["КодВидаДокумента"]);
			
		ИначеЕсли ИмяПоказателя = "ВидУдЛичн" Тогда
			
			Значение = Деньги3НДФЛКлиентСервер.НаименованиеВидаУдостоверенияЛичности(СокрЛП(Организация["КодВидаДокумента"]));
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичн" Тогда
			
			Значение = СокрЛП(Организация["ДокументМестоВыдачи"]);
			
		ИначеЕсли ИмяПоказателя = "КодПодрУдЛичн" Тогда
			
			Значение = СокрЛП(Организация["ДокументКодПодразделения"]);
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичн" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичн" Тогда
			
			Значение = СокрЛП(Организация["ДокументСерияНомер"]);
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичн" Тогда
			
			Значение = СокрЛП(Организация["ДокументДатаВыдачи"]);
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки"
			ИЛИ ИмяПоказателя = "АдрМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = РегламентированнаяОтчетность.АдресВФормате9Запятых(Результат);
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки_XML"
			ИЛИ ИмяПоказателя = "АдрМЖ_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки_JSON"
			ИЛИ ИмяПоказателя = "АдрМЖ_JSON" Тогда
			
			Значение = АдресВJSON(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Индекс;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Регион;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.КодРегиона;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Район;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Город;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.НаселенныйПункт;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Улица;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Дом;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Корпус;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖ" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
			Значение = Результат.Квартира;
			
		ИначеЕсли ИмяПоказателя = "ТелСлуж" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");
			
			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелДом" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");
			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдресЭлПочтыИП" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "EmailОрганизации");
			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		//прочие сведения
		//сведения о банковском счете организации
		ИначеЕсли ИмяПоказателя = "БанкСчетВидСчета" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, ИмяПоказателя);
			Если Результат <> Неопределено Тогда
				Значение = Результат["ВидСчета"];
			Иначе
				Значение = "";
			КонецЕсли;
		
		ИначеЕсли ИмяПоказателя = "БанкСчетНомер" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, ИмяПоказателя);
			Если Результат <> Неопределено Тогда
				Значение = Результат["НомерСчета"];
			Иначе
				Значение = "";
			КонецЕсли;
		
		ИначеЕсли ИмяПоказателя = "БанкСчетНаимБанка" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, ИмяПоказателя);
			Если Результат <> Неопределено Тогда
				Значение = Результат["НаименованиеБанка"];
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетКоррСчетБанка" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, ИмяПоказателя);
			Если Результат <> Неопределено Тогда
				Значение = Результат["КоррСчет"];
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "БанкСчетБИКБанка" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, ИмяПоказателя);
			Если Результат <> Неопределено Тогда
				Значение = Результат["БИК"];
			Иначе
				Значение = "";
			КонецЕсли;
			
		Иначе
			
			Значение = "";//если вернуть строку - больше шансов угадать, так как большинство сведений - строковые
			
		КонецЕсли;
		
		ОргСведения.Вставить(ИмяПоказателя, Значение);
		
	КонецЦикла;
	
	Возврат ОргСведения;
	
	
КонецФункции

// Возвращает представление первого счета из табличной части "БанковскиеРеквизиты" указанной организации
//
//Параметры:
//	Организация - СправочникСсылка.Организации или непоределено
//	СтруктураСчета - Вовзращаемый параметр, заполняется реквизитами счета
//
//Возвращаемое значение:
//	Строка - представление счета организации
//
Функция ОсновнойСчетОрганизации(Организация, СтруктураСчета = Неопределено) Экспорт
	
	СтруктураСчета = Новый Структура("ПредсталвениеСчета,НомерСчета,БИК,КоррСчет,
					|НаименованиеБанка,АдресБанка,ТекстКорреспондента,Депозитный,ВидСчета");
	ЗаполнитьРеквизитыБанковскогоСчета(Организация, СтруктураСчета);
	Возврат СтруктураСчета.ПредсталвениеСчета;
	
КонецФункции

// Возвращает строку с представлением периода.
//
// Параметры:
//	НачалоПериода - Дата - Начало периода.
//	КонецПериода - Дата - Конец периода.
//	ТолькоДаты - Булево - Если Ложь, то возвращаемая строка включает предлог "за".
//
// Возвращаемое значение:
//  Строка - Текст представления периода.
//
Функция ПолучитьПредставлениеПериода(НачалоПериода = '00010101', КонецПериода = '00010101', ТолькоДаты  = Ложь) Экспорт
	
	ТекстПериод = "";
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = ?(ТолькоДаты, "", " " + НСтр("ru = 'за'")+ " ") 
				+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда
		ТекстПериод = ?(ТолькоДаты, "", " " + НСтр("ru = 'за'")+ " ") 
			+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП = Истина");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, СтрНайти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Возврат ТекстПериод;
	
КонецФункции

// Возвращает дату начала периода.
//
// Параметры:
//	Период - Дата - Дата, для которой необходимо определить начало периода.
//	Периодичность - Число - Определяет вид периода.
//
// Возвращаемое значение:
//	Дата - Дата, соответствующая началу периода.
//
Функция НачалоПериода(Период, Периодичность) Экспорт
	
	НачалоПериода = Период;
	Если Периодичность = 6 Тогда       //День
		НачалоПериода = НачалоДня(Период);
	ИначеЕсли Периодичность = 7 Тогда  //Неделя
		НачалоПериода = НачалоНедели(Период);
	ИначеЕсли Периодичность = 8 Тогда  //Декада
		Если День(Период) <= 10 Тогда
			НачалоПериода = Дата(Год(Период), Месяц(Период), 1);
		ИначеЕсли День(Период) > 10 И День(Период) <= 20 Тогда
			НачалоПериода = Дата(Год(Период), Месяц(Период), 11);
		Иначе
			НачалоПериода = Дата(Год(Период), Месяц(Период), 21);
		КонецЕсли;
	ИначеЕсли Периодичность = 9 Тогда  //Месяц
		НачалоПериода = НачалоМесяца(Период);
	ИначеЕсли Периодичность = 10 Тогда //Квартал
		НачалоПериода = НачалоКвартала(Период);
	ИначеЕсли Периодичность = 11 Тогда //Полугодие
		НачалоПериода = ?(Месяц(Период) < 7, НачалоДня(Дата(Год(Период), 1, 1)), НачалоДня(Дата(Год(Период), 7, 1)));
	ИначеЕсли Периодичность = 12 Тогда //Год
		НачалоПериода = НачалоГода(Период);
	КонецЕсли;
	
	Возврат НачалоПериода;
	
КонецФункции

// Возвращает дату окончания периода.
//
// Параметры:
//	Период - Дата - Дата, для которой необходимо определить конец периода.
//	Периодичность - Число - Определяет вид периода.
//
// Возвращаемое значение:
//	Дата - Дата, соответствующая окончания периода.
//
Функция КонецПериода(Период, Периодичность) Экспорт
	
	КонецПериода = Период;
	Если Периодичность = 6 Тогда       //День
		КонецПериода = КонецДня(Период);
	ИначеЕсли Периодичность = 7 Тогда  //Неделя
		КонецПериода = КонецНедели(Период);
	ИначеЕсли Периодичность = 8 Тогда  //Декада
		Если День(Период) > 20 Тогда
			КонецПериода = КонецМесяца(Период);
		Иначе
			КонецПериода = КонецДня(Период + 10 * 86400 - 1);
		КонецЕсли; 
	ИначеЕсли Периодичность = 9 Тогда  //Месяц
		КонецПериода = КонецМесяца(Период);
	ИначеЕсли Периодичность = 10 Тогда //Квартал
		КонецПериода = КонецКвартала(Период);
	ИначеЕсли Периодичность = 11 Тогда //Полугодие
		КонецПериода = ?(Месяц(Период) < 7, КонецДня(Дата(Год(Период), 6, 30)), КонецДня(Дата(Год(Период), 12, 31)));
	ИначеЕсли Периодичность = 12 Тогда //Год
		КонецПериода = КонецГода(Период);
	КонецЕсли;
	
	Возврат КонецПериода;
	
КонецФункции

// Возвращает вид ближайшего периода между двумя датами.
//
// Параметры:
//	Периодичность - Число - Исходное значение периодичности.
//	НачалоПериода - ДатаВремя - Дата и время начала периода.
//	КонецПериода - ДатаВремя - Дата и время окончания периода.
//
// Возвращаемое значение:
//	Число - Вид периодичности.
//
Функция ПолучитьЗначениеПериодичности(Периодичность, НачалоПериода, КонецПериода) Экспорт
	
	Результат = Периодичность;
	Если Периодичность = 0 Тогда
		Если ЗначениеЗаполнено(НачалоПериода)
			И ЗначениеЗаполнено(КонецПериода) Тогда
			Разность = КонецПериода - НачалоПериода;
			Если Разность / 86400 < 45 Тогда
				Результат = 6; // День.
			Иначе
				Результат = 9; // Месяц.
			КонецЕсли;
		Иначе
			Результат = 9; // Месяц.
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает период отчета в настройках (см. НовыйУниверсальныеНастройки())
// исходя их переданного значения начала периода и периодичности отчета,
// периодичность при этом будет сброшена.
//
// Параметры:
//  Настройки - Структура - настройки отчета, см. НовыйУниверсальныеНастройки().
//  НачалоПериода - Дата - Дата начала периода.
//
Процедура ПреобразоватьПериодичностьОтчетаВПериод(Настройки, НачалоПериода) Экспорт
	
	Настройки.НачалоПериода = НачалоПериода;
	
	Если Настройки.Периодичность = 6 Тогда // По дням.
		
		Настройки.КонецПериода = КонецДня(Настройки.НачалоПериода);
		
	ИначеЕсли Настройки.Периодичность = 7 Тогда // По неделям.
		
		Настройки.КонецПериода = КонецНедели(Настройки.НачалоПериода);
		
	ИначеЕсли Настройки.Периодичность = 8 Тогда // По декадам.
		
		Настройки.КонецПериода = Мин(КонецМесяца(Настройки.НачалоПериода), КонецДня(Настройки.НачалоПериода + 9*60*60*24));
		
	ИначеЕсли Настройки.Периодичность = 9 Тогда // По месяцам.
		
		Настройки.КонецПериода = КонецМесяца(Настройки.НачалоПериода);
		
	ИначеЕсли Настройки.Периодичность = 10 Тогда // По кварталам.
		
		Настройки.КонецПериода = КонецКвартала(Настройки.НачалоПериода);
		
	ИначеЕсли Настройки.Периодичность = 11 Тогда // По полугодиям.
		
		Если ДеньГода(Настройки.НачалоПериода) = 1 Тогда
			Настройки.КонецПериода = Дата(Год(Настройки.НачалоПериода), 6, 30,23,59,59);
		Иначе
			Настройки.КонецПериода = КонецГода(Настройки.НачалоПериода);
		КонецЕсли;
		
	ИначеЕсли Настройки.Периодичность = 12 Тогда // По годам.
		
		Настройки.КонецПериода = КонецГода(Настройки.НачалоПериода);
		
	КонецЕсли;

	Настройки.Периодичность = 0; // За период отчета.
	
КонецПроцедуры

Функция РеквизитыОбязательныеДляОтчета(ИмяОтчета, Организация, ПериодОтчета) Экспорт
	
	Если ПериодОтчета < Дата(2014, 1, 1) Тогда
		// Проверка реквизитов отчетных форм за периоды ранее 2014 года не поддерживается.
		Возврат Новый Массив;
	КонецЕсли;
	
	ЭтоЮрлицо = Ложь;  // ДЕНЬГИ Деньги3НДФЛ.ЭтоЮрЛицо(Организация);
	
	СтрокаРеквизиты = "";
	
	Если ИмяОтчета = "РегламентированныйОтчет3НДФЛ" Тогда
		
		// Отчет требуется только предпринимателям
		Если НЕ ЭтоЮрлицо Тогда
			СтрокаРеквизиты = "ФамилияИП, ИмяИП, ИНН, Адрес, КодПоОКТМО, КодНалоговогоОргана";
		КонецЕсли;
		
	ИначеЕсли ИмяОтчета = "РегламентированныйОтчет4НДФЛ" Тогда
		
		// Отчет требуется только предпринимателям
		Если НЕ ЭтоЮрлицо Тогда
			СтрокаРеквизиты = "ФамилияИП, ИмяИП, КодПоОКТМО, КодНалоговогоОргана";
		КонецЕсли;
		
	// ДЕНЬГИ Остальные варианты исключены
	
	КонецЕсли;
	
	СтрокаРеквизиты = СтрЗаменить(СтрокаРеквизиты, " ", "");
	
	Возврат СтрРазделить(СтрокаРеквизиты, ",", Ложь);
	
КонецФункции

Функция ПолНалогоплательщика(Налогоплательщик) Экспорт
	
	Результат = Перечисления.ПолФизическогоЛица.Мужской;
	Если ЗначениеЗаполнено(Налогоплательщик) И ЗначениеЗаполнено(Налогоплательщик.ПолФизическогоЛица) Тогда
		Результат = Налогоплательщик.ПолФизическогоЛица;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоЮрЛицо(Организация) Экспорт
	
	Возврат Справочники.Организации.ЭтоЮрЛицо(Организация);
	
КонецФункции

// Возвращает дату начала применения схемы расчета авансовых платежей предпринимателем
// (п. 7 ст. 1 Федерального закона от 15.04.2019 N 63-ФЗ)
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаРасчетаАвансовыхПлатежейНДФЛ() Экспорт
	
	Возврат Дата('20200101');
	
КонецФункции

Функция ДеятельностьОтнесенаКПострадавшимОтКоронавируса(Организация) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ТаблицаДоходовРасходовПоВидамПредпринимательскойДеятельности3НДФЛ(ПараметрыОтчета) Экспорт
	
	Возврат ТаблицаДанныхРаздела61();
	
КонецФункции

// Возвращает признак необходимости включения авансов покупателей в прочие доходы поквартально.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация, для которой необходимо проверить настройку
//   Период      - Дата - Дата, на которую нужно проверить возможность включения авансов покупателей в доходы
//
// Возвращаемое значение:
//   Булево
//
Функция ВключатьАвансыПокупателейВДоходыПоквартально(Организация, Период) Экспорт
	
	Если Период >= НачалоВключенияАвансовПокупателейВДоходыПоквартально()
		//И УчетнаяПолитика.АвансыВключаютсяВДоходыВПериодеПолученияИП(Организация, Период) 
		Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьОтчетыБРО() Экспорт
	
	Возврат Новый СписокЗначений();
	
КонецФункции

#Область НалоговыйУчет

Функция НоваяТаблицаНачисленияНалога() Экспорт

	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("СчетДт",                 Неопределено); // ДЕНЬГИ 
	Результат.Колонки.Добавить("СчетКт",                 Неопределено); // ДЕНЬГИ 
	Результат.Колонки.Добавить("ПрибылиИУбытки",         Неопределено); // ДЕНЬГИ 
	Результат.Колонки.Добавить("ВидыПлатежейВГосБюджет", Неопределено); // ДЕНЬГИ 
	Результат.Колонки.Добавить("Сумма",                  ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Результат.Колонки.Добавить("Содержание",             ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	Возврат Результат;

КонецФункции


#КонецОбласти 


#Область УчетНДФЛПредпринимателя

Функция СрокУплатыНалогаПоУмолчанию(Период) Экспорт
	
	Возврат Дата(Год(Период) + 1, 07, 15);
	
КонецФункции

// Возвращает разрядность округления показателей расчета НДФЛ (п. 6 ст. 52 НК РФ)
//
// Параметры:
//  Период - Дата - оплачиваемый период
//
// Возвращаемое значение:
//   Число
//
Функция РазрядностьОкругленияПоказателейПриРасчетеНалога(Период) Экспорт

	Возврат 0;

КонецФункции

#КонецОбласти 


#Область БухгалтерскийУчетПереопределяемый

// Предоставляет реквизиты компании (юридического лица или предпринимателя), например, для вывода в печатной форме.
//
// Параметры:
//  Компания		 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - компания, реквизиты которой нужно получить
//  Период			 - Дата - дата, на которую нужно получить значения периодических реквизитов
//  БанковскийСчет	 - СправочникСсылка.БанковскиеСчета - банковский счет, реквизиты которого нужно включить в реквизиты компании.
//                     Если не передан, будут включены реквизиты основного банковского счета.
// 
// Возвращаемое значение:
// см. НовыйРеквизитыКомпании() - коллекция общепринятых реквизитов компании.
//
Функция СведенияОЮрФизЛице(Компания, Период = '00010101', Знач БанковскийСчет = Неопределено, ПлатежВБюджет = Ложь, ГосКонтракт = Неопределено) Экспорт
	
	Реквизиты = НовыйРеквизитыКомпании();
	
	Если Не ЗначениеЗаполнено(Компания) Тогда
		Возврат Реквизиты;
	КонецЕсли;
	
	Если ТипЗнч(Компания) = Тип("СправочникСсылка.Организации") Тогда
		ЗаполнитьРеквизитыОрганизации(Реквизиты, Компания, Период);
	Иначе
		Возврат Реквизиты;
	КонецЕсли;
	
	ЗаполнитьРеквизитыБанковскогоСчета(Компания, Реквизиты, БанковскийСчет);
	
	// Вторичные данные
	Реквизиты.Представление               = СокрЛП(Реквизиты.Представление);
	Реквизиты.ПолноеНаименование          = СокрЛП(Реквизиты.ПолноеНаименование);
	Реквизиты.СокращенноеНаименование     = СокрЛП(Реквизиты.СокращенноеНаименование);
	Реквизиты.НаименованиеДляПечатныхФорм = СокрЛП(Реквизиты.НаименованиеДляПечатныхФорм);
	Реквизиты.ТекстКорреспондента         = СокрЛП(Реквизиты.ТекстКорреспондента);
	
	Если Не ЗначениеЗаполнено(Реквизиты.ПолноеНаименование) Тогда
		Если ЗначениеЗаполнено(Реквизиты.СокращенноеНаименование) Тогда
			Реквизиты.ПолноеНаименование = Реквизиты.СокращенноеНаименование;
		Иначе
			Реквизиты.ПолноеНаименование = Реквизиты.Представление;
		КонецЕсли;
	КонецЕсли;
	
	Если ПлатежВБюджет И Не ПустаяСтрока(Реквизиты.ТекстКорреспондента) Тогда
		Реквизиты.ПолноеНаименование = Реквизиты.ТекстКорреспондента;
	КонецЕсли;
	
	Если Реквизиты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо
		И Не ПустаяСтрока(Реквизиты.СвидетельствоСерияНомер) Тогда
		Реквизиты.Свидетельство = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'свидетельство %1 от %2'"),
			Реквизиты.СвидетельствоСерияНомер,
			Формат(Реквизиты.СвидетельствоДатаВыдачи, "ДЛФ=D"));
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции

// Конструктор коллекции, содержащей общепринятые реквизиты компании (юридического лица или индивидуального предпринимателя).
// 
// Возвращаемое значение:
// Структура - см. содержимое функции
//
Функция НовыйРеквизитыКомпании() Экспорт
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("ЮридическоеФизическоеЛицо",          Перечисления.ЮридическоеФизическоеЛицо.ПустаяСсылка());
	// Наименования
	Реквизиты.Вставить("Представление",                      "");
	Реквизиты.Вставить("ПолноеНаименование",                 "");
	Реквизиты.Вставить("СокращенноеНаименование",            "");
	Реквизиты.Вставить("НаименованиеДляПечатныхФорм",        "");
	Реквизиты.Вставить("ФамилияИнициалыФизлица",             ""); // Фамилия И.О.
	Реквизиты.Вставить("ФИОФизлица",                         ""); // Фамилия Имя Отчество
	// Адреса и контактная информация
	Реквизиты.Вставить("ЮридическийАдрес",                   "");
	Реквизиты.Вставить("ЗначенияПолейЮридическийАдрес",      ""); // структурированное строковое представление адреса (XML или в формате "9 запятых")
	Реквизиты.Вставить("ЗначениеJSONЮридическийАдрес",       ""); // структурированное строковое представление адреса (JSON)
	Реквизиты.Вставить("ФактическийАдрес",                   ""); 
	Реквизиты.Вставить("ЗначенияПолейФактическийАдрес",      ""); // структурированное строковое представление адреса (XML или в формате "9 запятых")
	Реквизиты.Вставить("ЗначениеJSONФактическийАдрес",       ""); // структурированное строковое представление адреса (JSON)
	Реквизиты.Вставить("ПочтовыйАдрес",                      ""); 
	Реквизиты.Вставить("ЗначенияПолейПочтовыйАдрес",         ""); // структурированное строковое представление адреса (XML или в формате "9 запятых")
	Реквизиты.Вставить("ЗначениеJSONПочтовыйАдрес",          ""); // структурированное строковое представление адреса (JSON)
	Реквизиты.Вставить("Телефоны",                           "");
	Реквизиты.Вставить("ЗначенияПолейТелефоны",              ""); 
	Реквизиты.Вставить("ЗначениеJSONТелефоны",               ""); 
	Реквизиты.Вставить("ТелефонЮридическогоАдреса",          "");
	Реквизиты.Вставить("ЗначенияПолейТелефонЮридическогоАдреса", ""); 
	Реквизиты.Вставить("ЗначениеJSONТелефонЮридическогоАдреса", ""); 
	Реквизиты.Вставить("Факс",                               ""); 
	Реквизиты.Вставить("Email",                              "");
	// Регистрационные данные
	Реквизиты.Вставить("ОГРН",                               ""); // Здесь же ОГРНИП для ИП, рег. номер для иностранных контрагентов
	Реквизиты.Вставить("ДатаРегистрации",                    "");
	Реквизиты.Вставить("КодПоОКПО",                          "");
	Реквизиты.Вставить("ИНН",                                "");
	Реквизиты.Вставить("КПП",                                ""); // Только для ЮЛ
	Реквизиты.Вставить("СвидетельствоСерияНомер",            "");           // Только для ИП
	Реквизиты.Вставить("СвидетельствоДатаВыдачи",            '0001-01-01'); // Только для ИП
	Реквизиты.Вставить("Свидетельство",                      ""); // Свидетельство строкой, только для ИП
	Реквизиты.Вставить("ДокументУдостоверяющийЛичность",     ""); // Только для физлица
	Реквизиты.Вставить("ИндивидуальныйПредприниматель",      Неопределено); // ДЕНЬГИ // Только для организаций-ИП
	Реквизиты.Вставить("СтранаРегистрации",                  Справочники.СтраныМира.ПустаяСсылка());
	Реквизиты.Вставить("НалоговыйНомерВСтранеРегистрации",   "");
	// Банковские реквизиты
	Реквизиты.Вставить("НомерСчета",                         "");
	Реквизиты.Вставить("ТекстКорреспондента",                "");
	Реквизиты.Вставить("БИК",                                "");
	Реквизиты.Вставить("Банк",                               "");
	Реквизиты.Вставить("АдресБанка",                         "");
	Реквизиты.Вставить("КоррСчет",                           "");
	// Должностные лица юридического лица
	Реквизиты.Вставить("Руководитель"                      , Неопределено); // ДЕНЬГИ 
	Реквизиты.Вставить("РуководительФИО"                   , "");
	Реквизиты.Вставить("ДолжностьРуководителяПредставление", "");
	
	// ДЕНЬГИ
	Реквизиты.Вставить("ДатаРождения"                          , "");
	Реквизиты.Вставить("ДокументДатаВыдачи"                    , "");
	Реквизиты.Вставить("ДокументМестоВыдачи"                   , "");
	Реквизиты.Вставить("ДокументСерияНомер"                    , "");
	Реквизиты.Вставить("КодПоОКТМО"                            , "");
	Реквизиты.Вставить("КатегорияПлательщикаНДФЛ"              , Перечисления.КатегорииНалогоплательщикаНДФЛ.НеПредприниматель);
	
	
	Возврат Реквизиты;
	
КонецФункции

Процедура ЗаполнитьРеквизитыОрганизации(Реквизиты, Организация, Период)
	
	// Константы
	Реквизиты.СтранаРегистрации = Справочники.СтраныМира.Россия;
	
	// Общие сведения
	ИменаРеквизитовПредпринимателя = "ИндивидуальныйПредприниматель, СвидетельствоСерияНомер, СвидетельствоДатаВыдачи";
	ИменаРеквизитовОбъекта = "ЮридическоеФизическоеЛицо, Представление, ИНН, ОГРН, ДатаРегистрации, КодПоОКПО, "
		+ ИменаРеквизитовПредпринимателя;
	ЗначенияРеквизитовОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, ИменаРеквизитовОбъекта);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, ЗначенияРеквизитовОбъекта, , ИменаРеквизитовПредпринимателя); // Все, кроме реквизитов предпринимателя
	// (некоторые свойства зависят от того, как оформлен бизнес)
	Если Реквизиты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, ЗначенияРеквизитовОбъекта, ИменаРеквизитовПредпринимателя); // Только реквизиты предпринимателя
	Иначе // Юридическое лицо
		// ДЕНЬГИ код исключен
	КонецЕсли;
	
	// Наименования
	// ДЕНЬГИ код исключен
	
	Если Реквизиты.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		Реквизиты.ФИОФизлица = Деньги3НДФЛВызовСервера.ПолучитьФамилиюИмяОтчество(
			Организация.ФамилияИП,
			Организация.ИмяИП,
			Организация.ОтчествоИП,
			Ложь);
		
		Реквизиты.ФамилияИнициалыФизлица = Деньги3НДФЛВызовСервера.ПолучитьФамилиюИмяОтчество(
			Организация.ФамилияИП,
			Организация.ИмяИП,
			Организация.ОтчествоИП,
			Истина);
		
	КонецЕсли;
	
	// Контактная информация
	ЗаполнитьКонтактнуюИнформациюВРеквизитахКомпании(Реквизиты, Организация, Период);
	
КонецПроцедуры

Процедура ЗаполнитьКонтактнуюИнформациюВРеквизитахКомпании(Реквизиты, Компания, Период)

	ВидыКонтактнойИнформации = Новый ТаблицаЗначений; // Кеш для поиска
	ВидыКонтактнойИнформации.Колонки.Добавить("Вид", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"));
	ВидыКонтактнойИнформации.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	Для Каждого ОписаниеВидаКИ Из ВидыКонтактнойИнформацииКомпании(ТипЗнч(Компания)) Цикл
		
		ИдентификаторВида = ВидыКонтактнойИнформации.Добавить();
		ИдентификаторВида.Вид = ОписаниеВидаКИ.Значение;
		ИдентификаторВида.ИмяРеквизита = ОписаниеВидаКИ.Ключ;

	КонецЦикла;
	
	//КонтактнаяИнформация = УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату(
	//	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Компания),
	//	Неопределено, // типы определяются по видам - следующему параметру
	//	ВидыКонтактнойИнформации.ВыгрузитьКолонку("Вид"),
	//	Период);
	
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Компания),
		Неопределено,
		ВидыКонтактнойИнформации.ВыгрузитьКолонку("Вид"));
	
	Для Каждого ЭлементКонтактнойИнформации Из КонтактнаяИнформация Цикл
		
		ИдентификаторВида = ВидыКонтактнойИнформации.Найти(ЭлементКонтактнойИнформации.Вид, "Вид");
		Если ИдентификаторВида = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ИмяРеквизита = ИдентификаторВида.ИмяРеквизита;
		Реквизиты[ИмяРеквизита] = ЭлементКонтактнойИнформации.Представление;
		
		Если ЭлементКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			
			// Заполним детальнее
			
			Если ИмяРеквизита = "ЮридическийАдрес" Тогда
				ИмяРеквизитаЗначенияПолей = "ЗначенияПолейЮридическийАдрес";
				ИмяРеквизитаЗначенияПолейJSON = "ЗначениеJSONЮридическийАдрес";
			ИначеЕсли ИмяРеквизита = "ФактическийАдрес" Тогда
				ИмяРеквизитаЗначенияПолей = "ЗначенияПолейФактическийАдрес";
				ИмяРеквизитаЗначенияПолейJSON = "ЗначениеJSONФактическийАдрес";
			Иначе // ПочтовыйАдрес
				ИмяРеквизитаЗначенияПолей = "ЗначенияПолейПочтовыйАдрес";
				ИмяРеквизитаЗначенияПолейJSON = "ЗначениеJSONПочтовыйАдрес";
			КонецЕсли;
			
			Реквизиты[ИмяРеквизитаЗначенияПолей] = ЭлементКонтактнойИнформации.ЗначенияПолей;
			Реквизиты[ИмяРеквизитаЗначенияПолейJSON] = ЭлементКонтактнойИнформации.Значение;
			
		ИначеЕсли ЭлементКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			
			Если ИмяРеквизита = "ТелефонЮридическогоАдреса" Тогда
				ИмяРеквизитаЗначенияПолей = "ЗначенияПолейТелефонЮридическогоАдреса";
				ИмяРеквизитаЗначенияПолейJSON = "ЗначениеJSONТелефонЮридическогоАдреса";
			Иначе // Телефоны
				ИмяРеквизитаЗначенияПолей = "ЗначенияПолейТелефоны";
				ИмяРеквизитаЗначенияПолейJSON = "ЗначениеJSONТелефоны";
			КонецЕсли;
			
			Реквизиты[ИмяРеквизитаЗначенияПолей] = ЭлементКонтактнойИнформации.ЗначенияПолей;
			Реквизиты[ИмяРеквизитаЗначенияПолейJSON] = ЭлементКонтактнойИнформации.Значение;
			
		КонецЕсли;
		
	КонецЦикла; // По КонтактнаяИнформация
	
КонецПроцедуры

Функция ВидыКонтактнойИнформацииКомпании(ТипКомпании)
	
	ВидыКонтактнойИнформацииКомпании = Новый Структура();
	ВидыКонтактнойИнформацииКомпании.Вставить("ЮридическийАдрес");
	ВидыКонтактнойИнформацииКомпании.Вставить("ФактическийАдрес");
	ВидыКонтактнойИнформацииКомпании.Вставить("ПочтовыйАдрес");
	ВидыКонтактнойИнформацииКомпании.Вставить("Телефоны");
	ВидыКонтактнойИнформацииКомпании.Вставить("Email");
	
	Если ТипКомпании = Тип("СправочникСсылка.Организации") Тогда
		ВидыКонтактнойИнформацииКомпании.ЮридическийАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
		ВидыКонтактнойИнформацииКомпании.ФактическийАдрес = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
		ВидыКонтактнойИнформацииКомпании.ПочтовыйАдрес    = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
		ВидыКонтактнойИнформацииКомпании.Телефоны         = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
		ВидыКонтактнойИнформацииКомпании.Email            = Справочники.ВидыКонтактнойИнформации.EmailОрганизации;
	КонецЕсли;
	
	Возврат ВидыКонтактнойИнформацииКомпании;
	
КонецФункции

#КонецОбласти 


#Область ДанныеВыбораБЗК

// Обработчик получения данных выбора для справочников, упорядоченных по коду. 
// Готовит данные выбора для справочников-классификаторов, упорядочивает по коду и наименованию.
//
// Вызывается из обработчика ОбработкаПолученияДанныхВыбора для формирования списка при вводе по строке,
// автоподборе текста и быстром выборе, а также при выполнении метода ПолучитьДанныеВыбора.
//
// Параметры:
//  Источник             - СправочникМенеджер - объект, для которого формируется список выбора.
//  ДанныеВыбора         - СписокЗначений     - данные для выбора.
//  Параметры            - Структура          - содержит параметры выбора.
//  СтандартнаяОбработка - Булево             - признак выполнения стандартной обработки события.
//
Процедура ЗаполнитьДляКлассификатораСПорядкомПоКоду(
	Источник, 
	ДанныеВыбора, Знач Параметры,СтандартнаяОбработка) Экспорт
	
	Запрос = Новый Запрос;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 51
		|	Классификатор.Ссылка КАК Ссылка,
		|	Классификатор.Код КАК Код,
		|	Классификатор.Наименование КАК Наименование,
		|	ИСТИНА КАК НайденПоКоду
		|ПОМЕСТИТЬ ВТОтобранныеЭлементы
		|ИЗ
		|	&Классификатор КАК Классификатор
		|ГДЕ
		|	&УсловиеПоКод
		|	И Классификатор.Код <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 51
		|	Классификатор.Ссылка,
		|	ВЫБОР
		|		КОГДА Классификатор.Код = """"
		|			ТОГДА ""999999999""
		|		ИНАЧЕ Классификатор.Код
		|	КОНЕЦ,
		|	Классификатор.Наименование,
		|	ЛОЖЬ
		|ИЗ
		|	&Классификатор КАК Классификатор
		|ГДЕ
		|	&УсловиеПоНаименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 51
		|	ОтобранныеЭлементы.Ссылка КАК Ссылка,
		|	ОтобранныеЭлементы.Код КАК Код,
		|	ОтобранныеЭлементы.Наименование КАК Наименование,
		|	МАКСИМУМ(ОтобранныеЭлементы.НайденПоКоду) КАК НайденПоКоду
		|ИЗ
		|	ВТОтобранныеЭлементы КАК ОтобранныеЭлементы
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтобранныеЭлементы.Ссылка,
		|	ОтобранныеЭлементы.Код,
		|	ОтобранныеЭлементы.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код,
		|	Наименование";
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Классификатор", Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя());
	
	УстановитьОтборыВЗапросеПоПараметрам(Запрос, Параметры, "Код, Наименование");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ДанныеВыбора.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			
			Если Выборка.НайденПоКоду Тогда
				Представление = СтрШаблон("%1 (%2)", СокрЛП(Выборка.Код), Выборка.Наименование);
			ИначеЕсли Не ПустаяСтрока(Выборка.Код) И Выборка.Код <> "999999999" Тогда
				Представление = СтрШаблон("%1 (%2)", Выборка.Наименование, СокрЛП(Выборка.Код));
			Иначе	
				Представление = Выборка.Наименование;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
			
		КонецЕсли;
	КонецЦикла;
		
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Обработчик получения данных выбора для справочников, упорядоченных по реквизиту допупорядочивания. 
//
Процедура ЗаполнитьДляКлассификатораСПорядкомПоДопРеквизиту(
		Источник, 
		ДанныеВыбора, Знач Параметры, СтандартнаяОбработка) Экспорт
	
	Запрос = Новый Запрос;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 51
		|	Классификатор.Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(Классификатор.Ссылка) КАК СсылкаПредставление
		|ИЗ
		|	&Классификатор КАК Классификатор
		|ГДЕ &УсловиеПоНаименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Классификатор.РеквизитДопУпорядочивания";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Классификатор", Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя());
	
	УстановитьОтборыВЗапросеПоПараметрам(Запрос, Параметры, "Наименование");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
			Представление = Выборка.СсылкаПредставление;
		Иначе
			
			ДлинаСтрокиПоиска = СтрДлина(Параметры.СтрокаПоиска);
			Представление = 
				Новый ФорматированнаяСтрока(
					Новый ФорматированнаяСтрока(
						Лев(Выборка.СсылкаПредставление, ДлинаСтрокиПоиска), 
						Новый Шрифт( , , Истина), 
						WebЦвета.Зеленый),
					Сред(Выборка.СсылкаПредставление, ДлинаСтрокиПоиска + 1));
			
		КонецЕсли;
		
		ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
		
	КонецЦикла;
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура УстановитьОтборыВЗапросеПоПараметрам(Запрос, Параметры, Знач ПоляПоиска)
	
	// Накопитель отборов по полям поиска:
	//     Ключ     - имя поля поиска
	//     Значение - массив строк с условиями отбора
	ОтборыПолей = Новый Структура(ПоляПоиска);
	Для Каждого ОтборыПоля Из ОтборыПолей Цикл
		ОтборыПолей[ОтборыПоля.Ключ] = Новый Массив;
	КонецЦикла;	
	
	// Отборы из параметров добавляются к условиям отбора каждого из заказанных полей поиска
	Для Каждого ЭлементОтбора Из Параметры.Отбор Цикл
		ИмяПараметра = "Отбор" + ЭлементОтбора.Ключ;
		Для Каждого ОтборыПоля Из ОтборыПолей Цикл
			ОтборыПоля.Значение.Добавить(СтрШаблон("Классификатор.%1 В (&%2)", ЭлементОтбора.Ключ, ИмяПараметра)); 
		КонецЦикла;	
		Запрос.УстановитьПараметр(ИмяПараметра, ЭлементОтбора.Значение);
	КонецЦикла;
	
	// Когда есть строка поиска, условие по ней вставляется перед условиям отбора по параметрам
	Если НЕ ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
		Для Каждого ОтборыПоля Из ОтборыПолей Цикл
			ОтборыПоля.Значение.Вставить(0, СтрШаблон("Классификатор.%1 ПОДОБНО &СтрокаПоиска", ОтборыПоля.Ключ)); 
		КонецЦикла;	
		Запрос.УстановитьПараметр("СтрокаПоиска", Параметры.СтрокаПоиска + "%");
	КонецЕсли;
	
	// Условия отборов каждого каждого из заказанных полей соединяются по "И".
	// если же отборов у поля нет, то назначается "условие" ИСТИНА
	Для Каждого ОтборыПоля Из ОтборыПолей Цикл
		ТекстУсловийОтбора = СтрСоединить(ОтборыПоля.Значение, " И ");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			СтрШаблон("&УсловиеПо%1", ОтборыПоля.Ключ), 
			?(ЗначениеЗаполнено(ТекстУсловийОтбора), ТекстУсловийОтбора, "(ИСТИНА)"));
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти 


#Область РегламентированнаяОтчетностьБП

Функция ПолучитьСУчетомКэша(Кэш, Параметр, ФизЛицо = Неопределено)
	Перем ЗначениеПараметра;
	
	Если Кэш.Свойство(Параметр, ЗначениеПараметра) Тогда
		Возврат ЗначениеПараметра;
	КонецЕсли;
	
	Если Параметр = "СтавкаНалогаНаПрибыль" Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("СтавкаФБ",        0);
		Результат.Вставить("СтавкаСубъектРФ", 0);
		Результат.Вставить("СтавкаМестный",   0);   // Для совместимости
		
	
	ИначеЕсли Параметр = "ЮрАдресОрганизации" ИЛИ Параметр = "ФактАдресОрганизации" Тогда
		
		ВидКонтактнойИнформации = ?(Параметр = "ЮрАдресОрганизации",Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации , Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
		Результат = АдресСтруктурой(Кэш.Организация.Ссылка, ВидКонтактнойИнформации, Кэш.ДатаЗначения);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателе" Тогда
		Если Кэш.Организация.Метаданные().Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
			Результат = Новый Массив;
			Результат.Добавить(Новый Структура("ФизическоеЛицо", Кэш.Организация.ИндивидуальныйПредприниматель));
		КонецЕсли;
	ИначеЕсли Параметр = "ТелефонОрганизации" Тогда
		ЭлементТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации;
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, ЭлементТелефон);
		Результат = Кэш.Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		Если Результат.Количество() > 0 Тогда
			Результат = Результат[0];
		Иначе
			Результат = Неопределено;
		КонецЕсли;
	ИначеЕсли Параметр = "ФаксОрганизации" Тогда
		ЭлементФакс = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Факс, ЭлементФакс);
		Результат = Кэш.Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
		Если Результат.Количество() > 0 Тогда
			Результат = Результат[0];
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
	ИначеЕсли СтрНайти(Параметр, "Банк") > 0 Тогда
		
		Результат = Новый Структура("ПредсталвениеСчета,ТекстКорреспондента,АдресБанка,НаименованиеБанка,КоррСчет,БИК,НомерСчета,ВидСчета");
		ЗаполнитьРеквизитыБанковскогоСчета(Кэш.Организация.Ссылка, Результат);
		
	КонецЕсли;
				
	Кэш.Вставить(Параметр, Результат);
	Возврат Результат;
	
КонецФункции

Функция АдресВXML(КонтактнаяИнформация, ВидАдреса)
	
	Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдреса);
	
	Результат = КонтактнаяИнформация.НайтиСтроки(Данные);
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Результат[0].ЗначенияПолей, Результат[0].Представление, ВидАдреса);
	
КонецФункции

Функция АдресВJSON(КонтактнаяИнформация, ВидАдреса)
	
	Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдреса);
	
	Результат = КонтактнаяИнформация.НайтиСтроки(Данные);
	
	Если Результат.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЗначениеАдресаJSON(Результат[0]);
	
КонецФункции

Функция ЗначениеАдресаJSON(Адрес)
	
	Если ЗначениеЗаполнено(Адрес.Значение) Тогда
		Возврат Адрес.Значение;
	Иначе
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВJSON(Адрес.ЗначенияПолей, Адрес.Вид);
	КонецЕсли;
	
КонецФункции

#КонецОбласти 


#Область УправлениеКонтактнойИнформациейБП

// Возвращает адрес в виде структуры полей. Если адрес нужного вида не задан, то будет возвращена структура с пустыми полями.
//
// Параметры:
//    Ссылка                  - СправочникСсылка - Ссылка на объект, который содержит контактную информацию.
//    ВидКонтактнойИнформации - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации, структуру которого нужно получить.
//    НаименованиеВключаетСокращение - Булево - признак включение в наименования элемента адреса его сокращенного представления
//
// Возвращаемое значение:
//  Структура - Структура со значениями полей адреса.
//
Функция АдресСтруктурой(Ссылка, ВидКонтактнойИнформации, Период = '00010101', НаименованиеВключаетСокращение = Истина) Экспорт
	
	
	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка),
		Неопределено,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидКонтактнойИнформации));
		
	Если Адрес.Количество() <> 0 Тогда
		ДополнительныеПараметры = Новый Структура("НаименованиеВключаетСокращение", НаименованиеВключаетСокращение);
		СтруктураАдреса = СтруктураАдреса(Адрес[0].Значение, ДополнительныеПараметры);
		СтруктураАдреса.ЗначенияПолей = Адрес[0].ЗначенияПолей;
		СтруктураАдреса.ЗначениеJSON  = Адрес[0].Значение;
	Иначе
		СтруктураАдреса = НовыйСтруктураАдреса();
	КонецЕсли;
	
	Возврат СтруктураАдреса;
	
КонецФункции

Функция СтруктураАдреса(ЗначенияАдресаJSON, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураАдреса = НовыйСтруктураАдреса();
	
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(ЗначенияАдресаJSON, ДополнительныеПараметры);
	
	СтруктураАдреса.Страна    = СведенияОбАдресе.Страна;
	СтруктураАдреса.КодСтраны = СведенияОбАдресе.КодСтраны;
	Если СтруктураАдреса.Свойство("Страна") 
		И СтрСравнить(СтруктураАдреса.Страна, Справочники.СтраныМира.Россия.Наименование) = 0 Тогда
		СтруктураАдреса.АдресРФ = Истина;
	Иначе
		СтруктураАдреса.АдресРФ = Ложь;
	КонецЕсли;
	
	СтруктураАдреса.Представление             = СведенияОбАдресе.Представление;
	СтруктураАдреса.Индекс                    = СведенияОбАдресе.Индекс;
	СтруктураАдреса.Регион                    = СведенияОбАдресе.Регион;
	СтруктураАдреса.КодРегиона                = ?(СведенияОбАдресе.Свойство("КодРегиона"), СведенияОбАдресе.КодРегиона, "");
	СтруктураАдреса.РегионСокращение          = СведенияОбАдресе.РегионСокращение;
	СтруктураАдреса.Район                     = СведенияОбАдресе.Район;
	СтруктураАдреса.РайонСокращение           = СведенияОбАдресе.РайонСокращение;
	СтруктураАдреса.Город                     = СведенияОбАдресе.Город;
	СтруктураАдреса.ГородСокращение           = СведенияОбАдресе.ГородСокращение;
	СтруктураАдреса.НаселенныйПункт           = СведенияОбАдресе.НаселенныйПункт;
	СтруктураАдреса.НаселенныйПунктСокращение = СведенияОбАдресе.НаселенныйПунктСокращение;
	СтруктураАдреса.Улица                     = СведенияОбАдресе.Улица;
	СтруктураАдреса.УлицаСокращение           = СведенияОбАдресе.УлицаСокращение;
	СтруктураАдреса.Дом                       = СведенияОбАдресе.Здание.Номер;
	СтруктураАдреса.ТипДома                   = СведенияОбАдресе.Здание.ТипЗдания;
	
	Если СведенияОбАдресе.Корпуса.Количество() > 0 Тогда
		СтруктураАдреса.Корпус     = СведенияОбАдресе.Корпуса[0].Номер;
		СтруктураАдреса.ТипКорпуса = СведенияОбАдресе.Корпуса[0].ТипКорпуса;
	КонецЕсли;
	
	Если СведенияОбАдресе.Помещения.Количество() > 0 Тогда
		СтруктураАдреса.Квартира    = СведенияОбАдресе.Помещения[0].Номер;
		СтруктураАдреса.ТипКвартиры = СведенияОбАдресе.Помещения[0].ТипПомещения;
	КонецЕсли;
	
	Возврат СтруктураАдреса;
	
КонецФункции

Функция НовыйСтруктураАдреса() Экспорт
	
	СтруктураАдреса = Новый Структура();
	СтруктураАдреса.Вставить("АдресРФ",                   Истина);
	СтруктураАдреса.Вставить("КодСтраны",                 "");
	СтруктураАдреса.Вставить("Страна",                    "");
	СтруктураАдреса.Вставить("Индекс",                    "");
	СтруктураАдреса.Вставить("Регион",                    "");
	СтруктураАдреса.Вставить("РегионСокращение",          "");
	СтруктураАдреса.Вставить("КодРегиона",                "");
	СтруктураАдреса.Вставить("Район",                     "");
	СтруктураАдреса.Вставить("РайонСокращение",           "");
	СтруктураАдреса.Вставить("Город",                     "");
	СтруктураАдреса.Вставить("ГородСокращение",           "");
	СтруктураАдреса.Вставить("НаселенныйПункт",           "");
	СтруктураАдреса.Вставить("НаселенныйПунктСокращение", "");
	СтруктураАдреса.Вставить("Улица",                     "");
	СтруктураАдреса.Вставить("УлицаСокращение",           "");
	СтруктураАдреса.Вставить("Дом",                       "");
	СтруктураАдреса.Вставить("ТипДома",                   "");
	СтруктураАдреса.Вставить("Корпус",                    "");
	СтруктураАдреса.Вставить("ТипКорпуса",                "");
	СтруктураАдреса.Вставить("Квартира",                  "");
	СтруктураАдреса.Вставить("ТипКвартиры",               "");
	СтруктураАдреса.Вставить("Представление",             "");
	СтруктураАдреса.Вставить("ЗначенияПолей",             "");
	СтруктураАдреса.Вставить("ЗначениеJSON",              "");
	
	Возврат СтруктураАдреса;
	
КонецФункции

#КонецОбласти 


#Область РС_ИПСтандартныеВычетыНаДетей

// Возвращает рассчитанные данные по суммам вычета на детей.
//
// Параметры:
//    СведенияОДетях    - ТаблицаЗначений, СтрокаТаблицыЗначений - Данные о вычетах на детей.
//    РазмерыВычетов    - Структура - Фиксированные значения стандартных вычетов на детей.
//    КоличествоМесяцев - Число - Необязательный. Количество месяцев применения вычета.
//
// Возвращаемое значение:
//   См. НовыйСуммыВычетаНаДетей()
//
Функция РассчитатьСуммыВычетаНаДетей(СведенияОДетях, РазмерыВычетов, КоличествоМесяцев) Экспорт
	
	СуммыВычета = НовыйСуммыВычетаНаДетей();
	
	Для Каждого СтрокаТаблицы Из СведенияОДетях Цикл
		
		Если СтрокаТаблицы.НомерМесяца <= КоличествоМесяцев Тогда
			РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, СтрокаТаблицы, РазмерыВычетов);
		КонецЕсли;
		
	КонецЦикла;
	
	СуммыВычета.Всего = СуммыВычета.СтандартныйВычет + СуммыВычета.ДвойнойВычет
		+ СуммыВычета.ВычетНаИнвалидов + СуммыВычета.ДвойнойВычетНаИнвалидов;
	
	Возврат СуммыВычета;
	
КонецФункции

Функция НовыйСуммыВычетаНаДетей()
	
	СуммыВычета = Новый Структура;
	СуммыВычета.Вставить("СтандартныйВычет", 0);
	СуммыВычета.Вставить("ДвойнойВычет", 0);
	СуммыВычета.Вставить("ВычетНаИнвалидов", 0);
	СуммыВычета.Вставить("ДвойнойВычетНаИнвалидов", 0);
	СуммыВычета.Вставить("Всего", 0);
	
	Возврат СуммыВычета;
	
КонецФункции

Процедура РассчитатьСуммыВычетаНаДетейПоСтроке(СуммыВычета, СтрокаТаблицы, РазмерыВычетов)
	
	СтандартныйВычет = СтандартныйВычетПоКоличествуДетей(СтрокаТаблицы, РазмерыВычетов);
	ВычетНаИнвалидов = СтрокаТаблицы.РодныеДетиИнвалиды * РазмерыВычетов.РоднойИнвалид
		+ СтрокаТаблицы.ПриемныеДетиИнвалиды * РазмерыВычетов.ПриемныйИнвалид;
	
	Если СтрокаТаблицы.ПрименяетсяДвойнойВычет Тогда
		Коэффициент = 2;
		СуммыВычета.ДвойнойВычет = СуммыВычета.ДвойнойВычет + (СтандартныйВычет * Коэффициент);
		СуммыВычета.ДвойнойВычетНаИнвалидов = СуммыВычета.ДвойнойВычетНаИнвалидов + (ВычетНаИнвалидов * Коэффициент);
	Иначе
		СуммыВычета.СтандартныйВычет = СуммыВычета.СтандартныйВычет + СтандартныйВычет;
		СуммыВычета.ВычетНаИнвалидов = СуммыВычета.ВычетНаИнвалидов + ВычетНаИнвалидов;
	КонецЕсли;
	
КонецПроцедуры

Функция СтандартныйВычетПоКоличествуДетей(ТекущаяСтрока, РазмерыВычетов)
	
	Если ТекущаяСтрока.ВсегоДетей < 3 Тогда
		ДетейДо3 = ТекущаяСтрока.Несовершеннолетних;
	Иначе
		ДетейДо3 = Макс(2 - (ТекущаяСтрока.ВсегоДетей - ТекущаяСтрока.Несовершеннолетних), 0);
	КонецЕсли;
	
	ВычетНаПервого = ?(ДетейДо3 > 0, РазмерыВычетов.ПервыйРебенок, 0);
	ВычетНаВторого = ?(ДетейДо3 > 1, РазмерыВычетов.ВторойРебенок, 0);
	
	ДетейПосле3 = ТекущаяСтрока.Несовершеннолетних - ДетейДо3;
	
	Возврат ВычетНаПервого + ВычетНаВторого + (ДетейПосле3 * РазмерыВычетов.ТретийРебенок);
	
КонецФункции


#КонецОбласти 


#Область ЕдиныйНалоговыйСчет



#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ТаблицаДанныхРаздела61()
	
	Число15_2 = Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2));
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("ВидДеятельности", 	Новый ОписаниеТипов("Строка")); // ДЕНЬГИ 
	Таблица.Колонки.Добавить("ИтогоДоходов", 		Число15_2);
	Таблица.Колонки.Добавить("ИтогоРасходов", 		Число15_2);
	Таблица.Колонки.Добавить("Доходы", 				Число15_2);
	Таблица.Колонки.Добавить("ПрочиеДоходы", 		Число15_2);
	Таблица.Колонки.Добавить("МатериальныеРасходы", Число15_2);
	Таблица.Колонки.Добавить("Амортизация", 		Число15_2);
	Таблица.Колонки.Добавить("РасходыНаОплатуТруда",Число15_2);
	Таблица.Колонки.Добавить("ПрочиеРасходы", 		Число15_2);
	
	Возврат Таблица;
	
КонецФункции 

Функция НачалоВключенияАвансовПокупателейВДоходыПоквартально() Экспорт
	
	Возврат '20200101';
	
КонецФункции

Процедура ЗаполнитьРеквизитыБанковскогоСчета(Организация, Реквизиты, ПредсталвениеСчета = Неопределено)
	
	Реквизиты.Вставить("ПредсталвениеСчета", Неопределено);
	
	Если Не ЗначениеЗаполнено(Организация) Или Реквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСчета = Неопределено;
	Если ЗначениеЗаполнено(ПредсталвениеСчета) Тогда
		СтрокиСчета = Организация.БанковскиеРеквизиты.НайтиСтроки(Новый Структура("ПредсталвениеСчета", ПредсталвениеСчета));
		СтрокаСчета = ?(ЗначениеЗаполнено(СтрокиСчета), СтрокиСчета[0], Неопределено);
	КонецЕсли;
	Если СтрокаСчета = Неопределено И Организация.БанковскиеРеквизиты.Количество() > 0 Тогда
		СтрокаСчета = Организация.БанковскиеРеквизиты[0];
	КонецЕсли;
	
	Если СтрокаСчета <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, СтрокаСчета);
		Реквизиты.Депозитный = Нрег(СтрокаСчета.ВидСчета) = "депозитный"; 
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти