///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//

#Область ПрограммныйИнтерфейс

Функция ЗаписьУзлаДляПроцесса(Узел, знач Процесс) Экспорт
	
	Если ТипЗнч(Процесс) = Тип("Строка") Тогда
		Процесс = Перечисления.ПроцессыОбменаДанными[Процесс];
	КонецЕсли;
	
	Запись = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьМенеджерЗаписи();
	Запись.Узел = Узел;
	Запись.Процесс = Процесс;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Запись.Узел = Узел;
		Запись.Процесс = Процесс;
		Запись.Записать();
	КонецЕсли;
	
	Возврат Запись;
	
КонецФункции

Функция ДоступноДляБлокировки(Узел, знач Процесс) Экспорт
	
	Если ТипЗнч(Процесс) = Тип("Строка") Тогда
		Процесс = Перечисления.ПроцессыОбменаДанными[Процесс];
	КонецЕсли;

	Запись = ЗаписьУзлаДляПроцесса(Узел, Процесс);
	Если Не Запись.Выбран() Тогда
		ВызватьИсключение СтрШаблон( НСтр("ru='Невозможно проверить процесс обмена ""%1"" для узла ""%2"": отсутствует запись регистра сведений'"), 
				Процесс, Узел);
	КонецЕсли;
	
	Ключ = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(Новый Структура("Узел, Процесс", Узел, Процесс));
	Результат = Ложь;
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ключ);
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	РазблокироватьДанныеДляРедактирования(Ключ);
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти

//
#КонецЕсли