#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
		Запись = Новый Структура;
		Запись.Вставить("Объект", ЗаписьРегистра.Ссылка);
		Запись.Вставить("Организация", ЗаписьРегистра.Организация);
		Запись.Вставить("Страница", ""); // ДЕНЬГИ Перечисления.СтраницыЖурналаОтчетность.Отчеты);
		Запись.Вставить("КонтролирующийОрган", ЗаписьРегистра.ПредставлениеКонтролирующегоОргана);
		Запись.Вставить("Состояние", ЗаписьРегистра.СостояниеСдачиОтчетности);
		Запись.Вставить("Статус", ЗаписьРегистра.Статус);
		Запись.Вставить("Наименование", ЗаписьРегистра.НаименованиеОтчета);
		Запись.Вставить("НеОтправляетсяВКонтролирующийОрган", ЗаписьРегистра.НеОтправляетсяВКонтролирующийОрган);
		Запись.Вставить("ЕстьОтвет", Ложь);
		Запись.Вставить("ВидКонтролирующегоОргана", ЗаписьРегистра.ВидКонтролирующегоОргана);
		Запись.Вставить("ЕстьКритическиеОшибкиОтправки", ЗаписьРегистра.ЕстьКритическиеОшибкиОтправки);
		Запись.Вставить("Просмотрено", Не ЗаписьРегистра.Непрочтенное);
		Запись.Вставить("Скрыт", ЗаписьРегистра.Скрыт);
		
		// ДЕНЬГИ
		// Удален вызов ЕДО
		// Конец ДЕНЬГИ	
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли


