#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ОбменДанными

// Заполняет настройки, влияющие на использование плана обмена.
// 
// Параметры:
//  Настройки - Структура - настройки плана обмена по умолчанию, см. ОбменДаннымиСервер.НастройкиПланаОбменаПоУмолчанию,
//                          описание возвращаемого значения функции.
//
Процедура ПриПолученииНастроек(Настройки) Экспорт
	
	Настройки.ИмяКонфигурацииИсточника = Метаданные.Имя;
	
	Настройки.НазначениеПланаОбмена = "СинхронизацияСДругойПрограммой";
	
	Настройки.ЭтоПланОбменаXDTO = Истина;
	Настройки.ФорматОбмена = "http://v8.1c.ru/Money/MoneyData";
	
	ВерсииФормата = Новый Соответствие;
	ВерсииФормата.Вставить("2.0",   МенеджерСинхронизацииАвтономныхКопий_10);
	ВерсииФормата.Вставить("1.6.3", МенеджерСинхронизацииАвтономныхКопий_10); // для обратной совместимости
	
	Настройки.ВерсииФорматаОбмена = ВерсииФормата;
	
	Настройки.ПланОбменаИспользуетсяВМоделиСервиса = Истина;
	
	Настройки.Алгоритмы.ПриПолученииВариантовНастроекОбмена   = Истина;
	Настройки.Алгоритмы.ПриПолученииОписанияВариантаНастройки = Истина;
	
	Настройки.Алгоритмы.ПредставлениеОтбораИнтерактивнойВыгрузки = Ложь;
	Настройки.Алгоритмы.НастроитьИнтерактивнуюВыгрузку           = Ложь;
	
	Настройки.Алгоритмы.ОбработчикПроверкиПараметровУчета = Истина;
	Настройки.Алгоритмы.ПриПодключенииККорреспонденту     = Истина;
	
	Настройки.Алгоритмы.ПриОпределенииПоддерживаемыхОбъектовФормата                = Истина;
	Настройки.Алгоритмы.ПриОпределенииПоддерживаемыхКорреспондентомОбъектовФормата = Истина;
	
КонецПроцедуры

// Заполняет коллекцию вариантов настроек, предусмотренных для плана обмена.
// 
// Параметры:
//  ВариантыНастроекОбмена - ТаблицаЗначений - коллекция вариантов настроек обмена, см. описание возвращаемого значения
//                                       функции НастройкиПланаОбменаПоУмолчанию общего модуля ОбменДаннымиСервер.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияВариантовНастроек,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииВариантовНастроекОбмена(ВариантыНастроекОбмена, ПараметрыКонтекста) Экспорт
	
	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	ВариантНастройки.ИдентификаторНастройки        = "";
	ВариантНастройки.КорреспондентВМоделиСервиса   = Истина;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;
	
	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	ВариантНастройки.ИдентификаторНастройки        = "ПолнаяВыгрузка";
	ВариантНастройки.КорреспондентВМоделиСервиса   = Истина;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;
	
	ВариантНастройки = ВариантыНастроекОбмена.Добавить();
	ВариантНастройки.ИдентификаторНастройки        = "ПолнаяЗагрузка";
	ВариантНастройки.КорреспондентВМоделиСервиса   = Истина;
	ВариантНастройки.КорреспондентВЛокальномРежиме = Истина;
	
КонецПроцедуры

// Заполняет набор параметров, определяющих вариант настройки обмена.
// 
// Параметры:
//  ОписаниеВарианта       - Структура - набор варианта настройки по умолчанию,
//                                       см. ОбменДаннымиСервер.ОписаниеВариантаНастройкиОбменаПоУмолчанию,
//                                       описание возвращаемого значения.
//  ИдентификаторНастройки - Строка    - идентификатор варианта настройки обмена.
//  ПараметрыКонтекста     - Структура - см. ОбменДаннымиСервер.ПараметрыКонтекстаПолученияОписанияВариантаНастройки,
//                                       описание возвращаемого значения функции.
//
Процедура ПриПолученииОписанияВариантаНастройки(ОписаниеВарианта, ИдентификаторНастройки, ПараметрыКонтекста) Экспорт
	
	КраткаяИнформацияПоОбмену = "";
	Если ИдентификаторНастройки = "ПолнаяВыгрузка" Тогда
		КраткаяИнформацияПоОбмену = НСтр("ru = 'Выгрузка всех данных информационной базы.'");
	ИначеЕсли ИдентификаторНастройки = "ПолнаяЗагрузка" Тогда
		КраткаяИнформацияПоОбмену = НСтр("ru = 'Перезапись всех данных на входящие записи.'");
	Иначе
		КраткаяИнформацияПоОбмену = НСтр("ru = 'Обмен измененными данными'");
	КонецЕсли;
	
	ОписаниеВарианта.КраткаяИнформацияПоОбмену   = КраткаяИнформацияПоОбмену;
	ОписаниеВарианта.ПодробнаяИнформацияПоОбмену = "";
	
	ОписаниеВарианта.НаименованиеКонфигурацииКорреспондента = НСтр("ru = 'Через универсальный формат обмена'");
	ОписаниеВарианта.ИмяФайлаНастроекДляПриемника           = НСтр("ru = 'Синхронизация данных через универсальный формат'");
	
	ЗаголовокКоманды   = НСтр("ru = 'Синхронизация данных через универсальный формат'");
	ЗаголовокПомощника = "";
	ЗаголовокУзла      = "";
	Если ИдентификаторНастройки = "ПолнаяВыгрузка" Тогда
		
		ЗаголовокКоманды   = НСтр("ru = 'Полная выгрузка'");
		ЗаголовокПомощника = НСтр("ru = 'Настройка выгрузки всех данных'");
		ЗаголовокУзла      = НСтр("ru = 'Отправка полной копии всех данных'");
		
		
	ИначеЕсли ИдентификаторНастройки = "ПолнаяЗагрузка" Тогда
		
		ЗаголовокКоманды   = НСтр("ru = 'Замена всех данных'");
		ЗаголовокПомощника = НСтр("ru = 'Настройка замены всех данных на данные из другого узла'");
		ЗаголовокУзла      = НСтр("ru = 'Замена всех данных на данные из другого узла'");
		
		
	Иначе
		
		ЗаголовокКоманды   = НСтр("ru = 'Синхронизация изменений'");
		ЗаголовокПомощника = НСтр("ru = 'Настройка синхронизации изменений с удаленным узлом'");
		ЗаголовокУзла      = НСтр("ru = 'Синхронизация изменений с удаленным узлом'");
		
	КонецЕсли;
	
	ОписаниеВарианта.ЗаголовокКомандыДляСозданияНовогоОбменаДанными = ЗаголовокКоманды;
	ОписаниеВарианта.ЗаголовокПомощникаСозданияОбмена               = ЗаголовокПомощника;
	ОписаниеВарианта.ЗаголовокУзлаПланаОбмена                       = ЗаголовокУзла;
	
КонецПроцедуры

// Проверяет корректность настройки параметров учета.
//
// Параметры:
//	Отказ - Булево - Признак невозможности продолжения настройки обмена из-за некорректно настроенных параметров учета.
//	Получатель - ПланОбменаСсылка - Узел обмена, для которого выполняется проверка параметров учета.
//	Сообщение - Строка - Содержит текст сообщения о некорректных параметрах учета.
//
Процедура ОбработчикПроверкиПараметровУчета(Отказ, Получатель, Сообщение) Экспорт
	// в текущей версии не используется
	Возврат;
КонецПроцедуры

// Обработчик события при подключении к корреспонденту.
// Событие возникает при успешном подключении к корреспонденту и получении версии конфигурации корреспондента
// при настройке обмена с использованием помощника через прямое подключение
// или при подключении к корреспонденту через Интернет.
// В обработчике можно проанализировать версию корреспондента и,
// если настройка обмена не поддерживается с корреспондентом указанной версии, то вызвать исключение.
//
// Параметры:
//	ВерсияКорреспондента - Строка - версия конфигурации корреспондента, например, "2.1.5.1".
//
Процедура ПриПодключенииККорреспонденту(ВерсияКорреспондента) Экспорт
	
	Если ВерсияКорреспондента = "0.0.0.0" Тогда
		ВерсияКорреспондента = "2.0.34.1";
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияКорреспондента, "2.0.34.1") < 0 Тогда
		
		ВызватьИсключение НСтр("ru = 'Настройка синхронизации данных поддерживается только с конфигурацией
			|""1С:Деньги 8"" версии 2.0.34 и выше.'");
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после определения состава поддерживаемых этой конфигурацией объектов формата.
// Предоставляет возможность дополнить или ограничить состав данных, которые могут участвовать в обмене.
// Используется только для планов обмена XDTO.
//
// Параметры:
//  ПоддерживаемыеОбъекты - ТаблицаЗначений - см. ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФормата.
//  Режим                 - Строка - см. описание одноименного параметра функции ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФормата.
//  УзелОбмена            - ПланОбменаСсылка - узел плана обмена, соответствующий корреспонденту.
//
Процедура ПриОпределенииПоддерживаемыхОбъектовФормата(ПоддерживаемыеОбъекты, Знач Режим, УзелОбмена = Неопределено) Экспорт
	
	НомерВерсии = "2.0";
	Режим = ?(СтрНайти(Нрег(Режим), "получение") > 0, "Получение", "Отправка");
	
	
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ДополнительныеЗначенияВидовАналитик", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСубконтоАналитика", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ВидыАналитик", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НастройкиАналитикиВДокументахПоУмолчанию", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НастройкиАналитикиПоСтатьям", Режим);
	
	Если Не УзелОбмена.МобильноеУстройство Тогда
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ДополнительныеРеквизитыИСведения", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияДополнительныхРеквизитов", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСвойствОбъектов", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСвойствОбъектовГруппа", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСвойствОбъектовИерархия", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НаборыДополнительныхРеквизитовИСведений", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НаборыДополнительныхРеквизитовИСведенийГруппа", Режим);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после определения состава поддерживаемых конфигурацией-корреспондентом объектов формата.
// Предоставляет возможность дополнить или ограничить состав данных, которые могут участвовать в обмене.
// Используется только для планов обмена XDTO.
//
// Параметры:
//  УзелОбмена            - ПланОбменаСсылка - узел плана обмена, соответствующий корреспонденту.
//  ПоддерживаемыеОбъекты - ТаблицаЗначений - см. ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФорматаКорреспондента.
//  Режим                 - Строка - см. описание одноименного параметра функции ОбменДаннымиXDTOСервер.ПоддерживаемыеОбъектыФорматаКорреспондента.
//
Процедура ПриОпределенииПоддерживаемыхКорреспондентомОбъектовФормата(УзелОбмена, ПоддерживаемыеОбъекты, Знач Режим) Экспорт
	
	НомерВерсии = "2.0";
	Режим = ?(СтрНайти(Нрег(Режим), "получение") > 0, "Получение", "Отправка");
	
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ДополнительныеЗначенияВидовАналитик", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСубконтоАналитика", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ВидыАналитик", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НастройкиАналитикиВДокументахПоУмолчанию", Режим);
	СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НастройкиАналитикиПоСтатьям", Режим);
	
	Если Не УзелОбмена.МобильноеУстройство Тогда
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ДополнительныеРеквизитыИСведения", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияДополнительныхРеквизитов", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСвойствОбъектов", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСвойствОбъектовГруппа", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.ЗначенияСвойствОбъектовИерархия", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НаборыДополнительныхРеквизитовИСведений", Режим);
		СтрокаОбъектаФормата(ПоддерживаемыеОбъекты, НомерВерсии, "Справочник.НаборыДополнительныхРеквизитовИСведенийГруппа", Режим);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбменДанными

#КонецОбласти

// Возвращает массив узлов обмена, для которых обмен не запрещен.
//
Функция ПолучитьИспользуемыеУзлыПланаОбмена() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	План.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.СинхронизацияАвтономныхКопий КАК План
		|ГДЕ
		|	План.Активность
		|	И Не План.ЭтотУзел");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Расчет параметров выгрузки по умолчанию.
//
// Параметры:
//     Получатель - ПланОбменаСсылка - Узел, для которого производится настройка.
//
// Возвращаемое значение - Структура - содержит поля:
//     ПредставлениеОтбора - Строка - текстовое описание отбора по умолчанию.
//     Период              - СтандартныйПериод     - значение периода общего отбора по умолчанию.
//     Отбор               - ОтборКомпоновкиДанных - отбор.
//
Функция ПараметрыВыгрузкиПоУмолчанию(Получатель) Экспорт
	
	Результат = Новый Структура;
	
	Возврат Результат;
КонецФункции

Функция СтрокаОбъектаФормата(ТаблицаОбъектов, Версия, Объект, Режим) 
	
	Результат = ТаблицаОбъектов.Добавить();
	Результат.Версия    = Версия;
	Результат.Объект    = Объект;
	Если Режим = "Отправка" Тогда
		Результат.Отправка = Истина;
	Иначе
		Результат.Получение = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Процедура ОчиститьКодЦентральнойБазы() Экспорт
	
	УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	Если ЗначениеЗаполнено(УзелЦБ) Тогда
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.СинхронизацияАвтономныхКопий");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", УзелЦБ);
			Блокировка.Заблокировать();
			
			ЗаблокироватьДанныеДляРедактирования(УзелЦБ);
			ОбъектУзла = УзелЦБ.ПолучитьОбъект();
			
			ОбъектУзла.Код = "000";
			ОбъектУзла.ОбменДанными.Загрузка = Истина;
			ОбъектУзла.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение ;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
