#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Активность              = Истина;
		ВерсияФорматаОбмена     = СинхронизацияАвтономныхКопийКлиентСервер.ТекущаяВерсияФормата();
		РегистрироватьИзменения = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// обработка лицензий в тарификации не зависи от режима обмена данными
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	СинхронизацияАвтономныхКопий.УзелОбменаПередЗаписью(ЭтотОбъект, Отказ);
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СинхронизацияЗапрещена И НЕ Ссылка.СинхронизацияЗапрещена Тогда
		Активность = Ложь;
	ИначеЕсли ПометкаУдаления И Активность И НЕ Ссылка.Активность Тогда
		ПометкаУдаления        = Ложь;
		СинхронизацияЗапрещена = Ложь;
	ИначеЕсли ПометкаУдаления И НЕ Ссылка.ПометкаУдаления И Активность Тогда
		Активность = Ложь;
	КонецЕсли;
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(ВерсияФорматаОбмена) Тогда
		ВерсияФорматаОбмена     = СинхронизацияАвтономныхКопийКлиентСервер.ТекущаяВерсияФормата();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	 
	СинхронизацияАвтономныхКопий.УзелОбменаПриЗаписи(ЭтотОбъект, Отказ);
	Если Не Отказ И Режим = "Разделенный" Тогда
		МодульДеньгиБиллинг = ОбщегоНазначения.ОбщийМодуль("ОСДБиллинг");
		МодульДеньгиБиллинг.УзелОбменаПриЗаписи(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если Не ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(Ссылка) И Режим <> "Неразделенный" Тогда
		ОбменДаннымиСервер.ЗавершитьНастройкуСинхронизацииДанных(Ссылка);
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПолучениеСообщенияОбмена") Тогда
		ОбновитьСтатистикуСправочников(Режим);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьСтатистикуСправочников(Режим)
	
	Если Режим = "Неразделенный" Или Режим = "Разделенный" Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		БюджетированиеСервер.ОбновитьВсеКлючиСтатейБюджета();
	Исключение
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизаиция автономных копий.Прием.Загрузка",
			УровеньЖурналаРегистрации.Ошибка, , Ссылка, 
			"Не удалось обновить ключи статей бюджета по причине:
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Попытка
		РегистрыСведений.СтатистикаСправочников.ОбновитьВсюСтатистикуСправочников();
	Исключение
		ЗаписьЖурналаРегистрации("Обмен данными.Синхронизаиция автономных копий.Прием.Загрузка",
			УровеньЖурналаРегистрации.Ошибка, , Ссылка, 
			"Не удалось обновить статистику справочников по причине:
			|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры


#КонецОбласти


#КонецЕсли
