///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает текущее состояние обмена данными для указанного узла плана обмена
//
//Параметры:
//	УзелКорреспондента - ПланОбменаСсылка - узел, для которого нужно получить состояние обмена.
//			 Пустое значение приравнивается к узлу центральной базы в плане обмена СинхронизацияАвтономныхКопий
//
//Возвращаемое значение:
//	Структура - см. НовыйСтуктураСостоянияОбмена()
//
Функция СостояниеОбмена(ВидТранспорта = Неопределено)  Экспорт
	
	Если Не ЗначениеЗаполнено(ВидТранспорта) Тогда
		СвойстваАккаунта = Неопределено;
		ОблачныйПровайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
		ВидТранспорта = СинхронизацияАвтономныхКопий.ВидТранспортаПоПровайдеру(ОблачныйПровайдер);
	КонецЕсли;
	
	Состояние = НовыйСтруктураСостоянияОбменаФайлами(ВидТранспорта);
	ЗаполнитьСостояниеИзРегистра(Состояние);

	ОбновитьОбщиеСвойстваСостоянияПроцессов(Состояние, Истина, Неопределено);
	
	Возврат Состояние;
	
КонецФункции

Процедура ПродолжитьОбменФайлами(СостояниеОбмена = Неопределено, ВидТранспорта = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена) Тогда
		СостояниеОбмена = СостояниеОбмена(ВидТранспорта);
	КонецЕсли;
	
	ДополнительныеПараметры = ДополнительныеПараметрыПроцесса(ВидТранспорта);
	ВсеКоды = ДополнительныеПараметры.ВсеКодыРезультатов;
	
	// Проверить вид транспорта в сохраненном состоянии
	ПроверитьВидТранспорта(СостояниеОбмена);
	
	// Проверить настройки соединения с провайдером
	Если Не ПроверитьНастройкиТранспорта(СостояниеОбмена, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СостояниеОбмена.ДействиеПроцесса)
		Или ОбменНужноНачатьЗаново(СостояниеОбмена, ДополнительныеПараметры) Тогда
		// обмен не начинался
	 	// выполнить/продолжить получение файлов
	 	ПроверитьФайлСпискаУстройств(СостояниеОбмена, ДополнительныеПараметры, "Получение");
	 	Если ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
		 	ПолучитьФайлыИзОблачногоХранилища(СостояниеОбмена, ДополнительныеПараметры);
	 	КонецЕсли;
		
	ИначеЕсли СостояниеОбмена.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение Тогда
		 Если СостояниеОбмена.КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
		 	// получение файлов завершено, приступить к загрузке
		 	ЗагрузитьПолученныеПакеты(СостояниеОбмена, ДополнительныеПараметры);
		 ИначеЕсли Не ЗначениеЗаполнено(СостояниеОбмена.КодРезультатаДействия) Тогда 
		 	// выполнить/продолжить получение файлов
		 	ПолучитьФайлыИзОблачногоХранилища(СостояниеОбмена, ДополнительныеПараметры);
		 Иначе
		 	// получение завершилось ошибкой. Переход к выгрузке изменений
		 	ВыгрузитьИзменения(СостояниеОбмена, ДополнительныеПараметры);
		 КонецЕсли;
		 
	ИначеЕсли СостояниеОбмена.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка Тогда
		 Если СостояниеОбмена.КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
		 	// загрузка завершена, приступить к выгрузке изменений
		 	ВыгрузитьИзменения(СостояниеОбмена, ДополнительныеПараметры);
		 ИначеЕсли Не ЗначениеЗаполнено(СостояниеОбмена.КодРезультатаДействия) Тогда 
		 	// выполнить/продолжить загрузку полученных файлов
		 	ЗагрузитьПолученныеПакеты(СостояниеОбмена, ДополнительныеПараметры);
		 Иначе
		 	// загрузка завершилась ошибкой. Переход к выгрузке изменений
		 	ВыгрузитьИзменения(СостояниеОбмена, ДополнительныеПараметры);
		 КонецЕсли;
		 
	ИначеЕсли СостояниеОбмена.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Выгрузка Тогда
		 Если СостояниеОбмена.КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
		 	// выгрузка завершена, приступить к отправке файлов
		 	ОтправитьФайлыВОблачноеХранилище(СостояниеОбмена, ДополнительныеПараметры);
		 Иначе
		 	// выполнить/продолжить выгрузку изменений
		 	ВыгрузитьИзменения(СостояниеОбмена, ДополнительныеПараметры);
		 КонецЕсли;
		 
	ИначеЕсли СостояниеОбмена.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка Тогда
		 Если Не ЗначениеЗаполнено(СостояниеОбмена.КодРезультатаДействия) Тогда
		 	// выполнить/продолжить отправку файлов
		 	ОтправитьФайлыВОблачноеХранилище(СостояниеОбмена, ДополнительныеПараметры);
		 Иначе
		 	// обработка завершенной отправки делается в первом условии 
		 КонецЕсли;
		 
	КонецЕсли;
	
	
КонецПроцедуры

Функция ОбменНужноНачатьЗаново(СостояниеОбмена, ДополнительныеПараметры, СбрасыватьСостояние = Истина)
	
	Результат = Ложь;
	
	ВсеКоды = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если СостояниеОбмена.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка 
		И ЗначениеЗаполнено(СостояниеОбмена.КодРезультатаДействия) Тогда

		Результат = СостояниеОбмена.КодРезультатаДействия <> ВсеКоды.Выполнено.Код
			Или ТекущаяДатаСеанса() - СостояниеОбмена.ЗавершениеДействия >= 180;
		
	КонецЕсли;
	
	Если Результат И СбрасыватьСостояние Тогда
		СброситьСостояние(СостояниеОбмена);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Переводит состояние автомата в начальное состояние
//
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//
Процедура СброситьСостояние(Состояние) Экспорт
	
	ВидТранспорта = ?(ЗначениеЗаполнено(Состояние.ТекущийВидТранспорта), Состояние.ТекущийВидТранспорта,
				Перечисления.ВидыТранспортаСообщенийОбмена.FILE);
	
	Если ЗначениеЗаполнено(Состояние.Корреспонденты) Тогда
		Для Каждого ОписаниеУзла Из Состояние.Корреспонденты Цикл
			Если ОписаниеУзла <> Неопределено И ЗначениеЗаполнено(ОписаниеУзла.Узел) Тогда
				СостояниеУзла = ?(ЗначениеЗаполнено(ОписаниеУзла.СостояниеОбмена), 
							ОписаниеУзла.СостояниеОбмена, 
							ПроцессыОбменаСлужебный.СостояниеОбмена(ОписаниеУзла.Узел, Состояние.ВидТранспорта));
				ПроцессыОбменаСлужебный.СброситьСостояние(СостояниеУзла);
				РегистрыСведений.ПакетыСинхронизацииКОтправке.УдалитьПакеты(ОписаниеУзла.Узел, Неопределено);
				РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(ОписаниеУзла.Узел, Неопределено);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Состояние = НовыйСтруктураСостоянияОбменаФайлами(ВидТранспорта);
	
	ЗаписатьСостояниеВРегистр(Состояние);
	ОбновитьОбщиеСвойстваСостоянияПроцессов(Состояние, Ложь, Неопределено);
	
КонецПроцедуры

// Делает отметку о начале выполнения действия обмена данными. При этом обнуляются результаты действия и 
// обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	НомерПакета - Число - номре отправляемого или получаемого пакета. Если Неопределено - не изменяется
//	КоличествоЧастей - Число - количество частей пакета к получению или отправке. Если Неопределено - не изменяется
//	НомерОбработаннойЧасти - Число - номер последней полученной или отправленной части пакета. Если Неопределено - не изменяется
//
Процедура ОтметитьНачалоДействия(Состояние, знач Действие, знач ВсегоУзлов = Неопределено, знач ОбработаноУзлов = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Состояние = СостояниеОбмена();
	КонецЕсли;
	
	Если ТипЗнч(Действие) = Тип("Строка") Тогда
		Действие = Перечисления.ДействияПроцессовОбмена[Действие];
	КонецЕсли;
	
	Состояние.ПроцессЗавершен        = Ложь;
	Состояние.ДействиеПроцесса       = Действие;
	Состояние.КодРезультатаДействия  = 0;
	Состояние.НачалоДействия         = ТекущаяДатаСеанса();
	Состояние.ЗавершениеДействия     = Дата(1,1,1);
	Состояние.ТекстОшибки            = "";
	Состояние.ВидТранспорта          = Состояние.ТекущийВидТранспорта;
	
	ОбновитьСтатистикуДействия(Состояние, ВсегоУзлов, ОбработаноУзлов);
	
КонецПроцедуры

// Обновляет номера-количества в состоянии процесс и одновременно обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	НомерПакета - Число - номре отправляемого или получаемого пакета. Если Неопределено - не изменяется
//	КоличествоЧастей - Число - количество частей пакета к получению или отправке. Если Неопределено - не изменяется
//	НомерОбработаннойЧасти - Число - номер последней полученной или отправленной части пакета. Если Неопределено - не изменяется
//
Процедура ОбновитьСтатистикуДействия(Состояние, знач ВсегоУзлов, знач ОбработаноУзлов) Экспорт
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Состояние = СостояниеОбмена();
	КонецЕсли;
	
	Если ВсегоУзлов <> Неопределено Тогда
		Состояние.Количество              = ВсегоУзлов;
	КонецЕсли;
	Если ВсегоУзлов <> Неопределено Тогда
		Состояние.НомерОбработанного     = ОбработаноУзлов;
	КонецЕсли;
	
	ЗаписатьСостояниеВРегистр(Состояние);
	ОбновитьОбщиеСвойстваСостоянияПроцессов(Состояние, Ложь, Неопределено);
	
КонецПроцедуры

// Делает отметку о завершении действия обмена данными, устанавливая код состояния, текст ошибки и т.д. 
// При этом обновляется запись в РС СостоянияПроцессовОбменаДанными
// 
//Параметры:
//	Состояние - Структура - параметры состояния процессов обмена данными (см. НовыйСтуктураСостоянияОбмена())
//	Процесс - Стрка - процесс, для которого начинается действие
//	Действие - Стрка или ПеречислениеСсылка.ДействияПроцессаСинхронизации - действие, наичнаемое в данный момент
//	КодРезультатаДействия - Число - код, соответствующий результату. см. ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий()
//	Ошибка - Строка - текст ошибки, если таковая возникла
//
Процедура ОтметитьЗавершениеДействия(Состояние, знач Действие, знач КодРезультатаДействия, знач Ошибка = "",
								знач ВсегоУзлов, знач ОбработаноУзлов) Экспорт
	
	Если Не ЗначениеЗаполнено(Состояние) Тогда
		Состояние = СостояниеОбмена();
	КонецЕсли;
	
	Если ТипЗнч(Действие) = Тип("Строка") Тогда
		Действие = Перечисления.ДействияПроцессовОбмена[Действие];
	КонецЕсли;
	
	Состояние.ДействиеПроцесса       = Действие;
	Состояние.КодРезультатаДействия  = КодРезультатаДействия;
	Состояние.ЗавершениеДействия     = ТекущаяДатаСеанса();
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		Состояние.ТекстОшибки            = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		Состояние.ТекстОшибки            = Ошибка;
	КонецЕсли;
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	Состояние.ПроцессЗавершен = 
		ЗначениеЗаполнено(Состояние.КодРезультатаДействия) 
				И Состояние.КодРезультатаДействия <> ВсеКоды.Выполнено.Код
		Или Состояние.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Отправка 
				И Состояние.КодРезультатаДействия = ВсеКоды.Выполнено.Код; 
	
	ЗаписатьСостояниеВРегистр(Состояние);
	ОбновитьОбщиеСвойстваСостоянияПроцессов(Состояние, Ложь, Неопределено);
	
КонецПроцедуры

Функция ОбменСОблачнымХранилищемВручную(ВидТранспорта, Форма) Экспорт
	
	// параметры метода, выполняемого в фоне
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("Транспорт",     Неопределено);
	ПараметрыМетода.Вставить("ВидТранспорта", ВидТранспорта);
	ПараметрыМетода.Вставить("СпособЗапуска", "Интерактивно");
	
	АдресРезультата    = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	АдресДопРезультата = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	
	МассивПараметров = Новый Массив(3);
	МассивПараметров[0] = ПараметрыМетода;
	МассивПараметров[1] = АдресРезультата;
	МассивПараметров[2] = АдресДопРезультата;
	
	Задание = РегламентноеЗаданиеОбмена(Ложь);
	Задание.Параметры = МассивПараметров;
	УстановитьПривилегированныйРежим(Истина);
	Задание.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатЗапуска = РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(Задание);
	
	ПроверитьПараметрыРегламентногоЗадания(Задание, Истина);
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(РезультатЗапуска.ИдентификаторФоновогоЗадания) И РезультатЗапуска.ЗапускВыполнен Тогда
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(
							Новый УникальныйИдентификатор(РезультатЗапуска.ИдентификаторФоновогоЗадания));
		Результат =  ОбщегоНазначенияДеньги.СтруктраСвойствФоновогоЗадания(ФоновоеЗадание, 
							АдресРезультата, АдресДопРезультата);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьФайлСпискаУстройствВОблаке(СостояниеОбмена, ДополнительныеПараметры, ТекстОшибки = "") Экспорт

	// Проверка существования файла по указанному пути
	ПолныйПутьВОблаке = СокрЛП(ДополнительныеПараметры.ИмяФайлаСпискаУстройств);
	ПолныйПутьЛокальный = ДополнительныеПараметры.ВременныйКаталог + ДополнительныеПараметры.ИмяФайлаСпискаУстройств;
	
	// Создание нового файла
	ОбменМобильноеПриложение.ЗаписатьНовыйФайлСпискаУстройств(ПолныйПутьЛокальный);
		
	// отправка файла в облако
	СтруктураРезультата = RESTВызовСервера.ЗагрузитьФайлВОблако(ДополнительныеПараметры.Провайдер, 
			ПолныйПутьЛокальный, ПолныйПутьВОблаке, 
			ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера); 
	
	ВсеКоды = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если Не СтруктураРезультата.ВыполненоУспешно Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при отправке в облако списка устройств %1. Описание ошибки: %2'")
				,ПолныйПутьВОблаке ,СтруктураРезультата.ОписаниеОшибки);
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, "Получение", ВсеКоды.СерверНедоступен.Код, ТекстОшибки, , );;
		КонецЕсли;

		Возврат Ложь;
		
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция ОблачноеХранилищеГотовоКОбмену(ВидТранспорта, Провайдер, ТекстОшибки) Экспорт
	
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВсеКодыРезультатов", ВсеКоды);
	ДополнительныеПараметры.Вставить("ВременныйКаталог", 
		ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ОбменДаннымиСервер.СоздатьВременныйКаталогСообщенийОбмена()));
	ДополнительныеПараметры.Вставить("ИмяФайлаСпискаУстройств", ОбменМобильноеПриложение.ПолучитьИмяФайлаСпискаУстройств());
	
	СвойстваАккаунта   = Неопределено;
	СвойстваПровайдера = Неопределено;
	RESTВызовСервера.ПроверитьСвойстваАккаунтаИПровайдера(Провайдер, СвойстваАккаунта, СвойстваПровайдера);
	ДополнительныеПараметры.Вставить("СвойстваАккаунта", СвойстваАккаунта);
	ДополнительныеПараметры.Вставить("СвойстваПровайдера", СвойстваПровайдера);
	ДополнительныеПараметры.Вставить("Провайдер", Провайдер);
	
	// Проверить настройки транспортв
	Если Не ПроверитьНастройкиТранспорта(Неопределено, ДополнительныеПараметры, ТекстОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// проверить/создать файл списка устройств в облаке
	Если Не ПроверитьФайлСпискаУстройств(Неопределено, ДополнительныеПараметры, "Получение", ТекстОшибки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// проверить файл списка устройств
	Возврат Истина;
	
КонецФункции

// Метод, назначенный регламентному заданию ОбменФайламиСМобильными
//
//Параметры:
//	ПараметрыМетода - Структура - входящие параметры
//		* Транспорт - СправочникСсылка.ТранспортыОбменаДанными
//		* ВидТранспорта - ПеречислениеСсылка.ВидыТранспортаСообщенийОбмена
//		* СпособЗапуска - Строка - "интерактивно" или "в фоне" (пустая строка соответствует значению "в фоне)
//
Процедура ОбработчикРеглЗаданияОбменЧерезОблачноеХранилище(ПараметрыМетода = Неопределено, АдресРезультата = Неопределено, АдресДополнительногоРезультата = Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбменФайламиСМобильными);
	
	НаименованиеЗадания = НСтр("ru='Обмен файлами с мобильными устройствами'");
	Если Не ПолучитьФункциональнуюОпцию("ДеньгиИспользуетсяОбменСМобильными") Тогда
		ВызватьИсключение СтрШаблон( НСтр("ru='Регламентное задание ""%1"" недоступно по функциональным опциям'"), 
				НаименованиеЗадания);
	КонецЕсли;
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим <> "ЦентрМобильных" Тогда
		// некорректный режим использования регламентного задания
		ВызватьИсключение СтрШаблон( НСтр("ru='Регламентное задание ""%1"" недоступно в режиме работы ""%2""'"), 
				НаименованиеЗадания, Режим);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыМетода) Тогда
		ПараметрыМетода = Новый Структура("Транспорт,ВидТранспорта,СпособЗапуска", 
				Неопределено, Неопределено, "в фоне");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПараметрыМетода.Транспорт) Тогда
		СвойстваАккаунта = Неопределено;
		ОблачныйПровайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
		Если Не ЗначениеЗаполнено(ОблачныйПровайдер) Тогда
			ВызватьИсключение НСтр("ru='не задан облачный провайдер для обмена файлами'");
		КонецЕсли;
		ПараметрыМетода.Транспорт = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(ОблачныйПровайдер);
		ПараметрыМетода.ВидТранспорта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыМетода.Транспорт, "ВидТранспорта");
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Обмен данными.Мобильное приложение.Регламентное задание",
			УровеньЖурналаРегистрации.Информация, 
			Метаданные.РегламентныеЗадания.ОбменФайламиСМобильными, ,
			?(Нрег(ПараметрыМетода.СпособЗапуска) = "интерактивно", НСтр("ru='Запуск обмена файлами вручную'"), 
					НСтр("ru='Старт регламентного задания обмена файлами'")));
	
	СостояниеОбмена = СостояниеОбмена(ПараметрыМетода.ВидТранспорта);
	ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	
	Если Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить() 
		И Нрег(ПараметрыМетода.СпособЗапуска) <> "интерактивно" Тогда
		// автоматическая синхрнизация приостановлена пользователем
		ТекстОшибки = СтрШаблон( НСтр("ru='Регламентное задание ""%1"" отменено: выбран способ обмена файлами ""Вручную""'"), 
				НаименованиеЗадания);
		ОтметитьЗавершениеДействия(СостояниеОбмена, 
			?(ЗначениеЗаполнено(СостояниеОбмена.ДействиеПроцесса), СостояниеОбмена.ДействиеПроцесса, "Получение"),
			ВсеКоды.ОперацияОтменена.Код, ТекстОшибки, 0, 0);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ПараметрыОблачногоХранилищаФайлов = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(ПараметрыМетода.Транспорт, Ложь);
	Если ПараметрыОблачногоХранилищаФайлов.ЗапретитьИспользование Тогда
		ТекстОшибки = СтрШаблон( НСтр("ru='Регламентное задание ""%1"" недоступно: в настройках запрещен обмен через облачное хранилище файлов'"), 
				НаименованиеЗадания);
		ОтметитьЗавершениеДействия(СостояниеОбмена, 
			?(ЗначениеЗаполнено(СостояниеОбмена.ДействиеПроцесса), СостояниеОбмена.ДействиеПроцесса, "Получение"),
			ВсеКоды.ОперацияОтменена.Код, ТекстОшибки, 0, 0);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	СостояниеОбмена = СостояниеОбмена(ПараметрыМетода.ВидТранспорта);
	Если Нрег(ПараметрыМетода.СпособЗапуска) = "интерактивно" Тогда
		ОбменМобильноеПриложение.ВыполнитьОбменЧерезОблачноеХранилищеФайлов(ПараметрыМетода.Транспорт);
	Иначе
		ПродолжитьОбменФайлами(СостояниеОбмена, СостояниеОбмена.ТекущийВидТранспорта);
	КонецЕсли;
	
КонецПроцедуры

Функция РегламентноеЗаданиеОбмена(ОбновлятьПараметры = Ложь) Экспорт
	
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	Если Режим = "Разделенный" Или Режим = "Неразделенный" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбменФайламиСМобильными);
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	
	Если ЗначениеЗаполнено(СписокЗаданий) Тогда
		ПроцессыОбменаСлужебный.ПроверитьСписокЗаданийНаДубли(СписокЗаданий);
		Задание = СписокЗаданий[0];
	Иначе
		Отбор.Вставить("Использование", ПолучитьФункциональнуюОпцию("ДеньгиИспользуетсяОбменСМобильными"));
		Задание = РегламентныеЗаданияСервер.ДобавитьЗадание(Отбор);
	КонецЕсли;
	
	Если ОбновлятьПараметры Тогда
		ПроверитьПараметрыРегламентногоЗадания(Задание, Истина);
	КонецЕсли;

	Возврат Задание;
	
КонецФункции

Процедура ПроверитьПараметрыРегламентногоЗадания(Задание, Записывать = Истина) Экспорт
	
	ПараметрыМетода = Новый Структура("Транспорт,ВидТранспорта,СпособЗапуска");
	ПараметрыМетода.СпособЗапуска = "в фоне"; // остальные значения заполняются в обработчике из текущих настроек
	МассивПараметров = Новый Массив(2);
	МассивПараметров[0] = ПараметрыМетода;
	МассивПараметров[1] = Неопределено;
	
	Задание.Параметры = МассивПараметров;
	
	Если Записывать Тогда
		УстановитьПривилегированныйРежим(Истина);
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ФоновоеЗаданиеОбмена(ТолькоАктивное = Истина) Экспорт
	
	Задание = РегламентноеЗаданиеОбмена();
	Результат = ПроцессыОбменаСлужебный.ФоновоеЗаданиеОбмена(Задание);
	
	Если ТолькоАктивное И Результат <> Неопределено И Результат.Статус <> "Выполняется" Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьФайлСпискаУстройств(СостояниеОбмена, ДополнительныеПараметры, ДействиеОбмена = "Получение", ТекстОшибки = "") Экспорт
	
	Если СостояниеОбмена <> Неопределено И СостояниеОбмена.ТекущийВидТранспорта = Перечисления.ВидыТранспортаСообщенийОбмена.FILE Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Список устройств не доступен для вида транспорта ""%1""'"), 
				СостояниеОбмена.ТекущийВидТранспорта);
		Возврат Ложь;
	КонецЕсли;
	
	Если СостояниеОбмена <> Неопределено Тогда
		СостояниеОбмена.Корреспонденты.Очистить();
	КонецЕсли;
	
	ИмяФайлаСпискаУстройств = ДополнительныеПараметры.ИмяФайлаСпискаУстройств;
	
	// Проверка существования файла по указанному пути
	ПолныйПутьВОблаке = СокрЛП(ИмяФайлаСпискаУстройств);
	СтруктураРезультата = RESTВызовСервера.ПолучитьИнформациюОРесурсе(ДополнительныеПараметры.Провайдер, 
				ПолныйПутьВОблаке, 
				ДополнительныеПараметры.СвойстваАккаунта, 
				ДополнительныеПараметры.СвойстваПровайдера);
	
	ВсеКоды = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если Не СтруктураРезультата.ВыполненоУспешно Тогда
		// запрос к серверу завершился ошибкой
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось проверить наличие файла со списком устройств на сервере:
				|%1'")
				,Строка(СтруктураРезультата.КодСостояния) +": " + СтруктураРезультата.ОписаниеОшибки);
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, ДействиеОбмена, ВсеКоды.СерверНедоступен.Код, ТекстОшибки, , );
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Если Не СтруктураРезультата.Результат.Существует Тогда
		// файла в облаке нет
		Если Не СоздатьФайлСпискаУстройствВОблаке(СостояниеОбмена, ДополнительныеПараметры, ТекстОшибки) Тогда
			Если СостояниеОбмена <> Неопределено Тогда
				ОтметитьЗавершениеДействия(СостояниеОбмена, ДействиеОбмена, ВсеКоды.НетФайлаСпискаУстройств.Код, , , );
			КонецЕсли;
			ТекстОшибки = ВсеКоды.НетФайлаСпискаУстройств.ТекстОписания;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Получение файла из облака
	ПолныйПутьЛокальный = ДополнительныеПараметры.ВременныйКаталог + ИмяФайлаСпискаУстройств;
	СтруктураРезультата = RESTВызовСервера.СкачатьФайлИзОблака(
				ДополнительныеПараметры.Провайдер, 
				ПолныйПутьВОблаке, ПолныйПутьЛокальный, 
				ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
	
	ФайлСпискаУстройств = Новый Файл(ПолныйПутьЛокальный);
	
	Если Не СтруктураРезультата.ВыполненоУспешно Тогда
		// при получении файла из облака произошла ошибка 
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при получении из облака списка устройств. Описание ошибки: %1'")
				,СтруктураРезультата.ОписаниеОшибки);
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, ДействиеОбмена, ВсеКоды.СерверНедоступен.Код, ТекстОшибки, , );
		КонецЕсли;
	
		// При ошибке могут оставаться файлы нулевого размера
		Если ФайлСпискаУстройств.Существует() И Не ОбменМобильноеПриложение.ФайлСодержитСписокУстройств(ФайлСпискаУстройств) Тогда
			УдалитьФайлы(ФайлСпискаУстройств.ПолноеИмя);
		КонецЕсли; 
	
		Возврат Ложь;
		
	КонецЕсли;

	
	// Проверка полученного файла
	Если Не ФайлСпискаУстройств.Существует() Или Не ОбменМобильноеПриложение.ФайлСодержитСписокУстройств(ФайлСпискаУстройств) Тогда
		
		Если Не СоздатьФайлСпискаУстройствВОблаке(СостояниеОбмена, ДополнительныеПараметры, ТекстОшибки) Тогда
			// завершение отметится автоматически, если метод вернул Ложь
			Возврат Ложь;
		КонецЕсли;
		
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, ДействиеОбмена, ВсеКоды.ФайлСпискаУстройствПустой.Код, , , );
			ТекстОшибки = ВсеКоды.ФайлСпискаУстройствПустой.ТекстОписания;
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка содержимого файла
	КодВладельца = "";
	СписокКодовУстройств = Новый Массив;;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПолныйПутьЛокальный);
	Пока ЧтениеXML.Прочитать() Цикл
	
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Owner" Тогда
			
			КодВладельца = ЧтениеXML.ПолучитьАтрибут("Code");
			
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "MobileApp" Тогда
			
			КодУстройства = ЧтениеXML.ПолучитьАтрибут("Code");
			Если ЗначениеЗаполнено(КодУстройства) Тогда
				СписокКодовУстройств.Добавить(КодУстройства);
			КонецЕсли; 
			
		КонецЕсли; 
	
	КонецЦикла;
	ЧтениеXML.Закрыть();
	
	КодЭтогоУзла = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла("МобильноеПриложение");
	Если КодВладельца <> КодЭтогоУзла Тогда
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, ДействиеОбмена, ВсеКоды.ФайлСпискаЧужой.Код, , , );;
		КонецЕсли;
		
		ТекстОшибки = ВсеКоды.ФайлСпискаЧужой.ТекстОписания;
		Возврат Ложь;
		
	ИначеЕсли Не ЗначениеЗаполнено(СписокКодовУстройств) Тогда
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, ДействиеОбмена, ВсеКоды.ФайлСпискаУстройствПустой.Код, , , );;
			ТекстОшибки = ВсеКоды.ФайлСпискаУстройствПустой.ТекстОписания;
			Возврат Ложь;
		КонецЕсли;
			 
	КонецЕсли; 
	
	Если СостояниеОбмена <> Неопределено Тогда
		// заполнение списка устройств
	
		Для Каждого КодУстройства Из СписокКодовУстройств Цикл
			
			СтруктураКорреспондента = Новый Структура("Код,Узел,Активность,ИмяВходящегоФайла,ИмяИсходящегоФайла,СостояниеОбмена", 
						КодУстройства);
			Узел = СинхронизацияАвтономныхКопий.УзелПланаОбменаПоКоду("МобильноеПриложение", КодУстройства, Истина, 
							СтрШаблон(НСтр("ru='Новое устройство %1'"), Прав(КодУстройства, 6)));
			Если ЗначениеЗаполнено(Узел) Тогда
				СтруктураКорреспондента.Узел = Узел;
				СвойстваУзла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Узел, "Активность,ПометкаУдаления");
				СтруктураКорреспондента.Активность = СвойстваУзла.Активность И Не СвойстваУзла.ПометкаУдаления;
			КонецЕсли;
			СтруктураКорреспондента.ИмяВходящегоФайла = 
					СинхронизацияАвтономныхКопий.ИмяФайлаСообщенияОбмена(КодУстройства, КодЭтогоУзла, Ложь);
			СтруктураКорреспондента.ИмяИсходящегоФайла = 
					СинхронизацияАвтономныхКопий.ИмяФайлаСообщенияОбмена(КодЭтогоУзла, КодУстройства, Ложь);
			
			СостояниеОбмена.Корреспонденты.Добавить(СтруктураКорреспондента);
			
		КонецЦикла;
			
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ДополнительныеПараметрыПроцесса(ВидТранспорта) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ВсеКодыРезультатов", ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий());
	Результат.Вставить("ВсеКодыСостояний", ПроцессыОбменаПовтИсп.ВсеКодыСостоянияСервера());
	Результат.Вставить("ВременныйКаталог", 
		ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ОбменДаннымиСервер.СоздатьВременныйКаталогСообщенийОбмена()));
	Результат.Вставить("ИмяФайлаСпискаУстройств", ОбменМобильноеПриложение.ПолучитьИмяФайлаСпискаУстройств());
	
	СвойстваАккаунта   = Неопределено;
	СвойстваПровайдера = Неопределено;
	Провайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
	RESTВызовСервера.ПроверитьСвойстваАккаунтаИПровайдера(Провайдер, СвойстваАккаунта, СвойстваПровайдера);
	Результат.Вставить("СвойстваАккаунта", СвойстваАккаунта);
	Результат.Вставить("СвойстваПровайдера", СвойстваПровайдера);
	Результат.Вставить("Провайдер", Провайдер);
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция НовыйСтруктураСостоянияОбменаФайлами(ВидТранспорта)
	
	Результат = Новый Структура;
	
	ЭтотУзел = СинхронизацияАвтономныхКопийВызовСервера.ЭтотУзел("МобильноеПриложение");
	Результат.Вставить("ЭтотУзел", ЭтотУзел);
	Результат.Вставить("КодЭтогоУзла", СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла("МобильноеПриложение"));
	Результат.Вставить("Режим", ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения()); 
	Результат.Вставить("ЭтоЦентральнаяБаза", Результат.Режим = "ЦентрМобильных" Или Результат.Режим = "Разделенный"); 
	Результат.Вставить("ТекущийВидТранспорта", ВидТранспорта); // вид транспорта, используемый в текуший момент

	//Измерения регистра
	Результат.Вставить("Узел",    ЭтотУзел);
	Результат.Вставить("Процесс", Перечисления.ПроцессыОбменаДанными.ПустаяСсылка());
	
	// состояние процесса
	Результат.Вставить("ВидТранспорта",          ВидТранспорта);
	Результат.Вставить("ДействиеПроцесса",       Перечисления.ДействияПроцессовОбмена.ПустаяСсылка());
	Результат.Вставить("КодРезультатаДействия",  0);
	Результат.Вставить("Количество",             0);
	Результат.Вставить("НомерОбработанного",     0);
	Результат.Вставить("НачалоДействия",         Дата(1,1,1));
	Результат.Вставить("ЗавершениеДействия",     Дата(1,1,1));
	Результат.Вставить("ПараметрыОбменаФайлами", Неопределено);
	Результат.Вставить("ПроцессЗавершен",        Ложь);
	Результат.Вставить("ТекстОшибки",            Ложь);
	
	Результат.Вставить("Корреспонденты", Новый Массив); // массив структур с описанием узлов, участвующих в обмене
	
	// Статус транспорта
	Результат.Вставить("СтатусТранспорта", Новый Структура);
	Результат.СтатусТранспорта.Вставить("КодСостояния",      0);
	Результат.СтатусТранспорта.Вставить("ТекстОшибки",       "");
	Результат.СтатусТранспорта.Вставить("ПоследняяПроверка", Дата(1,1,1));
	Результат.СтатусТранспорта.Вставить("СоединениеНастроено", Ложь);
	Результат.СтатусТранспорта.Вставить("ОшибкиНастройкиСоединения", "");
	Результат.СтатусТранспорта.Вставить("ДомашняяСетьИспользуется", Ложь);
	Результат.СтатусТранспорта.Вставить("ФайловоеОблакоИспользуется", Ложь);
	Результат.СтатусТранспорта.Вставить("СоединениеСФайловымОблакомНастроено", Ложь);
	Результат.СтатусТранспорта.Вставить("Провайдер", Неопределено);
	
	// состояние сервера
	Если Результат.Режим = "КлиентОблака" Тогда
		Результат.Вставить("СостояниеСервера", Неопределено); // заполняется статусом, полученным с сервера
	КонецЕсли;
	
	// общее состояние процесса
	Результат.Вставить("ПроцессАктивен",            Ложь);
	Результат.Вставить("ТекстСостояния",            НСтр("ru='не выполняется'"));
	Результат.Вставить("ЗавершенСОшибками",         Ложь);
	Результат.Вставить("ЗавершенСПредупреждениями", Ложь);
	Результат.Вставить("ИспользоватьСинхронизацию", ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных"));
	Результат.Вставить("ПриостановитьАвтосинхронизацию", Константы.ДеньгиПриостановитьАвтосинхронизацию.Получить());

	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСостояниеИзРегистра(СостояниеОбмена)
	
	ЗаписьРегистра = РегистрыСведений.СостоянияПроцессовОбменаДанными.СостояниеПроцессаДляУзла(СостояниеОбмена.ЭтотУзел, 
			Перечисления.ПроцессыОбменаДанными.ПустаяСсылка());
	ЗаполнитьЗначенияСвойств(СостояниеОбмена, ЗаписьРегистра, , "ПараметрыОбменаФайлами");
	ПараметрыОбмена = ЗаписьРегистра.ПараметрыОбменаФайлами.Получить();
	Если ТипЗнч(ПараметрыОбмена) = Тип("Структура") Тогда
		СостояниеОбмена.Корреспонденты = ПараметрыОбмена.Корреспонденты;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСостояниеВРегистр(Состояние)
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("Корреспонденты", Состояние.Корреспонденты);
	
	Состояние.ПараметрыОбменаФайлами = Новый ХранилищеЗначения(ПараметрыОбмена);
	РегистрыСведений.СостоянияПроцессовОбменаДанными.ОбновитьЗапись(Состояние);
	
КонецПроцедуры

Процедура ОбновитьОбщиеСвойстваСостоянияПроцессов(СостояниеОбмена, ОбновлятьСостояниеНастроек = Ложь, ВсеКоды = Неопределено)
	
	Если ОбновлятьСостояниеНастроек Тогда
		ОбновитьСостояниеНастроек(СостояниеОбмена);
	КонецЕсли;
	Если ВсеКоды = Неопределено Тогда
		ВсеКоды = ПроцессыОбменаПовтИсп.ВсеКодыРезультатовДействий();
	КонецЕсли;

	СостояниеОбмена.ЗавершенСОшибками         = Ложь;
	СостояниеОбмена.ЗавершенСПредупреждениями = Ложь;
	
	Если Не СостояниеОбмена.ИспользоватьСинхронизацию Тогда
		
		СостояниеОбмена.ТекстСостояния = НСтр("ru='Синхронизация отключена'");
		СостояниеОбмена.ПроцессАктивен = Ложь;
		СостояниеОбмена.ЗавершенСПредупреждениями = Истина;
		
	ИначеЕсли Не СостояниеОбмена.СтатусТранспорта.СоединениеНастроено Тогда
		
		СостояниеОбмена.ТекстСостояния = НСтр("ru='Не настроено соединение'");
		СостояниеОбмена.ПроцессАктивен = Ложь;
		СостояниеОбмена.ЗавершенСПредупреждениями = Истина;
		
	Иначе
		
		СостояниеОбмена.ПроцессАктивен = Не СостояниеОбмена.ПроцессЗавершен;
		
		Если СостояниеОбмена.ПроцессАктивен Тогда
			
			СостояниеОбмена.ТекстСостояния = НСтр("ru='Обмен файлами...'");
			
		Иначе
			Если СостояниеОбмена.КодРезультатаДействия = ВсеКоды.Выполнено.Код Тогда
				СостояниеОбмена.ТекстСостояния = НСтр("ru='Обмен файлами завершен'");
			
			ИначеЕсли СостояниеОбмена.КодРезультатаДействия = ВсеКоды.ОперацияОтменена.Код
				И СостояниеОбмена.ПриостановитьАвтосинхронизацию Тогда
				СостояниеОбмена.ТекстСостояния = НСтр("ru='Автоматический обмен отключен'");
			
			Иначе
				ОписаниеРезультата = ПроцессыОбменаПовтИсп.ОписаниеРезультатаПоКоду(СостояниеОбмена.КодРезультатаДействия);
				Если ОписаниеРезультата.ЯвляетсяОшибкой Тогда
					СостояниеОбмена.ЗавершенСОшибками         = Истина;
				Иначе
					СостояниеОбмена.ЗавершенСПредупреждениями = Истина;
				КонецЕсли;
				СостояниеОбмена.ТекстСостояния = ОписаниеРезультата.ТекстОписания;
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСостояниеНастроек(СостояниеОбмена)
	
	// проверка доступности домашней сети
	ПараметрыДомашняяСеть = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(
			Справочники.ТранспортыОбменаДанными.ОсновнойТранспортДомашнейСети());
	СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется = Не ПараметрыДомашняяСеть.ЗапретитьИспользование;
	
	// проверка облачного хранилища файлов
	СвойстваАккаунта = Неопределено;
	ОблачныйПровайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса(СвойстваАккаунта);
	Транспорт = Справочники.ТранспортыОбменаДанными.ОсновнойТранспортОблачногоПровайдера(ОблачныйПровайдер);
	ПараметрыОблачногоХранилищаФайлов = Справочники.ТранспортыОбменаДанными.СтруктураПараметровТранспорта(Транспорт, Истина);
	
	СостояниеОбмена.СтатусТранспорта.ФайловоеОблакоИспользуется = Не ПараметрыОблачногоХранилищаФайлов.ЗапретитьИспользование;
	СостояниеОбмена.СтатусТранспорта.Провайдер = ОблачныйПровайдер;
	
	СостояниеОбмена.СтатусТранспорта.СоединениеСФайловымОблакомНастроено = СвойстваАккаунта <> Неопределено
			И ЗначениеЗаполнено(СвойстваАккаунта.КлючАвторизации);
			
	СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = "";
	Если Не СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется И Не СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется Тогда
		СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = НСтр("ru='Отключены все транспорты обмена файлами'");
	ИначеЕсли Не СостояниеОбмена.СтатусТранспорта.СоединениеСФайловымОблакомНастроено Тогда
		СостояниеОбмена.СтатусТранспорта.ОшибкиНастройкиСоединения = 
				НСтр("ru='Отсутствуют настройки облачного хранилища или авторизация приложения'");
	КонецЕсли;

	СостояниеОбмена.СтатусТранспорта.СоединениеНастроено = СостояниеОбмена.СтатусТранспорта.ДомашняяСетьИспользуется
			Или СостояниеОбмена.СтатусТранспорта.СоединениеСФайловымОблакомНастроено;
	
КонецПроцедуры



Процедура ПроверитьВидТранспорта(СостояниеОбмена)
	
	Если ЗначениеЗаполнено(СостояниеОбмена.ВидТранспорта) И ЗначениеЗаполнено(СостояниеОбмена.ТекущийВидТранспорта)
		И СостояниеОбмена.ВидТранспорта <> СостояниеОбмена.ТекущийВидТранспорта Тогда
		СброситьСостояние(СостояниеОбмена);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНастройкиТранспорта(СостояниеОбмена, ДополнительныеПараметры, ТекстОшибки = "")
	
	СвойстваАккаунта   = ДополнительныеПараметры.СвойстваАккаунта;
	СвойстваПровайдера = ДополнительныеПараметры.СвойстваПровайдера;

	ВсеКоды      = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если ТипЗнч(СвойстваАккаунта) <> Тип("Структура") 
		Или Не ЗначениеЗаполнено(СвойстваАккаунта.КлючАвторизации)
		Или ТипЗнч(СвойстваПровайдера) <> Тип("Структура") Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Для провайдера ""%1"" не задан ключ доступа (токен)'"), Строка(ДополнительныеПараметры.Провайдер));
		Если СостояниеОбмена <> Неопределено Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, "Получение", ВсеКоды.ОблачныйСервисНеНастроен.Код, ТекстОшибки, 0, 0);
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


#Область Процесс_Прием

Функция ИмяФайлаСпискаЧастей(ИмяПакета)
	Возврат ИмяПакета + "_parts.json";
КонецФункции

Функция ИмяЧастиПакета(ИмяПакета, НомерЧасти)
	Возврат ИмяПакета + "." + Формат(НомерЧасти, "ЧЦ=3; ЧДЦ=0; ЧВН=; ЧГ=;")
КонецФункции

Функция КоличествоЧастейИзФайлаОписания(СостояниеОбменаОбщее, ДополнительныеПараметры, СостояниеОбменаСУзлом, ИмяФайлаВОблаке, ИмяЛокальногоФайла)
	
	СтруктураРезультата = RESTВызовСервера.СкачатьФайлИзОблака(ДополнительныеПараметры.Провайдер, 
				ИмяФайлаВОблаке, ИмяЛокальногоФайла, 
				ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
	
	ВсеКоды = ДополнительныеПараметры.ВсеКодыРезультатов;
	Если Не СтруктураРезультата.ВыполненоУспешно Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при получении количества частей пакета из облака. 
				|%1: %2'")
				,СтруктураРезультата.КодСостояния, СтруктураРезультата.ОписаниеОшибки);
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение", 
					ВсеКоды.СерверНедоступен.Код, ТекстОшибки);
		
		// В некоторых случаях остаются файлы нулевого размера
		ФайлСообщения = Новый Файл(ИмяЛокальногоФайла);
		Если ФайлСообщения.Существует() Тогда
			УдалитьФайлы(ИмяЛокальногоФайла);
		КонецЕсли; 
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат        = Неопределено;
	КоличествоЧастей = Неопределено;
	НомерПакета      = Неопределено;
	
	Чтение = Новый ЧтениеJSON();
	Чтение.ОткрытьФайл(ИмяЛокальногоФайла);
	ЗначениеИзФайла = ПрочитатьJSON(Чтение, Ложь);
	Чтение.Закрыть();
	Если ТипЗнч(ЗначениеИзФайла) = Тип("Структура") И ЗначениеИзФайла.Свойство("КоличествоЧастей") Тогда
		КоличествоЧастей = ЗначениеИзФайла.КоличествоЧастей;
	Иначе
		ТекстОшибки = НСтр("ru='Файл с описанием количества частей пакета не содержит нужную информацию'");
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение", 
					ВсеКоды.ОшибкаЧтенияПакета.Код, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	Если ТипЗнч(ЗначениеИзФайла) = Тип("Структура") И ЗначениеИзФайла.Свойство("НомерПакета") Тогда
		НомерПакета = ЗначениеИзФайла.НомерПакета;
	КонецЕсли;
	
	ФайлСообщения = Новый Файл(ИмяЛокальногоФайла);
	Если ФайлСообщения.Существует() Тогда
		УдалитьФайлы(ИмяЛокальногоФайла);
	КонецЕсли; 

	Если Не ЗначениеЗаполнено(КоличествоЧастей) Тогда
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение", 
					ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код, "");
		Возврат Результат;
	КонецЕсли;
	
	Результат = Новый Структура("КоличествоЧастей,НомерПакета", КоличествоЧастей, НомерПакета);
	Возврат Результат;
	
КонецФункции

// Загружает из облачного файлохранилища файлы пакетов от всех мобильных устройств, которые
// зарегистрировались в файле списка устройств и имеют пометка "Активность" и не помечены на удаление
//
Процедура ПолучитьФайлыИзОблачногоХранилища(СостояниеОбмена, ДополнительныеПараметры)
	
	ВсеКоды                = ДополнительныеПараметры.ВсеКодыРезультатов;
	КаталогОбменаЛокальный = ДополнительныеПараметры.ВременныйКаталог;

	Если ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
		ОтметитьНачалоДействия(СостояниеОбмена, "Получение", СостояниеОбмена.Корреспонденты, 0);
	Иначе
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Получение", ВсеКоды.ФайлСпискаУстройствПустой.Код, , , );;
		Возврат;
	КонецЕсли;
	
	Для Каждого Устройство Из СостояниеОбмена.Корреспонденты Цикл
		
		Если Не ЗначениеЗаполнено(Устройство.Узел) Тогда
			Продолжить;
		КонецЕсли;

		Устройство.СостояниеОбмена = ПроцессыОбменаСлужебный.СостояниеОбмена(Устройство.Узел, СостояниеОбмена.ВидТранспорта);
		
		КлючБлокировки = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
					Новый Структура("Узел, Процесс", Устройство.СостояниеОбмена.УзелКорреспондента, 
							Перечисления.ПроцессыОбменаДанными.Прием));
		Попытка
			ЗаблокироватьДанныеДляРедактирования(КлючБлокировки);
		Исключение
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(Устройство.СостояниеОбмена, "Прием", "Получение", 
					ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
					ИнформацияОбОшибке());
			Продолжить;
		КонецПопытки;
		
		ПроцессыОбменаСлужебный.ОтметитьНачалоДействия(Устройство.СостояниеОбмена, "Прием", "Получение");
		
		// Формируем имя получаемого файла
		ШаблонФайла = Устройство.ИмяВходящегоФайла;
		ИмяВходящегоФайла         = ШаблонФайла + ".xml";
		
		// В обмене может быть целый файл пакета или разделенный на части
		ФайлРазделенНаЧасти = Ложь;
		ВсегоЧастей         = 0;
		// проверка файла описания частей
		ИмяФайлаКоличестваЧастей =  ИмяФайлаСпискаЧастей(ШаблонФайла);
		СтруктураРезультата = RESTВызовСервера.ПолучитьИнформациюОРесурсе(ДополнительныеПараметры.Провайдер, 
						ИмяФайлаКоличестваЧастей, 
						ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
		Если Не СтруктураРезультата.ВыполненоУспешно Или Не СтруктураРезультата.Результат.Существует Тогда
			// проверка целикового файла пакета
			СтруктураРезультата = RESTВызовСервера.ПолучитьИнформациюОРесурсе(ДополнительныеПараметры.Провайдер, 
							ИмяВходящегоФайла, 
							ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
			Если Не СтруктураРезультата.ВыполненоУспешно Или Не СтруктураРезультата.Результат.Существует Тогда
				// отсутствие входящего файла ошибкой не является
				РазблокироватьДанныеДляРедактирования(КлючБлокировки);
				Продолжить;
			КонецЕсли;
			
		Иначе
			
			ФайлРазделенНаЧасти = Истина;
			ИмяЛокальногоФайлаКоличестваЧастей = КаталогОбменаЛокальный + ИмяФайлаКоличестваЧастей;
			СвойстваФайлаЧастей = КоличествоЧастейИзФайлаОписания(СостояниеОбмена, ДополнительныеПараметры, 
							Устройство.СостояниеОбмена,
							ИмяФайлаКоличестваЧастей, ИмяЛокальногоФайлаКоличестваЧастей);
			Если Не ЗначениеЗаполнено(СвойстваФайлаЧастей) Тогда
				// Отметка о завершении действия уже сделана
				РазблокироватьДанныеДляРедактирования(КлючБлокировки);
				Продолжить;
			КонецЕсли;

			ВсегоЧастей = СвойстваФайлаЧастей.КоличествоЧастей;
			Если ЗначениеЗаполнено(СвойстваФайлаЧастей.НомерПакета) Тогда
				Устройство.СостояниеОбмена.Прием.НомерПакета = СвойстваФайлаЧастей.НомерПакета;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ФайлРазделенНаЧасти Тогда
			ПолучитьФайлПакетаПоЧастям(СостояниеОбмена, ДополнительныеПараметры, Устройство.СостояниеОбмена, 
						ВсегоЧастей, Устройство.ИмяВходящегоФайла);
			
		Иначе
			ПолучитьФайлПакетаЦеликом(СостояниеОбмена, ДополнительныеПараметры, Устройство.СостояниеОбмена, 
						Устройство.ИмяВходящегоФайла);
			
		КонецЕсли;
		
		РазблокироватьДанныеДляРедактирования(КлючБлокировки);
		
	КонецЦикла; 
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Получение", ВсеКоды.Выполнено.Код, , , );;
	
КонецПроцедуры

Процедура ПолучитьФайлПакетаПоЧастям(СостояниеОбменаОбщее, ДополнительныеПараметры, СостояниеОбменаСУзлом, ВсегоЧастей, ИмяФайла)
	
	ВсеКоды                = ДополнительныеПараметры.ВсеКодыРезультатов;
	КаталогОбменаЛокальный = ДополнительныеПараметры.ВременныйКаталог;
	Если ЗначениеЗаполнено(СостояниеОбменаСУзлом.Прием.НомерПакета) 
		И СостояниеОбменаСУзлом.Прием.НомерПакета > СостояниеОбменаСУзлом.НомерПринятого Тогда
		НомерПакета        = СостояниеОбменаСУзлом.Прием.НомерПакета;
	Иначе
		НомерПакета        = СостояниеОбменаСУзлом.НомерПринятого + 1;
	КонецЕсли;
	
	// Удаление старых пакетов, если такие есть
	Если НомерПакета > 1 Тогда
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(СостояниеОбменаСУзлом.УзелКорреспондента, НомерПакета-1);
	КонецЕсли;
	
	ПолученныеПакеты = РегистрыСведений.ПакетыСинхронизацииПолученные.ИнформацияОПолученныхПакетах(СостояниеОбменаСУзлом.УзелКорреспондента, 
									НомерПакета);
	Если ПолученныеПакеты.КоличествоВсего > 0 И ПолученныеПакеты.КоличествоВсего <> ВсегоЧастей Тогда
		РегистрыСведений.ПакетыСинхронизацииПолученные.УдалитьПакеты(СостояниеОбменаСУзлом.УзелКорреспондента, 
									НомерПакета);
		ПолученныеПакеты.ПолученныеЧасти.Очистить();
	КонецЕсли;

	ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбменаСУзлом, "Прием", НомерПакета, 
			ВсегоЧастей, ПолученныеПакеты.Количество());
	
	// для исключения повторного получения уже полученных пакетов
	КонтрольПолученных = Новый Соответствие;
	Для Каждого Элемент Из ПолученныеПакеты.ПолученныеЧасти Цикл
		КонтрольПолученных.Вставить(Элемент.НомерЧастиПакета, Истина);
	КонецЦикла;
	
	ОписаниеЧасти = Новый Структура("ТипПакета,НомерПакетаКПолучению,ВсегоЧастей,ДатаВыгрузки,НомерЧастиПакета", 
				Перечисления.ТипыПакетовСинхронизации.Файл, НомерПакета, ВсегоЧастей,
				ТекущаяДатаСеанса(), 0);
	
	
	// загрузка каждой части
	БылиОшибки = Ложь;
	Для Счетчик = 1 По ВсегоЧастей Цикл
		
		Если КонтрольПолученных[Счетчик] = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеЧасти.НомерЧастиПакета = Счетчик;
		ШаблонЧасти = ИмяЧастиПакета(ИмяФайла, Счетчик);
		ИмяФайлаЧастиВОблаке  = ШаблонЧасти;
		ИмяФайлаЧастилокально = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогОбменаЛокальный, ШаблонЧасти);
		СтруктураРезультата = RESTВызовСервера.СкачатьФайлИзОблака(ДополнительныеПараметры.Провайдер, 
					ИмяФайлаЧастиВОблаке, ИмяФайлаЧастилокально, 
					ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
		Если СтруктураРезультата.ВыполненоУспешно Тогда
			
			ДанныеЧасти = Новый ДвоичныеДанные(ИмяФайлаЧастилокально);
			
			Запись = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ОписаниеЧасти);
			Запись.УзелКорреспондента = СостояниеОбменаСУзлом.УзелКорреспондента;
			Запись.ДанныеПакета = Новый ХранилищеЗначения(ДанныеЧасти, Новый СжатиеДанных(9));
			Запись.Записать(Истина);
			
			КонтрольПолученных.Вставить(Счетчик, Истина);
			ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбменаСУзлом, "Прием", , 
					, Счетчик);
			
		Иначе
			
			БылиОшибки = Истина;
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при получении части %1 пакета из облака. 
					|%2: %3'"), Счетчик, 
					СтруктураРезультата.КодСостояния, СтруктураРезультата.ОписаниеОшибки);
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение",
						ВсеКоды.ОшибкаПолученияФайла.Код, ТекстОшибки);
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КонтрольПолученных.Количество() <> ВсегоЧастей Тогда
		БылиОшибки = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Из облачного хранилища получено неверное количество частей файла: вместо %1 частей получено %2'"), 
				ВсегоЧастей, КонтрольПолученных.Количество());
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение",
					ВсеКоды.ОшибкаПолученияФайла.Код, ТекстОшибки);
	КонецЕсли;
	
	Если Не БылиОшибки Тогда
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение",
					ВсеКоды.Выполнено.Код, "");
	КонецЕсли;
	
	// удаление всех временных файлов пакета
	Попытка
		УдалитьФайлы(КаталогОбменаЛокальный, ИмяФайла + ".???");
	Исключение
		// обработка не требуется
	КонецПопытки;
	Попытка
		УдалитьЧастиПакетаВОблаке(ДополнительныеПараметры, ИмяФайла, ВсегоЧастей);
	Исключение
		// обработка не требуется
	КонецПопытки;
	
	
КонецПроцедуры

Процедура УдалитьЧастиПакетаВОблаке(ДополнительныеПараметры, ИмяФайла, КоличествоЧастей = 300)
	
	ИмяФайлаСпискаЧастей = ИмяФайлаСпискаЧастей(ИмяФайла);
	СтруктураРезультата = RESTВызовСервера.ПолучитьИнформациюОРесурсе(ДополнительныеПараметры.Провайдер, 
				ИмяФайлаСпискаЧастей, ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
	Если СтруктураРезультата.ВыполненоУспешно И СтруктураРезультата.Результат.Существует Тогда
		RESTВызовСервера.УдалитьФайлИзОблака(ДополнительныеПараметры.Провайдер, 
					ИмяФайлаСпискаЧастей, ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
	КонецЕсли;
	
	Для Счетчик = 1 По КоличествоЧастей Цикл
		
		ИмяФайлаВОблаке = ИмяЧастиПакета(ИмяФайла, Счетчик);
		СтруктураРезультата = RESTВызовСервера.ПолучитьИнформациюОРесурсе(ДополнительныеПараметры.Провайдер, 
					ИмяФайлаВОблаке, ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
		Если Не СтруктураРезультата.ВыполненоУспешно Или Не СтруктураРезультата.Результат.Существует Тогда
			Прервать;
		КонецЕсли;
		
		СтруктураРезультата = RESTВызовСервера.УдалитьФайлИзОблака(ДополнительныеПараметры.Провайдер, 
					ИмяФайлаВОблаке, ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
		Если Не СтруктураРезультата.ВыполненоУспешно Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПолучитьФайлПакетаЦеликом(СостояниеОбменаОбщее, ДополнительныеПараметры, СостояниеОбменаСУзлом, ИмяФайла)
	
	ВсеКоды                   = ДополнительныеПараметры.ВсеКодыРезультатов;
	КаталогОбменаЛокальный    = ДополнительныеПараметры.ВременныйКаталог;
	НомерПакета               = СостояниеОбменаСУзлом.НомерПринятого + 1;
	ИмяВходящегоФайла         = ИмяФайла + ".xml";
	ИмяЛокальнойКопииФайла    = КаталогОбменаЛокальный + ИмяФайла + ".xml";

	// Получение целикового файла с облака во временный каталог
	СтруктураРезультата = RESTВызовСервера.СкачатьФайлИзОблака(ДополнительныеПараметры.Провайдер, 
				ИмяВходящегоФайла, ИмяЛокальнойКопииФайла, 
				ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
	Если Не СтруктураРезультата.ВыполненоУспешно Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при получении пакета из облака. 
				|%1: %2'")
				,СтруктураРезультата.КодСостояния, СтруктураРезультата.ОписаниеОшибки);
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение",
				ВсеКоды.ОшибкаПолученияФайла.Код, ТекстОшибки);
		
		// В некоторых случаях остаются файлы нулевого размера
		ФайлСообщения = Новый Файл(ИмяЛокальнойКопииФайла);
		Если ФайлСообщения.Существует() Тогда
			УдалитьФайлы(ИмяЛокальнойКопииФайла);
		КонецЕсли; 
		
		Возврат;
		
	КонецЕсли;
	
	// Разделение файла на части.
	КаталогФайлов = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогФайлов);

	КоличествоЧастей = 1;
	РазмерЧасти = 3072;
	ИменаФайлов = РазделитьФайл(ИмяЛокальнойКопииФайла, РазмерЧасти * 1024, КаталогФайлов);
	КоличествоЧастей = ИменаФайлов.Количество();
	
	// Сохранение частей в базе
	Набор = РегистрыСведений.ПакетыСинхронизацииПолученные.СоздатьНаборЗаписей();
	Набор.Отбор.УзелКорреспондента.Установить(СостояниеОбменаСУзлом.УзелКорреспондента);
	Набор.Отбор.НомерПакетаКПолучению.Установить(НомерПакета);
	Набор.Записать(Истина);

	СжатиеДанных = Новый СжатиеДанных(9);
	ДатаВыгрузки = ТекущаяДатаСеанса();
	Для НомерЧасти = 1 По КоличествоЧастей Цикл
		
		ИмяФайлаЧасти = ИменаФайлов[НомерЧасти - 1];
		ДанныеФайла = Новый ДвоичныеДанные(ИмяФайлаЧасти);
		ЗаписьНабора = Набор.Добавить();
		ЗаписьНабора.УзелКорреспондента = СостояниеОбменаСУзлом.УзелКорреспондента;
		ЗаписьНабора.НомерПакетаКПолучению = НомерПакета;
		ЗаписьНабора.НомерЧастиПакета = НомерЧасти;
		ЗаписьНабора.ДанныеПакета = Новый ХранилищеЗначения(ДанныеФайла, СжатиеДанных);
		ЗаписьНабора.ТипПакета = Перечисления.ТипыПакетовСинхронизации.Файл;
		ЗаписьНабора.ВсегоЧастей = КоличествоЧастей;
		ЗаписьНабора.ДатаВыгрузки = ДатаВыгрузки;
		
	КонецЦикла;
	
	Набор.Записать(Истина);
	
	ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбменаСУзлом, "Прием", НомерПакета, 
			КоличествоЧастей, КоличествоЧастей);
	ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение",
				ВсеКоды.Выполнено.Код, "");
	
	// удаление файлов с диска
	Попытка
		
		УдалитьФайлы(ИмяФайла);
		УдалитьФайлы(КаталогФайлов);
		
	Исключение
		// Обработка не требуется
	КонецПопытки;
	 
КонецПроцедуры

// Загружает файлы сообщений, полученные от устройств
//
Процедура ЗагрузитьПолученныеПакеты(СостояниеОбмена, ДополнительныеПараметры)
	
	ВсеКоды    = ДополнительныеПараметры.ВсеКодыРезультатов;

	Если ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
		ОтметитьНачалоДействия(СостояниеОбмена, "Загрузка", СостояниеОбмена.Корреспонденты, 0);
	Иначе
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Загрузка", ВсеКоды.ФайлСпискаУстройствПустой.Код, , , );;
		Возврат;
	КонецЕсли;
	
	Для Каждого Устройство Из СостояниеОбмена.Корреспонденты Цикл
		
		Если Не ЗначениеЗаполнено(Устройство.Узел) Тогда
			Продолжить;
		КонецЕсли;

		Устройство.СостояниеОбмена = ПроцессыОбменаСлужебный.СостояниеОбмена(Устройство.Узел, СостояниеОбмена.ВидТранспорта);
		НужноЧитатьПакет = Устройство.СостояниеОбмена.Прием.НомерПакета <> 0 
				И (Устройство.СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Получение
					И Устройство.СостояниеОбмена.Прием.КодРезультатаДействия = ВсеКоды.Выполнено.Код)
				Или (Устройство.СостояниеОбмена.Прием.ДействиеПроцесса = Перечисления.ДействияПроцессовОбмена.Загрузка
					И Устройство.СостояниеОбмена.Прием.КодРезультатаДействия <> ВсеКоды.Выполнено.Код);
		Если Не НужноЧитатьПакет Тогда
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(Устройство.СостояниеОбмена, "Прием", "Загрузка", 
					ВсеКоды.ОтсутствуютДанныеДляЗагрузки.Код);
			Продолжить;
		КонецЕсли;
		
		ПроцессыОбменаСлужебный.ЗагрузитьПакетВЭтойБазе(Устройство.СостояниеОбмена, ДополнительныеПараметры, 
				Устройство.СостояниеОбмена.Прием.НомерПакета);
		
	КонецЦикла;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Загрузка", ВсеКоды.Выполнено.Код, , , );;
	
КонецПроцедуры

#КонецОбласти


#Область Процесс_Передача

// Выгружает имзменения для узлов, зарегистрированных в файле списка узлов и помеченных как активные
//
Процедура ВыгрузитьИзменения(СостояниеОбмена, ДополнительныеПараметры)
	
	ВсеКоды    = ДополнительныеПараметры.ВсеКодыРезультатов;

	Если ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
		ОтметитьНачалоДействия(СостояниеОбмена, "Выгрузка", СостояниеОбмена.Корреспонденты, 0);
	Иначе
		// Попытка прочитать файл списка устройств
		ПроверитьФайлСпискаУстройств(СостояниеОбмена, ДополнительныеПараметры, "Выгрузка");
		Если Не ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
			ОтметитьЗавершениеДействия(СостояниеОбмена, "Выгрузка", ВсеКоды.ФайлСпискаУстройствПустой.Код, , , );
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Устройство Из СостояниеОбмена.Корреспонденты Цикл
		
		Если Не ЗначениеЗаполнено(Устройство.Узел) Тогда
			Продолжить;
		КонецЕсли;

		Устройство.СостояниеОбмена = ПроцессыОбменаСлужебный.СостояниеОбмена(Устройство.Узел, СостояниеОбмена.ВидТранспорта);
		ПроцессыОбменаСлужебный.ВыгрузитьИзмененияВЭтойБазе(Устройство.СостояниеОбмена, ДополнительныеПараметры);
		
	КонецЦикла;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Выгрузка", ВсеКоды.Выполнено.Код, , , );
	
КонецПроцедуры

Процедура ОтправитьФайлыВОблачноеХранилище(СостояниеОбмена, ДополнительныеПараметры)
	
	ВсеКоды    = ДополнительныеПараметры.ВсеКодыРезультатов;

	Если ЗначениеЗаполнено(СостояниеОбмена.Корреспонденты) Тогда
		ОтметитьНачалоДействия(СостояниеОбмена, "Отправка", СостояниеОбмена.Корреспонденты, 0);
	Иначе
		ОтметитьЗавершениеДействия(СостояниеОбмена, "Отправка", ВсеКоды.ФайлСпискаУстройствПустой.Код, , , );
		Возврат;
	КонецЕсли;
	
	Для Каждого Устройство Из СостояниеОбмена.Корреспонденты Цикл
		
		Если Не ЗначениеЗаполнено(Устройство.Узел) Тогда
			Продолжить;
		КонецЕсли;

		Устройство.СостояниеОбмена = ПроцессыОбменаСлужебный.СостояниеОбмена(Устройство.Узел, СостояниеОбмена.ВидТранспорта);
		ОтправитьЧастиПакета(СостояниеОбмена, ДополнительныеПараметры, 
				Устройство.СостояниеОбмена, Устройство.ИмяИсходящегоФайла);
		
	КонецЦикла;
	
	ОтметитьЗавершениеДействия(СостояниеОбмена, "Отправка", ВсеКоды.Выполнено.Код, , , );
	
КонецПроцедуры

Процедура ОтправитьЧастиПакета(СостояниеОбменаОбщее, ДополнительныеПараметры, СостояниеОбменаСУзлом, ИмяФайла)
	
	ВсеКоды                = ДополнительныеПараметры.ВсеКодыРезультатов;
	КаталогОбменаЛокальный = ДополнительныеПараметры.ВременныйКаталог;
	НомерПакета            = СостояниеОбменаСУзлом.НомерОтправленного;

	// Проверка выгруженных изменений
	СписокПакетов = РегистрыСведений.ПакетыСинхронизацииКОтправке.ОчередьПакетовДляУзла(
			СостояниеОбменаСУзлом.УзелКорреспондента, НомерПакета);
	Если Не ЗначениеЗаполнено(СписокПакетов) Тогда
		// Отправлять нечего
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Передача", "Отправка", 
				ВсеКоды.ОтсутствуютДанныеДляВыгрузки.Код, "Отсутствуют данные для отправки");
		Возврат;
	КонецЕсли;
	
	ПроцессыОбменаСлужебный.ОтметитьНачалоДействия(СостояниеОбменаСУзлом, "Передача", "Отправка", 
				НомерПакета, СписокПакетов.Количество(), 0);
	
	КлючБлокировки = РегистрыСведений.КонтрольПроцессовОбменаДанными.СоздатьКлючЗаписи(
				Новый Структура("Узел, Процесс", СостояниеОбменаСУзлом.УзелКорреспондента, 
							Перечисления.ПроцессыОбменаДанными.Передача));
	Попытка
		ЗаблокироватьДанныеДляРедактирования(КлючБлокировки);
	Исключение
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Передача", "Отправка", 
				ВсеКоды.ОшибкаБлокировкиКонтрольнойЗаписи.Код, 
				ИнформацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	// Отправить все части по одной
	БылиОшибки = Ложь;
	ОбработаноПакетов = 0;
	Для каждого ПараметрыПакета Из СписокПакетов Цикл
		
		ФайлЧасти = Неопределено;
		
		Если ПараметрыПакета.Отправлено Тогда
			ОбработаноПакетов = ОбработаноПакетов + 1;
			ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбменаСУзлом, "Передача",  
					Неопределено, Неопределено, ОбработаноПакетов);
			Продолжить;
		КонецЕсли;
		
		Запись = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ПараметрыПакета, "УзелКорреспондента,НомерПакетаКОтправке,НомерЧастиПакета");
		Запись.Прочитать();
		Если Не Запись.Выбран() Тогда
			ТекстОшибки = НСтр("ru='Ошибка отправки пакета на сервер'") + Символы.ПС + Символы.ПС
					+ Символы.Таб + "Узел = " + ПараметрыПакета.УзелКорреспондента + Символы.ПС
					+ Символы.Таб + "Номер пакета = " + ПараметрыПакета.НомерПакетаКОтправке + Символы.ПС
					+ Символы.Таб + "Номер части = " + ПараметрыПакета.НомерЧастиПакета;
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Передача", "Отправка",
					ВсеКоды.ОшибкаОтправкиФайла.Код, ТекстОшибки);
			БылиОшибки = Истина;
			Прервать;
		КонецЕсли;

		ДанныеЧасти = Запись.ДанныеПакета.Получить();
		Если ДанныеЧасти = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Часть файла выгрузки не содержит данных'") + Символы.ПС + Символы.ПС
					+ Символы.Таб + "Узел = " + ПараметрыПакета.УзелКорреспондента + Символы.ПС
					+ Символы.Таб + "Номер пакета = " + ПараметрыПакета.НомерПакетаКОтправке + Символы.ПС
					+ Символы.Таб + "Номер части = " + ПараметрыПакета.НомерЧастиПакета;
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Передача", "Отправка",
					ВсеКоды.ОшибкаОтправкиФайла.Код, ТекстОшибки);
			БылиОшибки = Истина;
			Прервать;
		КонецЕсли;
		
		ИмяФайлаЧасти = ИмяЧастиПакета(ИмяФайла, ПараметрыПакета.НомерЧастиПакета);
		ФайлЧасти = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогОбменаЛокальный, ИмяФайлаЧасти);
		ДанныеЧасти.Записать(ФайлЧасти);
		
		Для Попыток = 1 По 3 Цикл
			СтруктураРезультата = RESTВызовСервера.ЗагрузитьФайлВОблако(ДополнительныеПараметры.Провайдер, 
					ФайлЧасти, ИмяФайлаЧасти, 
					ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
			Если СтруктураРезультата.ВыполненоУспешно Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если СтруктураРезультата.ВыполненоУспешно Тогда
			ПараметрыПакета.Отправлено = Истина;
			Запись = РегистрыСведений.ПакетыСинхронизацииКОтправке.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ПараметрыПакета, "УзелКорреспондента,НомерПакетаКОтправке,НомерЧастиПакета");
			Запись.Прочитать();
			Если Запись.Выбран() Тогда
				Запись.Отправлено = Истина;
				Запись.Записать(Истина);
			КонецЕсли;
			ОбработаноПакетов = ОбработаноПакетов + 1;
			ПроцессыОбменаСлужебный.ОбновитьСтатистикуДействия(СостояниеОбменаСУзлом, "Передача", 
					Неопределено, Неопределено, ОбработаноПакетов);
			
		Иначе
			// отправить файл не получилось
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при отправке части %1 файла %2 в облачное хранилище файлов. 
					|%3: %4'"), ПараметрыПакета.НомерЧастиПакета, ИмяФайла, 
								СтруктураРезультата.КодСостояния, СтруктураРезультата.ОписаниеОшибки);
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Передача", "Отправка",
					ВсеКоды.ОшибкаОтправкиФайла.Код, ТекстОшибки);
			БылиОшибки = Истина;
				
		КонецЕсли;
		
		// удаление временного файла
		Если ЗначениеЗаполнено(ФайлЧасти) Тогда
			Попытка
				УдалитьФайлы(ФайлЧасти);
			Исключение
				// Обработка не требуется
			КонецПопытки;
		КонецЕсли;
		
		Если БылиОшибки Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если Не БылиОшибки Тогда
		
		// файл с количеством частей отпраляется последним, чтобы в корреспонденте получение файлов не началось раньше времени
		ФайлСКоличествомЧастей = ФайлСКоличествомЧастей(ИмяФайла, СписокПакетов.Количество(), 
				НомерПакета, КаталогОбменаЛокальный);
		ИмяФайлаСпискаЧастей = ИмяФайлаСпискаЧастей(ИмяФайла);
		СтруктураРезультата = RESTВызовСервера.ЗагрузитьФайлВОблако(ДополнительныеПараметры.Провайдер, 
					ФайлСКоличествомЧастей, ИмяФайлаСпискаЧастей, 
					ДополнительныеПараметры.СвойстваАккаунта, ДополнительныеПараметры.СвойстваПровайдера);
					
		Если Не СтруктураРезультата.ВыполненоУспешно Тогда
			// при отправке сообщения сервер вернул ошибку
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при отправке файла с описанием пакета %1 в облачное хранилище. 
					|%2: %3'"), ИмяФайлаСпискаЧастей, 
								СтруктураРезультата.КодСостояния, СтруктураРезультата.ОписаниеОшибки);
			ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Прием", "Получение",
					ВсеКоды.ОшибкаНаСервере.Код, ТекстОшибки);
			БылиОшибки = Истина;
		КонецЕсли;
		
		Попытка
			УдалитьФайлы(ФайлСКоличествомЧастей);
		Исключение
			// Обработка не требуется
		КонецПопытки;
			
	КонецЕсли;

	Если Не БылиОшибки Тогда
		ПроцессыОбменаСлужебный.ОтметитьЗавершениеДействия(СостояниеОбменаСУзлом, "Передача", "Отправка", 
					ВсеКоды.Выполнено.Код, "");
	КонецЕсли;	

	РазблокироватьДанныеДляРедактирования(КлючБлокировки);
	
КонецПроцедуры

Функция ФайлСКоличествомЧастей(ШаблонИмениФайлаСообщения, КоличествоЧастей, НомерПакета, ВременныйКаталог)
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог, 
			ИмяФайлаСпискаЧастей(ШаблонИмениФайлаСообщения));
	ДанныеДляЗаписи = Новый Структура("ВерсияОбработчика, КоличествоЧастей, НомерПакета", 
			ВерсияОбработчика(), КоличествоЧастей, НомерПакета);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ИмяФайла);
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляЗаписи);
	ЗаписьJSON.Закрыть();
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ВерсияОбработчика()
	Возврат "1.0";
КонецФункции

#КонецОбласти


#КонецОбласти