&НаКлиенте 
Перем ПотмекаПоказатьПароль;
&НаКлиенте 
Перем НастройкиЗапуска;
&НаКлиенте 
Перем ПараметрыОжидания;
&НаКлиенте 
Перем ПредыдущаяСтраница, СпособПодключения;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПараметрыПодключения(Истина);
	Если Не ЗначениеЗаполнено(ИмяЭтойБазы) Тогда
		ИмяЭтойБазы = ИмяКомпьютера();
	КонецЕсли;
	
	Если ПодключениеВыполнено Тогда
		Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПараметрыУчетнойЗаписи;
		ПоказатьQRкодСервер();
	Иначе
		Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПодключение;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Пароль2ПриИзменении(Элемент)
	
	Если ПотмекаПоказатьПароль = Истина Тогда
		ПарольПодтверждение = Пароль;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПарольПоказать(Команда)
	ИзменитьОтображениеПароля();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКРегистрации(Команда)
	
	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаРегистрация;
	Элементы.Зарегистрироваться.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодключению(Команда)
	
	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПодключение;
	Элементы.Войти.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	ВерутьсяСоСтраницыОжидания();
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрироваться(Команда)
	
	Если Не ПоляЗаполненыКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьБазуКОблаку(2);
	
КонецПроцедуры

&НаКлиенте
Процедура Войти(Команда)
	
	Если Не ПоляЗаполненыКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьБазуКОблаку(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьСинхронизацию(Команда)
	
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Выключить синхронизацию на этом компьютере?'");
	Если ПодключениеВыполнено Тогда
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru='Обратите внимание:
				| - выключение не освобождает лицензию в облаке
				| - при повторном включении возможна рассинхронизация данных'");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыключитьСинхронизациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Выключить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВПоддержку(Команда)
	ОтправитьСообщениеВПоддержку();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыйтиИзУчетнойЗаписи(Команда)
	
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Выйти из учетной записи?
	|
	|Обратите внимание:
	| - этот выход не освободит лицензию в теущей учетной записи
	| - подключение к другой учетной записи может оказаться невозможным без очистки всей базы'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыйтиИзУчетнойЗаписиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Выйти'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да);
	#КонецОбласти
	 
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьОтображениеПароля()
	
	ПотмекаПоказатьПароль = ?(ПотмекаПоказатьПароль = Неопределено, Истина, Не ПотмекаПоказатьПароль);
	Элементы.ПоказатьПароль1.Пометка = ПотмекаПоказатьПароль;
	Элементы.ПоказатьПароль2.Пометка = ПотмекаПоказатьПароль;
	Элементы.ПоказатьПароль3.Пометка = ПотмекаПоказатьПароль;
	
	ЗаголовокКнопки       = ?(ПотмекаПоказатьПароль, НСтр("ru='Скрыть'"), НСтр("ru='Показать'"));
	Элементы.ПоказатьПароль1.Заголовок = ЗаголовокКнопки;
	Элементы.ПоказатьПароль2.Заголовок = ЗаголовокКнопки;
	Элементы.ПоказатьПароль3.Заголовок = ЗаголовокКнопки;
	
	Элементы.Пароль1.РежимПароля = Не ПотмекаПоказатьПароль;
	Элементы.Пароль2.РежимПароля = Не ПотмекаПоказатьПароль;
	Элементы.Пароль3.РежимПароля = Не ПотмекаПоказатьПароль;
	
	Элементы.ПарольПодтверждение.Доступность = Не ПотмекаПоказатьПароль;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрыПодключения(ОбновлятьРеквизитыФормы)
	
	Если ОбновлятьРеквизитыФормы Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	ПараметрыПодключения = ДеньгиВОблаке.ПараметрыСоединенияСОблаком();
	ПодключениеВыполнено = Не ЗначениеЗаполнено(ТекстОшибки) И ДеньгиВОблакеВызовСервера.ЭтаБазаПодключенаКОблаку(ПараметрыПодключения);
	Если ОбновлятьРеквизитыФормы Тогда
		ЭлектроннаяПочта   = ПараметрыПодключения.Логин;
		Пароль             = ПараметрыПодключения.Пароль;
		ИмяЭтойБазы        = ПараметрыПодключения.ИмяЭтойБазы;
		ПоказатьQRкодСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПоляЗаполненыКорректно()
	
	Возврат ЛогинИПарольКорректны() И ИмяБазыКорректно();
	
КонецФункции

&НаКлиенте
Функция ЛогинИПарольКорректны()
	
	Если Не ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не указан адрес электронной почты'"), , "ЭлектроннаяПочта");
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		//@skip-warning
		Результат = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ЭлектроннаяПочта);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ЭлектроннаяПочта");
		Возврат Ложь;
	КонецПопытки;
	
	Если Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПодключение Тогда
		ПолеПароля = "Пароль1";
	ИначеЕсли Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаРегистрация Тогда
		ПолеПароля = "Пароль2";
	Иначе
		ПолеПароля = "Пароль3";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Пароль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не задан пароль'"), , ПолеПароля);
		Возврат Ложь;
	КонецЕсли;
	Если СтрДлина(Пароль) < 6 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Пароль не должен быть короче 6 символов'"), , ПолеПароля);
		Возврат Ложь;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаРегистрация
		И ПотмекаПоказатьПароль<> Истина
		И Пароль <> ПарольПодтверждение Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Пароль и подтверждение пароля не совпадают'"), , "ПарольПодтверждение");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиенте
Функция ИмяБазыКорректно()
	
	Если Не ЗначениеЗаполнено(ИмяЭтойБазы) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не задано имя этой базы'"), , "ИмяЭтойБазы");
		Возврат Ложь;
	КонецЕсли;
	Если СтрДлина(СокрЛП(ИмяЭтойБазы)) < 4 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Имя базы не должно быть короче 4-х символов'"), , "ИмяЭтойБазы");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяДатаКлиентСервер()
	#Если Сервер Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли 
КонецФункции 



#Область Фоновые_задания

&НаКлиенте
Процедура ОбновитьЗаголовкиОжидания(ТекстОжидания, ЗаголовокОжидания = Неопределено)

	Если Элементы.ДекорацияОписаниеОжидания.Заголовок <> ТекстОжидания Тогда
		Элементы.ДекорацияОписаниеОжидания.Заголовок = ТекстОжидания;
	КонецЕсли;
	Если ЗаголовокОжидания <> Неопределено И Элементы.ДекорацияОжидание.Заголовок <> ЗаголовокОжидания Тогда
		Элементы.ДекорацияОжидание.Заголовок = ЗаголовокОжидания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибкеФоновогоЗадания(СообщениеПользователю, Ошибка, ТекстЗаголовка = Неопределено)

	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОшибка;
	Если Элементы.ДекорацияСообщениеПользователю.Заголовок <> СообщениеПользователю Тогда
		Элементы.ДекорацияСообщениеПользователю.Заголовок = СообщениеПользователю;
	КонецЕсли;
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = ?(ЗначениеЗаполнено(Ошибка), Ошибка, "");
	КонецЕсли;
	Элементы.ГруппаПодробнаяИнформацияОбОшибке.Видимость = ЗначениеЗаполнено(ТекстОшибки);

КонецПроцедуры

&НаКлиенте
Процедура НачатьФоновоеЗадание()
	ТекстОшибки = "";
	ДеньгиКлиент.ВыполнитьЭтапФоновогоЗадания(ЭтотОбъект, НастройкиЗапуска, РезультатЗапускаФоновогоЗадания);
	НастройкиЗапуска = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ВерутьсяСоСтраницыОжидания()

	Если ПодключениеВыполнено Тогда
		Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПараметрыУчетнойЗаписи;
	Иначе
		Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = ПредыдущаяСтраница;
	КонецЕсли;

КонецПроцедуры



#Область Подключение_к_облаку

// Подготовка последовательности процедур к запуску
//Параметры:
//	ВариантПодключения - Число: 1 - вход в учетку,2 - регистрация новой учетки 
&НаКлиенте
Процедура ПодключитьБазуКОблаку(ВариантПодключения)
	
	ПредыдущаяСтраница = Элементы.ГруппаСтраницыФормы.ТекущаяСтраница;
	КартинкаQR = Неопределено;
	
	// Подготовка серии фоновых заданий
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Подключение к облаку");
	
	СпособПодключения = ВариантПодключения;
	
	// Последовательность действий, выполняемых в фоне
	Если ВариантПодключения = 2 Тогда
		НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.НачатьРегистрациюАбонентаВФоне");
		НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПроверитьСостояниеРегистрацииНовогоАбонентаВФоне");
		НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ИзменитьПарольПользователяВФоне");
	Иначе
		НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПодключитьБазуКАбонентуВФоне");
	КонецЕсли;
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПроверитьРегистрациюБазыНаСервереВФоне");
	
	// Параметры первого метода последовательности
	НастройкиЗапуска.ПараметрыМетода = Новый Структура;
	НастройкиЗапуска.ПараметрыМетода.Вставить("Логин",  ЭлектроннаяПочта);
	НастройкиЗапуска.ПараметрыМетода.Вставить("Пароль", Пароль);
	НастройкиЗапуска.ПараметрыМетода.Вставить("ИмяЭтойБазы", ИмяЭтойБазы);
	
	// Обработчики событий фонового задания
	НастройкиЗапуска.ОбработчикОжидания        = Новый ОписаниеОповещения("ОбработчикВыполняющегосяЗаданияПодключения", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиЗаданияПодключения", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияЗаданияПодключения", ЭтотОбъект);
	
	
	// Подготовка формы
	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	Элементы.ИконкаОжидания.Картинка            = БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.Отменить.Видимость                 = Истина;
	ОбновитьЗаголовкиОжидания(НСтр("ru='проверка логина и пароля'"), НСтр("ru='Подождите, подключаем базу к облаку'"));
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 0.7, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыполняющегосяЗаданияПодключения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ВыполненныйЭтап = "" Тогда
		ОбновитьЗаголовкиОжидания(НСтр("ru='проверка логина и пароля'"));
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.НачатьРегистрациюАбонентаВФоне" Тогда
		ОбновитьЗаголовкиОжидания(НСтр("ru='подготовка облачной базы'"));
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПроверитьСостояниеРегистрацииНовогоАбонентаВФоне" Тогда
		ОбновитьЗаголовкиОжидания(НСтр("ru='подготовка облачной базы'"));
		//ОбновитьЗаголовкиОжидания(НСтр("ru='установка пароля пользователя'"));
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ИзменитьПарольПользователяВФоне"
		Или Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПодключитьБазуКАбонентуВФоне" Тогда
		ОбновитьЗаголовкиОжидания(НСтр("ru='регистрация этой базы в облаке'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибкиЗаданияПодключения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ФоновоеЗадание.Статус = "Ошибка" Тогда
		СообщениеПользователю = НСтр("ru='Не удалось подключить эту базу к облаку
				|" + ?(ЗначениеЗаполнено(Результат.ФоновоеЗадание.КраткоеПредставлениеОшибки), 
					Результат.ФоновоеЗадание.КраткоеПредставлениеОшибки, "") + "
				|Пожалуйста, проверьте используемые логин и пароль и повторите попытку еще раз'");
	Иначе
		СообщениеПользователю = НСтр("ru='Подключение к облаку было прервано пользователем.
				|Пожалуйста, проверьте используемые логин и пароль и повторите попытку еще раз'");
	КонецЕсли;
	ОбновитьПараметрыПодключения(Ложь);
	ОповеститьОПодключении();
	СообщитьОбОшибкеФоновогоЗадания(СообщениеПользователю, Результат.ФоновоеЗадание.ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияЗаданияПодключения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	ПрерыватьЗадание = Ложь;
	
	Если РезультатВыполнения.Свойство("ОписаниеОшибки") И ЗначениеЗаполнено(РезультатВыполнения.ОписаниеОшибки) Тогда
		
		СообщитьОбОшибкеФоновогоЗадания(РезультатВыполнения.ОписаниеОшибки, Неопределено);
		ПрерыватьЗадание = Истина;
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.НачатьРегистрациюАбонентаВФоне" Тогда
		
		Если РезультатВыполнения.КодСостояния = 302 И Не ЗначениеЗаполнено(РезультатВыполнения.АдресЗавершенияРегистрации) Тогда 
			СообщитьОбОшибкеФоновогоЗадания(НСтр("ru='Не удалось начать регистрацию абонента. Возможно, в данный момент облако недоступно, попробуйте позже'"), 
						НСтр("ru='Менеджер сервиса вернул пустую строку вместо адреса страницы регистрации нового абонента'"));
			ПрерыватьЗадание = Истина;
		КонецЕсли;
		
		Результат.НастройкиЗапуска.ПараметрыМетода = Новый Структура;
		Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("АдресЗавершенияРегистрации", РезультатВыполнения.АдресЗавершенияРегистрации);
		Результат.НастройкиЗапуска.ИнтервалОжидания = 1;
		
		ПараметрыОжидания = Новый Структура;
		ПараметрыОжидания.Вставить("КоличествоВызовов", 0);
		
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПроверитьСостояниеРегистрацииНовогоАбонентаВФоне" Тогда
		
		Если РезультатВыполнения.КодСостояния = 302 Тогда
			
			Если Не ЗначениеЗаполнено(РезультатВыполнения.АдресЗавершенияРегистрации) Тогда
				СообщитьОбОшибкеФоновогоЗадания(НСтр("ru='Не удалось проверить регистрацию нового абонента. Возможно, в данный момент облако недоступно, попробуйте позже'"), 
							НСтр("ru='При проверке завершения регистрации нового абонента адрес страницы регистрации был очищен'"));
				ПрерыватьЗадание = Истина;
			КонецЕсли;
			
			// задание проверки состояния выполняется до тех пор, пока не получим результат
			Результат.НастройкиЗапуска.ПараметрыМетода = Новый Структура;
			Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("АдресЗавершенияРегистрации", РезультатВыполнения.АдресЗавершенияРегистрации);
			Результат.НастройкиЗапуска.ПоследовательностьПроцедур.Вставить(0, "ДеньгиВОблаке.ПроверитьСостояниеРегистрацииНовогоАбонентаВФоне");
			Результат.НастройкиЗапуска.ИнтервалОжидания = Результат.НастройкиЗапуска.ИнтервалОжидания + 
						?(Результат.НастройкиЗапуска.ИнтервалОжидания > 7, 0, Результат.НастройкиЗапуска.ИнтервалОжидания * 1.5);
			
			ПараметрыОжидания.КоличествоВызовов =  ПараметрыОжидания.КоличествоВызовов + 1;
			
		Иначе
			
			// кэширование результатов подключения
			ЗаполнитьЗначенияСвойств(ПараметрыПодключения, РезультатВыполнения);
			ЗаписатьРегистрациюАбонента(ПараметрыПодключения.ПолныйПутьКБазе,
						ПараметрыПодключения.Логин,
						РезультатВыполнения.Пароль, //ПараметрыПодключения.Пароль,
						ПараметрыПодключения.НомерОбласти,
						ИмяЭтойБазы,
						ПараметрыПодключения.КодАбонента,
						Ложь);
			
			// Параметры для смены пароля
			Результат.НастройкиЗапуска.ПараметрыМетода = Новый Структура;
			Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("Логин",         РезультатВыполнения.Логин);
			Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("ТекущийПароль", РезультатВыполнения.Пароль);
			Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("НовыйПароль",   Пароль);
			Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("КодАбонента",   РезультатВыполнения.КодАбонента);
			
			Пароль = СокрЛП(РезультатВыполнения.Пароль);
			ОбновитьСценарии(СпособПодключения);
			ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
			
		КонецЕсли;
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ИзменитьПарольПользователяВФоне" Тогда
		
		Пароль = РезультатВыполнения.Пароль;
		// запись данных из кэша - только пароль берется из результатов выполнения задания
		ЗаписатьРегистрациюАбонента(ПараметрыПодключения.ПолныйПутьКБазе,
						ПараметрыПодключения.Логин,
						Пароль,
						ПараметрыПодключения.НомерОбласти,
						ИмяЭтойБазы,
						ПараметрыПодключения.КодАбонента,
						Ложь);
		
		// параметры для регистрации базы на сервере
		Результат.НастройкиЗапуска.ПараметрыМетода = Новый Структура;
		Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("ПараметрыПодключения",  ПараметрыПодключения);
		ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПодключитьБазуКАбонентуВФоне" Тогда
		
		// запись восстановленных данных
		ЗаписатьРегистрациюАбонента(РезультатВыполнения.ПолныйПутьКБазе,
						РезультатВыполнения.Логин,
						РезультатВыполнения.Пароль,
						РезультатВыполнения.НомерОбласти,
						ИмяЭтойБазы,
						РезультатВыполнения.КодАбонента,
						Ложь);
		
		// параметры для регистрации базы на сервере
		Результат.НастройкиЗапуска.ПараметрыМетода = Новый Структура;
		Результат.НастройкиЗапуска.ПараметрыМетода.Вставить("ПараметрыПодключения",  ПараметрыПодключения);
		ОбновитьСценарии(СпособПодключения);
		ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПроверитьРегистрациюБазыНаСервереВФоне" Тогда
		
		// серия фоновых заданий завершена
		ЗавершитьПодключениеБазыСервер();
		ВерутьсяСоСтраницыОжидания();
		ОповеститьОПодключении();
		ДеньгиКлиент.ОбновитьКлиентскиеПараметрыПриложения();
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПрерыватьЗадание Тогда
		Результат.НастройкиЗапуска.ПоследовательностьПроцедур.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегистрациюАбонента(НовыйПутьКБазе, НовыйЛогин, НовыйПароль, НомерОбласти, НовыйИмяЭтойБазы, НовыйКодАбонента, НовыйОтключено)

	ДеньгиВОблаке.ЗаписатьПараметрыСоединенияСОблаком(НовыйПутьКБазе, 
				НовыйЛогин, НовыйПароль, НомерОбласти, 
				НовыйИмяЭтойБазы, НовыйКодАбонента, НовыйОтключено);
	ОбновитьПараметрыПодключения(Ложь);

КонецПроцедуры

&НаСервере
Процедура ЗавершитьПодключениеБазыСервер()
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПоказатьQRкодСервер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСценарии(СпособПодключения)
	
	Если СпособПодключения = 2 Тогда
		// регистрация нового абонента 
		// пометить все для отправки
		ПланыОбмена.ЗарегистрироватьИзменения(СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий"));
		// Установить сценарий по умолчанию
		СинхронизацияАвтономныхКопий.УстановитьСтандартныйСценарийЗапросаДанных(
				СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий"));
	Иначе
		// подключение к существующему абоненту
		// очистка сценариев для исключения автоматической синхронизации устаревших данных
		ОчиститьСценарииСинхронизации();
	КонецЕсли;
	
КонецПроцедуры
 

#КонецОбласти 


#Область Запись_изменений_на_сервере

// Запуск фонового метода как единственного этапа в цепочке
&НаКлиенте
Процедура ЗаписатьИзмененияКлиент()

	ПредыдущаяСтраница = Элементы.ГруппаСтраницыФормы.ТекущаяСтраница;
	КартинкаQR = Неопределено;
	
	// Подготовка серии фоновых заданий
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Изменение пароля и имени базы в облаке");
	
	// Параметры первого метода последовательности
	НастройкиЗапуска.ПараметрыМетода = Новый Структура;
	НастройкиЗапуска.ПараметрыМетода.Вставить("ПараметрыПодключения", ПараметрыПодключения);
	НастройкиЗапуска.ПараметрыМетода.Вставить("Пароль",      Пароль);
	НастройкиЗапуска.ПараметрыМетода.Вставить("ИмяЭтойБазы", ИмяЭтойБазы);
	
	// Последовательность действий, выполняемых в фоне
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ИзменитьПарольИИмяБазыВОблакеВФоне");
	
	// Обработчики событий фонового задания
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиЗаданияИзменения", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияЗаданияИзменения", ЭтотОбъект);
	
	
	// Подготовка формы
	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	Элементы.Отменить.Видимость = Истина;
	ОбновитьЗаголовкиОжидания(НСтр("ru='отправка изменений в облако'"), НСтр("ru='Запись изменений'"));
	
	ПодключитьОбработчикОжидания("НачатьФоновоеЗадание", 0.7, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибкиЗаданияИзменения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ФоновоеЗадание.Статус = "Ошибка" Тогда
		СообщениеПользователю = НСтр("ru='Не удалось записать изменения в облаке
				|Пожалуйста, проверьте подключение к интернету и повторите попытку еще раз 
				|или откажитесь от изменений'");
	Иначе
		СообщениеПользователю = НСтр("ru='Подключение к облаку было прервано пользователем.
				|Пожалуйста, повторите попытку еще раз или откажитесь от изменений'");
	КонецЕсли;
	СообщитьОбОшибкеФоновогоЗадания(СообщениеПользователю, Результат.ФоновоеЗадание.ПодробноеПредставлениеОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияЗаданияИзменения(Результат, ДополнительныеПараметры) Экспорт
	
	ЗавершитьЗаписьИзмененийСервер();
	ВерутьсяСоСтраницыОжидания();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьЗаписьИзмененийСервер()
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьПараметрыПодключения(Истина);
	ПоказатьQRкодСервер();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьСценарииСинхронизации()
	
	УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	Если ЗначениеЗаполнено(УзелЦБ) Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			Неопределено, Неопределено, Неопределено);
		СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(УзелЦБ, Изменения);
	КонецЕсли;
	
КонецПроцедуры
 

#КонецОбласти 


#КонецОбласти

&НаКлиенте
Процедура ВыключитьСинхронизациюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыключитьСинхронизациюСервер();
	ОбновитьИнтерфейс();
	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
	Оповестить("СинхронизацияВыключена");
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьСинхронизациюСервер()
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
	
		Константы.ИспользоватьСинхронизациюДанных.Установить(Ложь);

		// Выбор способа устанавливает функциональные опции
		Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОПодключении()
	
	Оповестить("ПодключениеКОблакуИзменено", ПодключениеВыполнено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеВПоддержку()

	Состояние(НСтр("ru='Подготовка технологической информации...'"));
	
	ПараметрыФормы = ПараметрыСообщения();
	Если ПредыдущаяСтраница = Элементы.СтраницаПараметрыУчетнойЗаписи Тогда
		ПараметрыФормы.Тема = "Ошибка сохранения изменений в учетной записи 1С:Деньги";
		Действие = "Запись изменений";
	Иначе
		ПараметрыФормы.Тема = "Ошибка подключения к учетной записи 1С:Деньги";
		Действие = ?(ПредыдущаяСтраница = Элементы.СтраницаРегистрация, 
				"Регистрация нового абонента", 
				"Подключение к абоненту");
	КонецЕсли;
	
	ПараметрыФормы.Тело = "Форма ""Подключение к облаку"".
		|Выполняемое действие: " + Действие + " 
		|Ошибка: " + ТекстОшибки + ", 
		|	
		|	* дата: " + ТекущаяДатаКлиентСервер();
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВСлужбуПоддержки", ПараметрыФормы, ЭтотОбъект, Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыСообщения()

	Возврат ПоддержкаПользователейДеньги.НоваяСтруктураСообщения();

КонецФункции

&НаСервере
Процедура ПоказатьQRкодСервер()
	
	Если Не ЗначениеЗаполнено(ПараметрыПодключения) Или Не ЗначениеЗаполнено(ПараметрыПодключения.ПолныйПутьКБазе) Тогда
		КартинкаQR = "";
		Возврат;
	КонецЕсли;
	
	СтрокаШаблона = ПараметрыПодключения.Логин+"%"+ПараметрыПодключения.Пароль+"%"+ПараметрыПодключения.КодАбонента+"%";
	СтрокаСоединения = "CloudConnetc:" + ПараметрыПодключения.ПолныйПутьКБазе + "?" + СтрокаШаблона;
	КартинкаQR = ПоместитьВоВременноеХранилище(Новый Картинка(ОтчетыСервер.ДанныеQRКода(СтрокаСоединения,1,240), Истина), УникальныйИдентификатор);
	Элементы.ГруппаКартинкиQR.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВыйтиИзУчетнойЗаписиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыйтиИзУчетнойЗаписиСервер();
	ОповеститьОПодключении();
	
КонецПроцедуры

&НаСервере
Процедура ВыйтиИзУчетнойЗаписиСервер()
	
	Попытка
		
		УзелЦБ = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
		Если ЗначениеЗаполнено(УзелЦБ) Тогда
			ДеньгиОбменСЦентральнойБазой.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(Ложь, УзелЦБ, Истина);
		КонецЕсли;
		ДеньгиВОблаке.ОчиститьПараметрыСоединенияСОблаком();
		ОбновитьПовторноИспользуемыеЗначения();
		
	Исключение
		ВызватьИсключение НСтр("ru='Не удалось изменить настройки соединения.
			|Возможно, в данный момент выполняется обмен или настройки заблокированы другим процессом.
			|Проверьте/остановите синхронизацию и повторите попытку'");
	КонецПопытки;
	ОбновитьПараметрыПодключения(Истина);
	Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПодключение;
	
КонецПроцедуры
 

#КонецОбласти
