#Область НастройкиДоступаКРесурсуСАктуальнымиСведениями

//Процедура ПродолжитьПослеЗапросаПодтвержденияДоступаВИнтернет(Знач ОписаниеОповещенияДляПродолжения) Экспорт

//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ОписаниеОповещенияДляПродолжения", ОписаниеОповещенияДляПродолжения);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПослеЗапросаПодтвержденияДоступаВИнтернетЗавершение", ЭтотОбъект, ДополнительныеПараметры);

//	ОткрытьФорму("Обработка.ОнлайнСервисыРегламентированнойОтчетности.Форма.ПодтверждениеВыходаВИнтернет",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
//	
//КонецПроцедуры

//Процедура ПродолжитьПослеЗапросаПодтвержденияДоступаВИнтернетЗавершение(РезультатПоказа, ДополнительныеПараметры) Экспорт
//	
//	ОписаниеОповещенияДляПродолжения = ДополнительныеПараметры.ОписаниеОповещенияДляПродолжения;
//	
//	Если РезультатПоказа = Ложь Тогда
//		ПоказатьПредупреждение(, "Запрос на доступ в Интернет будет выдан повторно после обновления релиза конфигурации.");
//		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("ОнлайнСервисыРО_ДоступЗапрещенВерсияРелиза", , ОнлайнСервисыРегламентированнойОтчетности.ВерсияПрограммы());
//	КонецЕсли;
//	
//	ВыполнитьОбработкуОповещения(ОписаниеОповещенияДляПродолжения, РезультатПоказа);
//	
//КонецПроцедуры

//Процедура ЗапроситьПараметрыПрокси(Знач ОписаниеОповещенияДляПродолжения = Неопределено) Экспорт
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ОписаниеОповещенияДляПродолжения", ОписаниеОповещенияДляПродолжения);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ЗапроситьПараметрыПроксиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
//	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера",,,,,, ОписаниеОповещения);

//КонецПроцедуры

//Процедура ЗапроситьПараметрыПроксиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//    
//    ОписаниеОповещенияДляПродолжения = ДополнительныеПараметры.ОписаниеОповещенияДляПродолжения;
//	Если ОписаниеОповещенияДляПродолжения <> Неопределено Тогда
//		ВыполнитьОбработкуОповещения(ОписаниеОповещенияДляПродолжения, Результат);
//	КонецЕсли;

//КонецПроцедуры

#КонецОбласти

Процедура АктуализироватьСлужебнуюИнформациюМеханизмаОнлайнСервисовРОПриНеобходимости(УникальныйИдентификаторФормы) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

//Процедура АктуализироватьСлужебнуюИнформациюМеханизмаОнлайнСервисовРОПриНеобходимостиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат <> Истина Тогда
//		Возврат;
//	КонецЕсли;
//	
//	УникальныйИдентификаторФормы = ДополнительныеПараметры.УникальныйИдентификаторФормы;
//	
//	// Если нет доступа к регистру, то не выполняем актуализацию
//	Если НЕ ОнлайнСервисыРегламентированнойОтчетности.ЕстьПравоИзмененияРегистраРесурсыМеханизмаОнлайнСервисовРО() Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ОнлайнСервисыРегламентированнойОтчетности.ЗапуститьФоновоеЗаданиеАктуализироватьСлужебнуюИнформациюМеханизмаОнлайнСервисовРО(УникальныйИдентификаторФормы);
//	
//КонецПроцедуры

#Область МеханизмБлокировок

Процедура ПроверкаОнлайнБлокировки(ВыполняемоеОповещение, Объект, БлокируемаяФункция = "И") Экспорт
	
	// ДЕНЬГИ
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Истина);
	// Конец ДЕНЬГИ
	
КонецПроцедуры

//Функция ВерсияМодуляВБазеСодержитИсправление(ВерсияМодуляДокументооборотаСИсправлениемОшибки) Экспорт
//	
//	ВерсияМодуляВБазе = ЧислоИзСтроки(ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ВерсияВнешнегоМодуляДокументооборота());
//	Если ВерсияМодуляВБазе = Неопределено Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ВерсияМодуляСИсправлениемОшибки = ЧислоИзСтроки(ВерсияМодуляДокументооборотаСИсправлениемОшибки);
//	Если ВерсияМодуляСИсправлениемОшибки = Неопределено Тогда
//		Возврат Неопределено;
//	КонецЕсли;	
//	
//	Возврат ВерсияМодуляВБазе >= ВерсияМодуляСИсправлениемОшибки;
//	
//КонецФункции

//Функция ЧислоИзСтроки(Знач Текст)
//	
//	Текст = СтрЗаменить(Текст, Символы.НПП, "");
//	
//	Попытка
//		Число = Число(Текст);
//	Исключение
//		Число = Неопределено;
//	КонецПопытки;
//	
//	Возврат Число;

//КонецФункции

//Процедура ПроверкаОнлайнБлокировкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Результат);
//	
//КонецПроцедуры

Процедура ПроверкаФормыПоПериодуПрименения(ВыполняемоеОповещение, Форма) Экспорт
	
	// ДЕНЬГИ
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Истина);
	// Конец ДЕНЬГИ
	
КонецПроцедуры

//Процедура ПроверкаФормыПоПериодуПримененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Результат);
//	
//КонецПроцедуры

Процедура ПроверкаФорматаПоПериодуПрименения(ВыполняемоеОповещение, Форма) Экспорт
	
	// ДЕНЬГИ
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Истина);
	// Конец ДЕНЬГИ
	
КонецПроцедуры

//Процедура ПроверкаФорматаПоПериодуПримененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Результат);
//	
//КонецПроцедуры

#Область ОткрытиеФормУведомлений

//Процедура ПоказатьУведомлениеОБлокировке(ВыполняемоеОповещение, Объект, СвойстваБлокировки)
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ЗапретНаПродолжение", 								СвойстваБлокировки.Жесткая);
//	ПараметрыФормы.Вставить("ТекстЗаголовок", 									ПредставлениеОбъектаБлокировки(Объект));
//	ПараметрыФормы.Вставить("ТекстПодробнее", 									СвойстваБлокировки.Комментарий);
//	ПараметрыФормы.Вставить("БлокируемаяФункция", 								СвойстваБлокировки.Функция);
//	ПараметрыФормы.Вставить("БлокировкаФормыИЛИФормата", 						Ложь);
//	ПараметрыФормы.Вставить("ВерсияМодуляДокументооборотаСИсправлениемОшибки", 	СвойстваБлокировки.ВерсияМодуляДокументооборотаСИсправлениемОшибки);
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьУведомлениеОБлокировкеЗавершение", ЭтотОбъект, ДополнительныеПараметры);

//	Если Объект.Модифицированность Тогда
//		// Открываем с указанием владельца
//		ОткрытьФорму("Обработка.ОнлайнСервисыРегламентированнойОтчетности.Форма.УведомлениеОБлокировкеФормыИЛИФормата", ПараметрыФормы,Объект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Иначе
//		// Открываем без указания владельца
//		ОткрытьФорму("Обработка.ОнлайнСервисыРегламентированнойОтчетности.Форма.УведомлениеОБлокировкеФормыИЛИФормата", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ПоказатьУведомлениеОБлокировкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Результат);
//	
//КонецПроцедуры

//Процедура ПоказатьУведомлениеОБлокировкеУтвержденнойФормы(ВыполняемоеОповещение, Объект, СведенияПоБлокировке) Экспорт
//	
//	ПараметрыФормы = Новый Структура; 
//	ПараметрыФормы.Вставить("ЗапретНаПродолжение", 								СведенияПоБлокировке.Жесткая);
//	ПараметрыФормы.Вставить("ТекстЗаголовок", 									СведенияПоБлокировке.ТекстЗаголовок);
//	ПараметрыФормы.Вставить("ТекстПодробнее", 									СведенияПоБлокировке.ТекстПодробнее);
//	ПараметрыФормы.Вставить("ТекстИспользуйте", 								СведенияПоБлокировке.ТекстИспользуйте);
//	ПараметрыФормы.Вставить("БлокировкаФормы", 									Истина);
//	ПараметрыФормы.Вставить("БлокировкаФормыИЛИФормата", 						Истина);
//	ПараметрыФормы.Вставить("ВерсияМодуляДокументооборотаСИсправлениемОшибки",	"");
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьУведомлениеОБлокировкеУтвержденнойФормыЗавершение", ЭтотОбъект, ДополнительныеПараметры);

//	ОткрытьФорму("Обработка.ОнлайнСервисыРегламентированнойОтчетности.Форма.УведомлениеОБлокировкеФормыИЛИФормата", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//Процедура ПоказатьУведомлениеОБлокировкеУтвержденнойФормыЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Результат);
//	
//КонецПроцедуры

//Процедура ПоказатьУведомлениеОБлокировкеУтвержденногоФормата(ВыполняемоеОповещение, Объект, СведенияПоБлокировке) Экспорт
//	
//	ПараметрыФормы = Новый Структура; 
//	ПараметрыФормы.Вставить("ЗапретНаПродолжение", 								СведенияПоБлокировке.Жесткая);
//	ПараметрыФормы.Вставить("ТекстЗаголовок", 									СведенияПоБлокировке.ТекстЗаголовок);
//	ПараметрыФормы.Вставить("ТекстПодробнее", 									СведенияПоБлокировке.ТекстПодробнее);
//	ПараметрыФормы.Вставить("ТекстИспользуйте", 								СведенияПоБлокировке.ТекстИспользуйте);
//	ПараметрыФормы.Вставить("БлокировкаФормы", 									Ложь);
//	ПараметрыФормы.Вставить("БлокировкаФормыИЛИФормата", 						Истина);
//	ПараметрыФормы.Вставить("ВерсияМодуляДокументооборотаСИсправлениемОшибки",	"");
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьУведомлениеОБлокировкеУтвержденногоФорматаЗавершение", ЭтотОбъект, ДополнительныеПараметры);

//	ОткрытьФорму("Обработка.ОнлайнСервисыРегламентированнойОтчетности.Форма.УведомлениеОБлокировкеФормыИЛИФормата", ПараметрыФормы,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//Процедура ПоказатьУведомлениеОБлокировкеУтвержденногоФорматаЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ВыполняемоеОповещение, Результат);
//	
//КонецПроцедуры

//Процедура ОткрытьФормуДоступныхОбновленийРО() Экспорт
//	
//	ОткрытьФорму("Обработка.ОнлайнСервисыРегламентированнойОтчетности.Форма.ДоступныеОбновленияРегламентированнойОтчетности");
//	
//КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СобытияРегламентированныхОтчетов

Процедура ПередЗагрузкойРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗагрузкойРегламентированногоОтчетаПродолжение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма, "ЗГ");
	
КонецПроцедуры

Процедура ПередЗагрузкойРегламентированногоОтчетаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	Форма                 = ДополнительныеПараметры.Форма;
	Отказ                 = ДополнительныеПараметры.Отказ;
	
	Если Результат = Неопределено ИЛИ НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;
	
	// ПроверкаФорматаПоПериодуПрименения
	НовыеДополнительныеПараметры = Новый Структура();
	НовыеДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	НовыеДополнительныеПараметры.Вставить("Отказ", Отказ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗагрузкойРегламентированногоОтчетаЗавершение", ЭтотОбъект, НовыеДополнительныеПараметры);
	
	ПроверкаФорматаПоПериодуПрименения(ОписаниеОповещения, Форма);
	
КонецПроцедуры

Процедура ПередЗагрузкойРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ                 = ДополнительныеПараметры.Отказ;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	
	Если Результат = Неопределено ИЛИ НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

// Параметры:
//	ВыполняемоеОповещение                  - ОписаниеОповещения - Описание оповещения, которое будет вызвано после открытия формы регламентированного отчета
//                                                       В качестве результата описания оповещения передается булевская переменная. Если Истина - форму нужно закрыть
Процедура ПередОткрытиемФормыРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередОткрытиемФормыРегламентированногоОтчетаПродолжение", ЭтотОбъект, ДополнительныеПараметры);
			
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма);
	
КонецПроцедуры

Процедура ПередОткрытиемФормыРегламентированногоОтчетаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Форма 					= ДополнительныеПараметры.Форма;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	// ПроверкаФормыПоПериодуПрименения
	НовыеДополнительныеПараметры = Новый Структура();
	НовыеДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	НовыеДополнительныеПараметры.Вставить("Отказ", Отказ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередОткрытиемФормыРегламентированногоОтчетаЗавершение", ЭтотОбъект, НовыеДополнительныеПараметры);
	
	ПроверкаФормыПоПериодуПрименения(ОписаниеОповещения, Форма);
	
КонецПроцедуры

Процедура ПередОткрытиемФормыРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

Процедура ПередПечатьюРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередПечатьюРегламентированногоОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма, "П");
	
КонецПроцедуры

Процедура ПередПечатьюРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

Процедура ПередПечатьюМЧБРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередПечатьюМЧБРегламентированногоОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма, "ПВ");
	
КонецПроцедуры

Процедура ПередПечатьюМЧБРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

Процедура ПередВыгрузкойРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередВыгрузкойРегламентированногоОтчетаПродолжение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма, "В");
	
КонецПроцедуры

Процедура ПередВыгрузкойРегламентированногоОтчетаПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Форма 					= ДополнительныеПараметры.Форма;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	// ПроверкаФорматаПоПериодуПрименения
	НовыеДополнительныеПараметры = Новый Структура();
	НовыеДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	НовыеДополнительныеПараметры.Вставить("Отказ", Отказ);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередВыгрузкойРегламентированногоОтчетаЗавершение", ЭтотОбъект, НовыеДополнительныеПараметры);
	
	ПроверкаФорматаПоПериодуПрименения(ОписаниеОповещения, Форма);
	
КонецПроцедуры

Процедура ПередВыгрузкойРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

Процедура ПередЗаполнениемРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаполнениемРегламентированногоОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма, "З");
	
КонецПроцедуры

Процедура ПередЗаполнениемРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если НЕ Результат Тогда
		Отказ = Истина;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

Процедура ПередОтправкойРегламентированногоОтчета(ВыполняемоеОповещение, Форма, Отказ) Экспорт
	
	// ПроверкаОнлайнБлокировки
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВыполняемоеОповещение", ВыполняемоеОповещение);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПередОтправкойРегламентированногоОтчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
	ПроверкаОнлайнБлокировки(ОписаниеОповещения, Форма, "О");
	
КонецПроцедуры

Процедура ПередОтправкойРегламентированногоОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполняемоеОповещение 	= ДополнительныеПараметры.ВыполняемоеОповещение;
	Отказ 					= ДополнительныеПараметры.Отказ;
	
	Если Результат <> Истина Тогда
		Отказ = Истина;
	КонецЕсли;

	ВыполнитьОбработкуОповещения(ВыполняемоеОповещение, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция ИмяФормы(СтруктураРеквизитовФормы)
//	
//	ИмяФормы = Неопределено;
//	Если НЕ РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мВыбраннаяФорма") 
//			И НЕ РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мСохраненныйДок") Тогда
//		ИмяФормы = Неопределено;
//	ИначеЕсли РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мВыбраннаяФорма") 
//			И ЗначениеЗаполнено(СтруктураРеквизитовФормы.мВыбраннаяФорма) Тогда
//		ИмяФормы = СтруктураРеквизитовФормы.мВыбраннаяФорма;
//	ИначеЕсли РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мСохраненныйДок") 
//			И РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы.мСохраненныйДок, "ВыбраннаяФорма") 
//			И ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма) Тогда
//		ИмяФормы = СтруктураРеквизитовФормы.мСохраненныйДок.ВыбраннаяФорма;
//	КонецЕсли;
//	
//	Возврат ИмяФормы;
//	
//КонецФункции

//Функция ИДОтчета(Объект)
//	
//	СоставляющиеИмениФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Объект.ИмяФормы, ".");
//	
//	Если СоставляющиеИмениФормы.Количество() >= 1 Тогда
//		ИДОтчета = ВРЕГ(СоставляющиеИмениФормы[1]);
//	Иначе
//		ИДОтчета = Неопределено;
//	КонецЕсли;
//	
//	Возврат ИДОтчета;
//	
//КонецФункции


//Функция ПолучитьКраткуюВерсиюОтчета(ОбъектОтчет) Экспорт

//	Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ОбъектОтчет, "мВерсияОтчета") Тогда
//		ПолнаяВерсияОтчета = ОбъектОтчет.мВерсияОтчета;
//		КраткаяВерсия = ВыделитьКраткуюВерсиюОтчетаИзПолной(ПолнаяВерсияОтчета);
//		Возврат ?(ЗначениеЗаполнено(КраткаяВерсия), КраткаяВерсия, Неопределено);
//	КонецЕсли;
//	
//	Возврат Неопределено;
//	
//КонецФункции

//Функция ВыделитьКраткуюВерсиюОтчетаИзПолной(ПолнаяВерсияОтчета)
//	
//	Если НЕ ЗначениеЗаполнено(ПолнаяВерсияОтчета) Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ВхождениеПробела = Найти(ПолнаяВерсияОтчета, " ");
//	Если ВхождениеПробела = 0 Тогда
//		Возврат Неопределено;
//	Иначе
//		Возврат СокрЛП(Сред(ПолнаяВерсияОтчета, ВхождениеПробела + 1));
//	КонецЕсли;
//	
//КонецФункции

//// Предназначена для формирования заголовка формы уведомления о блокировках (УведомлениеОБлокировке)
//Функция ПредставлениеОбъектаБлокировки(Объект)
//	
//	ПредставлениеОтчета = СокрЛП(Объект.Заголовок) + ".";
//	Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда
//		
//		ПредставлениеФормы = Неопределено;
//		СтруктураРеквизитовФормы = Объект.СтруктураРеквизитовФормы;
//		
//		
//		Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мВыбраннаяФорма") Тогда
//			
//			ВыбраннаяФорма = СтруктураРеквизитовФормы.мВыбраннаяФорма;
//			ИДОтчета = ИДОтчета(Объект);
//			
//			ПредставлениеФормы = ОнлайнСервисыРегламентированнойОтчетности.ПредставлениеФормы(ИДОтчета, ВыбраннаяФорма);
//			
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(ПредставлениеФормы) Тогда
//			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мДатаНачалаПериодаОтчета") 
//					И РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(СтруктураРеквизитовФормы, "мДатаКонцаПериодаОтчета") Тогда
//				ДатаНачалаПериодаОтчета = СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
//				ДатаКонцаПериодаОтчета = СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
//				Если ЗначениеЗаполнено(ДатаНачалаПериодаОтчета) И ЗначениеЗаполнено(ДатаКонцаПериодаОтчета) Тогда
//					ПредставлениеФормы = "за период " + ПредставлениеПериода(НачалоДня(ДатаНачалаПериодаОтчета), КонецДня(ДатаКонцаПериодаОтчета), "ФП = Истина");
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(ПредставлениеФормы) Тогда
//			Возврат ПредставлениеОтчета;
//		Иначе
//			Возврат ПредставлениеОтчета + "<BR>" + СокрЛП(ПредставлениеФормы) + ".";
//		КонецЕсли;
//		
//	Иначе
//		Возврат ПредставлениеОтчета;
//	КонецЕсли;
//	
//КонецФункции

Процедура ПопытатьсяПерейтиПоНавигационнойСсылке(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ПерейтиПоНавигационнойСсылке(Ссылка);
		
	Исключение
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось перейти по указанной ссылке!'"));
		
	КонецПопытки; 
	
КонецПроцедуры


#КонецОбласти
