#Область ОписаниеФормы

// Описывает "словарь" реквизитов, представленных в формах для отчетности.
// Это могут быть как реквизиты организации (основного объекта формы),
// так и реквизиты формы.
// Отличить одни от других можно с помощью функции РазмещениеДанныхФормыДляОтчетности.
//
Функция ВсеРеквизитыДляОтчетности(ЮридическоеФизическоеЛицо)
	
	ЭтоЮрлицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
	Реквизиты = Новый Массив;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Реквизиты, ВсеРеквизитыОрганизацииДляОтчетности(ЭтоЮрлицо));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Реквизиты, ВсеРеквизитыКонтактнойИнформацииДляОтчетности(ЭтоЮрлицо));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Реквизиты, ВсеРеквизитыРуководителяДляОтчетности(ЭтоЮрлицо));
	
	Возврат Реквизиты;
	
КонецФункции

Функция ВсеРеквизитыОрганизацииДляОтчетности(ЭтоЮрлицо)
	
	Реквизиты = Новый Массив;
	
	Если ЭтоЮрлицо Тогда
		Реквизиты.Добавить("НаименованиеСокращенное");   // Только для юрлиц
		Реквизиты.Добавить("НаименованиеПолное");        // Только для юрлиц
	Иначе
		Реквизиты.Добавить("ФамилияИП");                 // Только для ИП
		Реквизиты.Добавить("ИмяИП");                     // Только для ИП
		Реквизиты.Добавить("ОтчествоИП");                // Только для ИП
	КонецЕсли;
	
	Реквизиты.Добавить("ИНН");
	
	Если ЭтоЮрлицо Тогда
		Реквизиты.Добавить("КПП");                       // Только для юрлиц
	КонецЕсли;
	
	Реквизиты.Добавить("ДатаРегистрации");
	
	Если НЕ ЭтоЮрлицо Тогда
		Реквизиты.Добавить("ИПРегистрационныйНомерПФР"); // Только для ИП
	КонецЕсли;
	
	Реквизиты.Добавить("РегистрационныйНомерПФР");
	Реквизиты.Добавить("РегистрационныйНомерФСС");
	Реквизиты.Добавить("КодПоОКПО");
	Реквизиты.Добавить("КодПоОКТМО");
	Реквизиты.Добавить("КодНалоговогоОргана");
	Реквизиты.Добавить("НаименованиеНалоговогоОргана");
	Реквизиты.Добавить("КодОрганаПФР");
	Реквизиты.Добавить("НаименованиеТерриториальногоОрганаПФР");
	Реквизиты.Добавить("КодПодчиненностиФСС");
	Реквизиты.Добавить("НаименованиеТерриториальногоОрганаФСС");
	Реквизиты.Добавить("КодОКВЭД2");
	Реквизиты.Добавить("НаименованиеОКВЭД2");
	Реквизиты.Добавить("ОГРН");
	
	Возврат Реквизиты;
	
КонецФункции

Функция ВсеРеквизитыКонтактнойИнформацииДляОтчетности(ЭтоЮрлицо)
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Телефон");
	Реквизиты.Добавить("Адрес");
	
	Возврат Реквизиты;
	
КонецФункции

Функция ВсеРеквизитыРуководителяДляОтчетности(ЭтоЮрлицо)
	
	Реквизиты = Новый Массив;
	
	Если НЕ ЭтоЮрлицо Тогда
		// Реквизиты руководителя требуются только для юрлиц.
		Возврат Реквизиты;
	КонецЕсли;
	
	Реквизиты.Добавить("РуководительФамилия");
	Реквизиты.Добавить("РуководительИмя");
	Реквизиты.Добавить("РуководительОтчество");
	Реквизиты.Добавить("РуководительДолжность");
	
	Возврат Реквизиты;
	
КонецФункции

// Описывает размещение проверяемых реквизитов в форме
// 
// Возвращаемое значение:
//  Структура - перечень реквизитов, размещенных на форме отдельно от объекта организации
//   * Ключ - имя реквизита из словаря, приведенного в ВсеРеквизитыДляОтчетности()
//   * Значение - путь в форме к данным этого реквизита
//
Функция РазмещениеДанныхФормыДляОтчетности()
	
	Пути = Новый Структура;
	
	Пути.Вставить("КодПоОКТМО",            "КодПоОКТМО");
	
	Пути.Вставить("Адрес",                 "КонтактнаяИнформацияПолеЮрАдресОрганизации");
	Пути.Вставить("Телефон",               "КонтактнаяИнформацияПолеТелефонОрганизации");
	
	Пути.Вставить("РуководительФамилия",   "РуководительФамилия");
	Пути.Вставить("РуководительИмя",       "РуководительИмя");
	Пути.Вставить("РуководительОтчество",  "РуководительОтчество");
	Пути.Вставить("РуководительДолжность", "РуководительДолжность");
	
	// Остальные реквизиты предполагаются в Объект (Объект.Наименование и т.п.)
	
	Возврат Пути;
	
КонецФункции

Функция СвязанныеДанные()
	
	// Группу связанных данных считаем атомарной:
	// должны быть заполнены все элементы группы или ни один из них.
	
	СвязанныеДанные = Новый Соответствие;
	// Для оптимизации группы описаны многократно - для каждого из элементов группы описана вся группа:
	// * ключ     - путь к данным, входящим в одну из групп
	// * значение - список путей к остальным данным, входящим в эту группу
	// См. также ОстальныеЭлементыГруппыСвязанных()
	
	// 1. Наименования обязательны, если указаны коды, и наоборот
	СвязанныеДанные.Вставить("Объект.КодОрганаПФР",                          "Объект.НаименованиеТерриториальногоОрганаПФР");
	СвязанныеДанные.Вставить("Объект.НаименованиеТерриториальногоОрганаПФР", "Объект.КодОрганаПФР");
	
	СвязанныеДанные.Вставить("Объект.НаименованиеТерриториальногоОрганаФСС", "Объект.КодПодчиненностиФСС");
	СвязанныеДанные.Вставить("Объект.КодПодчиненностиФСС",                   "Объект.НаименованиеТерриториальногоОрганаФСС");
	
	СвязанныеДанные.Вставить("Объект.НаименованиеОКВЭД2",                    "Объект.КодОКВЭД2");
	СвязанныеДанные.Вставить("Объект.КодОКВЭД2",                             "Объект.НаименованиеОКВЭД2");
	
	// 2. Законодательство РФ предполагает, что у человека обязательно есть имя и фамилия
	СвязанныеДанные.Вставить("РуководительФамилия",                          "РуководительИмя");
	СвязанныеДанные.Вставить("РуководительИмя",                              "РуководительФамилия");
	
	// 3. В программе код ОКТМО хранится в составе данных о налоговой инспекции и зависит от адреса
	СвязанныеДанные.Вставить("Объект.КодНалоговогоОргана",                   "КонтактнаяИнформацияПолеЮрАдресОрганизации,КодПоОКТМО,Объект.НаименованиеНалоговогоОргана");
	СвязанныеДанные.Вставить("Объект.НаименованиеНалоговогоОргана",          "КонтактнаяИнформацияПолеЮрАдресОрганизации,КодПоОКТМО,Объект.КодНалоговогоОргана");
	СвязанныеДанные.Вставить("КодПоОКТМО",                                   "КонтактнаяИнформацияПолеЮрАдресОрганизации,Объект.КодНалоговогоОргана,Объект.НаименованиеНалоговогоОргана");
	СвязанныеДанные.Вставить("КонтактнаяИнформацияПолеЮрАдресОрганизации",   "КодПоОКТМО,Объект.КодНалоговогоОргана,Объект.НаименованиеНалоговогоОргана");
	
	Возврат СвязанныеДанные;
	
КонецФункции

Функция СвязанныеНадписи()
	
	СвязанныеНадписи = Новый Соответствие;
	СвязанныеНадписи.Вставить("ЗаполнитьРеквизитыПоИНН",         "ИНН");
	СвязанныеНадписи.Вставить("ПояснениеНекорректныйИНН",        "ИНН");
	СвязанныеНадписи.Вставить("ПояснениеНекорректныйКодПоОКТМО", "КодПоОКТМО");
	СвязанныеНадписи.Вставить("ПодсказкаОКВЭД2",                 "КодОКВЭД2");
	
	Возврат СвязанныеНадписи;
	
КонецФункции

Функция ЗаголовкиРеквизитовФормыИсключения(ЮридическоеФизическоеЛицо)
	
	// Обычно заголовки реквизитов заданы в метаданных справочника.
	// Исключения описаны в функции
	
	ЭтоЮрлицо = (ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо);
	
	ОсобенныеРеквизиты = Новый Соответствие;
	
	ОсобенныеРеквизиты.Вставить("КодПоОКТМО", НСтр("ru = 'Код по ОКТМО'"));
	
	ОсобенныеРеквизиты.Вставить("Телефон", НСтр("ru = 'Телефон'"));
	Если ЭтоЮрлицо Тогда
		ОсобенныеРеквизиты.Вставить("Адрес", НСтр("ru = 'Юридический адрес'"));
	Иначе
		ОсобенныеРеквизиты.Вставить("Адрес", НСтр("ru = 'Адрес места жительства'"));
	КонецЕсли;
	
	ОсобенныеРеквизиты.Вставить("КодОКВЭД2",          НСтр("ru = 'Код основного вида деятельности'"));
	ОсобенныеРеквизиты.Вставить("НаименованиеОКВЭД2", НСтр("ru = 'Наименование основного вида деятельности'"));
	
	Если ЭтоЮрлицо Тогда
		ОсобенныеРеквизиты.Вставить("РуководительФамилия",   НСтр("ru = 'Фамилия руководителя'"));
		ОсобенныеРеквизиты.Вставить("РуководительИмя",       НСтр("ru = 'Имя руководителя'"));
		ОсобенныеРеквизиты.Вставить("РуководительОтчество",  НСтр("ru = 'Отчество руководителя'"));
		ОсобенныеРеквизиты.Вставить("РуководительДолжность", НСтр("ru = 'Должность руководителя'"));
	КонецЕсли;
	
	Возврат ОсобенныеРеквизиты;
	
КонецФункции

Функция ОписанияНезаполненныхЗначений()
	
	Описания = Новый Соответствие;
	
	Описания.Вставить(
		"КонтактнаяИнформацияПолеЮрАдресОрганизации",
		УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки());
		
	Возврат Описания;
		
КонецФункции

#КонецОбласти

#Область КонтактнаяИнформация

Процедура НастроитьЭлементыКонтактнойИнформации(Форма) Экспорт
	
	// Инициализируем только адрес и телефон, представленные на форме реквизитами, созданными для них.
	// Остальные поля контактной информации не отображаются на форме.
	// Это обеспечивается последним параметром (ОтложеннаяИнициализация)
	
	ИсключаемыеВиды = Новый Массив();
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	ИсключаемыеВиды.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	ПараметрыРазмещенияКонтактнойИнформации = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ПараметрыРазмещенияКонтактнойИнформации.ИмяЭлементаДляРазмещения = "КонтактныеДанные";
	ПараметрыРазмещенияКонтактнойИнформации.ИсключаемыеВиды = ИсключаемыеВиды;
	ПараметрыРазмещенияКонтактнойИнформации.ОтложеннаяИнициализация = Истина;
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(Форма, Форма.Объект, ПараметрыРазмещенияКонтактнойИнформации);
	
КонецПроцедуры

// Заполняет свойства объекта, хранящие контактную информацию и зависящие от адреса
//
// Параметры:
//  Форма			 - ФормаКлиентскогоПриложения - форма организации с реквизитами из подсистемы контактной информации
//                     (в т.ч. КонтактнаяИнформацияОписаниеДополнительныхРеквизитов)
//  ТекущийОбъект	 - СправочникОбъект.Организации - записываемый объект
//  Отказ			 - Булево - возвращаемый параметр, Истина, если так скажет подсистема контактной информации
//
Процедура ПередЗаписьюКонтактнойИнформации(Форма, ТекущийОбъект, Отказ) Экспорт
	
	КонтейнерКонтактнойИнформации = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов; // Навязано подсистемой контактной информации
	ВидИнформацииАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	
	ВидыДополнительныхАдресов = Новый Массив;
	ВидыДополнительныхАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	ВидыДополнительныхАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
	
	АдресДоИзменения  = "";
	АдресаДоИзменения = Неопределено;
	ИзмененАдрес      = Истина;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		 // ДЕНЬГИ проверка исторических значений не требуется
	КонецЕсли;
	
	УстановитьКодРегиона(ТекущийОбъект, КонтейнерКонтактнойИнформации); // Код региона устанавливается в доп. свойствах объекта
	
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(Форма, ТекущийОбъект, Отказ);
	
	Если Не ИзмененАдрес Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийОбъект.КодОрганаФСГС = ""; // будет перезаполнен позже - см. УстановитьКодОрганаРосстата()
	
	Для Каждого ВидДополнительногоАдреса Из ВидыДополнительныхАдресов Цикл
		
		// Проверим, не задан ли особый адрес
		Если ЗначениеЗаполнено(АдресаДоИзменения) Тогда
			
			// ДЕНЬГИ ДополнительныйАдресДоИзменения = УправлениеКонтактнойИнформациейБП.ЗначенияJSONВидаКонтактнойИнформации(
			ДополнительныйАдресДоИзменения = ЗначенияJSONВидаКонтактнойИнформации(  // ДЕНЬГИ 
				АдресаДоИзменения, ВидДополнительногоАдреса);
			Если ЗначениеЗаполнено(ДополнительныйАдресДоИзменения) И ДополнительныйАдресДоИзменения <> АдресДоИзменения Тогда
				// был задан особый дополнительный адрес, он и останется
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		// ДЕНЬГИ УправлениеКонтактнойИнформациейБП.СкопироватьКонтактнуюИнформацию(ТекущийОбъект.КонтактнаяИнформация, ВидИнформацииАдрес, ВидДополнительногоАдреса);
		СкопироватьКонтактнуюИнформацию(ТекущийОбъект.КонтактнаяИнформация, ВидИнформацииАдрес, ВидДополнительногоАдреса);  // ДЕНЬГИ 
		
	КонецЦикла;
	
КонецПроцедуры

#Область ЮридическийАдрес

// Определяет код региона по адресу организации и помещает его в дополнительные свойства
//  для использования в ходе записи.
//  Адрес хранится в форме с использованием подсистемы КонтактнаяИнформация и иметь путь КонтактнаяИнформацияПолеЮрАдресОрганизации.
//
// Параметры:
//  Объект												 - СправочникОбъект.Организации	 - модифицируемый объект
//  КонтактнаяИнформацияОписаниеДополнительныхРеквизитов - ДанныеФормыКоллекция - коллекция, содержащая сведения об адресах (см. подсистему КонтактнаяИнформация)
//
Процедура УстановитьКодРегиона(Объект, КонтактнаяИнформацияОписаниеДополнительныхРеквизитов) Экспорт
	
	ЗначениеАдресаJSON = ОрганизацииФормыДляОтчетностиКлиентСервер.АдресОрганизацииЗначениеJSON(
		КонтактнаяИнформацияОписаниеДополнительныхРеквизитов);
	
	КодРегиона = КодРегионаПоАдресу(ЗначениеАдресаJSON); // ДЕНЬГИ УправлениеКонтактнойИнформациейБП.КодРегионаПоАдресу(ЗначениеАдресаJSON);
	
	Объект.ДополнительныеСвойства.Вставить("КодРегиона", КодРегиона);
	
КонецПроцедуры

// Заполняет реквизиты организации по ее юридическому адресу
//
// Параметры:
//  Объект				- ДанныеФормыСтруктура - объект, представляющий в форме данные организации
//  КодПоОКТМО			- Строка - заполняемый код по ОКТМО
//  ЗначениеАдресаJSON  - см. АдресОрганизацииЗначениеJSON - данные об адресе
//
Процедура ЗаполнитьПоАдресу(Объект, КодПоОКТМО, ЗначениеАдресаJSON) Экспорт
	
	СведенияОНалоговомОргане = СведенияОНалоговомОрганеПоАдресу(ЗначениеАдресаJSON, Объект.ЮридическоеФизическоеЛицо);
	
	Если ЗначениеЗаполнено(СведенияОНалоговомОргане.КодПоОКТМО) Тогда
		КодПоОКТМО = СведенияОНалоговомОргане.КодПоОКТМО;
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОНалоговомОргане.КодНалоговогоОргана) Тогда
		Объект.КодНалоговогоОргана = СведенияОНалоговомОргане.КодНалоговогоОргана;
	КонецЕсли;
	Если ЗначениеЗаполнено(СведенияОНалоговомОргане.НаименованиеНалоговогоОргана) Тогда
		Объект.НаименованиеНалоговогоОргана = СведенияОНалоговомОргане.НаименованиеНалоговогоОргана;
	КонецЕсли;
	
	Объект.КодОрганаФСГС = "";// Заполняется перед записью
	
КонецПроцедуры

#КонецОбласти

// ДЕНЬГИ
// вставка из УправлениеКонтактнойИнформациейБП

// Возвращает значения полей по виду адреса из ТаблицаКонтактнойИнформации.
// ТаблицаКонтактнойИнформации должна быть предварительно получена с помощью УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату.
// Если в таблице есть несколько значений для данного вида контактной информации, то будет возвращено первое значение.
//
// Параметры:
//  ТаблицаКонтактнойИнформации - ТаблицаЗначений - Таблица, которую возвращает функция УправлениеКонтактнойИнформациейБП.КонтактнаяИнформацияОбъектовНаДату.
//  ВидКонтактнойИнформации     - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации, для которого нужно определить значения полей.
//
// Возвращаемое значение:
//    Строка - XML значения полей.
//
Функция ЗначенияJSONВидаКонтактнойИнформации(ТаблицаКонтактнойИнформации, ВидКонтактнойИнформации) Экспорт
	
	ДанныеСтроки = ТаблицаКонтактнойИнформации.НайтиСтроки(Новый Структура("Вид", ВидКонтактнойИнформации));
	Если ДанныеСтроки.Количество() > 0 Тогда
		Возврат ДанныеСтроки[0].Значение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Копирует значения контактной информации объекта одного вида в значения другого.
// Тип контактной информации источника и приемника должен быть одинаков.
//
// Параметры:
//    КонтактнаяИнформация - ТабличнаяЧасть - табличная часть, которая содержит сведения о контактной информации.
//    Источник             - СправочникСсылка.ВидКонтактнойИнформации - вид, значения которого будут выступать источником для копирования.
//    Приемник             - СправочникСсылка.ВидКонтактнойИнформации - вид, значения которого будут выступать приемником для копирования.
//
Процедура СкопироватьКонтактнуюИнформацию(КонтактнаяИнформация, Источник, Приемник) Экспорт
	
	ЗаписиИсточника = ЗаписиКонтактнойИнформации(КонтактнаяИнформация, Источник);
	
	Если Не ЗначениеЗаполнено(ЗаписиИсточника) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписиПриемника = ЗаписиКонтактнойИнформации(КонтактнаяИнформация, Приемник);
	
	Для Каждого Запись Из ЗаписиПриемника Цикл
		КонтактнаяИнформация.Удалить(Запись);
	КонецЦикла;
	
	Для Каждого Запись Из ЗаписиИсточника Цикл
		
		НоваяЗапись = КонтактнаяИнформация.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
		
		Если ЗначениеЗаполнено(НоваяЗапись.Вид) Тогда
			НоваяЗапись.Вид = Приемник;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяЗапись.ВидДляСписка) Тогда
			НоваяЗапись.ВидДляСписка = Приемник;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает код региона по переданному адресу.
//
// Параметры:
//    Адрес - Строка - Значения полей контактной информации в формате XML.
//
// Возвращаемое значение:
//    Число - код региона.
//
Функция КодРегионаПоАдресу(Адрес) Экспорт
	
	Попытка
		Регион = РаботаСАдресами.РегионАдресаКонтактнойИнформации(Адрес);
	Исключение
		Возврат 0;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Регион) Тогда
		КодРегиона = АдресныйКлассификатор.КодРегионаПоНаименованию(Регион);
		Если ЗначениеЗаполнено(КодРегиона) Тогда
			Возврат КодРегиона;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЗаписиКонтактнойИнформации(КонтактнаяИнформация, ВидКонтактнойИнформации)
	
	Отбор = Новый Структура("Вид", ВидКонтактнойИнформации);
	Записи = КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Отбор = Новый Структура("Вид,ВидДляСписка", Справочники.ВидыКонтактнойИнформации.ПустаяСсылка(), ВидКонтактнойИнформации);
	ГрупповыеЗаписи = КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Записи, ГрупповыеЗаписи);
	
	Возврат Записи;
	
КонецФункции

// Конец ДЕНЬГИ 

#КонецОбласти

#Область СистемаНалогообложения

	// ДЕНЬГИ методы не востребованы

#КонецОбласти

#Область ГосударственныеОрганы

// ДЕНЬГИ методы искючены

Функция СведенияОНалоговомОрганеПоАдресу(Знач ЗначенияАдресаJSON, Знач ЮридическоеФизическоеЛицо)

	Сведения = Новый Структура();
	Сведения.Вставить("КодНалоговогоОргана",                "");
	Сведения.Вставить("КодПоОКТМО",                         "");
	Сведения.Вставить("КодПоОКАТО",                         "");
	Сведения.Вставить("НаименованиеНалоговогоОргана",       "");
	
	Если Не ЗначениеЗаполнено(ЗначенияАдресаJSON) Тогда
		Возврат Сведения;
	КонецЕсли;
	
	СведенияОНалоговомОрганеПоАдресу = АдресныйКлассификатор.КодыАдреса(ЗначенияАдресаJSON, "Сервис1С");
	
	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ЧисловойКодИФНС = СведенияОНалоговомОрганеПоАдресу.КодИФНСФЛ;
	Иначе
		ЧисловойКодИФНС = СведенияОНалоговомОрганеПоАдресу.КодИФНСЮЛ;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЧисловойКодИФНС) И Не ЗначениеЗаполнено(СведенияОНалоговомОрганеПоАдресу.ОКТМО) Тогда
		Возврат Сведения;
	КонецЕсли;
	
	СтроковойКодИФНС = Формат(ЧисловойКодИФНС, "ЧЦ=4; ЧДЦ=; ЧВН=; ЧГ=0");
	НаименованиеНалоговогоОргана = ОрганизацииФормыДляОтчетностиВызовСервера.РеквизитыГосударственногоОрганаПоКоду(
		"НалоговыйОрган", // ДЕНЬГИ  Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган,
		СтроковойКодИФНС);
	
	Сведения.КодНалоговогоОргана          = СтроковойКодИФНС;
	Сведения.КодПоОКТМО                   = Формат(СведенияОНалоговомОрганеПоАдресу.ОКТМО, "ЧДЦ=; ЧГ=0");
	Сведения.КодПоОКАТО                   = Формат(СведенияОНалоговомОрганеПоАдресу.ОКАТО, "ЧДЦ=; ЧГ=0");
	Сведения.НаименованиеНалоговогоОргана = НаименованиеНалоговогоОргана;
	
	Возврат Сведения;
		
КонецФункции

#КонецОбласти

#Область Руководитель

// Получает данные о руководителе организации из сведений об ответственных лицах
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, для которой требуются сведения о руководителе
//
// Возвращаемое значение:
//  Структура - сведения о руководителе, см. НовыйДанныеРуководителя()
//
Функция ДанныеРуководителя(Организация) Экспорт
	
	ДанныеРуководителя = НовыйДанныеРуководителя();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат ДанныеРуководителя;
	КонецЕсли;
	
	// ДЕНЬГИ код исключен
	
	Возврат ДанныеРуководителя;
	
КонецФункции

Функция НовыйДанныеРуководителя()
	
	ДанныеРуководителя = Новый Структура;
	
	ДанныеРуководителя.Вставить("РуководительФизЛицо",   Неопределено);  // ДЕНЬГИ Справочники.ФизическиеЛица.ПустаяСсылка());
	ДанныеРуководителя.Вставить("РуководительДолжность", "");  // ДЕНЬГИ Справочники.Должности.ПустаяСсылка());
	ДанныеРуководителя.Вставить("РуководительПериод",    '0001-01-01');
	
	Возврат ДанныеРуководителя;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеЕГР

// В форме организации заполняет реквизиты объекта и формы данными, полученными из госреестров.
//
// Параметры:
//  ОтветДанныхЕГР	- Структура - см. НовыйОтветДанныхЕГР(), результат запроса к сервису, предоставляющему данные госреестров
//  Форма  - ФормаКлиентскогоПриложения - форма элемента справочника Организации. 
//								Обязательные реквизиты формы:
//                              - Объект
//								- КодПоОКТМО
//								- КонтактнаяИнформацияОписаниеДополнительныхРеквизитов
//								- КонтактнаяИнформацияПолеТелефонОрганизации
//								- КонтактнаяИнформацияПолеЮрАдресОрганизации
//
Процедура ЗаполнитьДаннымиЕГР(ОтветДанныхЕГР, Форма) Экспорт
	
	Форма.Модифицированность = Ложь;
	
	// ДЕНЬГИ код исключен
	
КонецПроцедуры

#КонецОбласти

#Область СокращеннаяФорма

// Скрывает заполненные и не обязательные реквизиты
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - настраиваемая форма 
//  ПроверяемыеДанные - Соответствие - перечень данных (путей к данным), подлежащих контролю
//  СвязанныеДанные   - См. СвязанныеДанные()
//  ОписанияНезаполненныхЗначений
//                    - См. ОписанияНезаполненныхЗначений()
//
Процедура СократитьФорму(Форма, ПроверяемыеДанные, СвязанныеДанные, ОписанияНезаполненныхЗначений)
	
	// Если ИНН заполнен, форма сокращается до обязательных незаполненных реквизитов
	СокращеннаяФорма = ПоказыватьФормуСокращенно(Форма);
	
	// Кнопка "Записать и закрыть" внизу отображается только для полной формы юридического лица.
	// В форме Предпринимателя такой кнопки нет.
	ЮридическоеФизическоеЛицо = Форма.Объект.ЮридическоеФизическоеЛицо;
	Если ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		Форма.Элементы.ЗаписатьИЗакрытьНиз.Видимость = НЕ СокращеннаяФорма;
	КонецЕсли;
	
	Если Не СокращеннаяФорма Тогда
		Возврат;
	КонецЕсли;
	
	// Отображаем все те, что должны быть заполнены, но не заполнены.
	// Если в группе не заполнен хотя бы один, показываем группу целиком.
	// Под "группами" здесь понимаются
	// - связанные данные, т.е. "атомарные" группы полей, которые обязательны к заполнению или все, или ни одно
	// - поля кадровых данных физлица, которые отображаются или все или ни одно,
	//   но обязательны к заполнению могут быть не все
	
	ОтображаемыеДанные = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ПроверяемыеДанные Цикл
		
		Если ОтображаемыеДанные[КлючИЗначение.Ключ] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитЗаполнен(Форма, КлючИЗначение.Ключ, ОписанияНезаполненныхЗначений) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтображаемыеДанные.Вставить(КлючИЗначение.Ключ, Истина);
		
		Для Каждого Одногруппник Из ПутиКОстальнымДаннымГруппы(КлючИЗначение.Ключ, СвязанныеДанные) Цикл
			ОтображаемыеДанные.Вставить(Одногруппник, Истина);
		КонецЦикла;
		
	КонецЦикла;
	
	// Если в проверяемые реквизиты входит код по ОКТМО,
	// то его требуется отобразить не только в случае если он не заполнен, но и если он заполнен некорректно
	ПроверитьОКТМО = ПроверяемыеДанные.Получить("КодПоОКТМО");
	Если ПроверитьОКТМО <> Неопределено Тогда
		ОшибкиПроверкиОКТМО = ОрганизацииФормыДляОтчетностиКлиентСервер.ПроверитьКодПоОКТМО(Форма.КодПоОКТМО);
		Если ЗначениеЗаполнено(ОшибкиПроверкиОКТМО) Тогда
			ОтображаемыеДанные.Вставить("КодПоОКТМО", Истина);
		КонецЕсли;
	КонецЕсли;
	
	ДополнитьОтображаемыеДанныеПолямиРуководителя(ОтображаемыеДанные);
	
	// Отключим видимость элементов
	Для Каждого Элемент Из Форма.Элементы Цикл
		
		Если ТипЗнч(Элемент) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОтображаемыеДанные[Элемент.ПутьКДанным] = Неопределено Тогда
			Элемент.Видимость = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	// Управление видимостью связанных надписей
	Для Каждого СвязаннаяНадпись Из СвязанныеНадписи() Цикл
		Форма.Элементы[СвязаннаяНадпись.Ключ].Видимость = Форма.Элементы[СвязаннаяНадпись.Значение].Видимость;
	КонецЦикла;
	
КонецПроцедуры

Функция ПоказыватьФормуСокращенно(Форма)
	
	// Если ИНН заполнен, форма сокращается до обязательных незаполненных реквизитов
	Возврат ЗначениеЗаполнено(Форма.Объект.ИНН);
	
КонецФункции

Процедура ДополнитьОтображаемыеДанныеПолямиРуководителя(ОтображаемыеДанные)
	
	// Отчество руководителя в отчетности, как правило, это формально необязательный реквизит.
	// Однако, отчество не обязательно только в том случае, если оно у человека отсутствует.
	// Другими словами, обязательность заполнения отчества в общем случае программа определить не может:
	// неизвестно, есть у человека отчество или нет.
	// Поэтому поля для ввода имени руководителя показываем все три, даже когда заполнение отчества не обязательно.
	
	// Поле Должность при вводе данных руководителя заполняется значением по умолчанию.
	// Поэтому, чтобы предотвратить заполнение "под капотом" неправильным значением, 
	// поле для ввода должности показываем, если требуется ввести данные руководителя,
	// даже если для конкретной формы должность не важна.
	
	ЕстьПоляРуководителя  = Ложь;
	РеквизитыРуководителя = ВсеРеквизитыРуководителяДляОтчетности(Истина);
	
	Для Каждого ИмяРеквизита Из РеквизитыРуководителя Цикл
		
		Если ОтображаемыеДанные[ИмяРеквизита] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьПоляРуководителя = Истина;
		Прервать;
		
	КонецЦикла;
	
	Если ЕстьПоляРуководителя Тогда
		Для Каждого ИмяРеквизита Из РеквизитыРуководителя Цикл
			ОтображаемыеДанные.Вставить(ИмяРеквизита, Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполненияВФорме

// Проверяет заполнение реквизитов организации.
// Выполняет проверки, дополнительные к реализованным в модуле объекта.
// Перечень таких проверок может быть передан в форму при ее открытии.
// Если есть незаполненные реквизиты, то выдает сообщения пользователю.
//
// Параметры:
//  Форма						 - ФормаКлиентскогоПриложения - форма элемента справочника Организации.
//                                 Для формы предполагается
//                                 1. данные объекта в ней размещены в реквизите с именем Объект
//                                 2. состав, размещение и взаимосвязи полей соответствуют описаниям,
//                                    приведенным в области ОписаниеФормы
//  ПроверяемыеРеквизиты		 - Массив - имена реквизитов, для которых должна быть вызвана платформенная проверка
//  ХранилищеПроверяемыеДанные	 - Соответствие - имена реквизитов, заполнение которых должно быть проверено этой процедурой
//                                 * Ключ - путь к данным
//                                 * Значение - любое, кроме Неопределено
//                                 см. также ПроверяемыеДанные()
//                               - Строка - адрес временного хранилища, где размещено это Соответствие
//  Отказ						 - Булево - Истина, если что-то не заполнено
//
Процедура ПроверитьЗаполнение(Форма, ПроверяемыеРеквизиты, ХранилищеПроверяемыеДанные, Отказ) Экспорт
	
	Если ТипЗнч(ХранилищеПроверяемыеДанные) <> Тип("Строка") Тогда
		ПроверяемыеДанные = ХранилищеПроверяемыеДанные;
	ИначеЕсли ЭтоАдресВременногоХранилища(ХранилищеПроверяемыеДанные) Тогда
		ПроверяемыеДанные = ПолучитьИзВременногоХранилища(ХранилищеПроверяемыеДанные);
	КонецЕсли;
	
	Если ТипЗнч(ПроверяемыеДанные) <> Тип("Соответствие") Или Не ЗначениеЗаполнено(ПроверяемыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеРеквизитовФормы       = ОписаниеРеквизитовФормы(Форма.Объект.ЮридическоеФизическоеЛицо);
	РазмещениеРеквизитов          = РазмещениеДанныхФормыДляОтчетности();
	ОписанияНезаполненныхЗначений = ОписанияНезаполненныхЗначений();
	
	// Если заполнен любой из группы связанных данных, то должны быть заполнены все связанные,
	// даже если извне не требуется заполнение ни одного из них.
	// Это применимо только для несокращенной формы, так как в сокращенной вся группа будет скрыта,
	// если заполнение ни одного из одногруппников не требуется.
	Если Не ПоказыватьФормуСокращенно(Форма) Тогда
		
		ПроверяемыеДанные = ОбщегоНазначения.СкопироватьРекурсивно(ПроверяемыеДанные); // Дополняем только на время вызова проверки
		СвязанныеДанные   = СвязанныеДанные();
		
		Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовФормы Цикл
		
			ПодозреваемыйВЗаполненности = ПутьКДанным(ОписаниеРеквизита.Имя, РазмещениеРеквизитов);
			
			Одногруппники = ПутиКОстальнымДаннымГруппы(ПодозреваемыйВЗаполненности, СвязанныеДанные);
			
			Если Не ЗначениеЗаполнено(Одногруппники) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не РеквизитЗаполнен(Форма, ПодозреваемыйВЗаполненности, ОписанияНезаполненныхЗначений) Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Одногруппник Из Одногруппники Цикл
				ПроверяемыеДанные.Вставить(Одногруппник, Истина);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// О незаполненных реквизитах объектов сообщим. Сообщения будем выдавать в порядке следования полей на форме
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовФормы Цикл
		
		ПутьКДанным = ПутьКДанным(ОписаниеРеквизита.Имя, РазмещениеРеквизитов);
		
		Если ПроверяемыеДанные[ПутьКДанным] = Неопределено Тогда
			// Проверять не требуется
			Продолжить;
		КонецЕсли;
		
		// отметим, что проверили
		Индекс = ПроверяемыеРеквизиты.Найти(ПутьКДанным);
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс); // Сейчас проверим сами
		КонецЕсли;
		
		Если РеквизитЗаполнен(Форма, ПутьКДанным, ОписанияНезаполненныхЗначений) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение",
			ОписаниеРеквизита.Заголовок);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Неопределено,// КлючДанных
			,//Поле
			ПутьКДанным,// ПутьКДанным
			Отказ);
		
	КонецЦикла;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(Форма, Форма.Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
КонецПроцедуры

// Помещает во временное хранилище перечень данных, заполнение которых контролируется в конкретном вызове формы.
// Перечень состоит из путей к данным реквизитов.
// Значение помещается в хранилище на время жизни формы.
//
// Параметры:
//  Организация                  - Справочник.Организации - организация, реквизиты которой редактируются
//  ПараметрПроверяемыеРеквизиты - Массив, Неопределено - перечень имен проверяемых реквизитов;
//                                 имена - в соответствии с ВсеРеквизитыДляОтчетности()
//  ПараметрКонтекст             - Структура, Неопределено - сведения, описывающие, для какой цели была вызвана форма.
//                                 Если эти сведения переданы, то перечень имен проверяемых реквизитов дополняется определенными исходя из контекста.
//                                 Ключи структуры:
//                                  * Период           - Дата   - период, к которому относится выполняемое действие, например, за который представляется декларация
//                                  * ИмяРеглОтчета    - Строка - (опционально) имя отчета, для работы с которым нужны реквизиты организации
//                                  * ПолноеИмяПравила - Строка - (опционально) имя правила, для выполнения которого нужны реквизиты организации
//                                  * Правило          - СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов - 
//                                                                (опционально) правило, для выполнения которого нужны реквизиты организации
//                                 Структура должна содержать ровно два свойства: Период и одно из опциональных.
//  АдресПроверяемыеДанные		 - Строка - возвращаемый параметр: адрес в хранилище, по которому размещен перечень проверяемых данных
//  ИдентификаторФормы			 - УникальныйИдентификатор - идентификатор формы, в которой будет проверяться заполнение реквизитов
//
Процедура УстановитьПроверяемыеДанные(Организация, ПараметрПроверяемыеРеквизиты, ПараметрКонтекст, АдресПроверяемыеДанные, ИдентификаторФормы) Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресПроверяемыеДанные) Тогда
		// Проверяемые данные уже размещены в хранилище.
		// Предполагается, что проверяемые данные передаются в форму и не могут быть изменены в ходе работы формы,
		// поэтому если хранилище уже заполнено, то обновлять в нем данные незачем.
		Возврат;
	КонецЕсли;
	
	// Настроим проверку заполнения в соответствии с параметром формы
	ПроверяемыеРеквизиты = Новый Массив;
	Если ТипЗнч(ПараметрПроверяемыеРеквизиты) = Тип("Массив") Тогда
		// перечень реквизитов в готовом виде
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты, ПараметрПроверяемыеРеквизиты);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрКонтекст) = Тип("Структура") Тогда
		// информация, которая позволяет определить перечень реквизитов
		
		Период = ПараметрКонтекст.Период;
		
		Если ПараметрКонтекст.Свойство("ИмяРеглОтчета") Тогда
			ИмяРеглОтчета = ПараметрКонтекст.ИмяРеглОтчета;
		Иначе
			Если ПараметрКонтекст.Свойство("ПолноеИмяПравила") Тогда
				ПолноеИмяПравила = ПараметрКонтекст.ПолноеИмяПравила;
			Иначе
				// ДЕНЬГИ ПолноеИмяПравила = Справочники.ПравилаПредставленияОтчетовУплатыНалогов.ПолноеИмяПравила(ПараметрКонтекст.Правило);
				ПолноеИмяПравила = "НДФЛ_ФизЛицо";
			КонецЕсли;
			ИмяРеглОтчета = ИнтерфейсыВзаимодействияБРО.ИмяРеглОтчета(ПолноеИмяПравила);
		КонецЕсли;
			
		ПроверяемыеРеквизитыПоКонтексту = Деньги3НДФЛ.РеквизитыОбязательныеДляОтчета( // ДЕНЬГИ 
					ИмяРеглОтчета, Организация, Период);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеРеквизиты, ПроверяемыеРеквизитыПоКонтексту);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемыеДанные = ПроверяемыеДанные(ПроверяемыеРеквизиты);
	
	// Дополним проверяемые данным связанными реквизитами:
	// если требуется заполнение любого реквизита из группы связанных,
	// то требуется заполнение всех их.
	СвязанныеДанные = СвязанныеДанные();
	Для Каждого КлючИЗначение Из ПроверяемыеДанные Цикл
		Для Каждого Одногруппник Из ПутиКОстальнымДаннымГруппы(КлючИЗначение.Ключ, СвязанныеДанные) Цикл
			ПроверяемыеДанные.Вставить(Одногруппник, Истина);
		КонецЦикла;
	КонецЦикла;
	
	АдресПроверяемыеДанные = ПоместитьВоВременноеХранилище(ПроверяемыеДанные, ИдентификаторФормы);
	
КонецПроцедуры

// Настраивает свойства элементов формы в зависимости от требований к заполнению данных:
// 1. Если необходимо, сокращает форму - скрывает заполненные и не обязательные реквизиты
// 2. Отображает отметку незаполненного реквизитам, проверка которых должна быть выполнена дополнительно к проверкам, описанным для объекта метаданных.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - настраиваемая форма 
//  АдресПроверяемыеДанные	 - Строка - адрес временного хранилища, где размещен перечень данных, подлежащих контролю.
//                             См. УстановитьПроверяемыеДанные()
//
Процедура НастроитьПроверяемыеРеквизиты(Форма, АдресПроверяемыеДанные) Экспорт
	
	Если НЕ ЭтоАдресВременногоХранилища(АдресПроверяемыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверяемыеДанные = ПолучитьИзВременногоХранилища(АдресПроверяемыеДанные);
	Если ТипЗнч(ПроверяемыеДанные) <> Тип("Соответствие") 
		Или Не ЗначениеЗаполнено(ПроверяемыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	СвязанныеДанные               = СвязанныеДанные();
	ОписанияНезаполненныхЗначений = ОписанияНезаполненныхЗначений();
	
	СократитьФорму(Форма, ПроверяемыеДанные, СвязанныеДанные, ОписанияНезаполненныхЗначений);
	НастроитьОтметкуНезаполненного(Форма, ПроверяемыеДанные, СвязанныеДанные, ОписанияНезаполненныхЗначений);
	
КонецПроцедуры

// Настраивает элементы формы и условное оформление формы для отображения отметки незаполненного у тех реквизитов,
// проверка которых должна быть выполнена дополнительно к проверкам, описанным для объекта метаданных.
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - настраиваемая форма 
//  ПроверяемыеДанные - Соответствие - перечень данных (путей к данным), подлежащих контролю
//  СвязанныеДанные   - См. СвязанныеДанные()
//  ОписанияНезаполненныхЗначений
//                    - См. ОписанияНезаполненныхЗначений()
//
Процедура НастроитьОтметкуНезаполненного(Форма, ПроверяемыеДанные, СвязанныеДанные, ОписанияНезаполненныхЗначений)
	
	// 1. Полям, отображающим проверяемые данные, включим отметку незаполненного
	// 2. Остальным (необязательным) полям, входящим в группы связанных, установим условное оформление,
	//    которое будет требовать заполнения всех полей в группе,
	//    если заполнено поле хотя бы одного элемента группы
	//    Второе применимо только для несокращенной формы, так как в сокращенной вся группа будет скрыта,
	//    если заполнение ни одного из одногруппников не требуется.
	
	СокращеннаяФорма = ПоказыватьФормуСокращенно(Форма);
	
	Для Каждого Элемент Из Форма.Элементы Цикл
		
		Если ТипЗнч(Элемент) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПроверяемыеДанные[Элемент.ПутьКДанным] <> Неопределено Тогда
			
			// 1. автоотметка незаполненного - у проверяемых полей
		
			Если Элемент.Вид = ВидПоляФормы.ПолеВвода
				Или Элемент.Вид = ВидПоляФормы.ПолеПереключателя
				Или Элемент.Вид = ВидПоляФормы.ПолеТекстовогоДокумента Тогда
			
				Элемент.АвтоОтметкаНезаполненного = Истина;
				
			ИначеЕсли Элемент.Вид = ВидПоляФормы.ПолеНадписи Тогда
				
				// Незаполненные гиперссылки отмечаются цветом: используем условное оформление
				
				ТекстНезаполненного = ОписанияНезаполненныхЗначений[Элемент.ПутьКДанным];
				
				Если ТекстНезаполненного <> Неопределено Тогда
					
					ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
					
					КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элемент.Имя);
						
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
						ЭлементУО.Отбор,
						Элемент.ПутьКДанным,
						ВидСравненияКомпоновкиДанных.Равно,
						ТекстНезаполненного);
						
					ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Не СокращеннаяФорма Тогда
			
			// 2. Для непроверяемых требуем заполнить все поля группы, если заполнено любое из полей группы

			Одногруппники = ПутиКОстальнымДаннымГруппы(Элемент.ПутьКДанным, СвязанныеДанные);
			Если Не ЗначениеЗаполнено(Одногруппники) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементУО = Форма.УсловноеОформление.Элементы.Добавить();
			
			// Действие:
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элемент.Имя);
			ТекстНезаполненного = ОписанияНезаполненныхЗначений[Элемент.ПутьКДанным];
			Если ТекстНезаполненного = Неопределено Тогда
				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
			Иначе
				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);
			КонецЕсли;
			
			// Условия:
			// a. Элемент не заполнен
			Если ТекстНезаполненного = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
					ЭлементУО.Отбор,
					Элемент.ПутьКДанным,
					ВидСравненияКомпоновкиДанных.НеЗаполнено);
			Иначе
				ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
					ЭлементУО.Отбор,
					Элемент.ПутьКДанным,
					ВидСравненияКомпоновкиДанных.Равно,
					ТекстНезаполненного);
			КонецЕсли;
			
			// b. Любой одногруппник заполнен
			ГруппаИли = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			
			Для Каждого Одногруппник Из Одногруппники Цикл
				ТекстНезаполненного = ОписанияНезаполненныхЗначений[Одногруппник];
				Если ТекстНезаполненного = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИли, Одногруппник, ВидСравненияКомпоновкиДанных.Заполнено);
				Иначе
					ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
						ГруппаИли,
						Одногруппник, 
						ВидСравненияКомпоновкиДанных.НеРавно,
						ТекстНезаполненного);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Конструирует коллекцию, содержащую имена и заголовки реквизитов формы.
// См. также ЗаголовкиРеквизитовФормыИсключения()
//
// Параметры:
//  ЮридическоеФизическоеЛицо	 - ПеречислениеСсылка.ЮридическоеФизическоеЛицо - тип организации, данные которой представлены в форме
// 
// Возвращаемое значение:
//  ТаблицаЗначений - описание реквизитов. 
//    Колонки:
//    * Имя - Строка - имя реквизита в соответствии со "словарем" ВсеРеквизитыДляОтчетности()
//    * Заголовок - Строка - заголовок реквизита
//
Функция ОписаниеРеквизитовФормы(ЮридическоеФизическоеЛицо) Экспорт
	
	ОписаниеРеквизитов = Новый ТаблицаЗначений;
	ОписаниеРеквизитов.Колонки.Добавить("Имя",       Новый ОписаниеТипов("Строка"));
	ОписаниеРеквизитов.Колонки.Добавить("Заголовок", Новый ОписаниеТипов("Строка"));
	
	ВсеРеквизиты        = ВсеРеквизитыДляОтчетности(ЮридическоеФизическоеЛицо);
	ЗаголовкиИсключения = ЗаголовкиРеквизитовФормыИсключения(ЮридическоеФизическоеЛицо);
	
	МетаданныеОрганизации = Метаданные.Справочники.Организации;
	
	Для каждого ИмяРеквизита Из ВсеРеквизиты Цикл
		
		// Сначала ищем среди явно заданных заголовков
		ЗаголовокРеквизита = ЗаголовкиИсключения[ИмяРеквизита];
		
		Если ЗаголовокРеквизита = Неопределено Тогда
			// Не нашли в особенностях, ищем в метаданных справочника
			МетаданныеРеквизита = МетаданныеОрганизации.Реквизиты.Найти(ИмяРеквизита);
			Если МетаданныеРеквизита = Неопределено Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ЗаголовокРеквизита = МетаданныеРеквизита.Синоним;
			
		КонецЕсли;
		
		Запись = ОписаниеРеквизитов.Добавить();
		Запись.Имя       = ИмяРеквизита;
		Запись.Заголовок = ЗаголовокРеквизита;
		
	КонецЦикла;
	
	Возврат ОписаниеРеквизитов;
	
КонецФункции

Функция ПутьКДанным(ИмяРеквизита, РазмещениеРеквизитов)
	
	Путь = "";
	Если Не РазмещениеРеквизитов.Свойство(ИмяРеквизита, Путь) Тогда
		Путь = "Объект." + ИмяРеквизита;
	КонецЕсли;
	
	Возврат Путь;
	
КонецФункции

Функция ПроверяемыеДанные(ПроверяемыеРеквизиты)
	
	ПроверяемыеДанные = Новый Соответствие; // Ключ - путь к данным, Значение - Истина
	
	РазмещениеРеквизитов = РазмещениеДанныхФормыДляОтчетности();
	
	Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
		
		ПутьКДанным = ПутьКДанным(ИмяРеквизита, РазмещениеРеквизитов);
		
		ПроверяемыеДанные.Вставить(ПутьКДанным, Истина);
		
	КонецЦикла;
	
	Возврат ПроверяемыеДанные;
	
КонецФункции

Функция ПутиКОстальнымДаннымГруппы(ПутьКДанным, СвязанныеДанные)
	
	Одногруппники = СвязанныеДанные[ПутьКДанным];
	Если Одногруппники = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат СтрРазделить(Одногруппники, ",");
	
КонецФункции

Функция РеквизитЗаполнен(Форма, ПутьКДанным, ОписанияНезаполненныхЗначений)
	
	ТекстНезаполненного = ОписанияНезаполненныхЗначений[ПутьКДанным];
	
	ЗначениеРеквизита = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКДанным);
	
	Если ТекстНезаполненного <> Неопределено Тогда
		// Реквизиты, представленные на форме гиперссылками, следует обработать отдельно:
		// их незаполненное значение обозначено нестандартно - особым текстом
		Возврат ЗначениеРеквизита <> ТекстНезаполненного;
	Иначе
		Возврат ЗначениеЗаполнено(ЗначениеРеквизита);
	КонецЕсли;
	
КонецФункции

// Проверяет корректность заполнения реквизита ОКТМО на форме, в случае наличия ошибок выводит сообщение
//
// Параметры:
//
//  ОКТМО - Строка - значение кода по ОКТМО
//  ПутьКРеквизиту - Строка - путь к реквизиту на форме, используется для вывода сообщения
//  Отказ - Булево - признак отказа от выполнения действия
//
Процедура ПроверитьКодПоОКТМОНаФорме(ОКТМО, ПутьКРеквизиту, Отказ = Ложь) Экспорт
	
	ОшибкиЗаполненияОКТМО = ОрганизацииФормыДляОтчетностиКлиентСервер.ПроверитьКодПоОКТМО(ОКТМО);
	Если ЗначениеЗаполнено(ОшибкиЗаполненияОКТМО) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОшибкиЗаполненияОКТМО, , , ПутьКРеквизиту, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполненияВДанных

Функция РеквизитыЗаполнены(Организация, ПроверяемыеРеквизиты, НезаполненныеРеквизиты) Экспорт
	
	Если ПроверяемыеРеквизиты = Неопределено ИЛИ ПроверяемыеРеквизиты.Количество() = 0 Тогда
		// Нечего проверять.
		Возврат Истина;
	КонецЕсли;
	
	// ДЕНЬГИ ЗначенияРеквизитов = ЗначенияПроверяемыхРеквизитов(Организация, ПроверяемыеРеквизиты);
	ЗначенияРеквизитов = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДата(), ПроверяемыеРеквизиты);
	// Конец ДЕНЬГИ 
	
	Результат = Истина;
	
	НезаполненныеРеквизиты = Новый Массив;
	
	Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
		Если НЕ ЗначениеЗаполнено(ЗначенияРеквизитов[ИмяРеквизита]) Тогда
			Результат = Ложь;
			НезаполненныеРеквизиты.Добавить(ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти
