
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("ТабличныйДокумент");
	БлокируемыеРеквизиты.Добавить("ПолеТабличногоДокументаФормаОтчета");
	
	БлокируемыеРеквизиты.Добавить("ГруппаКнопокСохранитьИЗаписать;ГруппаКнопокСохранитьИЗаписать");
	БлокируемыеРеквизиты.Добавить("ГруппаКнопокЗаписатьЗакрыть;ГруппаКнопокЗаписатьЗакрыть");
	БлокируемыеРеквизиты.Добавить("ГруппаКнопок1;ГруппаКнопок1");
	
	БлокируемыеРеквизиты.Добавить("ФормаЗаписатьИЗакрыть;ФормаЗаписатьИЗакрыть");
	БлокируемыеРеквизиты.Добавить("ФормаЗагрузитьИзФайла;ФормаЗагрузитьИзФайла");
	БлокируемыеРеквизиты.Добавить("ФормаОбрезатьПустыеСимволы;ФормаОбрезатьПустыеСимволы");
	БлокируемыеРеквизиты.Добавить("ФормаЗаполнитьДаннымиУведомленияКИК;ФормаЗаполнитьДаннымиУведомленияКИК");
	БлокируемыеРеквизиты.Добавить("ОчиститьТекущуюСтраницу;ОчиститьТекущуюСтраницу");
	БлокируемыеРеквизиты.Добавить("ОчиститьТекущийРаздел;ОчиститьТекущийРаздел");
	БлокируемыеРеквизиты.Добавить("ПодменюОчистить;ПодменюОчистить");
	БлокируемыеРеквизиты.Добавить("ОчиститьОтчет;ОчиститьОтчет");
	БлокируемыеРеквизиты.Добавить("Импортировать;Импортировать");
	БлокируемыеРеквизиты.Добавить("Сохранить;Сохранить");
	БлокируемыеРеквизиты.Добавить("Загрузить;Загрузить");
	
	БлокируемыеРеквизиты.Добавить("Заполнить;Заполнить");
	БлокируемыеРеквизиты.Добавить("ЗаполнитьВсе;ЗаполнитьВсе");
	БлокируемыеРеквизиты.Добавить("ЗаполнитьТекущий;ЗаполнитьТекущий");
	БлокируемыеРеквизиты.Добавить("ОткрытьФормуНастроек;ОткрытьФормуНастроек");
	
	БлокируемыеРеквизиты.Добавить(
		"ТабличныйДокументКонтекстноеМенюГруппаСтроки;ТабличныйДокументКонтекстноеМенюГруппаСтроки");
	БлокируемыеРеквизиты.Добавить(
		"ТабличныйДокументКонтекстноеМенюДобавитьСтроку;ТабличныйДокументКонтекстноеМенюДобавитьСтроку");
	БлокируемыеРеквизиты.Добавить(
		"ТабличныйДокументКонтекстноеМенюУдалитьСтроку;ТабличныйДокументКонтекстноеМенюУдалитьСтроку");
	БлокируемыеРеквизиты.Добавить(
		"ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюГруппаСтроки;ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюГруппаСтроки");
	БлокируемыеРеквизиты.Добавить(
		"ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтроку;ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтроку");
	БлокируемыеРеквизиты.Добавить(
		"ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюУдалитьСтроку;ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюУдалитьСтроку");
	БлокируемыеРеквизиты.Добавить(
		"ТабличныйДокументКонтекстноеМенюДобавитьСтрокуКопированием;ТабличныйДокументКонтекстноеМенюДобавитьСтрокуКопированием");
	БлокируемыеРеквизиты.Добавить(
		"ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтрокуКопированием;ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтрокуКопированием");
	БлокируемыеРеквизиты.Добавить(
		"РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу;РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу");
	БлокируемыеРеквизиты.Добавить(
		"РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу;РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу");
	БлокируемыеРеквизиты.Добавить(
		"РазделыОтчетаКонтекстноеМенюДобавитьСтраницу;РазделыОтчетаКонтекстноеМенюДобавитьСтраницу");
	БлокируемыеРеквизиты.Добавить(
		"РазделыОтчетаКонтекстноеМенюУдалитьСтраницу;РазделыОтчетаКонтекстноеМенюУдалитьСтраницу");
	
	БлокируемыеРеквизиты.Добавить("ДобавитьСтраницу;ДобавитьСтраницу");
	БлокируемыеРеквизиты.Добавить("УдалитьСтраницу;УдалитьСтраницу");
	БлокируемыеРеквизиты.Добавить("СобратьДанные;СобратьДанные");
	БлокируемыеРеквизиты.Добавить("Комментарий;Комментарий");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

// Обработчик обновления БРО 1.1.11.37
//
Процедура ИзменитьНаименованияДекларацийПоКосвеннымНалогам(Параметры = Неопределено) Экспорт
	
	ИзменитьНаименованиеРеглОтчета(
		"Косвенные налоги при импорте товаров из государств - членов таможенного союза",
		"Косвенные налоги при импорте товаров");
	
КонецПроцедуры

// Обработчик обновления БРО 1.1.9.13
//
Процедура ИзменитьНаименованияДекларацийПоАлкоголю(Параметры = Неопределено) Экспорт
	
	ИзменитьНаименованиеРеглОтчета("Производство и оборот этилового спирта",
						 "Прил. 01: Производство и оборот этилового спирта");
	
	ИзменитьНаименованиеРеглОтчета("Использование этилового спирта",
						 "Прил. 02: Использование этилового спирта");
	
	ИзменитьНаименованиеРеглОтчета("Производство и оборот алкогольной продукции",
						 "Прил. 03: Производство и оборот алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Использование алкогольной и спиртосодержащей продукции",
						 "Прил. 04: Использование алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Оборот этилового спирта, алкогольной и спиртосодержащей продукции",
						 "Прил. 05: Оборот этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Поставки спирта и алкогольной продукции",
						 "Прил. 06: Поставка этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Закупки спирта и алкогольной продукции",
						 "Прил. 07: Закупка этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Объем перевозки этилового спирта, алкогольной и спиртосодержащей продукции",
						 "Прил. 08: Объем перевозки этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Перевозка этилового спирта и спиртосодержащей продукции",
						 "Прил. 09: Перевозка этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Использование мощностей по производству этилового спирта и алкогольной продукции",
						 "Прил. 10: Использование мощностей по производству этилового спирта и алкогольной продукции");
	
	ИзменитьНаименованиеРеглОтчета("Розничная продажа алкогольной (за исключением пива и пивных напитков) и спиртосодержащей продукции",
						 "Прил. 11: Розничная продажа алкогольной (за исключением пива и пивных напитков) и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Розничная продажа пива и пивных напитков",
						 "Прил. 12: Розничная продажа пива и пивных напитков");
	
	ИзменитьНаименованиеРеглОтчета("Объем собранного винограда для производства винодельческой продукции",
						 "Прил. 13: Объем собранного винограда для производства винодельческой продукции");
	
	ИзменитьНаименованиеРеглОтчета("Объем винограда, использованного для производства вина, игристого вина (шампанского)",
						 "Прил. 14: Объем винограда, использованного для производства вина, игристого вина (шампанского)");
	
	ИзменитьНаименованиеРеглОтчета("Объем винограда, использованного для производства винодельческой продукции с защищенным географическим указанием, с защищенным наименованием места происхождения и полного цикла производства дистиллято",
						 "Прил. 15: Объем винограда, использованного для производства винодельческой продукции с защищенным географическим указанием, с защищенным наименованием места происхождения и полного цикла производства дистиллятов");
	
КонецПроцедуры

// Обработчик обновления БРО 1.1.1.11
//
Процедура ИзменитьНаименованияДекларацийПоАлкоголю4кв2019(Параметры = Неопределено) Экспорт
		
	ИзменитьНаименованиеРеглОтчета("Прил. 13: Объем собранного винограда для производства винодельческой продукции",
						 "(до 2019 г.) Алко Прил.13: Объем собранного винограда для производства винодельческой продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 14: Объем винограда, использованного для производства вина, игристого вина (шампанского)",
						 "(до 2019 г.) Алко Прил.14: Объем винограда, использованного для производства вина, игристого вина (шампанского)");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 15: Объем винограда, использованного для производства винодельческой продукции с защищенным географическим указанием, с защищенным наименованием места происхождения и полного цикла производства дистиллятов",
						 "(до 2019 г.) Алко Прил.15: Объем винограда, использованного для производства винодельческой продукции с защищенным географическим указанием, с защищенным наименованием места происхождения и полного цикла производства дистиллятов");
	
КонецПроцедуры

// Обработчик обновления БРО 1.1.10.65, 1.1.11.54, 1.1.12.20, 1.1.13.1
//
Процедура ИзменитьНаименованияДекларацийПоФармАлкоголю(Параметры = Неопределено) Экспорт
	
	ИзменитьНаименованиеРеглОтчета("Прил. 01: Объем производства и поставки фармсубстанции спирта этилового",
						 		"Объем производства и поставки фармсубстанции спирта этилового");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 02: Объем использования для собственных нужд фармсубстанции спирта этилового",
						 		"Объем использования для собственных нужд фармсубстанции спирта этилового");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 03: Объем поставки фармсубстанции спирта этилового",
						 		"Объем поставки фармсубстанции спирта этилового");
	
КонецПроцедуры

// Обработчик обновления БРО 1.2.1.75
Процедура ИзменитьНаименованияДекларацийПоФСРАР2021кв1(Параметры = Неопределено) Экспорт
		
	ИзменитьНаименованиеРеглОтчета("Прил. 01: Производство и оборот этилового спирта",
						 "(до 2021 г.) Прил. 01: Производство и оборот этилового спирта");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 02: Использование этилового спирта",
						 "(до 2021 г.) Прил. 02: Использование этилового спирта");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 03: Производство и оборот алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 03: Производство и оборот алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 04: Использование алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 04: Использование алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 05: Оборот этилового спирта, алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 05: Оборот этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 06: Поставка этилового спирта, алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 06: Поставка этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 07: Закупка этилового спирта, алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 07: Закупка этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 08: Объем перевозки этилового спирта, алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 08: Объем перевозки этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 09: Перевозка этилового спирта, алкогольной и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 09: Перевозка этилового спирта, алкогольной и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 10: Использование мощностей по производству этилового спирта и алкогольной продукции",
						 "(до 2021 г.) Прил. 10: Использование мощностей по производству этилового спирта и алкогольной продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 11: Розничная продажа алкогольной (за исключением пива и пивных напитков) и спиртосодержащей продукции",
						 "(до 2021 г.) Прил. 11: Розничная продажа алкогольной (за исключением пива и пивных напитков) и спиртосодержащей продукции");
	
	ИзменитьНаименованиеРеглОтчета("Прил. 12: Розничная продажа пива и пивных напитков",
						 "(до 2021 г.) Прил. 12: Розничная продажа пива и пивных напитков");
	
	
	ИзменитьНаименованиеРеглОтчета("Заявление о представлении корректирующих деклараций в ФСРАР",
						 "Прил.11: заявление о представлении корректирующих деклараций в ФСРАР");
	
	ИзменитьНаименованиеРеглОтчета("Объем производства и поставки фармацевтической субстанции спирта этилового",
						 "(до 2021 г.) Объем производства и поставки фармацевтической субстанции спирта этилового");
	
	ИзменитьНаименованиеРеглОтчета("Объем использования для собственных нужд фармацевтической субстанции спирта этилового",
						 "(до 2021 г.) Объем использования для собственных нужд фармацевтической субстанции спирта этилового");
	
	ИзменитьНаименованиеРеглОтчета("Объем поставки фармацевтической субстанции спирта этилового",
						 "(до 2021 г.) Объем поставки фармацевтической субстанции спирта этилового");
	
КонецПроцедуры

// Обработчик обновления БРО 1.1.9.13
//
Процедура ИзменитьНаименованияРеестровПоНДС(Параметры = Неопределено) Экспорт
	
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 1", "Реестр по НДС: Приложение 01");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 2", "Реестр по НДС: Приложение 02");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 3", "Реестр по НДС: Приложение 03");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 4", "Реестр по НДС: Приложение 04");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 5", "Реестр по НДС: Приложение 05");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 6", "Реестр по НДС: Приложение 06");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 7", "Реестр по НДС: Приложение 07");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 8", "Реестр по НДС: Приложение 08");
	ИзменитьНаименованиеРеглОтчета("Реестр по НДС: Приложение 9", "Реестр по НДС: Приложение 09");
	
КонецПроцедуры

// Обработчик обновления БРО 1.1.7.12
//
Процедура ИзменитьПредставлениеПериода(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегламентированныйОтчет.Ссылка,
	               |	РегламентированныйОтчет.ДатаНачала,
	               |	РегламентированныйОтчет.ДатаОкончания
	               |ИЗ
	               |	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	               |ГДЕ
	               |	РегламентированныйОтчет.Периодичность = &Периодичность";	
	 
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТаблЗнач Из Результат Цикл
		
		Док = СтрТаблЗнач.Ссылка.ПолучитьОбъект();
		
		Док.ПредставлениеПериода = РегламентированнаяОтчетностьВызовСервера.ПредставлениеФинансовогоПериода(СтрТаблЗнач.ДатаНачала, СтрТаблЗнач.ДатаОкончания, "Ложь");
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Док, , Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления БРО 0.0.0.1, 1.0.1.60
//
Процедура НазначитьНомераПачекОтчетовПФР() Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Процедура ОпределитьНомерПачкиПоИмениФайла(НомерПачки, ИмяФайла)
	
	Если ТипЗнч(ИмяФайла) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	НомерПачкиВыгрузки = 0;
	
	ПозицияПервогоТокенаDCK = СтрНайти(ИмяФайла, "DCK-");
	Если ПозицияПервогоТокенаDCK <> 0 Тогда
		НомерПачкиОрганизации = Сред(ИмяФайла, ПозицияПервогоТокенаDCK + 4, 5);
		
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерПачкиОрганизации) Тогда
			НомерПачкиВыгрузки = Число(НомерПачкиОрганизации);
			
			Если НомерПачкиВыгрузки = 0 Тогда
				СтрокаБезПервогоВхождения = Сред(ИмяФайла, ПозицияПервогоТокенаDCK + 4 + 5);
				ПозицияВторогоТокенаDCK = СтрНайти(СтрокаБезПервогоВхождения, "DCK-");
				
				НомерПачкиПодразделения = Сред(СтрокаБезПервогоВхождения, ПозицияВторогоТокенаDCK + 4, 5);
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерПачкиПодразделения) Тогда
					НомерПачкиВыгрузки = Число(НомерПачкиПодразделения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НомерПачки = Макс(НомерПачки, НомерПачкиВыгрузки);
	
КонецПроцедуры

Процедура ИзменитьНаименованиеРеглОтчета(СтароеНаим, НовоеНаим)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
		|	РегламентированныйОтчет.Ссылка
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	РегламентированныйОтчет.НаименованиеОтчета = &НаименованиеОтчета";
	
	Запрос.УстановитьПараметр("НаименованиеОтчета", СтароеНаим);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрТаблЗнач Из Результат Цикл
		
		Док = СтрТаблЗнач.Ссылка.ПолучитьОбъект();
		
		Док.НаименованиеОтчета = НовоеНаим;
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Док, , Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления БРО 1.1.11.5
//
Процедура ПереименоватьРасчетПлатыВДекларациюНВОС(Параметры = Неопределено) Экспорт
	Попытка
		Если Метаданные.Отчеты.Найти("РегламентированныйОтчетДекларацияПлатаНВОС") = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РегламентированныйОтчет.Ссылка
		|ИЗ
		|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
		|ГДЕ
		|	ВЫРАЗИТЬ(РегламентированныйОтчет.ВыбраннаяФорма КАК СТРОКА(255)) = ""ФормаОтчета2016Кв1""
		|	И РегламентированныйОтчет.ИсточникОтчета = ""РегламентированныйОтчетРасчетПлатыОкрСредаСвод""";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
				Продолжить;
			КонецЕсли;
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.ИсточникОтчета = "РегламентированныйОтчетДекларацияПлатаНВОС";
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокОбъект);
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление декларация по оплате за негативное воздействие завершено с ошибкой'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область Обработчики

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("НаименованиеОтчета");
 	Поля.Добавить("ПредставлениеПериода");
	Поля.Добавить("ПредставлениеВида");
	Поля.Добавить("Организация");
		
 	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
			
	НаименованиеОтчета = Данные.НаименованиеОтчета + " за " + Данные.ПредставлениеПериода + " (Вид: " + ?(ЗначениеЗаполнено(Данные.ПредставлениеВида), Данные.ПредставлениеВида, "П") + ". Организация: " + Данные.Организация + ")";
			
 	Представление = СтрШаблон(НСтр("ru = '%1'"), НаименованиеОтчета);
		
 	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти