
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	БылиОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"Выбрать РАЗЛИЧНЫЕ
	|	РС.Операция КАК Операция
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.Операция.Ссылка ЕСТЬ NULL
	|;
	|//1//////////////////////////////
	|Выбрать РАЗЛИЧНЫЕ
	|	РС.ПредметУчета КАК ПредметУчета
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.ПредметУчета.Ссылка ЕСТЬ NULL
	|;
	|//2//////////////////////////////
	|Выбрать РАЗЛИЧНЫЕ
	|	РС.ФинансоваяЦель КАК ФинансоваяЦель
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.ФинансоваяЦель <> Значение(Справочник.ФинансовыеЦели.ПустаяСсылка) И РС.ФинансоваяЦель.Ссылка ЕСТЬ NULL
	|;
	|//3//////////////////////////////
	|Выбрать РАЗЛИЧНЫЕ
	|	РС.Валюта КАК Валюта
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.Валюта <> Значение(Справочник.Валюты.ПустаяСсылка) И РС.Валюта.Ссылка ЕСТЬ NULL
	|";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// несуществуюшие операции
	Выборка = РезультатыЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Операция;
		Попытка
			УдалитьЗапись(Новый Структура("Операция", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по документу");
		КонецПопытки;
		
	КонецЦикла; 
		
	// несуществуюшие ссылки справочников
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.ПредметУчета;
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Или Не ЗначениеЗаполнено(Ссылка) Тогда
			// Допускаются пустые значения
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура("ПредметУчета", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по предмету учета");
		КонецПопытки;
		
	КонецЦикла; 
		
	// несуществуюшие финансовые цели
	Выборка = РезультатыЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.ФинансоваяЦель;
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Или Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура("ФинансоваяЦель", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по финансовой цели");
		КонецПопытки;
		
	КонецЦикла; 
		
	// несуществуюшие валюты
	Выборка = РезультатыЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Валюта;
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Или Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура("Валюта", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по валюте");
		КонецПопытки;
		
	КонецЦикла; 
		
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСлужебный.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "ОбъектыОпераций", Загрузка);
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьОшибку(Ошибка, Данные, Комментарий)
	
	ТипДанных = ТипЗнч(Данные);
	ЗаписьЖурналаРегистрации("Справочники.Объекты операций", УровеньЖурналаРегистрации.Ошибка, , Данные,
			СтрШаблон("%1 ""%2"" (%3): 
			|%4", Комментарий, Данные, ТипДанных, ПодробноеПредставлениеОшибки(Ошибка)));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли