
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ПараметрыФормы.Отбор.Вставить("Имущество", ПараметрКоманды);
	КонецЕсли;
	ПараметрыФормы.Вставить("КлючВарианта", "ОперацииПоИмуществу");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", ЗначениеЗаполнено(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ОтчетПоИмуществу.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
