////////////////////////////////////////////////////////////////////////////////
//Документ.ВводИзменениеОстака.ФормаСписка
//  Используется для просмотра и выбора документа
//  
//  
//Параметры формы:
//	Стандартные параметры формы
//	НомерОтбораПоСостоянию - Число - для установки отбора по состоянию операций.
//									Описание возможных значений дано в ДеньгиКлиентСервер.УстановитьОтборСпискаОперацийПоСостояниюДокумента()
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Общие настройки для всех форм списков документов
	РаботаСФормамиДокументов.ФормаСпискаПриСозданииНаСервере(ЭтотОбъект, "Список", Ложь);
	
	// Установка условного оформления для форм списков:
	СуммыИВалюты = Новый Структура("СуммаДохода, СуммаРасхода", 
			Новый Массив, Новый Массив);
	СуммыИВалюты.СуммаДохода.Добавить("ВалютаОперации");
	СуммыИВалюты.СуммаРасхода.Добавить("ВалютаОперации1");
	РаботаСФормамиДокументов.УстановитьУсловноеОформлениеФормыСписка(ЭтотОбъект, "Список", Истина, СуммыИВалюты, Ложь, Ложь);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийСписка

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
//@skip-warning
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти

