///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
/////////////////////////////////////////////////////////////////////////////////////////////////////V


#Область ПрограммныйИнтерфейс

// Проверяет наличие указанного каталога. При необходимости создает новый каталог
//
//Параметры:
//	Каталог - Строка или Файл - каталог, наличе которого нужно проверить
//	СоздаватьПриОстутствии - Булево - нужно ли создать каталог, если он отсутствует
//	ОписаниеПроблемы - Строка - будет заполнена если не удасться создать каталог или получить к нему доступ
//
//Возвращаемое значение:
//	Булево - Истина, если каталог создан.
//
Функция ПроверитьКаталог(Каталог, СоздаватьПриОстутствии = Истина, ОписаниеПроблемы = "") Экспорт
	
	ПроверяемыйФайл = Файл(Каталог);
	Если ПроверяемыйФайл.Существует() Тогда
		
		Если ПроверяемыйФайл.ЭтоФайл() Тогда
			ОписаниеПроблемы = СтрШаблон(НСтр("ru='Имя ""%1"" занято файлом. Каталог сэтим именем создать невозможно'"), 
					ПроверяемыйФайл.ПолноеИмя); 
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		СоздатьКаталог(ПроверяемыйФайл.ПолноеИмя);
		Результат = Истина;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ОписаниеПроблемы = СтрШаблон(НСтр("ru='Создание каталога ""%1"" завершилось ошибкой: %2'"), 
				ПроверяемыйФайл.ПолноеИмя, КраткоеПредставлениеОшибки(Ошибка)); 
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции 

// Составляет имя файла из частей, проверяя наличие разделителей
//
//Параметры:
//	Часть1 - Часть5 - Строка или Неопределено
//
//Возвращаемое значение:
//	Строка - Полное имя файла, составленное из частей
//
Функция СоставитьИмяФайла(Часть1, Часть2 = Неопределено, Часть3 = Неопределено, Часть4 = Неопределено, Часть5 = Неопределено,
					Часть6 = Неопределено, Часть7 = Неопределено, Часть8 = Неопределено, Часть9 = Неопределено, Часть10 = Неопределено) Экспорт
	
	Результат = Часть1;
	Разделитель = ПолучитьРазделительПути();
	Если Разделитель = "/" Тогда
		Результат = СтрЗаменить(Результат, "\", Разделитель);
	Иначе
		Результат = СтрЗаменить(Результат, "/", Разделитель);
	КонецЕсли;
	
	Если Не ИмяФайлаДополнено(Результат, Часть2, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть3, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть4, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть5, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть6, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть7, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть8, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть9, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Не ИмяФайлаДополнено(Результат, Часть10, Разделитель) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

// Разбивает полное имя файла с неизвестным расширением на путь и имя, 
// возвращает путь к файлу (т.е. часть строки до последнего разделителя пути включительно)
Функция КаталогИзИмениФайла(Знач ИмяФайла) Экспорт
	
	Разделитель = ПолучитьРазделительПути();
	Если Разделитель = "/" Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", Разделитель);
	Иначе
		ИмяФайла = СтрЗаменить(ИмяФайла, "/", Разделитель);
	КонецЕсли;
	
	Если Прав(ИмяФайла, 1) = Разделитель Тогда
		ИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла) - 1);
	КонецЕсли;
	
	ПозицияРазделителя = СтрНайти(ИмяФайла, Разделитель, НаправлениеПоиска.СКонца);
	Если ПозицияРазделителя = 0 Тогда
		Возврат "";
	Иначе
		Возврат Лев(ИмяФайла, ПозицияРазделителя);
	КонецЕсли;
	
КонецФункции

// Разбивает полное имя файла с неизвестным расширением на путь и имя, 
// возвращает путь к файлу (т.е. часть строки до последнего разделителя пути включительно)
Функция ИмяИзИмениФайла(Знач ИмяФайла) Экспорт
	
	Разделитель = ПолучитьРазделительПути();
	Если Разделитель = "/" Тогда
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", Разделитель);
	Иначе
		ИмяФайла = СтрЗаменить(ИмяФайла, "/", Разделитель);
	КонецЕсли;
	
	Если Прав(ИмяФайла, 1) = Разделитель Тогда
		ИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла) - 1);
	КонецЕсли;
	
	ПозицияРазделителя = СтрНайти(ИмяФайла, Разделитель, НаправлениеПоиска.СКонца);
	Если ПозицияРазделителя = 0 Тогда
		Возврат ИмяФайла;
	Иначе
		Возврат Сред(ИмяФайла, ПозицияРазделителя + 1);
	КонецЕсли;
	
КонецФункции

// Копирует каталог из одного местоположения в новое. Если задано - удаляет оригинальные файлы и каталоги
//
//Параметры:
//	ТекущееИмя - Строка или Файл - каталог-источник файлов
//	НовоеИмя   - Строка или Файл - каталог-назначение копирования или переноса
//	УдалятьОригинал - Булево - если истина, каатлог будет перенесен, а не скопирован
//
Процедура СкопироватьКаталог(ТекущееИмя, НовоеИмя, УдалятьОригинал = Ложь) Экспорт
	
	#Если Сервер Или ВнешнееСоединение Тогда
		ИмяТекущее = ТекущееИмя;
		ИмяНовое   = НовоеИмя;
	#Иначе
		ИмяТекущее = ПолноеИмяФайла(ТекущееИмя);
		ИмяНовое   = ПолноеИмяФайла(НовоеИмя);
	#КонецЕсли 
	
	ДеньгиРаботаСФайламиВызовСервера.СкопироватьКаталог(ИмяТекущее, ИмяНовое, УдалятьОригинал);
	
КонецПроцедуры

// Возвращает каталог указанного файла или каталога
//
//Параметры:
//	ФайлИлиКаталог - Строка или Файл
//
//Возвращаемое значение:
//	Строка - Каталог файла или Неопределено
//
Функция РодительскийКаталог(Знач ФайлИлиКаталог) Экспорт
	
	Файл = Файл(ФайлИлиКаталог);
	Возврат ?(ЗначениеЗаполнено(Файл.Путь),  Файл.Путь, Неопределено);
	
КонецФункции 

// Возвращает структуру родителей для указанного файла или каталога
//
//Параметры:
//	ФайлИлиКаталог - Строка или Файл
//
//Возвращаемое значение:
//	Структура:
//		* ПолноеИмя - Строка - полное имя файла
//		* Имя - Строка - Имя файла или каталога
//		* ЭтоКаталог - Будево - является ли каталогом
//		* Родитель - структура или неопределено
//
Функция СтруктураРодителей(Знач ФайлИлиКаталог) Экспорт
	
	Если Не ЗначениеЗаполнено(ФайлИлиКаталог) Или Прав(ФайлИлиКаталог, 2) = ":\" Тогда
		Возврат Неопределено
	КонецЕсли;
	ФайлИлиКаталог = Файл(ФайлИлиКаталог);
	Если Не ФайлСуществует(ФайлИлиКаталог) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПолноеИмя",   ФайлИлиКаталог.ПолноеИмя); 
	Результат.Вставить("Имя",         ФайлИлиКаталог.Имя); 
	Результат.Вставить("ЭтоКаталог",  ФайлИлиКаталог.ЭтоКаталог()); 
	Результат.Вставить("Родитель",    ?(ЗначениеЗаполнено(ФайлИлиКаталог.Путь), 
					СтруктураРодителей(ФайлИлиКаталог.Путь), Неопределено)); 
	
	Возврат Результат;
	
КонецФункции 

// Открывает диалог выбора файла и обрабатывавет выбор пользователя
//
//Параметры:
//	Объект - Произвольный - Форма или другой объект, для реквизита которого нужно выбрать каталог
//	ИмяРеквизита - Строка - имя реквизита объекта, значение которого нужно заменить выбранным каталогом
//	ТекущееЗначение - Строка - текущее значение каталога
//	Обработчик - ОписаниеОповещения - обработчик выбора значения
//
&НаКлиенте 
Процедура ВыбратьКаталог(Объект = Неопределено, ИмяРеквизита = Неопределено, ТекущееЗначение = Неопределено, Обработчик  = Неопределено) Экспорт
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = НСтр("ru='Выберите каталог'");
	Диалог.Каталог = ТекущееЗначение;
	
	ДопСвойства = Новый Структура("Обработчик,Объект,ИмяРеквизита", Обработчик, Объект, ИмяРеквизита);
	Оповещение = Новый ОписаниеОповещения("ВыбратьКаталогЗавершение", ДеньгиРаботаСФайламиКлиентСервер, ДопСвойства);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталогЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранныйКаталог = СоставитьИмяФайла(ВыбранныеФайлы[0], "/");
	
	Если ДополнительныеПараметры.Объект <> Неопределено И Не ПустаяСтрока(ДополнительныеПараметры.ИмяРеквизита) Тогда
		ДополнительныеПараметры.Объект[ДополнительныеПараметры.ИмяРеквизита] = ВыбранныйКаталог;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Обработчик <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Обработчик, ВыбранныйКаталог);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстИзФайла( Знач Файл ) Экспорт
	
	Если Не ФайлСуществует(Файл) Тогда
		ВызватьИсключение СтрШаблон("Файл ""%1"" не существует", ПолноеИмяФайла(Файл)) ;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		Возврат ДеньгиРаботаСФайламиВызовСервера.ТекстИзФайла(Файл.ПолноеИмя);
	#Иначе
		Файл      = Файл(Файл);
		Чтение    = Новый ЧтениеТекста(Файл.ПолноеИмя, "UTF-8");
		Результат = Чтение.Прочитать();
		Чтение.Закрыть();
		
		Возврат Результат;
	#КонецЕсли
	
КонецФункции 

Процедура ТекстВФайл( Знач ИмяИлиФайл, Знач Текст ) Экспорт
	
	#Если ВебКлиент Тогда
		ДеньгиРаботаСФайламиВызовСервера.ТекстВФайл(ИмяИлиФайл, Текст);
	#Иначе
		Файл      = Файл(ИмяИлиФайл);
		Запись    = Новый ЗаписьТекста(Файл.ПолноеИмя, "UTF-8", Символы.ПС, Ложь, Символы.ПС);
		Запись.ЗаписатьСтроку( Текст,  );
		Запись.Закрыть();
	#КонецЕсли
	
КонецПроцедуры

// Преобразует данные в JSON-строку. В качестве данных можно использовать только простые типы или 
//	коллекции, состоящие из простых типов.
//Соответствия следует преобразовывать в структуры
//
//Параметры:
//	Данные - произвольные данные простого типа или коллекция данных простого типа
//
//Возвращаемое значение:
//	Строка - JSON
//
Функция ДанныеВФайлJSON(Данные, Знач ИмяФайла) Экспорт
	
	Файл = Неопределено;
	
	#Если ВебКлиент Тогда
		Возврат ДеньгиРаботаСФайламиВызовСервера.ДанныеВФайлJSON(Данные, ИмяФайла);
	#Иначе
	
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		
		Текст = ЗаписьJSON.Закрыть();
		Файл = Файл(ИмяФайла);
		ТекстВФайл(Файл, Текст);
			
	#КонецЕсли

	Возврат Файл;
	
КонецФункции

// Читает из файла текст и реобразует его в данные или коллекцию данных
//
//Параметры:
//	Файл - Строка или Файл
//	ИменаПолейТипаДата - Строка, в которой через запятую перечислены поля типа Дата
//
//Возвращаемое значение:
//	Произвольный - восстановленные из строки данные
//
Функция ДанныеИзФайлаJSON(Знач Файл, ИменаПолейТипаДата = "") Экспорт
	
	Текст = ТекстИзФайла(Файл);
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПарсерJSON.ДанныеИзСтрокиJSON(Текст, ИменаПолейТипаДата);

КонецФункции

Функция ФайлСуществует(Знач Файл) Экспорт
	
	Файл = Файл(Файл);
	Возврат Файл.Существует();
	
КонецФункции 

// Проверяет наличие и удаляет указанный файл или каталог
//
//Параметры:
//	ФайлИлиКаталог - Строка или Файл
//
Процедура УдалитьФайл(Знач ФайлИлиКаталог) Экспорт
	
	Файл = Файл(ФайлИлиКаталог);
	Если Файл.Существует() Тогда
		УдалитьФайлы(Файл.Путь, Файл.Имя);
	КонецЕсли;
	
КонецПроцедуры 

Функция ФайлСМаксимальнымИменем(Каталог, Маска) Экспорт
	Результат = Неопределено;
	
	СписокФайлов = НайтиФайлы(Каталог, Маска);
	Для Каждого Файл Из СписокФайлов Цикл
		Если Результат = Неопределено Тогда
			Результат = Файл;
		ИначеЕсли Файл.Имя > Результат.Имя Тогда
			Результат = Файл;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат.ПолноеИмя;
	
КонецФункции 

Функция НовыйИмяФайлаПоКаталогу(Каталог, Расширение) Экспорт
	
	ФайлКаталога = Новый Файл(Каталог);
	Возврат ФайлКаталога.Имя + "_" + Формат(ТекущаяДата(), "ДФ=гг-ММ-дд_ЧЧмм") 
			+ ?(Лев(Расширение, 1) = ".", "", ".") + Расширение;
	
КонецФункции 

// Возвращает строку недопустимых символов.
// Согласно http://en.wikipedia.org/wiki/Filename - в разделе "Reserved characters and words".
// Возвращаемое значение:
//   Строка - строка недопустимых символов.
Функция СписокНедопустимыхСимволовВИмениФайла() Экспорт

	НедопустимыеСимволы = """/\[]:;|=?*<>";
	НедопустимыеСимволы = НедопустимыеСимволы + Символы.Таб;
	Возврат НедопустимыеСимволы;

КонецФункции

// Проверяет наличие недопустимых символов в имени файла.
//
// Параметры:
//  ИмяФайла  - Строка - имя файла.
//
// Возвращаемое значение:
//   Массив   - массив обнаруженных в имени файла недопустимых символов.
//              Если недопустимых символов не обнаружено - возвращается пустой массив.
Функция НедопустимыеСимволыВИмениФайла(ИмяФайла) Экспорт

	НедопустимыеСимволы = СписокНедопустимыхСимволовВИмениФайла();
	
	МассивНайденныхНедопустимыхСимволов = Новый Массив;
	
	Для ПозицияСимвола = 1 По СтрДлина(НедопустимыеСимволы) Цикл
		ПроверяемыйСимвол = Сред(НедопустимыеСимволы,ПозицияСимвола,1);
		Если СтрНайти(ИмяФайла,ПроверяемыйСимвол) <> 0 Тогда
			МассивНайденныхНедопустимыхСимволов.Добавить(ПроверяемыйСимвол);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНайденныхНедопустимыхСимволов;

КонецФункции

// Заменяет недопустимые символы в имени файла.
//
// Параметры:
//  ИмяФайла     - Строка - исходное имя файла.
//  НаЧтоМенять  - Строка - строка, на которую необходимо заменить недопустимые символы.
//
// Возвращаемое значение:
//   Строка - преобразованное имя файла.
//
Функция ЗаменитьНедопустимыеСимволыВИмениФайла(Знач ИмяФайла, НаЧтоМенять = " ") Экспорт

	Результат = ИмяФайла;
	МассивНайденныхНедопустимыхСимволов = НедопустимыеСимволыВИмениФайла(Результат);
	Для Каждого НедопустимыйСимвол Из МассивНайденныхНедопустимыхСимволов Цикл
		Результат = СтрЗаменить(Результат, НедопустимыйСимвол, НаЧтоМенять);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Возвращает массив структур, описывающих файлы в указанном каталоге
//
// Параметры:
//	ИмяФайлаИлиКаталога - Строка - относительные имена файлов и каталогов, разделенные запятой
//	Расширения - Строка - нужные расширения через запятую. Если не задано, в список попадут все файлы
//	КорневойКаталог - Строка - имя каталога, относительно которого вычисляются ключевые имена файлов
//	ВключаяПодкаталоги - Булево - нужно ли получать файлы из подкаталогов 
//
//	Возвращаемое значение:
//	Массив структур (см. НовыйСтруктураФайлаВКэше();
///
Функция СписокФайлов(ИмяФайлаИлиКаталога, Расширения, КорневойКаталог = "", ВключаяПодкаталоги = Ложь) Экспорт
	
	Результат = Новый Массив();
	
	Расширения = ?(Не ЗначениеЗаполнено(Расширения), "*", Расширения);
	
	Если ТипЗнч(ИмяФайлаИлиКаталога) = Тип("Массив") Тогда
		СписокИскомыхФайлов     = ИмяФайлаИлиКаталога;
	Иначе
		СписокИскомыхФайлов     = СтрРазделить(ИмяФайлаИлиКаталога, ",");
	КонецЕсли;
	Если СписокИскомыхФайлов.Количество() = 0 Тогда
		СписокИскомыхФайлов.Добавить("*");
	КонецЕсли;
	
	Для Каждого ИмяФайла Из СписокИскомыхФайлов Цикл
		
		Если ЗначениеЗаполнено(КорневойКаталог) Тогда
			Каталог = КаталогИзИмениФайла(СоставитьИмяФайла(КорневойКаталог, ИмяФайла));
		Иначе
			Каталог = КаталогИзИмениФайла(ИмяФайла);
		КонецЕсли;
		ТолькоИмя = ИмяИзИмениФайла(ИмяФайла);
		НайденныеФайлы = НайтиФайлы(Каталог, ТолькоИмя + ".*", Ложь);
		Для Каждого НайденныйФайл Из НайденныеФайлы Цикл
			
			Если НайденныйФайл.ЭтоКаталог() Или Расширения = "*" 
				Или СтрНайти(Расширения + ",", СтрЗаменить(НайденныйФайл.Расширение, ".", "") + ",") > 0 Тогда
				СтруктураФайла = СтруктураФайлаВКэш(НайденныйФайл, КорневойКаталог);
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если СтруктураФайла.ЭтоКаталог И ВключаяПодкаталоги Тогда
				СтруктураФайла.Файлы = СписокФайлов(СтруктураФайла.ПолноеИмя, 
							Расширения, КорневойКаталог, ВключаяПодкаталоги);
			КонецЕсли;
			
			Результат.Добавить(СтруктураФайла);
			
		КонецЦикла;
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Делит исходный файл на части и возворащает массив имен файлов
//
//Параметры:
//	ИсходныйФайл - Строка - имя файла, который нужно разделить на части
//	РазмерЧасти - Число - размер в Mb, который не должны превышать результирующие части
//	КаталогРезультата - Строка - каталог, в который нужно поместить рещзультирующие части
//
//Возвращаемое значение:
//	Массив строк
//
Функция РазделитьНаЧасти(ИсходныйФайл, РазмерЧасти = 1, КаталогРезультата = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	#Если ВебКлиент Тогда
		Возврат ДеньгиРаботаСФайламиВызовСервера.РазделитьНаЧасти(ИсходныйФайл, РазмерЧасти, КаталогРезультата);
	#Иначе
		Результат = Новый Массив;
		РазмерВБайтах = РазмерЧасти * 1024 * 1024;
		
		Файл = Файл(ИсходныйФайл);
		Если Не Файл.Существует() Тогда
			ВызватьИсключение СтрШаблон( НСтр("ru='Невозможно разделить на части отсутствующий файл: ""%1""'"), Файл.ПолноеИмя );
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КаталогРезультата) Тогда
			ОписаниеПроблемы = "";
			Если Не ПроверитьКаталог(КаталогРезультата, Истина, ОписаниеПроблемы) Тогда
				ВызватьИсключение СтрШаблон( НСтр("ru='Невозможно разделить на части файл в каталог ""%1"": %2%3'"), 
							КаталогРезультата, Символы.ПС, ОписаниеПроблемы );
			КонецЕсли;
		КонецЕсли;
		Результат = РазделитьФайл(Файл.ПолноеИмя, РазмерВБайтах, КаталогРезультата);
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции 

// Выполняет объединение частей файла в файл с указанным именем
//
//Параметры:
//	СписокИлиМаска - Массив или Строка - список имен частей файлов или маска файлов для объединения
//	ИмяРезультирующегоФайла - Строка - полное имя файла, в который нужно собрать его части
//								В случае использования маски должен быть обязательно указан
//
Процедура ОбъединитьЧасти(СписокИлиМаска, ИмяРезультирующегоФайла = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		ДеньгиРаботаСФайламиВызовСервера.ОбъединитьЧасти(СписокИлиМаска, ИмяРезультирующегоФайла);
	#Иначе
		ЭтоМаска = ТипЗнч(СписокИлиМаска) = тип("Строка");
		Если ЭтоМаска И Не ЗначениеЗаполнено(ИмяРезультирующегоФайла) Тогда
			ВызватьИсключение НСтр("ru='Для объединения частей файла по маске нужно указать имя результирующего файла'");
		КонецЕсли;
		
		Если Не ЭтоМаска и Не ЗначениеЗаполнено(ИмяРезультирующегоФайла) Тогда
			ПервыйФайл = Файл(СписокИлиМаска[0]);
			РасширениеЧасти = СтрЗаменить(ПервыйФайл.Расширение, ".", "");
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(РасширениеЧасти) Тогда
				ИмяРезультирующегоФайла = СоставитьИмяФайла(ПервыйФайл.Путь, ПервыйФайл.ИмяБезРасширения);
			Иначе
				ИмяРезультирующегоФайла = ПервыйФайл.ПолноеИмя;
			КонецЕсли;
		КонецЕсли;
		
		ОбъединитьФайлы(СписокИлиМаска, ИмяРезультирующегоФайла);
	#КонецЕсли
	
КонецПроцедуры
 
 Функция РазмерФайлаСтрокой(РазмерФайла) Экспорт
	Если РазмерФайла < 1024 Тогда
		Результат = Формат(РазмерФайла, "ЧН=0") + " " + НСтр("ru = 'б'");
	ИначеЕсли РазмерФайла < 1024 * 1024 Тогда
		Результат = Формат(РазмерФайла / 1024, "ЧДЦ=0; ЧГ=0") + " " +  НСтр("ru = 'кб'");
	Иначе
		Результат = Формат(РазмерФайла / (1024 * 1024), "ЧДЦ=0; ЧГ=0") + " " +  НСтр("ru = 'Мб'");
	КонецЕсли;
	Возврат Результат;
	
 КонецФункции

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Получает строку или файл, возвращает полное файл
Функция Файл(Знач ИмяИлиФайл, Часть2 = Неопределено, Часть3 = Неопределено, Часть4 = Неопределено, Часть5 = Неопределено,
					Часть6 = Неопределено, Часть7 = Неопределено, Часть8 = Неопределено, Часть9 = Неопределено, Часть10 = Неопределено) Экспорт
	Если ТипЗнч(ИмяИлиФайл) = Тип("Файл") Тогда
		Возврат ИмяИлиФайл;
	Иначе
		ИмяФайла = СоставитьИмяФайла(ИмяИлиФайл, Часть2, Часть3, Часть4, Часть5, Часть6, Часть7, Часть8, Часть9, Часть10);
		Возврат Новый Файл(ИмяФайла);
	КонецЕсли;
	
КонецФункции 

// Получает строку или файл, возвращает полное имя файла
Функция ПолноеИмяФайла(ИмяИлиФайл) Экспорт
	Возврат ?(ТипЗнч(ИмяИлиФайл) = Тип("Файл"), ИмяИлиФайл.ПолноеИмя, ИмяИлиФайл);
КонецФункции 

// Возвращает пустую структуру для заполнения свойствами файла.
//	пригодно для обмена между сервером и клиентом
Функция НовыйСтруктураФайлаВКэше() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ключ",           ""); // путь без корневого каталога. Например: "Ошибки/Не работает список/
	Результат.Вставить("ПолноеИмя",      ""); // полный путь файла или каталога
	Результат.Вставить("Имя",            ""); // имя без расширения
	Результат.Вставить("Путь",           ""); // полный путь к каталогу текущего файла или каталога
	Результат.Вставить("Расширение",     ""); // расширение
	Результат.Вставить("ЭтоКаталог",     Ложь); // Истина для каталога
	Результат.Вставить("Файлы",          Новый Массив); // заполняется файлами, если это каталог
	Результат.Вставить("Параметры",      Неопределено); // вспомогательные значения - заполняются в получателе списка
	Результат.Вставить("Виртуальный",    Ложь);
	
	Результат.Вставить("ОдноименныеФайлы", Новый Массив); // заполняется файлами с тем же именем, но другими расширениями
	
	Возврат Результат;
	
КонецФункции 

// Возвращает структуру, заполненную свойствами файла.
//	пригодно для обмена между сервером и клиентом
Функция СтруктураФайлаВКэш(ИмяИлиФайл, Корень = Неопределено) Экспорт 
	
	Файл = Файл(ИмяИлиФайл);
	
	Результат = НовыйСтруктураФайлаВКэше();
	Результат.ПолноеИмя    = Файл.ПолноеИмя;
	Результат.Имя          = Файл.ИмяБезрасширения;
	Результат.Путь         = Файл.Путь;
	Результат.Расширение   = Файл.Расширение;
	Результат.ЭтоКаталог   = Файл.Существует() И Файл.ЭтоКаталог();
	
	Если Корень <> Неопределено Тогда
		Результат.Ключ = СтрЗаменить(СтрЗаменить(Файл.Путь, Корень, ""), "\", "/")
					+ Результат.Имя;
	КонецЕсли;
	
	ОдноименнныеФайлы = НайтиФайлы(Файл.Путь, Файл.ИмяБезрасширения + ".*", Ложь);
	Для каждого СубФайл Из ОдноименнныеФайлы Цикл
		
		Если СубФайл.ПолноеИмя = Файл.ПолноеИмя Тогда
			Продолжить;
		КонецЕсли;
		Результат.ОдноименныеФайлы.Добавить(СубФайл.ПолноеИмя);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ИмяФайлаДополнено(ИмяФайла, Продолжение, Разделитель = Неопределено) 
	
	Если Продолжение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Разделитель = Неопределено Тогда
		Разделитель = ПолучитьРазделительПути();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ИмяФайла = ИмяФайла + ?(Прав(ИмяФайла, 1) = Разделитель, "", Разделитель);
		Если Продолжение = "/" Или Продолжение = "\" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Разделитель = "/" Тогда
		ИмяФайла = ИмяФайла + СтрЗаменить(Продолжение, "\", Разделитель);
	Иначе
		ИмяФайла = ИмяФайла + СтрЗаменить(Продолжение, "/", Разделитель);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

Функция ПолучитьКаталогФайла(Знач Файл) Экспорт
	
	Пока ЗначениеЗаполнено(Файл.Путь) Цикл
		
		Файл = Новый Файл(Файл.Путь);
		Если Файл.Существует() Тогда
			Возврат Файл;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 



#КонецОбласти