#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуЭлемента();
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОткрытьФормуЭлемента();
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Сохраняем значение параметров формы
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	ЗначенияЗаполнения  = Параметры.ЗначенияЗаполнения;
	Основание           = Параметры.Основание;
	
	Параметры.ЗначениеКопирования	= Неопределено;
	Параметры.ЗначенияЗаполнения	= Неопределено;
	Параметры.Основание				= Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭлемента()

	ВидТранспорта = Элементы.СписокВыбора.ТекущиеДанные;
	Если ВидТранспорта = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначенияЗаполнения = Неопределено Тогда
		ЗначенияЗаполнения = Новый Структура;
	КонецЕсли; 
	ЗначенияЗаполнения.Вставить("ВидТранспорта", ВидТранспорта.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначениеКопирования,ЗначенияЗаполнения", ЗначениеКопирования, ЗначенияЗаполнения);
	Закрыть();
	ОткрытьФорму("Справочник.ТранспортыОбменаДанными.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры


#КонецОбласти


