
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписокОтчетов()
		
	ЗаполнитьДеревоОтчетов();

	Если ДеревоОтчетов.ПолучитьЭлементы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДеревоОтчетов", ДеревоОтчетов);
	
	ФормаВыбораОтчетов = ПолучитьФорму("Обработка.ОбновлениеРегламентированнойОтчетности.Форма.ФормаВыбораОтчетов", ПараметрыФормы, , "дляВыбораРегламОтчетов");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСписокОтчетовЗавершение", ЭтотОбъект);
	ФормаВыбораОтчетов.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаВыбораОтчетов.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВыбораОтчетов.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокОтчетовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДеревоВыбранныхОтчетов = Результат;
	
	Если ДеревоВыбранныхОтчетов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КопироватьДанныеФормы(ДеревоВыбранныхОтчетов, ДеревоОтчетов);
	
	ЗаполнитьСписокОтчетов();
	
	Оповестить("Обновить дерево отчетов", "Обновить дерево отчетов", ЭтаФорма)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОтчетов()
	
	СписокОтчетов = РеквизитФормыВЗначение("Объект").ПолучитьСписокОтчетов();
	
	Если СписокОтчетов.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
			
	ЗначениеВРеквизитФормы(СписокОтчетов, "ДеревоОтчетов");
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОтчетов()
	
	РеквизитФормыВЗначение("Объект").ЗаполнитьСписокОтчетов(РеквизитФормыВЗначение("ДеревоОтчетов"));
	РеквизитФормыВЗначение("Объект").СкрытьВосстановитьОтчеты(РеквизитФормыВЗначение("ДеревоОтчетов"));
	РеквизитФормыВЗначение("Объект").УстановитьСнятьПометкуНаУдаление(РеквизитФормыВЗначение("ДеревоОтчетов"));
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Обновить комплект отчетности?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ОбновитьСписокОтчетов();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти