
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверяет, принадлежит ли КлючВарианта схеме КД
//
Функция ЭтоСтандартныйВариант(КлючВарианта, АдресСхемыКомпоновкиДанных) Экспорт

	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	Возврат СхемаКомпоновкиДанных.ВариантыНастроек.Найти(КлючВарианта) <> Неопределено;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

