///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс


// Возвращает дату начала действия прогрессивной шкалы НДФЛ
//
// Возвращаемое значение:
//   Дата
//
Функция ДатаНачалаПрогрессивнойШкалы() Экспорт
	
	Возврат Дата(2021, 1, 1);
	
КонецФункции

// Возвращает сумму налоговой базы налогоплательщика для применения повышенной ставки НДФЛ
//
// Возвращаемое значение:
//   Число
//
Функция ГраницаНалоговойБазыДляПримененияПовышеннойСтавки() Экспорт
	
	Возврат 5000000; // п. 1 ст. 224 НК РФ
	
КонецФункции

// Возвращает ставки налога НДФЛ, указанные в НК РФ
//
// Параметры:
//   Период - Дата - Дата, для которой определяются ставки налога
//
// Возвращаемое значение:
//   Структура - ставки налогов
//    * СтавкаНДФЛ           - Число - абзац 2 п. 1 ст. 224 НК РФ
//    * СтавкаНДФЛПовышенная - Число - абзац 3 п. 1 ст. 224 НК РФ
//
Функция НалоговыеСтавкиПоУмолчанию(Период = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СтавкаНДФЛ", 13);
	Результат.Вставить("СтавкаНДФЛПовышенная", Неопределено);
	
	Если Период = Неопределено Или Период >= ДатаНачалаПрогрессивнойШкалы() Тогда
		Результат.СтавкаНДФЛПовышенная = 15;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает сумму налога на доходы физических лиц
//
// Параметры:
//   НалоговаяБаза - Число - сумма налоговой базы
//   Период        - Дата - Дата, для которой рассчитывается сумма налога
//
// Возвращаемое значение:
//   Число
//
Функция СуммаНалога(НалоговаяБаза, Период = Неопределено) Экспорт
	
	НалоговыеСтавки = НалоговыеСтавкиПоУмолчанию(Период);
	ПредельнаяСуммаНалоговойБазы = ГраницаНалоговойБазыДляПримененияПовышеннойСтавки();
	
	НалоговаяБазаСвышеПредела = НалоговаяБаза - ПредельнаяСуммаНалоговойБазы;
	
	Если НалоговыеСтавки.СтавкаНДФЛПовышенная <> Неопределено И НалоговаяБазаСвышеПредела > 0 Тогда
		
		Результат = ПредельнаяСуммаНалоговойБазы * НалоговыеСтавки.СтавкаНДФЛ / 100
			+ НалоговаяБазаСвышеПредела * НалоговыеСтавки.СтавкаНДФЛПовышенная / 100;
	Иначе
		Результат = НалоговаяБаза * НалоговыеСтавки.СтавкаНДФЛ / 100;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодНалогоплательщиваПоЕгоКатегории(Категория) Экспорт
	
	Если Категория = ПредопределенноеЗначение("Перечисление.КатегорииНалогоплательщикаНДФЛ.Адвокат") Тогда
		Возврат "740";
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.КатегорииНалогоплательщикаНДФЛ.АрбитражныйУправляющий") Тогда
		Возврат "750";
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.КатегорииНалогоплательщикаНДФЛ.ГлаваФермерскогоХозяйства") Тогда
		Возврат "770";
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.КатегорииНалогоплательщикаНДФЛ.ИндивидуальныйПредприниматель") Тогда
		Возврат "720";
	ИначеЕсли Категория = ПредопределенноеЗначение("Перечисление.КатегорииНалогоплательщикаНДФЛ.Нотариус") Тогда
		Возврат "730";
	Иначе
		Возврат "760";
	КонецЕсли;
	
КонецФункции

Функция НаименованиеВидаУдостоверенияЛичности(Код) Экспорт
	
	Если Код = "01" Тогда
		Возврат "Паспорт гражданина СССР";
	ИначеЕсли Код = "02" Тогда
		Возврат "Загранпаспорт гражданина СССР";
	ИначеЕсли Код = "03" Тогда
		Возврат "Свидетельство о рождении";
	ИначеЕсли Код = "04" Тогда
		Возврат "Удостоверение личности офицера";
	ИначеЕсли Код = "05" Тогда
		Возврат "Справка об освобождении из места лишения свободы";
	ИначеЕсли Код = "06" Тогда
		Возврат "Паспорт Минморфлота";
	ИначеЕсли Код = "07" Тогда
		Возврат "Военный билет";
	ИначеЕсли Код = "08" Тогда
		Возврат "Временное удостоверение, выданное взамен военного билета";
	ИначеЕсли Код = "09" Тогда
		Возврат "Дипломатический паспорт";
	ИначеЕсли Код = "10" Тогда
		Возврат "Паспорт иностранного гражданина";
	ИначеЕсли Код = "11" Тогда
		Возврат "Свидетельство о рассмотрении ходатайства о признании лица беженцем на территории Российской Федерации по существу";
	ИначеЕсли Код = "12" Тогда
		Возврат "Вид на жительство в Российской Федерации";
	ИначеЕсли Код = "13" Тогда
		Возврат "Удостоверение беженца";
	ИначеЕсли Код = "14" Тогда
		Возврат "Временное удостоверение личности гражданина Российской Федерации";
	ИначеЕсли Код = "15" Тогда
		Возврат "Разрешение на временное проживание в Российской Федерации";
	ИначеЕсли Код = "18" Тогда
		Возврат "Свидетельство о предоставлении временного убежища на территории Российской Федерации";
	ИначеЕсли Код = "21" Тогда
		Возврат "Паспорт гражданина Российской Федерации";
	ИначеЕсли Код = "22" Тогда
		Возврат "Загранпаспорт гражданина Российской Федерации";
	ИначеЕсли Код = "23" Тогда
		Возврат "Свидетельство о рождении, выданное уполномоченным органом иностранного государства";
	ИначеЕсли Код = "24" Тогда
		Возврат "Удостоверение личности военнослужащего Российской Федерации";
	ИначеЕсли Код = "26" Тогда
		Возврат "Паспорт моряка";
	ИначеЕсли Код = "27" Тогда
		Возврат "Военный билет офицера запаса";
	ИначеЕсли Код = "60" Тогда
		Возврат "Документы, подтверждающие факт регистрации по месту жительства";
	ИначеЕсли Код = "61" Тогда
		Возврат "Свидетельство о регистрации по месту жительства";
	ИначеЕсли Код = "62" Тогда
		Возврат "Вид на жительство иностранного гражданина";
	ИначеЕсли Код = "81" Тогда
		Возврат "Свидетельство о смерти";
	ИначеЕсли Код = "91" Тогда
		Возврат "Иные документы";
	Иначе
		Возврат "";
	КонецЕсли;
	 
	
КонецФункции

Функция ДатаПереходаНаЕдиныйНалоговыйПлатеж() Экспорт
	
	Возврат '20230101';
	
КонецФункции


#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

#Область ПлатежиВБюджетКлиентСервер

// Незаполненное значение ("0")
//
Функция НезаполненноеЗначение() Экспорт
	
	// При невозможности указать конкретное значение, указывается ноль "0".
	// Наличие незаполненных реквизитов не допускается.
	
	Возврат "0";
	
КонецФункции

// Возвращает список вариантов налоговых периодов
//
// Возвращаемое значение:
//  СписокЗначений – в котором создаются элементы с вариантами налоговых периодов
//
Функция ВидыНалоговыхПериодов() Экспорт
	
	// Первые два знака налогового периода предназначены для определения периодичности уплаты
	
	Периоды = Новый СписокЗначений;
	Периоды.Добавить(ПериодичностьМесяц(),     "МС - месячный платеж");
	Периоды.Добавить(ПериодичностьКвартал(),   "КВ - квартальный платеж");
	Периоды.Добавить(ПериодичностьПолугодие(), "ПЛ - полугодовой платеж");
	Периоды.Добавить(ПериодичностьГод(),       "ГД - годовой платеж"); 
	Периоды.Добавить(ПлатежПоКонкретнойДате(), "Платеж по конкретной дате");
	Периоды.Добавить(НезаполненноеЗначение(),  "0 - значение не указывается");
	
	Возврат Периоды;
	
КонецФункции

Функция ПериодичностьГод() Экспорт
	
	Возврат "ГД";
	
КонецФункции

Функция ПериодичностьПолугодие() Экспорт
	
	Возврат "ПЛ";
	
КонецФункции

Функция ПериодичностьКвартал() Экспорт
	
	Возврат "КВ";
	
КонецФункции

Функция ПериодичностьМесяц() Экспорт
	
	Возврат "МС";
	
КонецФункции

Функция ПлатежПоКонкретнойДате() Экспорт
	
	Возврат "-"; // Важно, чтобы отличалось от незаполненного значения
	
КонецФункции

Функция МаксимальноеЗначениеПоПериодичности(Периодичность)
	
	Результат = Неопределено;
	Если Периодичность = ПериодичностьМесяц() Тогда
		Результат = 12;
	ИначеЕсли Периодичность = ПериодичностьКвартал() Тогда
		Результат = 4;
	ИначеЕсли Периодичность = ПериодичностьПолугодие() Тогда
		Результат = 2;
	ИначеЕсли Периодичность = ПериодичностьГод() Тогда
		Результат = 1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаНачалаНалоговогоПериода(Периодичность, Год, НомерПериода)
	
	Если Год = 0 Тогда
		Возврат Дата(1, 1, 1);
	ИначеЕсли НомерПериода = 0 Тогда
		Возврат Дата(Год, 1, 1);
	ИначеЕсли Периодичность = ПериодичностьМесяц() Тогда
		Возврат Дата(Год, НомерПериода, 1);
	ИначеЕсли Периодичность = ПериодичностьКвартал() Тогда
		Возврат Дата(Год, НомерПериода * 3 - 2, 1);
	ИначеЕсли Периодичность = ПериодичностьПолугодие() Тогда
		Возврат Дата(Год, НомерПериода * 6 - 5, 1);
	Иначе
		Возврат Дата(Год, 1, 1);
	КонецЕсли;
	
КонецФункции


Функция РазобратьНалоговыйПериод(Знач НалоговыйПериод) Экспорт
	
	ОписаниеПериода = Новый Структура;
	ОписаниеПериода.Вставить("Периодичность", НезаполненноеЗначение());
	ОписаниеПериода.Вставить("Год",           0);
	ОписаниеПериода.Вставить("НомерПериода",  0);
	ОписаниеПериода.Вставить("Дата",          '0001-01-01');
	
	// Реквизит 107 заполняется налоговым периодом, который имеет 10 знаков, 
	// восемь из которых имеют смысловое значение, а два являются разделительными знаками и заполняются точками (".")
	
	Если СтрДлина(НалоговыйПериод) <> 10 Тогда
		Возврат ОписаниеПериода;
	КонецЕсли;
	
	ЧастиПериода = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НалоговыйПериод, ".", Ложь);
	Если ЧастиПериода.Количество() <> 3 Тогда
		Возврат ОписаниеПериода;
	КонецЕсли;
	
	// Предусмотрены два варианта:
	// 1. Первые два знака налогового периода предназначены для определения периодичности уплаты
	// 2. Форматом "день.месяц.год" указывается конкретная дата (например: "05.09.2003")
	
	Если СтрДлина(ЧастиПериода[0]) <> 2 Тогда
		Возврат ОписаниеПериода;
	КонецЕсли;
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиПериода[1])
		ИЛИ НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастиПериода[2]) Тогда
		Возврат ОписаниеПериода;
	КонецЕсли;
	
	Периодичность = ЧастиПериода[0];
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Периодичность) Тогда
		Периодичность = ПлатежПоКонкретнойДате();
	ИначеЕсли ВидыНалоговыхПериодов().НайтиПоЗначению(Периодичность) = Неопределено Тогда
		Возврат ОписаниеПериода;
	КонецЕсли;
	
	Если Периодичность = ПлатежПоКонкретнойДате() Тогда
		Попытка
			Значение = Дата(ЧастиПериода[2], ЧастиПериода[1], ЧастиПериода[0]);
		Исключение
			Значение = Неопределено;
		КонецПопытки;
		Если Значение = Неопределено Тогда
			Возврат ОписаниеПериода;
		Иначе
			ОписаниеПериода.Дата = Значение;
			ОписаниеПериода.Год  = Год(Значение);
		КонецЕсли;
	Иначе
		Попытка
			НомерПериода = Число(ЧастиПериода[1]);
			Год          = Число(ЧастиПериода[2]);
		Исключение
			НомерПериода = 0;
			Год          = 0;
		КонецПопытки;
		Если Год = 0 Тогда
			Возврат ОписаниеПериода;
		Иначе
			МаксимальноеЗначениеПоПериодичности = МаксимальноеЗначениеПоПериодичности(Периодичность);
			Если МаксимальноеЗначениеПоПериодичности = Неопределено ИЛИ НомерПериода > МаксимальноеЗначениеПоПериодичности Тогда
				Возврат ОписаниеПериода;
			КонецЕсли;
			
			ОписаниеПериода.НомерПериода = НомерПериода;
			ОписаниеПериода.Год          = Год;
			ОписаниеПериода.Дата         = ДатаНачалаНалоговогоПериода(Периодичность, Год, НомерПериода);
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеПериода.Периодичность = Периодичность;
	Возврат ОписаниеПериода;
	
КонецФункции


#КонецОбласти 


#Область БухгалтерскиеОтчетыКлиентСервер

// Возвращает строку с представлением периода.
//
// Параметры:
//	НачалоПериода - Дата - Начало периода.
//	КонецПериода - Дата - Конец периода.
//	ТолькоДаты - Булево - Если Ложь, то возвращаемая строка включает предлог "за".
//
// Возвращаемое значение:
//  Строка - Текст представления периода.
//
Функция ПолучитьПредставлениеПериода(НачалоПериода = '00010101', КонецПериода = '00010101', ТолькоДаты  = Ложь) Экспорт
	
	ТекстПериод = "";
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = ?(ТолькоДаты, "", " " + НСтр("ru = 'за'")+ " ") 
				+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина");
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) Тогда
		ТекстПериод = ?(ТолькоДаты, "", " " + НСтр("ru = 'за'")+ " ") 
			+ ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП = Истина");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, СтрНайти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Возврат ТекстПериод;
	
КонецФункции


#КонецОбласти 

#Область ЗадачиБухгалтераКлиентСервер

Функция Идентификатор(Имя) Экспорт
	
	Цифры = "1234567890";
	НомерСтрокой = "";
	ДлинаИмени = СтрДлина(Имя);
	Для Индекс = 0 По ДлинаИмени - 1 Цикл
		Позиция = ДлинаИмени - Индекс;
		Символ = Сред(Имя,Позиция,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		НомерСтрокой = Символ + НомерСтрокой;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(НомерСтрокой) - 1;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
	
#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти