#Область ПрограммныйИнтерфейс

#Область ЗаполнениеПоИНН

Функция ДанныеЗаполненияПоИНН(Знач ИНН) Экспорт
	
	// Заполнение по ИНН в помощнике 3-НДФЛ доступно только для юридических лиц
	ЭтоЮрЛицо = Истина;
	
	ДанныеЗаполнения = Новый Структура("ОписаниеОшибки", "");
	
	ИНН = СокрП(ИНН);
	
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИНН, ЭтоЮрЛицо);
	
	Если РезультатПроверки.СоответствуетТребованиям Тогда
		// ДЕНЬГИ
		ДанныеЗаполнения.Вставить("Наименование", "");
		ДанныеЗаполнения.Вставить("ИНН",   ИНН);
		ДанныеЗаполнения.Вставить("КПП",   "");
		ДанныеЗаполнения.Вставить("ОКТМО", "");
		Возврат ДанныеЗаполнения;
		// Конец ДЕНЬГИ
	Иначе
		ДанныеЗаполнения.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецОбласти