
&НаКлиенте
Процедура УчетТоваров_ЗагрузитьЧекиИзНалоговойПосле(Команда)
	
    ЗагрузитьЧекиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЧекиНаСервере()
	
	//Можно ввести признак "Обработан", для тех чеков, у которых не заполнен qr, и которые уже обрабатывались ранее
	//чтобы не делать повторную проверку
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расход.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Расход КАК Расход
	|ГДЕ
	|	Расход.ПометкаУдаления
	|	И Расход.Проведен
	|	И НЕ Расход.УчетТоваров_ЗагруженИзНалоговой";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Сначала перенесем QR коды из комментариев, если таковые имеются
		Если НЕ ЗначениеЗаполнено(Выборка.QRКод) Тогда
						
		КонецЕсли;
		
		//Затем загрузим чеки
		
	КонецЦикла;	
		
КонецПроцедуры