////////////////////////////////////////////////////////////////////////////////
// ПлановыеОперацииВызовСервера: процедуры и функции для управления шаблонами, расписаниями, 
//	плановыми операциями и плановыми движениями
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ОбновитьФормуОперацииПоШаблону(Форма, ШаблонОперации) Экспорт

	РаботаСФормамиДокументов.ОбновитьФормуОперацииПоШаблону(Форма, ШаблонОперации);

КонецПроцедуры

Процедура ПередЗаписьюОперацииСКлиента(Объект, ПараметрыРасписания, АдресПроизвольныхДатРасписания, СохранитьРасписание, ЭтоШаблон, ЗаписьОперацииШаблона, ЗаписьПлановойОперации, ПараметрыГрафика = Неопределено, ИзменилсяПределПланирования = Ложь) Экспорт

	ПлановыеОперации.ПередЗаписьюОперации(Объект, ПараметрыРасписания, АдресПроизвольныхДатРасписания, СохранитьРасписание, ЭтоШаблон, ЗаписьОперацииШаблона, ЗаписьПлановойОперации, ПараметрыГрафика, ИзменилсяПределПланирования);

КонецПроцедуры

Процедура ПересчитатьПланыПриИзмененииПределаПланирования() Экспорт
	ПлановыеОперации.ПересчитатьПланыПриИзмененииПределаПланирования();
КонецПроцедуры

Процедура ЗарегистрироватьПлановыеОперацииВОбмене() Экспорт
	ПлановыеОперации.ЗарегистрироватьПлановыеОперацииВОбмене();
КонецПроцедуры

#КонецОбласти







	