
&НаКлиенте 
Перем НастройкиЗапуска, Действие, ПустойСценарийОбработан;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОшибкаОбновленияДанных.Видимость = Ложь;
	Элементы.ГруппаСостояниеБазыВОблаке.Видимость = Ложь;
	
	ПроверитьРежимИПараметрыПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФормаЗамены         = "";
	ОповещениеОЗакрытии = Неопределено;
	ПроверитьДоступностьЭтойФормы(Отказ, ФормаЗамены, ОповещениеОЗакрытии);
	
	Если Не Отказ Тогда
		ЭтапОбновления = "Начало";
		ОбновитьСпособСледующейСинхронизации();
		ОбновитьИнформациюНаКлиенте();
		Если Не ЗначениеЗаполнено(СценарийСинхронизации) Тогда
			ПоказатьПредупреждение(, НСтр("ru='Пожалуйста, укажите сценарий синхронизации!'"));
			ТекущийЭлемент = Элементы.СценарийСинхронизации;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент();
	
	Если ЗначениеЗаполнено(ФормаЗамены) Тогда
		ОткрытьФорму(ФормаЗамены, , , , , , ОповещениеОЗакрытии);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СинхронизацияВыключена" Тогда
		
		Если Открыта() Тогда
			ПустойСценарийОбработан = Истина;
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ВыполненОбменДанными" Тогда
		
		ЭтапОбновления = "РезультатыСинхронизации";
		ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
		ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.СостояниеОбмена", Неопределено);
		ОбновитьИнформациюНаКлиенте();
		
	ИначеЕсли ИмяСобытия = "ПодключениеКОблакуИзменено" Тогда 
		
		ПроверитьРежимИПараметрыПодключения();
		
		Если Параметр = Истина Тогда
			
			ЭтапОбновления = "Начало";
			ОбновитьИнформациюНаКлиенте();
			
		Иначе
			
			// разорвано соединение с облаком
			ПредставлениеУчетнойЗаписи = ?(ПараметрыПодключения = Неопределено, НСтр("ru='нет данных'"), ПараметрыПодключения.Логин); 
			ПредставлениеЛицензий = НСтр("ru='нет данных'");
			ПредставлениеПодключенныхБаз = НСтр("ru='нет данных'");
			РезультатПоследнейСинхронизации = НСтр("ru='нет данных'");
			ПредставлениеОшибкиСинхронизации = "";
			Элементы.ОстановитьСинхронизацию.Доступность = Ложь;
			Элементы.ПродолжитьСинхронизацию.Доступность = Ложь;
			
		КонецЕсли;
		
	// ПроцессыОбмена
	ИначеЕсли ИмяСобытия = ПроцессыОбменаКлиент.КлючОповещенияОбИзмененииСостоянияОбмена() Тогда
	// Конец ПроцессыОбмена
		ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент();
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СценарийСинхронизации) И ПустойСценарийОбработан <> Истина Тогда
		
		Отказ = Истина;
		#Область ПоказатьВопрос
		ТекстВопроса = НСтр("ru='Синхронизация не будет выполняться, пока не указан сценарий.
			|Закрыть эту форму без указания сценария?'");
		
		ДополнительныеПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеЗакрытияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Закрыть'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Не закрывать'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, );
		#КонецОбласти
		 
	КонецЕсли;
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособСинхронизацииПриИзменении(Элемент)
	ЗаписатьРежимСинхронизации();
КонецПроцедуры

&НаКлиенте
Процедура СценарийСинхронизацииПриИзменении(Элемент)
	ЗаписатьСценарийСинхронизации();
	ОбновитьПодсказкуСценария(Элементы.СценарийСинхронизации, СценарийСинхронизации, Режим);
КонецПроцедуры


&НаКлиенте
Процедура ИконкаСостоянияСинхронизацииНажатие(Элемент)
	ПоказатьОписаниеСостоянияОбмена("");	
КонецПроцедуры


&НаКлиенте
Процедура НадписьСостоянияОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "http://transport" Тогда
		// описание для транспорта обмена
		ПоказатьОписаниеСостоянияОбмена("Транспорт");	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "http://receiving" Тогда
		// описание для процесса Прием
		ПоказатьОписаниеСостоянияОбмена("Прием");	
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "http://sending" Тогда
		// описание для процесса Передача
		ПоказатьОписаниеСостоянияОбмена("Передача");	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПодключенныеБазы

&НаКлиенте
Процедура ПодключенныеБазыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПодключенныеБазыСостояние" Тогда
		СтандартнаяОбработка = Ложь;
		
		ПоказатьДиалогИзмененияСостояния(ВыбраннаяСтрока)
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_АктивныеПодписки


&НаКлиенте
Процедура АктивныеПодпискиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "АктивныеПодпискиПродлить" Тогда
		СтандартнаяОбработка = Ложь;
		СтрокаПодписки = АктивныеПодписки.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Не СтрокаПодписки.ЭтоСлужебныйТариф Тогда
			ОткрытьОплатуПодписки(СтрокаПодписки.КоличествоЛицензий, КонецДня(СтрокаПодписки.ОкончаниеДействия) + 1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИдентификаторыОбмена(Команда)
	Текст = ТекстОтладочнойИнформации();
	Текст.Показать(НСтр("ru='Отладочная информация для тех.поддержки'"));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформацию(Команда)
	
	ЭтапОбновления = "Начало";
	ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.СостояниеОбмена", Неопределено);
	ОбновитьИнформациюНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчетнойЗаписи(Команда)
	
	ОткрытьФормуПодключенияКОблаку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВПоддержку(Команда)
	ОтправитьСообщениеВПоддержку();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЛицензии(Команда)
	
	ОчиститьСообщения();
	Если РежимПокупки = Неопределено Тогда
		ОткрытьОплатуПодписки(1, ТекущаяДатаКлиентСервер(), Неопределено);
	Иначе
		ОткрытьОплатуПодписки(РежимПокупки.Количество, РежимПокупки.Начало, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьПодписку(Команда)
	
	ОчиститьСообщения();
	Если РежимПокупки = Неопределено Тогда
		ОткрытьОплатуПодписки(1, ТекущаяДатаКлиентСервер(), Неопределено);
	Иначе
		ОткрытьОплатуПодписки(РежимПокупки.Количество, РежимПокупки.Начало, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСейчас(Команда)
	
	Если ПредупредитьЕслиВыполняетсяСинхронизация() Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьСинхронизациюИнтерактивноКлиент(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСинхронизацию(Команда)
	ВыполнитьСинхронизациюИнтерактивноКлиент(Ложь, Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ОстановитьСинхронизацию(Команда)
	
	Если СинхронизацияВыполняетсяВДанныйМомент() Тогда
		#Область ПоказатьВопрос
		ТекстВопроса = НСтр("ru='Остановить синхронизацию?'");
		
		ДополнительныеПараметры = Новый Структура;
		Оповещение = Новый ОписаниеОповещения("ОстановитьСинхронизациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
		#КонецОбласти
	Иначе
		ОстановитьСинхронизациюКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеКОтправке(Команда)
	
	ТекстПредупреждения = НСтр("ru='В данный момент выполняется синхронизация.
		|Для выполнения команды остановите синхронизацию или дождитесь ее завершения'");
	Если ПредупредитьЕслиВыполняетсяСинхронизация(ТекстПредупреждения) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьВсеДляОтправкиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсеКЗагрузке(Команда)
	
	ТекстПредупреждения = НСтр("ru='В данный момент выполняется синхронизация.
		|Для выполнения команды остановите синхронизацию или дождитесь ее завершения'");
	Если ПредупредитьЕслиВыполняетсяСинхронизация(ТекстПредупреждения) Тогда
		Возврат;
	КонецЕсли;
	
	ОтметитьДляЗагрузкиВсеЗаписиОблакаСервер()
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	ВыгрузитьВФайлКлент();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	ЗагрузитьИзФайлаКлент();
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьСинхронизацию(Команда)
	
	#Область ПоказатьВопрос
	ТекстВопроса = НСтр("ru='Выключить синхронизацию на этом компьютере?
		|Обратите внимание:
		| - выключение не освобождает лицензию в сервисе автосинхронизации
		| - при повторном включении возможна рассинхронизация данных'");
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ВыключитьСинхронизациюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Выключить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура Исправить(Команда)
	ПоказатьМенюИсправлений();
КонецПроцедуры

&НаКлиенте
Процедура СобытияПолучения(Команда)
	ОткрытьЖурналСобытийСинхронизации("ЗагрузкаДанных");
КонецПроцедуры

&НаКлиенте
Процедура СобытияОтправки(Команда)
	ОткрытьЖурналСобытийСинхронизации("ВыгрузкаДанных");
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьИтоги(Команда)
	ПараметрыФормы = Новый Структура("Ключ", ЦентральнаяБаза);
	ОткрытьФорму("ПланОбмена.СинхронизацияАвтономныхКопий.Форма.ПросмотрУзла", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьДоступностьЭтойФормы(Отказ, ФормаЗамены, ОповещениеОЗакрытии)
	
	ОповещениеОЗакрытии = Неопределено;
	
	Если Режим = "Независимый" Тогда 
		Отказ = Истина;
		ФормаЗамены = "ОбщаяФорма.ВыборСпособаСинхронизации";
		
	ИначеЕсли Режим = "ЦентрМобильных" Тогда 
		
		Отказ = Истина;
		ВызватьИсключение НСтр("ru='Эта форма не предназначена для использования в режме обмена данными с мобильными приложениями'");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФормаЗамены) И (Не ПараметрыПодключенияЗаполнены Или Не БазаПодключенаКОблаку) Тогда
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("НастройкиУчетнойЗаписиЗавершение", ЭтотОбъект);
		ФормаЗамены = "ОбщаяФорма.ПодключениеКСервисуАвтоСинхронизации";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюНаКлиенте()
	
	Элементы.ОстановитьСинхронизацию.Доступность = Ложь;
	Элементы.ПродолжитьСинхронизацию.Доступность = Ложь;

	Если Не ПараметрыПодключенияЗаполнены Или Не БазаПодключенаКОблаку Тогда
		
		ТекстНетДанных = НСтр("ru='нет данных'");
		ПредставлениеУчетнойЗаписи = ТекстНетДанных; 
		ПредставлениеПодключенныхБаз = ТекстНетДанных; 
		ПредставлениеЛицензий = ТекстНетДанных; 
		РезультатПоследнейСинхронизации = ТекстНетДанных;
		ПредставлениеОшибкиСинхронизации = "";
		
		Элементы.ГруппаПараметровСинхронизации.Доступность = Ложь;
		Элементы.СинхронизироватьЗаново.Доступность        = Ложь;
		Элементы.ГруппаКонмадАбонента.Доступность          = Ложь;
		Возврат;
		
	Иначе
		
		Элементы.ГруппаПараметровСинхронизации.Доступность = Истина;
		Элементы.СинхронизироватьЗаново.Доступность        = Истина;
		Элементы.ГруппаКонмадАбонента.Доступность          = Истина;
		
	КонецЕсли;
	
	Если ЭтапОбновления = "Начало" Тогда
		НачатьОбновлениеНаКлиенте();
		ЭтапОбновления = "РезультатыСинхронизации";
		
	ИначеЕсли ЭтапОбновления = "РезультатыСинхронизации" Тогда
		ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент();
		ОбновитьСпособСледующейСинхронизации();
		ЭтапОбновления = "СостояниеПодписок";
		
	ИначеЕсли ЭтапОбновления = "СостояниеПодписок" Тогда
		ОбновитьСостояниеПодписок();
		ЭтапОбновления = "";
		
	Иначе
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтапОбновления) Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнформациюНаКлиенте", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НачатьОбновлениеНаКлиенте()
	
	ОтключитьОбработчикОжидания("ОбработчикПроверкиОбмена");
	
	Элементы.ГруппаОшибкаОбновленияДанных.Видимость = Ложь;
	ТекстОшибки = "";
	ТекстСостоянияБазыВОблаке = "";
	Элементы.ГруппаСостояниеБазыВОблаке.Видимость = Ложь;
	Элементы.ПредставлениеОшибки.Заголовок = "При обновлении информации возникли ошибки";
	
	Если ПараметрыПодключения = Неопределено Тогда
		ПредставлениеУчетнойЗаписи = НСтр("ru='нет данных'");
	Иначе
		ПредставлениеУчетнойЗаписи = ПараметрыПодключения.Логин;
	КонецЕсли;
	
	ТекстОбновляется = НСтр("ru='обновление…'");
	ПредставлениеЛицензий               = ТекстОбновляется;
	ПредставлениеПодключенныхБаз        = ТекстОбновляется;
	РезультатПоследнейСинхронизации     = ТекстОбновляется;
	ПредставлениеОшибкиСинхронизации    = "";
	Элементы.ОстановитьСинхронизацию.Доступность = Ложь;
	Элементы.ПродолжитьСинхронизацию.Доступность = Ложь;
	
	ОбновитьЭлементыПоСостояниюОбновления(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭлементыПоСостояниюОбновления(Форма, ИдетОбновление)
	
	Форма.Элементы.ДекорацияИндикатор.Картинка = ?(ИдетОбновление, 
				БиблиотекаКартинок.ДлительнаяОперация48,
				БиблиотекаКартинок.ОблакоFRESH48);
	
	Форма.Элементы.ОбновитьИнформацию.Доступность      = Не ИдетОбновление;
	Форма.Элементы.НастройкиУчетнойЗаписи.Доступность  = Не ИдетОбновление;
	Форма.Элементы.ГруппаСписокПодписок.Доступность    = Не ИдетОбновление;
	Форма.Элементы.ГруппаСписокПрограмм.Доступность    = Не ИдетОбновление;
	Форма.Элементы.ГруппаКонмадАбонента.Доступность    = Не ИдетОбновление;
	Форма.Элементы.ГруппаПараметровСинхронизации.Доступность = Не ИдетОбновление;
	
	Форма.Элементы.СинхронизироватьЗаново.Доступность = Не ИдетОбновление;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПроверкиОбмена()
	
	ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент();
	
КонецПроцедуры

&НаКлиенте
Функция СинхронизацияВыполняетсяВДанныйМомент()
	
	ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент();
	Возврат СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Выполняется";
	
КонецФункции

&НаКлиенте
Функция ПредупредитьЕслиВыполняетсяСинхронизация(ТекстСообщения = "")
	
	Если Не СинхронизацияВыполняетсяВДанныйМомент() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТекстСообщения = "" Тогда
		ТекстСообщения = НСтр("ru='В данный момент синхронизация уже выполняется.
		|Повторите попытку позже'");
	КонецЕсли;
	
	ПоказатьПредупреждение( , ТекстСообщения );
	Возврат Истина;
	
КонецФункции 

&НаКлиенте
Процедура ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент()
	
	СвойствоФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	СостояниеИзПараметров = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.СостояниеОбмена", Неопределено);
	Если СвойствоФЗ = Неопределено Или СостояниеИзПараметров = Неопределено Тогда
		ПроцессыОбменаКлиент.ОбновитьКлиентскиеПараметрыПриложения();
		СвойствоФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
		СостояниеИзПараметров = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.СостояниеОбмена", Неопределено);
	КонецЕсли;
	
	ПоследняяСинхронизация = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ДатаПоследнейУспешнойСинхронизацииСтрокой", 
										Неопределено);
	Если ЗначениеЗаполнено(ПоследняяСинхронизация) Тогда
		РезультатПоследнейСинхронизации = ПоследняяСинхронизация;
	КонецЕсли;
	
	Если СостояниеИзПараметров = Неопределено Тогда
		ОбновитьСостояниеСинхронизацииСервер();
	Иначе
		СостояниеОбмена = СостояниеИзПараметров;
		ОбновитьЗаголовкиСостоянияСинхронизации(ЭтотОбъект);
		
		Если СостояниеОбмена <> Неопределено 
			И Не СостояниеОбмена.ПроцессАктивен
			И СценарийСинхронизации <> ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных") Тогда
			ОбновитьСпособСледующейСинхронизации();
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеСинхронизацииСервер()
	
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	ДатаСинхронизации = СинхронизацияАвтономныхКопий.ДатаПоследнейУспешнойСинхронизации(СостояниеОбмена.УзелКорреспондента);
	Если ЗначениеЗаполнено(ДатаСинхронизации) Тогда
		РезультатПоследнейСинхронизации = Формат(ДатаСинхронизации, "Л=ru_RU; ДФ='dd.MM.yyyy HH.mm.ss'");
	Иначе
		РезультатПоследнейСинхронизации = НСтр("ru='нет данных'") 
	КонецЕсли;
	
	ОбновитьЗаголовкиСостоянияСинхронизации(ЭтотОбъект);
	
	Если СостояниеОбмена <> Неопределено 
		И Не СостояниеОбмена.ПроцессАктивен
		И СценарийСинхронизации <> ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных") Тогда
		ОбновитьСпособСледующейСинхронизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗаголовкиСостоянияСинхронизации(Форма)
	
	СвойствоФЗ             = Форма.СвойствоФЗ;
	КартинкаСостояния      = БиблиотекаКартинок.СинхронизацияНетОбмена48;
	СостояниеТранспорта    = "…";
	СостояниеОбмена        = Форма.СостояниеОбмена;
	ЕстьОписаниеПроцессов  = СостояниеОбмена <> Неопределено И СостояниеОбмена.Свойство("СтруктураПредставления");
	СостояниеПередача      = НСтр("ru='Передача: …'");
	СостояниеПрием         = НСтр("ru='Прием: …'");
	
	Если СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Выполняется" Тогда
		КартинкаСостояния = БиблиотекаКартинок.СинхронизацияИдетОбмен48;
		СостояниеТранспорта    = НСтр("ru='синхронизация...'");
		
	ИначеЕсли СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Ошибка" Тогда
		КартинкаСостояния = БиблиотекаКартинок.СинхронизацияОшибка48;
		СостояниеТранспорта    = НСтр("ru='что-то пошло не так...'");
		
	ИначеЕсли СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Отменено" Тогда
		СостояниеТранспорта    = НСтр("ru='отменено'");
		
	ИначеЕсли ЕстьОписаниеПроцессов Тогда 
		
		Если ЗначениеЗаполнено(СостояниеОбмена.СтруктураПредставления.КартинкаСостояния48) Тогда
			КартинкаСостояния = БиблиотекаКартинок[СостояниеОбмена.СтруктураПредставления.КартинкаСостояния48];
		КонецЕсли;
		СостояниеТранспорта = СостояниеОбмена.СтруктураПредставления.СостояниеТранспорта;
		
	КонецЕсли;
	
	Если ЕстьОписаниеПроцессов Тогда
		СостояниеПередача = СостояниеОбмена.СтруктураПредставления.СостояниеПередача;
		СостояниеПрием    = СостояниеОбмена.СтруктураПредставления.СостояниеПрием;
	КонецЕсли;
	
	
	СтрокиСостояния = Новый Массив;
	СтрокиСостояния.Добавить(СостояниеТранспорта);
	СтрокиСостояния.Добавить(Символы.ПС);
	СтрокиСостояния.Добавить(СостояниеПередача);
	СтрокиСостояния.Добавить(Символы.ПС);
	СтрокиСостояния.Добавить(СостояниеПрием);
	
	Форма.Элементы.ИконкаСостоянияСинхронизации.Картинка     = КартинкаСостояния;
	Форма.Элементы.НадписьСостоянияОбмена.Заголовок          = Новый ФорматированнаяСтрока(СтрокиСостояния);
	
	Выполняется   = СвойствоФЗ <> Неопределено И СвойствоФЗ.Статус = "Выполняется";
	ПроцессАктивен = СостояниеОбмена <> Неопределено И СостояниеОбмена.ПроцессАктивен;
	Форма.Элементы.ОстановитьСинхронизацию.Доступность   = ПроцессАктивен;
	Форма.Элементы.ПродолжитьСинхронизацию.Доступность   = Не Выполняется И ПроцессАктивен;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпособСледующейСинхронизации()
	
	Если ЗначениеЗаполнено(ЦентральнаяБаза) Тогда
		СценарийСинхронизации  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦентральнаяБаза, "ЗатребованныйСценарий");
	КонецЕсли;
	ОбновитьПодсказкуСценария(Элементы.СценарийСинхронизации, СценарийСинхронизации, Режим);
	
	РегЗадание = АвтоматСинхронизацииССервисом.РегламентноеЗаданиеОбмена();
	Если РегЗадание = Неопределено Тогда
		Элементы.СпособСинхронизации.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.СпособСинхронизации.Доступность = Истина;
	КонецЕсли;
	
	СпособСинхронизации = ?(РегЗадание.Использование, 0, 1);
	
КонецПроцедуры
 

&НаКлиенте
Процедура ОбновитьСостояниеПодписок()
	
	Действие    = "Обновление состояния подписок";
	ТекстОшибки = "";
	НастройкиЗапуска = ДеньгиКлиент.НовыйНастройкиЗапускаФоновогоЗадания("Получение информации о подписках");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПолучитьСвойстваЭтойБазыИзОблакаВФоне");
	НастройкиЗапуска.ПоследовательностьПроцедур.Добавить("ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне");
	
	НастройкиЗапуска.ОбработчикОжидания        = Неопределено;
	НастройкиЗапуска.ОбработчикОшибки          = Новый ОписаниеОповещения("ОбработчикОшибкиФоновогоЗадания", ЭтотОбъект);
	НастройкиЗапуска.ОбработчикЗавершения      = Новый ОписаниеОповещения("ОбработчикЗавершенияФоновогоЗадания", ЭтотОбъект);
	
	ДеньгиКлиент.ВыполнитьЭтапФоновогоЗадания(ЭтотОбъект, НастройкиЗапуска, РезультатЗапускаФоновогоЗадания);
	НастройкиЗапуска = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОшибкиФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт

	Если Результат.ФоновоеЗадание <> Неопределено И Результат.ФоновоеЗадание.Статус = "Ошибка" Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "КраткоеПредставлениеОшибки") Тогда
			Обращение = Результат.ФоновоеЗадание.КраткоеПредставлениеОшибки;
			Ошибка = Результат.ФоновоеЗадание.ПодробноеПредставлениеОшибки;
		Иначе
			Обращение = НСтр("ru='При обновлении информации произошла какая-то ошибка'");
			Ошибка = НСтр("ru='Ошибка выполнения фонового задания. Подробности см. в журнале регистрации'");
		КонецЕсли;
		
	Иначе
		Обращение = НСтр("ru='Запрос к облаку был отменен пользователем.
				|Пожалуйста, еще раз запустите обновление и дождитесь его окончания'");
		Ошибка = "";
		
	КонецЕсли;
	
	ПоказатьОшибкуНаФорме(Обращение, Ошибка);
	ОбновитьЭлементыПоСостояниюОбновления(ЭтотОбъект, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуНаФорме(СообщениеПользователю, Ошибка)
	
	Элементы.ПредставлениеОшибки.Заголовок = ?(ЗначениеЗаполнено(СообщениеПользователю), СообщениеПользователю, 
				НСтр("ru='Не удалось обновить информацию.
						|Пожалуйста, поробуйте выполнить эту операцию позже'"));
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = ?(ЗначениеЗаполнено(Ошибка), Ошибка, "");
	КонецЕсли;
	
	Элементы.ГруппаОшибкаОбновленияДанных.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияФоновогоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПолучитьСвойстваЭтойБазыИзОблакаВФоне" Тогда
		
		ОбновитьСвойстваБазыПолученныеИзОблака(Результат, ДополнительныеПараметры);
		
	ИначеЕсли Результат.ВыполненныйЭтап = "ДеньгиВОблаке.ПолучитьТарифыИОстаткиПодписокВФоне" Тогда
		
		ВывестиРезультатСостоянияПодписок(Результат, ДополнительныеПараметры);
		ОбновитьЭлементыПоСостояниюОбновления(ЭтотОбъект, Ложь);
		//ПодключитьОбработчикОжидания("ОбработчикПроверкиОбмена", 10, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСвойстваБазыПолученныеИзОблака(Результат, ДополнительныеПараметры)
	
	СвйстваБазыВОблаке = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	
	ВидимостьСтроки     = Ложь;
	ТекстСостоянияБазыВОблаке = "";
	
	Если СвйстваБазыВОблаке = Неопределено Тогда
		ТекстСостоянияБазыВОблаке = НСтр("ru='не удалось получить состояние подписок. Проверьте настройки'");
			
	ИначеЕсли Не СвйстваБазыВОблаке.Существует Тогда
		ВидимостьСтроки = Истина;
		ТекстСостоянияБазыВОблаке = НСтр("ru='эта база не найдена в списке подключенных баз'");
		
	ИначеЕсли СвйстваБазыВОблаке.ИБУстаревшая Тогда
		ВидимостьСтроки = Истина;
		ТекстСостоянияБазыВОблаке = НСтр("ru='эта база помечена как устаревшая'");
		
	ИначеЕсли СвйстваБазыВОблаке.ИБЗапрещена Тогда
		
		ТекстСостоянияБазыВОблаке = НСтр("ru='в сервисе установлен запрет на эту базу. 
				|база очищена от всех записей!'");
		ОчиситьДанныеСервер();
		Результат.НастройкиЗапуска.ПоследовательностьПроцедур.Очистить();
		
	КонецЕсли;
	
	Элементы.ГруппаСостояниеБазыВОблаке.Видимость = ВидимостьСтроки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиситьДанныеСервер()
	
		Результат =  ОбщегоНазначенияДеньги.ОчиститьДанныеПодсистемыДеньги(Ложь, "");
		Если Результат Тогда
			Константы.СостояниеПомощникаНачалаРаботы.Установить(Новый ХранилищеЗначения(Неопределено));
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРезультатСостоянияПодписок(Результат, ДополнительныеПараметры)
	
	ОтветСервера = ПолучитьИзВременногоХранилища(Результат.ФоновоеЗадание.АдресРезультата);
	Сегодня = НачалоДня(ТекущаяДатаКлиентСервер());
	
	// Активные подписки
	ДоступноЛицензий       = ОтветСервера.ЛицензийСейчас;
	ЛицензийПослеИзменений = ОтветСервера.ЛицензийПослеИзменения;
	ДатаИзменений          = ОтветСервера.БлижайшаяДатаИзменения;
	НеиспользованнаяСумма  = ОтветСервера.НеиспользованнаяСумма;
	СписокТарифов          = ОтветСервера.СписокТарифов;
	
	// Доступные лицензии
	Если ДоступноЛицензий = -111 Тогда
		ПредставлениеЛицензий = НСтр("ru='без ограничений'");
		Элементы.ДобавитьЛицензии.Видимость = Ложь;
	Иначе
		ПредставлениеЛицензий = Формат(ДоступноЛицензий, "ЧДЦ=0; ЧН=0; ЧГ=");
		Элементы.ДобавитьЛицензии.Видимость = Истина;
	КонецЕсли;
	
	АктивныеПодписки.Очистить();
	Для каждого Подписка Из ОтветСервера.АктуальныеПодписки Цикл
		
		Строка = АктивныеПодписки.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Подписка);
		Если Не ЗначениеЗаполнено(Строка.НаименованиеТарифа) Тогда
			
			Если Подписка.ЭтоСлужебныйТариф Тогда
				Строка.НаименованиеТарифа = НСтр("ru='Ознакомительный'");
			ИначеЕсли Подписка.ЭтоБезлимитныйТариф Тогда
				Строка.НаименованиеТарифа = НСтр("ru='Тариф для всей семьи'");
			ИначеЕсли Подписка.ЭтоПремиумТарифМиниденег Тогда
				Строка.НаименованиеТарифа = НСтр("ru='Премиум-тариф для покупателей Миниденег'");
			Иначе
				Строка.НаименованиеТарифа = НСтр("ru='Тариф для каждого компьютера'");
			КонецЕсли;
			 
		КонецЕсли;
		
		Строка.КоличествоЛицензий = ?(Подписка.БезлимитныхЛицензий <> 0, -111, Подписка.ШтучныхЛицензий);
		Строка.ОсталосьДней = Макс(0, Цел((Строка.ОкончаниеДействия -Сегодня) / 86400));
		Если Строка.НачалоДействия > Сегодня Тогда
			Строка.ПредставлениеСрока = СтрШаблон(НСтр("ru='с %1 по %2'"), 
						Формат(Строка.НачалоДействия, "ДФ='дд МММ'"), Формат(Строка.ОкончаниеДействия, "ДФ='дд МММ гггг'"));
		Иначе
			Строка.ПредставлениеСрока = СтрШаблон(НСтр("ru='до %1 (%2 дн.)'"), Формат(Строка.ОкончаниеДействия, "ДФ='дд МММ гггг'") , Строка.ОсталосьДней);
		КонецЕсли;
		
		Если Строка.НачалоДействия < Сегодня И Не Подписка.ЭтоСлужебныйТариф Тогда
			Строка.Продлить = НСтр("ru='Продлить'"); 
		КонецЕсли;
		
	КонецЦикла;
	Элементы.ДекорацияНетПодписок.Видимость = АктивныеПодписки.Количество() = 0;
	Элементы.АктивныеПодписки.Видимость     = Не Элементы.ДекорацияНетПодписок.Видимость;
	
	// Список баз
	ПодключеноБаз = ОтветСервера.ПодключеноБаз;
	ПредставлениеПодключенныхБаз = Формат(ПодключеноБаз, "ЧДЦ=0; ЧН=0; ЧГ=");
	
	ПодключенныеБазы.Очистить();
	Для каждого База Из ОтветСервера.ПодключенныеБазы Цикл
		
		Строка = ПодключенныеБазы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, База);
		
		Если Строка.МобильноеУстройство Тогда
			Строка.ПредставлениеПрограммы = Строка.Наименование + " (Миниденьги)"; 
		Иначе
			Строка.ПредставлениеПрограммы = Строка.Наименование + " (1С:Деньги 8)"; 
		КонецЕсли;
		
		Если Строка.ИБЗапрещена Тогда
			Строка.Состояние = НСтр("ru='Запрещена'"); 
		ИначеЕсли Строка.ИБУстаревшая Тогда
			Строка.Состояние = НСтр("ru='Отключена'"); 
		Иначе
			Строка.Состояние = НСтр("ru='Подключена'"); 
		КонецЕсли;
		
	КонецЦикла;
	ПодключенныеБазы.Сортировать("ИБЗапрещена Убыв,ИБУстаревшая Убыв,Наименование");
	
	// Текст рекомендации и кнопки покупки
	ТекстРекомендации = НСтр("ru='Услуги сервиса доступны в полном объеме'");
	ЦветНадпсии       = WebЦвета.ТемноСерый;
	ЕстьЛицензии = ДоступноЛицензий = -111 Или ДоступноЛицензий >= ПодключеноБаз;
	Если ДоступноЛицензий <> -111 И ДоступноЛицензий < ПодключеноБаз Тогда
		// Лицензий недостаточно для продолжения работы
		НужноЛицензий = ПодключеноБаз - ДоступноЛицензий;
		ЦветНадпсии        = WebЦвета.Красный;
		ТекстРекомендации = СтрШаблон(НСтр("ru='Для доступа к сервису нужно купить не менее %1'"), ДеньгиВОблакеКлиентСервер.КоличествоЛицензийСтрокой(НужноЛицензий, "Т"));
		РежимПокупки = Новый Структура("Количество,Начало", ПодключеноБаз - ДоступноЛицензий, Сегодня);
		
	ИначеЕсли ЗначениеЗаполнено(ДатаИзменений) И ЛицензийПослеИзменений <> -111 И ЛицензийПослеИзменений < ПодключеноБаз Тогда 
		// Изменения скоро наступят и в результате лицензий станет недостаточно для продолжения работы
		ДатаПродления = Формат(ДатаИзменений, "Л=ru_RU; ДФ=dd.MM.yyyy"); 
		ТекстРекомендации = СтрШаблон(НСтр("ru='Подписка действует до %1'"), ДатаПродления);
		РежимПокупки = Новый Структура("Количество,Начало", ?(ЛицензийПослеИзменений = -111, -111, ПодключеноБаз - ЛицензийПослеИзменений), 
							ДатаИзменений);
		Если ДатаИзменений < НачалоДня(ТекущаяДата() + 604800) Тогда
			ЦветНадпсии        = WebЦвета.Красный;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ТекстРекомендации.Заголовок   = ТекстРекомендации;
	Элементы.ТекстРекомендации.ЦветТекста  = ЦветНадпсии;
	
КонецПроцедуры
 
&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяДатаКлиентСервер()
	#Если Сервер Или ВнешнееСоединение Тогда
		Возврат ТекущаяДатаСеанса();
	#Иначе
		Возврат ОбщегоНазначенияКлиент.ДатаСеанса();
	#КонецЕсли 
КонецФункции 

&НаСервереБезКонтекста
Функция ПараметрыСообщения()

	Возврат ПоддержкаПользователейДеньги.НоваяСтруктураСообщения();

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуСценария(ЭлементСценария, Сценарий, Режим)
	
	Если Сценарий = ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии") Тогда
		ТекстПодсказки = ?(Режим = "Разделенный", 
					НСтр("ru='Записи в локальной копии будут удалены. Вместо них будут загружены данные из сервиса'"),
					НСтр("ru='Перед синхронизацией эта база будет очищена и заполнена данными из сервиса'"));
		ТекстПодсказки = ТекстПодсказки + Символы.ПС + НСтр("ru='Обязательно сделайте резервную копию перед синхронизацией!'"); 
	ИначеЕсли Сценарий = ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе") Тогда
		ТекстПодсказки = ?(Режим = "Разделенный", 
					НСтр("ru='Записи в этой базе и в других локальных копия будут удалены. Вместо них будут загружены данные из выделенного узла'"),
					НСтр("ru='Данные во всех синхронизируемых базах будут замещены данными этой базы'")); 
		ТекстПодсказки = ТекстПодсказки + Символы.ПС + НСтр("ru='Обязательно сделайте резервную копию перед синхронизацией!'"); 
	ИначеЕсли Сценарий = ПредопределенноеЗначение("Перечисление.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных") Тогда
		ТекстПодсказки = НСтр("ru='Локальная база синхронизирует свои изменения с другими базами'");
	Иначе
		ТекстПодсказки = НСтр("ru='Сценарий не указан, синхронизация остановлана'");
	КонецЕсли;
	
	ЭлементСценария.Подсказка = ТекстПодсказки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРежимСинхронизации()
	
	ДеньгиОбменСЦентральнойБазой.ИзменитьИспользованиеЗаданияСинхронизацииСЦентральнойБазой(СпособСинхронизации <> 1, ЦентральнаяБаза);
	ОбновитьСостояниеСинхронизацииСервер();
	ОбновитьСпособСледующейСинхронизации();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСценарийСинхронизации()
	
	// записывает изменение сценария
	СценарийОбъединения = Перечисления.СценарииСинхронизацииАвтономныхКопий.ОбъединениеДанных;
	Если СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВАвтономнойКопии Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			СценарийСинхронизации, СценарийСинхронизации, СценарийОбъединения);
			
	ИначеЕсли СценарийСинхронизации = Перечисления.СценарииСинхронизацииАвтономныхКопий.ЗаменитьВсеВЦентральнойБазе Тогда
		Изменения = Новый Структура("ЗатребованныйСценарий,СценарийЗапрашиваемыхДанных,СценарийПереданныхДанных", 
			СценарийСинхронизации, СценарийОбъединения, СценарийСинхронизации);
	Иначе
		Изменения = Новый Структура("СценарийЗапрашиваемыхДанных,ЗатребованныйСценарий,СценарийПереданныхДанных", 
			СценарийОбъединения, СценарийОбъединения, СценарийОбъединения);
	КонецЕсли;
	
	СинхронизацияАвтономныхКопий.ЗаписатьНовыеПараметрыОбменаСУзлом(ЦентральнаяБаза, Изменения);
	
	Если СценарийСинхронизации <> СценарийОбъединения И СпособСинхронизации = 0 Тогда
		
		ОстановитьСинхронизациюСервер();
		СпособСинхронизации = 1;
		ЗаписатьРежимСинхронизации();
		Сообщить(НСтр("ru='Автоматическая синхронизация отключена'"));
		
	Иначе
		ОбновитьСостояниеСинхронизацииСервер();
		ОбновитьСпособСледующейСинхронизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолныйДоступКОблаку(СвйстваБазыВОблаке)
	Возврат СвйстваБазыВОблаке <> Неопределено 
			И Не СвйстваБазыВОблаке.ИБУстаревшая И Не СвйстваБазыВОблаке.ИБЗапрещена;
КонецФункции 

&НаКлиенте
Процедура ПоказатьДиалогИзмененияСостояния(ВыбраннаяСтрока)

	СтрокаБазы = ПодключенныеБазы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазрешеноОтключать = ПолныйДоступКОблаку(СвйстваБазыВОблаке);
	
	СписокКоманд = Новый СписокЗначений;
	Если СтрокаБазы.Код = КодЭтогоУзла Тогда
		
		Если СтрокаБазы.ИБУстаревшая и ДопускаетсяПодключениеБазы() Тогда
			СписокКоманд.Добавить("Подключить", НСтр("ru='Подключить'"));
		Иначе
			ПоказатьПредупреждение(, НСтр("ru='Невозможно отключить базу, из которой выполняется управление облаком'"));
			Возврат;
		КонецЕсли;
		
	Иначе
		
		Если СтрокаБазы.ИБЗапрещена Тогда
			СписокКоманд.Добавить("Разрешить", НСтр("ru='Разрешить соединение базы с сервисом'"));
		ИначеЕсли РазрешеноОтключать Тогда
			СписокКоманд.Добавить("Запретить", НСтр("ru='Запретить соединение с сервисом и по возможности очистить базу'"));
		КонецЕсли;
		
		Если СтрокаБазы.ИБУстаревшая Тогда
			СписокКоманд.Добавить("Подключить", НСтр("ru='Подключть к сервису и снять признак устаревшей базы'"));
		ИначеЕсли РазрешеноОтключать Тогда  
			СписокКоманд.Добавить("Отключить", НСтр("ru='Отключить от сеовиса как устаревшую'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если СписокКоманд.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьДиалогИзмененияСостоянияЗавершение", ЭтотОбъект, ВыбраннаяСтрока);
	ПоказатьВыборИзМеню(Оповещение, СписокКоманд);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогИзмененияСостоянияЗавершение(Ответ, ВыбраннаяСтрока) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаБазы = ПодключенныеБазы.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если СтрокаБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = "Подключить" Тогда
		
		Если Не ДопускаетсяПодключениеБазы() Тогда
			ПоказатьПредупреждение(, НСтр("ru='Для подключения еще одной базы не хватает лицензий'"));
		Иначе
			ИзменитьПодключениеБазы(СтрокаБазы.Код, Ответ.Значение);
		КонецЕсли;
		
	ИначеЕсли Ответ.Значение = "Отключить" Тогда
		ИзменитьПодключениеБазы(СтрокаБазы.Код, Ответ.Значение);
		
	ИначеЕсли Ответ.Значение = "Разрешить" Или Ответ.Значение = "Запретить" Тогда
		
		// Запрос подтверждения
		#Область ПоказатьВопрос
		Если Ответ.Значение = "Разрешить" Тогда
			ТекстВопроса = НСтр("ru='Разрешить подключение для ""%1""?
					|
					|После разрешения все данные станут доступны для этой программы'");
			ТекстКнопки = НСтр("ru='Разрешить'"); 
		Иначе
			ТекстВопроса = НСтр("ru='Запретить подключение для ""%1""?
					|
					|После запрета программа не сможет подкючаться к сервису, 
					|а если попытается - все данные в ней будут удалены без запроса подтверждения!'");
			ТекстКнопки = НСтр("ru='Запретить'"); 
		КонецЕсли;
		ТекстВопроса = СтрШаблон(ТекстВопроса, СтрокаБазы.ПредставлениеПрограммы);
		
		ДополнительныеПараметры = Новый Структура("Команда,ВыбраннаяСтрока", Ответ.Значение, ВыбраннаяСтрока);
		Оповещение = Новый ОписаниеОповещения("ПодтверждениеЗапретаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да,     ТекстКнопки);
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
		#КонецОбласти
		
	КонецЕсли;
	
	ЭтапОбновления = "Начало";
	ОбновитьИнформациюНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗапретаЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	СтрокаБазы = ПодключенныеБазы.НайтиПоИдентификатору(ДополнительныеПараметры.ВыбраннаяСтрока);
	Если СтрокаБазы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьЗапретБазы(СтрокаБазы.Код, Не СтрокаБазы.ИБЗапрещена);
	
КонецПроцедуры

&НаКлиенте
Функция ДопускаетсяПодключениеБазы()
	
	Возврат ДоступноЛицензий = -111 Или ДоступноЛицензий <= (ПодключеноБаз + 1);
	
КонецФункции 

&НаСервере
Процедура ИзменитьПодключениеБазы(КодИБ, Команда)
	
	ДеньгиВОблаке.ИзменитьПризнакУстарелаВОблаке(КодИБ, Команда = "Отключить");
	ПроверитьРежимИПараметрыПодключения();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗапретБазы(КодИБ, ЗначениеЗапрета)
	
	ДеньгиВОблаке.ИзменитьЗапретСоединенияВОблаке(КодИБ, ЗначениеЗапрета);
	ПроверитьРежимИПараметрыПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеВПоддержку()

	Состояние(НСтр("ru='Подготовка технологической информации...'"));
	
	ПараметрыФормы = ПараметрыСообщения();
	ПараметрыФормы.Тема = "Ошибка получения информации о подписках";
	
	ПараметрыФормы.Тело = "Форма ""Текущее состояние подписок"".
		|Выполняемое действие: " + Действие + " 
		|Ошибка: " + ТекстОшибки + ", 
		|	
		|	* дата: " + ТекущаяДатаКлиентСервер();
	
	ОткрытьФорму("ОбщаяФорма.ОтправкаСообщенияВСлужбуПоддержки", ПараметрыФормы, ЭтотОбъект, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОплатуПодписки(КоличествоЛицензий, ДатаНачала, Вариант = Неопределено)
	
	Если Не ЗначениеЗаполнено(СписокТарифов) Тогда
		ПоказатьПредупреждение(, НСтр("ru='С сервера не получена информация о тарифах.
			|Попробуйте обновить информацию (F5) и повторите попытку'") );
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КоличествоЛицензий",    КоличествоЛицензий);
	ПараметрыФормы.Вставить("ДатаНачала",            ДатаНачала);
	ПараметрыФормы.Вставить("Вариант",               Вариант);
	ПараметрыФормы.Вставить("НеиспользованнаяСумма", НеиспользованнаяСумма);
	ПараметрыФормы.Вставить("СписокТарифов",         СписокТарифов);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьОплатуПодпискиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ОплатаПодписки", ПараметрыФормы, ЭтотОбъект, Ложь, , , Оповещение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗарегистрироватьВсеДляОтправкиСервер()
	ПланыОбмена.ЗарегистрироватьИзменения(СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий"));
КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ОтметитьДляЗагрузкиВсеЗаписиОблакаСервер()
	АвтоматСинхронизацииССервисом.УстановитьРегистрациюИзмененийНаСервере("Зарегистрировать все");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайлКлент()
	ДиалогФайлаОбмена(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаКлент()
	ДиалогФайлаОбмена(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДиалогФайлаОбмена(ЭтоЗагрузка)
	
	ТекстПредупреждения = НСтр("ru='В данный момент выполняется синхронизация.
		|Для выполнения команды остановите синхронизацию или дождитесь ее завершения'");
	Если ПредупредитьЕслиВыполняетсяСинхронизация(ТекстПредупреждения) Тогда
		Возврат;
	КонецЕсли;
	
	ВыборФайла = Новый ДиалогВыбораФайла(?(ЭтоЗагрузка, РежимДиалогаВыбораФайла.Открытие, РежимДиалогаВыбораФайла.Сохранение));
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.ПолноеИмяФайла = ИмяФайлаВыгрузки;
	ВыборФайла.Расширение = "xml";
	ВыборФайла.Фильтр = "Файл выгрузки (*.xml)|*.xml|Все файлы (*.*)|*.*";
	ВыборФайла.ПроверятьСуществованиеФайла = ЭтоЗагрузка;
	ВыборФайла.МножественныйВыбор = Ложь;
	ВыборФайла.Заголовок = ?(ЭтоЗагрузка, НСтр("ru='Укажите файл для выгрузки'"), НСтр("ru='Укажите файл для загрузки'"));
	
	Оповещение = Новый ОписаниеОповещения("ДиалогФайлаВыгрузки_Завершение", ЭтотОбъект, ЭтоЗагрузка);
	ВыборФайла.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогФайлаВыгрузки_Завершение(ВыбранныеФайлы, ЭтоЗагрузка) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранныеФайлы) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("УзелИнформационнойБазы,ВидТранспорта,ВыполнятьВыгрузку,ВыполнятьЗагрузку,ИмяФайлаВыгрузки");
	ПараметрыФормы.УзелИнформационнойБазы = ЦентральнаяБаза;
	ПараметрыФормы.ВидТранспорта       = ПредопределенноеЗначение("Перечисление.ВидыТранспортаСообщенийОбмена.FILE");
	ПараметрыФормы.ВыполнятьВыгрузку   = Не ЭтоЗагрузка;
	ПараметрыФормы.ВыполнятьЗагрузку   = ЭтоЗагрузка;
	ПараметрыФормы.ИмяФайлаВыгрузки    = ВыбранныеФайлы[0];
	
	ОткрытьФорму("Обработка.МониторСинхронизацииССервисом.Форма.ИнтерактивнаяОперация", ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьСинхронизациюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	
	ВыключитьСинхронизациюСервер();
	ОбновитьИнтерфейс();
	Оповестить("ИзмененаСинхронизация");
	
	Если Открыта() Тогда
		ПустойСценарийОбработан = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьСинхронизациюСервер()
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда 
		Константы.ИспользоватьСинхронизациюДанных.Установить(Ложь);
	КонецЕсли;
	
	ОстановитьСинхронизациюСервер();
	
	// Выбор способа устанавливает функциональные опции
	Константы.ДеньгиВыбранныйСпособСинхронизации.Установить(Перечисления.СпособыСинхронизацииДанных.НеИспользовать);
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьРежимИПараметрыПодключения()
	
	Элементы.ГруппаУчетнаяЗаписьКолонкаПравая.Подсказка = "";
	Элементы.ДекорацияИндикатор.Подсказка = "";
	
	ЦентральнаяБаза = СинхронизацияАвтономныхКопийВызовСервера.УзелЦентральнойБазы("СинхронизацияАвтономныхКопий");
	КодЭтогоУзла    = СинхронизацияАвтономныхКопийВызовСервера.КодЭтогоУзла("СинхронизацияАвтономныхКопий");
	Режим = ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения();
	ПараметрыПодключения = Неопределено;
	Если Режим = "Разделенный" Тогда
		ПараметрыПодключенияЗаполнены = Истина;
		ЭталонныйНабор = Новый Структура("Логин,Пароль,НомерОбласти,КодАбонента,ПолныйПутьКБазе");
		ИмяНастройки = ДеньгиВОблакеКлиентСервер.ИмяНастройкиПараметрыСоединенияНаСервере();
		ПараметрыПодключения = РегистрыСведений.ЗначенияНастроекИнтеграции.ЗначениеНастройки(ИмяНастройки, ЭталонныйНабор);
		БазаПодключенаКОблаку = Истина;
	Иначе
		ПараметрыПодключенияЗаполнены = ДеньгиВОблаке.ПроверитьПараметрыПодключенияКОблаку(ПараметрыПодключения, , Ложь);
		БазаПодключенаКОблаку = ДеньгиВОблакеВызовСервера.ЭтаБазаПодключенаКОблаку(ПараметрыПодключения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстОтладочнойИнформации()
	
	Если Режим = "Разделенный" Тогда
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Разделитель = ОбщийМодуль.ЗначениеРазделителяСеанса();
	Иначе
		Разделитель = ?(ЗначениеЗаполнено(ПараметрыПодключения) И ЗначениеЗаполнено(ПараметрыПодключения.НомерОбласти), 
				ПараметрыПодключения.НомерОбласти, "<нет данных>");
	КонецЕсли;
	Результат = "";
	Результат = Результат + "Режим: " + ?(ЗначениеЗаполнено(Режим), Режим, "<нет данных>") 
			+ "(" + Формат(Разделитель, "ЧДЦ=0; ЧГ=") + ", " + ПараметрыПодключения.АдресСервера + ")" + Символы.ПС;
	Результат = Результат + "Код сервера: " + ?(ЗначениеЗаполнено(ЦентральнаяБаза), ЦентральнаяБаза.Код, "<нет данных>") + Символы.ПС;
	Результат = Результат + "Код этой базы: " + ?(ЗначениеЗаполнено(КодЭтогоУзла), КодЭтогоУзла, "<нет данных>") + Символы.ПС;
	
	Док = Новый ТекстовыйДокумент;
	Док.УстановитьТекст(Результат);
	Возврат Док;
	
КонецФункции 

&НаКлиенте
Процедура НастройкиУчетнойЗаписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьРежимИПараметрыПодключения();
	ОбновитьСпособСледующейСинхронизации();
	
	Если Режим = "КлиентОблака" Тогда
		ЭтапОбновления = "Начало";
		ОбновитьИнформациюНаКлиенте();
	ИначеЕсли Открыта() Тогда 
		ПустойСценарийОбработан = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМенюИсправлений()
	
	Если Не СвйстваБазыВОблаке.Существует Тогда
		ОткрытьФормуПодключенияКОблаку();
	ИначеЕсли СвйстваБазыВОблаке.ИБУстаревшая Тогда
		
		Если ДоступноЛицензий = -111 Или ДоступноЛицензий > 0 Тогда
			
			#Область ПоказатьВопрос
			ТекстВопроса = НСтр("ru='Снять отметку ""Устаревшая"" с этой базы?
			|
			|Будет занята одна из свободных лицезий'");
			
			ДополнительныеПараметры = Новый Структура;
			Оповещение = Новый ОписаниеОповещения("СнятьОтметкуУстаревшаяЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
			Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
			#КонецОбласти
			 
		Иначе
			
			#Область ПоказатьВопрос
			ТекстВопроса = НСтр("ru='Снять отметку ""Устаревшая"" можно только при наличии свободных лицензий
			|
			|Хотите купить подписку на нужное количество лицензий?'");
			
			ДополнительныеПараметры = Новый Структура;
			Оповещение = Новый ОписаниеОповещения("КупитьЛицензииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да,     НСтр("ru='Да'"));
			Кнопки.Добавить(КодВозвратаДиалога.Нет,    НСтр("ru='Нет'"));
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да, Заголовок);
			#КонецОбласти
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодключенияКОблаку()
	
	ТекстПредупреждения = НСтр("ru='В данный момент выполняется синхронизация.
		|Для изменения параметров подключения остановите синхронизацию или дождитесь ее завершения'");
	Если ПредупредитьЕслиВыполняетсяСинхронизация(ТекстПредупреждения) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("НастройкиУчетнойЗаписиЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ПодключениеКСервисуАвтоСинхронизации", , , Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкуУстаревшаяЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьПризнакУстарелаСервер(Ложь);
	ЭтапОбновления = "Начало";
	ОбновитьИнформациюНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПризнакУстарелаСервер(Устарела)
	
	ДеньгиВОблаке.ИзменитьПризнакУстарелаВОблаке(ПараметрыПодключения.КодЭтогоУзла, Устарела, ПараметрыПодключения);
	ПроверитьРежимИПараметрыПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура КупитьЛицензииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналСобытийСинхронизации(ДействиеПриОбменеСтрокой)
	
	СобытиеЖурналаРегистрации = ОбменДаннымиВызовСервера.КлючСообщенияЖурналаРегистрацииПоСтрокеДействия(ЦентральнаяБаза, ДействиеПриОбменеСтрокой);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СобытиеЖурналаРегистрации", СобытиеЖурналаРегистрации);
	Если ЗначениеЗаполнено(НачалоПоследнейСинхронизации) Тогда
		ПараметрыФормы.Вставить("ДатаНачала", НачалоПоследнейСинхронизации);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы, ЭтотОбъект, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗакрытияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПустойСценарийОбработан = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСейчасЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикПроверкиОбмена");
	ОбновитьСостояниеСинхронизацииСервер();
	//ПодключитьОбработчикОжидания("ОбработчикПроверкиОбмена", 10, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОплатуПодпискиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	ЭтапОбновления = "СостояниеПодписок";
	ОбновитьИнформациюНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьСинхронизациюЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОстановитьСинхронизациюКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьСинхронизациюКлиент()
	
	ОстановитьСинхронизациюСервер();
	ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	ОбновитьСтатусФоновогоЗаданияСинхронизацииКлиент();
	Оповестить("ИзмененаСинхронизация");
	
КонецПроцедуры


&НаСервере
Процедура ОстановитьСинхронизациюСервер()
	
	АвтоматСинхронизацииССервисом.ОстановитьФоновоеЗаданиеОбмена();
	ОбновитьСостояниеСинхронизацииСервер();
	ОбновитьСпособСледующейСинхронизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСинхронизациюИнтерактивноКлиент(СбрасыватьСостояние, ОтключитьАвтосинхронизацию = Истина) Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбмена");
	СообщитьОПереключении = СпособСинхронизации = 0 И ОтключитьАвтосинхронизацию;
	
	ЗаданиеОбмена = ФоновоеЗаданиеИнтерактивнойСинхронизации(СбрасыватьСостояние, ОтключитьАвтосинхронизацию);
	ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", ЗаданиеОбмена);
	ОбновитьЗаголовкиСостоянияСинхронизации(ЭтотОбъект);
	
	Если СообщитьОПереключении Тогда
		Сообщить(НСтр("ru='Автоматическая синхронизация отключена'"));
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбмена", 3, Истина);
	
КонецПроцедуры 


&НаСервере
Функция ФоновоеЗаданиеИнтерактивнойСинхронизации(СбрасыватьСостояние, ОтключитьАвтосинхронизацию)
	
	Если СпособСинхронизации = 0 И ОтключитьАвтосинхронизацию Тогда
		СпособСинхронизации = 1;
		ЗаписатьРежимСинхронизации();
	КонецЕсли;
	
	Если СбрасыватьСостояние 
		Или СостояниеОбмена <> Неопределено И Не СостояниеОбмена.ПроцессАктивен Тогда
		СброситьСостояниеОбмена();
	КонецЕсли;
	
	Задание = АвтоматСинхронизацииССервисом.ОбменСОблачнымХранилищемВручную(ЭтотОбъект);
	СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	
	Возврат Задание;
	
КонецФункции

&НаСервере
Процедура СброситьСостояниеОбмена()
	
	Если СостояниеОбмена = Неопределено Тогда
		СостояниеОбмена = АвтоматСинхронизацииССервисом.СостояниеОбмена();
	КонецЕсли;
	
	АвтоматСинхронизацииССервисом.СброситьСостояние(СостояниеОбмена);
	
	ОбновитьСостояниеСинхронизацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОписаниеСостоянияОбмена(ИмяПроцесса)
	
	ПараметрыФормы = Новый Структура("Процесс", ИмяПроцесса);
	ОткрытьФорму("ОбщаяФорма.СостояниеОбменаДанными", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
