////////////////////////////////////////////////////////////////////////////////
// Модуль содержит общие процедуры и функции для форм регламентированной
// отчетности.
//
////////////////////////////////////////////////////////////////////////////////

#Область ИнтерфейсРаботыСДаннымиРеестровПоНДС

Процедура Автозаполнение_РеестрПоНДС_Приложение5(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
	
	ДеревоДанныхРеестр = Контейнер.Реестр;
	
	СтруктураРеквизитовФормы = ПараметрыОтчета.СтруктураРеквизитовФормы;
	
	Графы_П10000 = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей["П10000"].ИменаГраф;
	Графы_П11000 = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей["П11000"].ИменаГраф;
	Графы_П11100 = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей["П11100"].ИменаГраф;
	
	СуммыПоКодамОперПостранично = Новый ТаблицаЗначений;
	ОписаниеТиповСтрока7   = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(7));
	ОписаниеТиповЧисло16_2 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(16, 2));
	СуммыПоКодамОперПостранично.Колонки.Добавить("Код",   ОписаниеТиповСтрока7);
	СуммыПоКодамОперПостранично.Колонки.Добавить("Сумма", ОписаниеТиповЧисло16_2);
	
	ИмяРаздела = "Реестр";
	
	НумераторыПоКодамОпер = Новый Структура;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ИсходныйМакет = РегламентированнаяОтчетность.РеглОтчеты(ИДОтчета).ПолучитьМакет(ИДРедакцииОтчета + "_" + ИмяРаздела);
	
	Для Инд = 0 По ДеревоДанныхРеестр.Строки.Количество() - 1 Цикл
		
		ТекВетка = ДеревоДанныхРеестр.Строки[Инд];
		
		ТабличныйДокумент.Очистить();
		ТабличныйДокумент.Вывести(ИсходныйМакет.ПолучитьОбласть());
		
		Обл = ТабличныйДокумент.Область("УдалитьСтрокуП10000_1");
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл = ТабличныйДокумент.Область("УдалитьСтрокуП11000_1_1");
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		Обл = ТабличныйДокумент.Область("УдалитьСтрокуП11100_1_1_1");
		Обл.Гиперссылка = Ложь;
		Обл.Текст = "";
		
		КодОперации = СокрЛП(ТекВетка.Данные["КодОперации"]);
		ТабличныйДокумент.Области.Найти("КодОперации").Значение = КодОперации;
		
		Дерево_П10000 = ТекВетка.ДанныеМногострочныхЧастей.П10000;
		
		СуммаПоКодуОперации = 0;
		
		НумераторПоКодуОпер = 0;
		Если ЗначениеЗаполнено(КодОперации)
			И НумераторыПоКодамОпер.Свойство("_" + КодОперации) Тогда
			НумераторПоКодуОпер = НумераторыПоКодамОпер["_" + КодОперации];
		КонецЕсли;
		
		Для Инд_П10000 = 0 По Дерево_П10000.Строки.Количество() - 1 Цикл
			
			Инд_П10000_Стр   = Формат(Инд_П10000, "ЧГ=");
			Инд_П10000_Стр_1 = Формат(Инд_П10000 + 1, "ЧГ=");
			
			Если Инд_П10000 > 0 Тогда
				ИмяОблПреемника_П10000 = "ДобавлениеСтрокиП10000_" + Инд_П10000_Стр;
				ВставитьДопСтроку(ИсходныйМакет, ТабличныйДокумент,
				СтруктураРеквизитовФормы, ИмяРаздела, "П10000", ИмяОблПреемника_П10000);
			КонецЕсли;
			ТекВетка_П10000 = Дерево_П10000.Строки[Инд_П10000];
			
			НумераторПоКодуОпер = НумераторПоКодуОпер + 1;
			ТекВетка_П10000.Данные["П1000001"] = Формат(НумераторПоКодуОпер, "ЧГ=");
			
			Для каждого Графа Из Графы_П10000 Цикл
				Обл = ТабличныйДокумент.Области.Найти(Графа + "_" + Инд_П10000_Стр_1);
				Обл.Значение = ТекВетка_П10000.Данные[Графа];
			КонецЦикла;
			
			СуммаПоКодуОперации = СуммаПоКодуОперации + ТекВетка_П10000.Данные["П1000003"];
			
			Дерево_П11000 = ТекВетка_П10000.ДанныеМногострочныхЧастей.П11000;
			
			Для Инд_П11000 = 0 По Дерево_П11000.Строки.Количество() - 1 Цикл
				
				Инд_П11000_Стр   = Формат(Инд_П11000, "ЧГ=");
				Инд_П11000_Стр_1 = Формат(Инд_П11000 + 1, "ЧГ=");
				
				Если Инд_П11000 > 0 Тогда
					ИмяОблПреемника_П11000 = "ДобавлениеСтрокиП11000_"
					+ Инд_П10000_Стр_1 + "_" + Инд_П11000_Стр;
					ВставитьДопСтроку(ИсходныйМакет, ТабличныйДокумент,
					СтруктураРеквизитовФормы, ИмяРаздела, "П11000", ИмяОблПреемника_П11000);
				КонецЕсли;
				ТекВетка_П11000 = Дерево_П11000.Строки[Инд_П11000];
				Для каждого Графа Из Графы_П11000 Цикл
					Обл = ТабличныйДокумент.Области.Найти(Графа + "_"
					+ Инд_П10000_Стр_1 + "_" + Инд_П11000_Стр_1);
					Обл.Значение = ТекВетка_П11000.Данные[Графа];
				КонецЦикла;
				
				Дерево_П11100 = ТекВетка_П11000.ДанныеМногострочныхЧастей.П11100;
				
				Для Инд_П11100 = 0 По Дерево_П11100.Строки.Количество() - 1 Цикл
					
					Инд_П11100_Стр   = Формат(Инд_П11100, "ЧГ=");
					Инд_П11100_Стр_1 = Формат(Инд_П11100 + 1, "ЧГ=");
					
					Если Инд_П11100 > 0 Тогда
						ИмяОблПреемника_П11100 = "ДобавлениеСтрокиП11100_" + Инд_П10000_Стр_1
						+ "_" + Инд_П11000_Стр_1 + "_" + Инд_П11100_Стр;
						ВставитьДопСтроку(ИсходныйМакет, ТабличныйДокумент,
						СтруктураРеквизитовФормы, ИмяРаздела, "П11100", ИмяОблПреемника_П11100);
					КонецЕсли;
					ТекВетка_П11100 = Дерево_П11100.Строки[Инд_П11100];
					Для каждого Графа Из Графы_П11100 Цикл
						Обл = ТабличныйДокумент.Области.Найти(Графа + "_" + Инд_П10000_Стр_1
						+ "_" + Инд_П11000_Стр_1 + "_" + Инд_П11100_Стр_1);
						Обл.Значение = ТекВетка_П11100.Данные[Графа];
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		НовСтр = СуммыПоКодамОперПостранично.Добавить();
		НовСтр.Код   = КодОперации;
		НовСтр.Сумма = СуммаПоКодуОперации;
		
		ТекВетка.АдресТабличногоДокумента = ТабличныйДокумент.ПолучитьОбласть();
		
		Если ЗначениеЗаполнено(КодОперации) Тогда
			НумераторыПоКодамОпер.Вставить("_" + КодОперации, НумераторПоКодуОпер);
		КонецЕсли;
		
	КонецЦикла;
	
	СуммыПоКодамОперИтого = СуммыПоКодамОперПостранично.Скопировать();
	СуммыПоКодамОперИтого.Свернуть("Код", "Сумма");
	
	ИтоговыеСуммыПоКодамОпераций = Новый Массив;
	
	Для каждого Стр Из СуммыПоКодамОперПостранично Цикл
		
		Если СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
			ИтоговыеСуммыПоКодамОпераций.Добавить(
				Новый Структура("КодОперации,НалБазаИтого", Стр.Код, 0));
			ИтогоСуммаПоКодуОпер = 0;
		Иначе
			ИтоговыеСуммыПоКодамОпераций.Добавить(
				Новый Структура("КодОперации,НалБазаИтого", Стр.Код, Стр.Сумма));
			ИтогоСуммаПоКодуОпер = СуммыПоКодамОперИтого.Найти(Стр.Код, "Код").Сумма;
		КонецЕсли;
		
		Инд = СуммыПоКодамОперПостранично.Индекс(Стр);
		
		ТекВетка = ДеревоДанныхРеестр.Строки[Инд];
		
		ТекВетка.Данные["НалБазаИтого"] = ИтогоСуммаПоКодуОпер;
		ТекВетка.АдресТабличногоДокумента.Область("НалБазаИтого").Значение = ИтогоСуммаПоКодуОпер;
		
	КонецЦикла;
	
	СтруктураРеквизитовФормы.ИтоговыеСуммыПоКодамОпераций = ИтоговыеСуммыПоКодамОпераций;
	
	ПоместитьВоВременноеХранилище(
		ДеревоДанныхРеестр, СтруктураРеквизитовФормы.АдресВоВрХранилищеДеревоДанныхРеестр);
	
	ПоместитьВоВременноеХранилище(
		СтруктураРеквизитовФормы, ПараметрыОтчета.АдресВоВременномХранилище);
	
КонецПроцедуры

Процедура ВставитьДопСтроку(ИсходныйМакет, ТабличныйДокумент, СтруктураРеквизитовФормы, Знач ИмяРаздела, Знач ИмяГруппы, Знач ИмяОбластиПреемника)
	
	НачИндекс = "_1";
	
	Если СтрНайти(ИмяОбластиПреемника, "ДобавлениеСтроки" + ИмяГруппы) > 0 Тогда
		
		ОблПреемник = ТабличныйДокумент.Области.Найти(ИмяОбластиПреемника);
		
		ВремТаблДок = ИсходныйМакет.ПолучитьОбласть();
		
		ИскомаяОбластьМнЧ = ВремТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
		
		ВремТаблДок = ВремТаблДок.ПолучитьОбласть(ИскомаяОбластьМнЧ.Верх, , ИскомаяОбластьМнЧ.Верх
		+ ВысотаМногострочнойЧасти(ИсходныйМакет, СтруктураРеквизитовФормы, ИмяГруппы, ВремТаблДок) - 1, );
		
		ВремТаблДок.Область("МногострочнаяЧасть" + ИмяГруппы).Имя = "";
		
		НовКоординаты = СтрокаСКоординатамиПоказателя(ИмяОбластиПреемника);
		
		КолУровнейПодчиненности = СтрЧислоВхождений(НовКоординаты, "_");
		НачКоординаты = "";
		Для НомУр = 1 По КолУровнейПодчиненности Цикл
			НачКоординаты = НачКоординаты + НачИндекс;
		КонецЦикла;
		
		ПреИндекс_Число = ИндексПоказателя(ИмяОбластиПреемника);
		ПреИндекс = СтрокаСИндексомПоказателя(ПреИндекс_Число);
		
		НовИндекс_Число = ПреИндекс_Число + 1;
		НовИндекс = СтрокаСИндексомПоказателя(НовИндекс_Число);
		
		НачПостфикс = ИмяГруппы + НачКоординаты + НачИндекс;
		ПреПостфикс = ИмяГруппы + НовКоординаты + ПреИндекс;
		НовПостфикс = ИмяГруппы + НовКоординаты + НовИндекс;
		
		МассивИменГраф = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей[ИмяГруппы]["ИменаГраф"];
		Для каждого ИмяГрафы Из МассивИменГраф Цикл
			НачИмяОбл = ИмяГрафы + НачКоординаты + НачИндекс;
			НовИмяОбл = ИмяГрафы + НовКоординаты + НовИндекс;
			
			ОбластьЯчейки = ВремТаблДок.Области[НачИмяОбл];
			ОбластьЯчейки.Имя = НовИмяОбл;
			
			Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
				ОбластьЯчейки.Очистить();
			КонецЕсли;
		КонецЦикла;
		
		Обл = ВремТаблДок.Область("УдалитьСтроку" + НачПостфикс);
		Обл.Имя = "УдалитьСтроку" + НовПостфикс;
		
		Обл = ВремТаблДок.Область("УдалитьСтроку" + НовПостфикс);
		Обл.Гиперссылка = Истина;
		Обл.Текст = "х";
		Если НовИндекс_Число = 2 Тогда
			Обл = ТабличныйДокумент.Области.Найти("УдалитьСтроку" + ПреПостфикс);
			Обл.Гиперссылка = Истина;
			Обл.Текст = "х";
		КонецЕсли;
		
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
		Обл.Имя = "ДобавитьСтроку" + НовПостфикс;
		Обл = ТабличныйДокумент.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
		Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
		
		ОблПреемник.Имя = "ДобавлениеСтроки" + НовПостфикс;
		
		// Обновление координат в именах областей подчиненных многострочных частей.
		ИменаПодчиненныхГрупп = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей[
			ИмяГруппы]["ИменаПодчиненныхГрупп"];
		Для каждого ИмяПодчГруппы Из ИменаПодчиненныхГрупп Цикл
			ПарамРеинд = Новый Структура("ИмяГруппы,ПреКоординаты,НовКоординаты",
				ИмяПодчГруппы, НачКоординаты + НачИндекс, НовКоординаты + НовИндекс);
			РеиндексироватьПодчиненныеДопСтрокиПриДобавлении(ВремТаблДок, СтруктураРеквизитовФормы, ПарамРеинд);
		КонецЦикла;
		
		ВставляемаяОбласть = ВремТаблДок.Область(1, , ВремТаблДок.ВысотаТаблицы, );
		
		// Изменения в оформлении ячеек: установка значения "НетЛинии"/"Сплошная" для
		// свойства "ГраницаСнизу" (в случае задания номеров специальных колонок):
		НомераСпецКолонок = Неопределено;
		СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей[ИмяГруппы].Свойство(
			"КолонкиСИзмНижнГраницей", НомераСпецКолонок);
		Если НомераСпецКолонок <> Неопределено Тогда
			Для каждого НомКолонки Из НомераСпецКолонок Цикл
				// Удаление линии в определенных колонках последней (до добавления) строки.
				Обл = ТабличныйДокумент.Область(
					ОблПреемник.Верх - 1, НомКолонки, ОблПреемник.Верх - 1, НомКолонки);
				Если Обл <> Неопределено Тогда
					Обл.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии);
				КонецЕсли;
				// Установка линии в определенных колонках добавляемой строки.
				Обл = ВремТаблДок.Область(
					ВставляемаяОбласть.Низ, НомКолонки, ВставляемаяОбласть.Низ, НомКолонки);
				Если Обл <> Неопределено Тогда
					Обл.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ТабличныйДокумент.ВставитьОбласть(
			ВставляемаяОбласть, ОблПреемник, ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РеиндексироватьПодчиненныеДопСтрокиПриДобавлении(ТаблДок, СтруктураРеквизитовФормы, ПараметрыРеиндексации)
	
	ИмяГруппы = ПараметрыРеиндексации["ИмяГруппы"];
	ПреКоординаты = ПараметрыРеиндексации["ПреКоординаты"];
	НовКоординаты = ПараметрыРеиндексации["НовКоординаты"];
	
	МассивИменГраф = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей[ИмяГруппы]["ИменаГраф"];
	НачИндекс = "_1";
	
	Для каждого ИмяГрафы Из МассивИменГраф Цикл
		ПреИмяОбл = ИмяГрафы + ПреКоординаты + НачИндекс;
		НовИмяОбл = ИмяГрафы + НовКоординаты + НачИндекс;
		
		ОбластьЯчейки = ТаблДок.Области[ПреИмяОбл];
		ОбластьЯчейки.Имя = НовИмяОбл;
	КонецЦикла;
	
	ПреПостфикс = ИмяГруппы + ПреКоординаты + НачИндекс;
	НовПостфикс = ИмяГруппы + НовКоординаты + НачИндекс;
	
	Обл = ТаблДок.Области.Найти("УдалитьСтроку" + ПреПостфикс);
	Обл.Имя = "УдалитьСтроку" + НовПостфикс;
	Обл.Гиперссылка = Ложь;
	Обл.Текст = "";
	
	Обл = ТаблДок.Области.Найти("ДобавлениеСтроки" + ПреПостфикс);
	Обл.Имя = "ДобавлениеСтроки" + НовПостфикс;
	Обл = ТаблДок.Области.Найти("ДобавитьСтроку" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтроку" + НовПостфикс;
	Обл = ТаблДок.Области.Найти("ДобавитьСтрокуЗначок" + ПреПостфикс);
	Обл.Имя = "ДобавитьСтрокуЗначок" + НовПостфикс;
	
	ТаблДок.Область("МногострочнаяЧасть" + ИмяГруппы).Имя = "";
	
	ИменаПодчиненныхГрупп = СтруктураРеквизитовФормы.СтруктураМногострочныхЧастей[
		ИмяГруппы]["ИменаПодчиненныхГрупп"];
	Для каждого ИмяПодчГруппы Из ИменаПодчиненныхГрупп Цикл
		ПарамРеинд = Новый Структура("ИмяГруппы,ПреКоординаты,НовКоординаты",
			ИмяПодчГруппы, ПреКоординаты + НачИндекс, НовКоординаты + НачИндекс);
		РеиндексироватьПодчиненныеДопСтрокиПриДобавлении(ТаблДок, СтруктураРеквизитовФормы, ПарамРеинд);
	КонецЦикла;
	
КонецПроцедуры

Функция ИндексПоказателя(Знач ИмяОбласти)
	
	МассивСтрок = СтрРазделить(ИмяОбласти, "_");
	
	КолСтрок = МассивСтрок.Количество();
	
	Если КолСтрок = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексСтрока = МассивСтрок[КолСтрок - 1];
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИндексСтрока) Тогда
		Возврат Число(ИндексСтрока);
	КонецЕсли;
	
КонецФункции

Функция СтрокаСИндексомПоказателя(Знач Индекс)
	
	Если ТипЗнч(Индекс) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат "_" + Формат(Индекс, "ЧГ=");
	
КонецФункции

Функция СтрокаСКоординатамиПоказателя(Знач Координаты)
	
	СтрокаСКоординатами = "";
	
	Если ТипЗнч(Координаты) = Тип("Массив") Тогда
		Для каждого КоординатаЧисло Из Координаты Цикл
			Если ТипЗнч(КоординатаЧисло) <> Тип("Число") Тогда
				Возврат Неопределено;
			КонецЕсли;
			СтрокаСКоординатами = СтрокаСКоординатами + "_" + Формат(КоординатаЧисло, "ЧГ=");
		КонецЦикла;
	ИначеЕсли ТипЗнч(Координаты) = Тип("Строка") Тогда
		МассивСтрок = СтрРазделить(Координаты, "_");
		КолСтрок = МассивСтрок.Количество();
		Если КолСтрок = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		МассивСтрок.Удалить(КолСтрок - 1);
		МассивСтрок.Удалить(0);
		Для каждого КоординатаСтрока Из МассивСтрок Цикл
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(КоординатаСтрока) Тогда
				СтрокаСКоординатами = СтрокаСКоординатами + "_" + Формат(КоординатаСтрока, "ЧГ=");
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрокаСКоординатами;
	
КонецФункции

Функция ВысотаМногострочнойЧасти(ИсходныйМакет, СтруктураРеквизитовФормы, ИмяГруппы, ТаблДок = Неопределено)
	
	Если ТаблДок = Неопределено Тогда
		ТаблДок = ИсходныйМакет.ПолучитьОбласть();
	КонецЕсли;
	
	ИскомаяОбласть1 = ТаблДок.Области.Найти("МногострочнаяЧасть" + ИмяГруппы);
	ИмяОблДобавлСтроки = "ДобавлениеСтроки" + ИмяГруппы;
	
	Для каждого ИскомаяОбласть2 Из ТаблДок.Области Цикл
		Если СтрНачинаетсяС(ИскомаяОбласть2.Имя, ИмяОблДобавлСтроки) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИскомаяОбласть2.Верх - ИскомаяОбласть1.Верх;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

Процедура ПриОпределенииИспользуемыхВерсийВнешнихКомпонент(Идентификаторы) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	Если ВидыДоступа.Найти("Организации", "Имя") = Неопределено Тогда
		
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя = "Организации";
		ВидДоступа.Представление = НСтр("ru = 'Организации'");
		ВидДоступа.ТипЗначений = Тип("СправочникСсылка.Организации");
		
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
			
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ДоверенностиНалогоплательщика");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.МакетыПенсионныхДел");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ЗаявлениеОНазначенииПенсии");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОписиВходящихДокументовИзНалоговыхОрганов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОписиИсходящихДокументовВНалоговыеОрганы");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОтправкиБанкРоссии");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОтправкиМинобороны");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОтправкиРПН");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОтправкиФСРАР");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОтправкиФСС");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ОтправкиФТС");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ПерепискаСКонтролирующимиОрганами");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.РегистрацииВНалоговомОргане");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.УчетныеЗаписиДокументооборота");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Справочник.ЦиклыОбмена");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ВыгрузкаРегламентированныхОтчетов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ЗаявлениеАбонентаСпецоператораСвязи");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ПоясненияКДекларацииПоНДС");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.РегламентированныйОтчет");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.УведомлениеОПолучателеДокументов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.УведомлениеОСпецрежимахНалогообложения");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"Документ.ТранспортноеСообщение");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.АрхивДанныхРегламентированнойОтчетности");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ВложенияНеформализованныхДокументов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ДокументыПоТребованиюФНС"); 
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ЖурналНовыхСобытий");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ЖурналОтчетовСтатусы");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиИнтеграцииСоСпринтером");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОбменаБанкРоссии");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОбменаМинобороны");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОбменаРПН");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОбменаФСРАР");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОбменаФСС");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОбменаФТС");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НумераторПачекПФР");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ОтветыНаЗапросыИОН");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ОтветыНаЗапросыИОС");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоЖурнал");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоЛицензии");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СобытияКалендаряБухгалтера");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СтатусыОтправки");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СчетчикВыгрузокОтчетностиВБанк");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СчетчикиВыгрузок");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ФайлыСведенийСпецоператоры");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ФайлыСведенийРОКИ");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СвойстваТранспортныхСообщений");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.СодержимоеТранспортныхКонтейнеров");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ТранспортныеКонтейнеры");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ПользователиУчетныхЗаписейДокументооборота");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ОрганизацииЗаключившиеСоглашениеСПФР");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.НастройкиОтправкиОтчетностиВБанк");
	ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки,
		"РегистрСведений.ЖурналПередачиОтчетностиВБанк");
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
//
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ДоверенностиНалогоплательщика");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
		|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
		|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.МакетыПенсионныхДел");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.МакетыПенсионныхДел.Чтение.Организации
		|Справочник.МакетыПенсионныхДел.Изменение.Организации";
		
	КонецЕсли;
	                                             	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ЗаявлениеОНазначенииПенсии");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ЗаявлениеОНазначенииПенсии.Чтение.Организации
		|Справочник.ЗаявлениеОНазначенииПенсии.Изменение.Организации";
		
	КонецЕсли;	
	                                             	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОписиВходящихДокументовИзНалоговыхОрганов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
		|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОписиИсходящихДокументовВНалоговыеОрганы");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
		|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОтправкиБанкРоссии");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОтправкиБанкРоссии.Чтение.Организации
		|Справочник.ОтправкиБанкРоссии.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОтправкиМинобороны");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОтправкиМинобороны.Чтение.Организации
		|Справочник.ОтправкиМинобороны.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОтправкиРПН");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОтправкиРПН.Чтение.Организации
		|Справочник.ОтправкиРПН.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОтправкиФСРАР");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОтправкиФСРАР.Чтение.Организации
		|Справочник.ОтправкиФСРАР.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОтправкиФСС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОтправкиФСС.Чтение.Организации
		|Справочник.ОтправкиФСС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ОтправкиФТС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ОтправкиФТС.Чтение.Организации
		|Справочник.ОтправкиФТС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ПерепискаСКонтролирующимиОрганами");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
		|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.РегистрацииВНалоговомОргане");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
		|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
		|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
		|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.ВыгрузкаРегламентированныхОтчетов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
		|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
		|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
		|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
		|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.ЗаявлениеАбонентаСпецоператораСвязи");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
		|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.ПоясненияКДекларацииПоНДС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
		|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.РегламентированныйОтчет");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.РегламентированныйОтчет.Чтение.Организации
		|Документ.РегламентированныйОтчет.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.УведомлениеОПолучателеДокументов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
		|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("Документ.УведомлениеОСпецрежимахНалогообложения");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
		|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.АрхивДанныхРегламентированнойОтчетности");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ВложенияНеформализованныхДокументов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
		|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ДокументыПоТребованиюФНС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
		|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ЖурналНовыхСобытий");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
		|РегистрСведений.ЖурналНовыхСобытий.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
		|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ЖурналОтчетовСтатусы");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
		|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиИнтеграцииСоСпринтером");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
		|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОбменаБанкРоссии");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиОбменаБанкРоссии.Чтение.Организации
		|РегистрСведений.НастройкиОбменаБанкРоссии.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОбменаМинобороны");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиОбменаМинобороны.Чтение.Организации
		|РегистрСведений.НастройкиОбменаМинобороны.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОбменаРПН");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
		|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОбменаФСРАР");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
		|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОбменаФСС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
		|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОбменаФТС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
		|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НумераторПачекПФР");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.НумераторПачекПФР.Чтение.Организации
		|РегистрСведений.НумераторПачекПФР.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
		|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ОтветыНаЗапросыИОН");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
		|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ОтветыНаЗапросыИОС");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
		|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоЖурнал");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоЛицензии");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Чтение.Организации
		|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СобытияКалендаряБухгалтера");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
		|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СтатусыОтправки");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СтатусыОтправки.Чтение.Организации
		|РегистрСведений.СтатусыОтправки.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СчетчикВыгрузокОтчетностиВБанк");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Чтение.Организации
		|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.СчетчикиВыгрузок");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
		|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(
		"РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
		|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации";
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(
		"РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
		|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации";	
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(
		"РегистрСведений.ОрганизацииЗаключившиеСоглашениеСПФР");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Описание = Описание + "
		|РегистрСведений.ОрганизацииЗаключившиеСоглашениеСПФР.Чтение.Организации
		|РегистрСведений.ОрганизацииЗаключившиеСоглашениеСПФР.Изменение.Организации";	
		
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.НастройкиОтправкиОтчетностиВБанк");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		Описание = Описание + "
			|РегистрСведений.НастройкиОтправкиОтчетностиВБанк.Чтение.Организации
			|РегистрСведений.НастройкиОтправкиОтчетностиВБанк.Изменение.Организации";
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени("РегистрСведений.ЖурналПередачиОтчетностиВБанк");
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		Описание = Описание + "
			|РегистрСведений.ЖурналПередачиОтчетностиВБанк.Чтение.Организации
			|РегистрСведений.ЖурналПередачиОтчетностиВБанк.Изменение.Организации";
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// См.
// ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке.
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт

	Типы.Добавить(Метаданные.Справочники.РегламентированныеОтчеты);
	
КонецПроцедуры

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

// Вызывается из процедур, вызванных обработчиком команды "РазрешитьРедактированиеРеквизитовОбъекта"
// размещенной в форме регламентированного отчета.
//
Процедура РазрешитьРедактированиеРеквизитовОтчета(Форма) Экспорт
	
	ИменаПолейТабличногоДокумента = СтрРазделить("ТабличныйДокумент;ПолеТабличногоДокументаФормаОтчета", ";");
	
	Для Каждого ИмяПоляТабличногоДокумента Из ИменаПолейТабличногоДокумента Цикл
		ЭлементФормыПолеТабличногоДокумента = Форма.Элементы.Найти(ИмяПоляТабличногоДокумента);
		Если НЕ ЭлементФормыПолеТабличногоДокумента = Неопределено Тогда
			// Включить действие "Выбор" в поле табличного документа.
			ЭлементФормыПолеТабличногоДокумента.УстановитьДействие("Выбор",
				СтрЗаменить(ЭлементФормыПолеТабличногоДокумента.ПолучитьДействие("Выбор"), "Отключенный_", ""));
		КонецЕсли;
	КонецЦикла;
	
	// Восстановить заголовок кнопки печати.
	ЭлементПоказатьБланк = Форма.Элементы.Найти("ПоказатьБланк");
	Если ЭлементПоказатьБланк <> Неопределено Тогда
		КомандаПоказатьБланк = Форма.Команды.Найти(ЭлементПоказатьБланк.ИмяКоманды);
		Если КомандаПоказатьБланк <> Неопределено Тогда
			Если ЗначениеЗаполнено(ЭлементПоказатьБланк.Заголовок) Тогда
				ЭлементПоказатьБланк.Заголовок = СокрП(СтрРазделить(ЭлементПоказатьБланк.Заголовок, "(")[0]);
			Иначе
				КомандаПоказатьБланк.Заголовок = СокрП(СтрРазделить(КомандаПоказатьБланк.Заголовок, "(")[0]);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	// Удалить ссылку на последний цикл обмена - не будут выводиться в печатных формах штампы ЭЦП.
	Если Форма.СтруктураРеквизитовФормы.Свойство("ПоследнийЦиклОбмена") Тогда
		Форма.СтруктураРеквизитовФормы.Удалить("ПоследнийЦиклОбмена"); 
	КонецЕсли;
	
КонецПроцедуры


// Возвращает таблицу с показателями регламентированных отчетов,
// необходимыми для оценки риска выездной налоговой проверки.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, по которой отбираются регламентированные отчеты.
//   ДатаНачала - Дата - начало периода, за который отбираются регламентированные отчеты.
//   ДатаОкончания - Дата - конец периода, за который отбираются регламентированные отчеты.
//
// Возвращаемое значение:
//   ТаблицЗначений - показатели регламентированных отчетов, необходимые
//					  для оценки риска выездной налоговой проверки.
//
Функция ПоказателиОценкиРискаВыезднойНалоговойПроверки(Организация, ДатаНачала, ДатаОкончания) Экспорт
	
	ТаблицаОтчетов = ОтчетыОценкиРисков(Организация, ДатаНачала, ДатаОкончания);
	
	ТаблицаПоказателей = НоваяТаблицаПоказателейОценкиРисков();
	
	Для Каждого СтрокаОтчета Из ТаблицаОтчетов Цикл
		ВставитьПоказательВТаблицуОценкиРисков(ТаблицаПоказателей, СтрокаОтчета);
	КонецЦикла;
	
	Возврат ТаблицаПоказателей
	
КонецФункции

// Формирует шаблон таблицы для получения данных из переопределяемого метода.
//
// Возвращаемое значение:
//   ТаблицаЗначений - шаблон таблицы для получения данных из переопределяемого метода.
//
Функция ПустаяТаблицаОписанияОбъектовРегламентированнойОтчетности() Экспорт
	
	ТаблицаОписания = Новый ТаблицаЗначений;
	ТаблицаОписания.Колонки.Добавить("Наименование");
	ТаблицаОписания.Колонки.Добавить("ТипОбъекта");
	ТаблицаОписания.Колонки.Добавить("ВидКонтролирующегоОргана");
	ТаблицаОписания.Колонки.Добавить("ГруппаВДереве");
	ТаблицаОписания.Колонки.Добавить("ВидДокумента");
	ТаблицаОписания.Колонки.Добавить("НеОтправляетсяВКонтролирующийОрган");
	ТаблицаОписания.Колонки.Добавить("ЯвляетсяАктуальным");
	ТаблицаОписания.Колонки.Добавить("ИмяОсновногоМакетаДляПечати");
	ТаблицаОписания.Колонки.Добавить("ВидЭлектронногоПредставления");
	
	Возврат ТаблицаОписания;
	
КонецФункции

// Заполняет наименование таблицы для получения данных из переопределяемого метода.
//
// Параметры:
//   ТаблицаОписания - ТаблицаЗначений - таблица описания.
//
Процедура ЗаполнитьНаименованиеВТаблицеОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	
	// Заполняем колонку Наименование из метаданных.
	Для каждого СтрокаТаблицыОписания Из ТаблицаОписания Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыОписания.Наименование) Тогда
			СтрокаТаблицыОписания.Наименование = Метаданные.НайтиПоТипу(СтрокаТаблицыОписания.ТипОбъекта).Представление();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Дополняет дерево видов отчетов данными из таблицы.
//
// Параметры:
//   ДеревоОтчетов - ДеревоЗначений - дерево регл. отчетов.
//   ТаблицаОписанияОтчетов - ТаблицаЗначений - таблица регл. отчетов.
//
Процедура ДобавитьВДеревоРегламентированныхОтчетовОтчетыИзТаблицы(ДеревоОтчетов, ТаблицаОписанияОтчетов) Экспорт
	
	ЗначенияКолонок = Новый Структура;
	
	Для каждого СтрокаТаблицыОписанияОтчетов Из ТаблицаОписанияОтчетов Цикл
		
		МетаОбъект = Метаданные.НайтиПоТипу(СтрокаТаблицыОписанияОтчетов.ТипОбъекта);
		Если МетаОбъект <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицыОписанияОтчетов.ГруппаВДереве) Тогда
			
			ЗначенияКолонок.Вставить("Наименование",  ?(ЗначениеЗаполнено(СтрокаТаблицыОписанияОтчетов.Наименование),
				СтрокаТаблицыОписанияОтчетов.Наименование, МетаОбъект.Синоним));
			ЗначенияКолонок.Вставить("ПолноеИмя",     МетаОбъект.ПолноеИмя());
			ЗначенияКолонок.Вставить("ТипПолучателя", СтрокаТаблицыОписанияОтчетов.ВидКонтролирующегоОргана);
			ЗначенияКолонок.Вставить("Категория",     СтрокаТаблицыОписанияОтчетов.ГруппаВДереве);
			ЗначенияКолонок.Вставить("ЭтоГруппа",     Ложь);
			
			ДобавитьОтчетВДеревоРегламентированныхОтчетов(ДеревоОтчетов, ЗначенияКолонок);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает таблицу ранее созданных отчетов.
//
// Параметры:
//   Организации - Массив - массив значений типа СправочникСсылка.Организации,
//                          по которым отбираются регламентированные отчеты.
//
// Возвращаемое значение:
//   ТаблицаЗначений - ранее созданные отчеты.
//
Функция ТаблицаСозданныхВидовОтчетов(Организации = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	РегламентированныйОтчет.Ссылка КАК Ссылка,
	                      |	РегламентированныйОтчет.ИсточникОтчета КАК ИсточникОтчета
	                      |ПОМЕСТИТЬ ТаблицаИсточникиОтчета
	                      |ИЗ
	                      |	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	                      |ГДЕ
	                      |	&УсловиеДокументов
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	РегламентированныеОтчеты.Ссылка,
	                      |	РегламентированныеОтчеты.ИсточникОтчета
	                      |ИЗ
	                      |	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ТИПЗНАЧЕНИЯ(ЖурналОтчетовСтатусы.Ссылка) КАК ТипСсылки,
	                      |	ЖурналОтчетовСтатусы.НаименованиеОтчета КАК Наименование,
	                      |	ТаблицаИсточникиОтчета.ИсточникОтчета КАК ИсточникОтчета
	                      |ПОМЕСТИТЬ ТаблицаЖурналОтчетовСтатусы
	                      |ИЗ
	                      |	РегистрСведений.ЖурналОтчетовСтатусы КАК ЖурналОтчетовСтатусы
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИсточникиОтчета КАК ТаблицаИсточникиОтчета
	                      |		ПО ЖурналОтчетовСтатусы.Ссылка = ТаблицаИсточникиОтчета.Ссылка
	                      |ГДЕ
	                      |	НЕ ЖурналОтчетовСтатусы.Ссылка ЕСТЬ NULL
	                      |	И &УсловиеОтбора
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаЖурналОтчетовСтатусы.ТипСсылки КАК ТипСсылки,
	                      |	ТаблицаЖурналОтчетовСтатусы.Наименование КАК Наименование,
	                      |	ТаблицаЖурналОтчетовСтатусы.ИсточникОтчета КАК ИсточникОтчета
	                      |ИЗ
	                      |	ТаблицаЖурналОтчетовСтатусы КАК ТаблицаЖурналОтчетовСтатусы
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование,
	                      |	ИсточникОтчета");
	
	Если Организации = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора","Истина");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументов","Истина");
	Иначе
		Запрос.УстановитьПараметр("Организации", Организации);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора","ЖурналОтчетовСтатусы.Организация В(&Организации)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДокументов","РегламентированныйОтчет.Организация В(&Организации)");
	КонецЕсли;
	
	ТаблицаСозданных = Запрос.Выполнить().Выгрузить();
	ТаблицаСозданных.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	КоличествоСтрок = ТаблицаСозданных.Количество();
	
	ЗагруженныеОтчеты = Новый Соответствие;
	
	Для Инд = 1 По КоличествоСтрок Цикл
		ОбрИндекс = КоличествоСтрок - Инд;
		СтрокаТаблицы = ТаблицаСозданных[ОбрИндекс];
		Если СтрокаТаблицы.ТипСсылки = Null ИЛИ СтрокаТаблицы.ТипСсылки = Неопределено Тогда
			ТаблицаСозданных.Удалить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		МетаОтчет = Метаданные.НайтиПоТипу(СтрокаТаблицы.ТипСсылки);
		Если МетаОтчет <> Неопределено Тогда
			СтрокаТаблицы.ПолноеИмя = МетаОтчет.ПолноеИмя();
			Если СтрокаТаблицы.ПолноеИмя = "Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов" Тогда
				ЗагруженныеОтчеты.Вставить(СтрокаТаблицы.Наименование, СтрокаТаблицы);
			ИначеЕсли СтрокаТаблицы.ПолноеИмя = "Справочник.МакетыПенсионныхДел"
				ИЛИ СтрокаТаблицы.ПолноеИмя = "Справочник.ЗаявлениеОНазначенииПенсии" Тогда
				СтрокаТаблицы.Наименование = Строка(СтрокаТаблицы.ТипСсылки);
			КонецЕсли;
		Иначе
			ТаблицаСозданных.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементЗагруженныйОтчет Из ЗагруженныеОтчеты Цикл
		Инд = ТаблицаСозданных.Индекс(ЭлементЗагруженныйОтчет.Значение);
		
		Если Инд >= 0 И Инд < ТаблицаСозданных.Количество() - 1 Тогда
			СледующаяСтрокаТаблицы = ТаблицаСозданных[Инд + 1];
			Если СледующаяСтрокаТаблицы.Наименование = ЭлементЗагруженныйОтчет.Ключ
			   И СледующаяСтрокаТаблицы.ПолноеИмя = "Документ.РегламентированныйОтчет" Тогда
				
				ТаблицаСозданных.Удалить(ЭлементЗагруженныйОтчет.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаСозданных;
	
КонецФункции

// Возвращает таблицу, содержащую доступные регламентированные отчеты, ограниченные переданным отбором.
//
// Параметры:
//   Отбор - Массив - массив имен отчетов.
//
// Возвращаемое значение:
//   ТаблицаЗначений - доступные регламентированные отчеты, ограниченные переданным отбором.
//
Функция ТаблицаДоступныеРегламентированныеОтчеты(Отбор) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(РегламентированныеОтчеты.Наименование КАК СТРОКА(255)) КАК НаименованиеОтчета,
	|	РегламентированныеОтчеты.Ссылка КАК СсылкаВидОтчета,
	|	РегламентированныеОтчеты.ИсточникОтчета КАК ИсточникОтчета
	|ИЗ
	|	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СкрытыеРегламентированныеОтчеты КАК СкрытыеРегламентированныеОтчеты
	|		ПО (СкрытыеРегламентированныеОтчеты.РегламентированныйОтчет = РегламентированныеОтчеты.Ссылка)
	|ГДЕ
	|	СкрытыеРегламентированныеОтчеты.РегламентированныйОтчет ЕСТЬ NULL
	|	И РегламентированныеОтчеты.ИсточникОтчета В(&Отбор)
	|	И НЕ РегламентированныеОтчеты.ЭтоГруппа");
	
	Запрос.УстановитьПараметр("Отбор", Отбор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает соответствие с показателями автозаполнения бухгалтерской отчетности.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, по которой рассчитываются сведения.
//   ДатаНачала - Дата - начало периода, за который расчитываются сведения. Приводится к началу года.
//   ДатаОкончания - Дата - конец периода, за который расчитываются сведения. Приводится к концу месяца,
//                          или к концу года от ДатаНачала, если годы не совпадают.
//   ЗаполнятьБаланс - Булево - признак заполнения баланса.
//
// Возвращаемое значение:
//   Соответствие - показатели автозаполнения бухгалтерской отчетности.
//
Функция ПоказателиАвтозаполненияБухгалтерскойОтчетности(Организация, ДатаНачала, ДатаОкончания, ЗаполнятьБаланс = Истина) Экспорт
	
	РезультатАвтозаполнения = Новый Соответствие;
	
	// Бухгалтерский баланс.
	СтрокиОтчета = "1110, 1120, 1130, 1140, 1150, 1160, 1170, 1180, 1190,
	               |1210, 1220, 1230, 1240, 1250, 1260,
	               |1310, 1320, 1340, 1350, 1360, 1370,
	               |1410, 1420,
	               |1510, 1520, 1530, 1540, 1550";
	ИнициализироватьПоказателиПоВекторам(РезультатАвтозаполнения, СтрокиОтчета, "3, 4, 5");
	
	// Отчет о финансовых результатах.
	СтрокиОтчета = "2110, 2120, 2210, 2220, 2310, 2320, 2330, 2340, 2350,
	               |2410, 2421, 2430, 2450, 2460, 2510";
	ИнициализироватьПоказателиПоВекторам(РезультатАвтозаполнения, СтрокиОтчета, "3, 4");
	
	НачалоПериодаОтчета = НачалоГода(ДатаНачала);
	КонецПериодаОтчета = КонецМесяца(Макс(ДатаНачала, ДатаОкончания));
	КонецПериодаОтчета = Мин(КонецГода(НачалоПериодаОтчета), КонецПериодаОтчета);
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура;
	
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ГруппаОрганизаций", Новый Массив);
	
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета", НачалоПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета", КонецПериодаОтчета);
	
	СтруктураОтчета = Новый Структура;
	СтруктураОтчета.Вставить("ИдентификаторАвтозаполнения", "Баланс_2012Кв4_3");
	
	ПараметрыОтчета.Вставить("СтруктураОтчета", Новый Структура("Баланс", СтруктураОтчета));
	
	ОрганизацияПрименяетЕНВД = РегламентированнаяОтчетностьПереопределяемый.ПлательщикЕНВД(Организация, КонецПериодаОтчета);
	ПараметрыОтчета.Вставить("ПрименениеЕНВД", ОрганизацияПрименяетЕНВД);
	
	ДеревоНастроекСтрокРасшифровки = Новый ДеревоЗначений;
	ДеревоНастроекСтрокРасшифровки.Колонки.Добавить("ИмяОбластиДопСтроки");
	
	ПараметрыОтчета.Вставить("СоставДополнительныхСтрокБаланс", ДеревоНастроекСтрокРасшифровки.Скопировать());
	ПараметрыОтчета.Вставить("СоставДополнительныхСтрокОПУ", ДеревоНастроекСтрокРасшифровки.Скопировать());
	
	ПараметрыОтчета.Вставить("СтруктураМногострочныхЧастей", Неопределено);
	
	ПараметрыОтчета.Вставить("ЗаполнятьБаланс",     ЗаполнятьБаланс);
	ПараметрыОтчета.Вставить("ЗаполнятьОФР",        Истина);
	ПараметрыОтчета.Вставить("ЗаполнятьОИК",        Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьОДДС",       Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения1", Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения2", Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения4", Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения5", Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения6", Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения7", Ложь);
	ПараметрыОтчета.Вставить("ЗаполнятьПояснения8", Ложь);
	
	ПараметрыОтчета.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	Контейнер = Новый Структура();
	Контейнер.Вставить("Баланс",        Новый Структура());
	Контейнер.Вставить("ФормаОтчета",   Новый Структура());
	Контейнер.Вставить("ОИК",           Новый Структура());
	Контейнер.Вставить("ОДДС",          Новый Структура());
	Контейнер.Вставить("ОЦИПС",         Новый Структура());
	Контейнер.Вставить("РасчетАктивов", Новый Структура());
	Контейнер.Вставить("Пояснения1",    Новый Структура());
	Контейнер.Вставить("Пояснения2",    Новый Структура());
	Контейнер.Вставить("Пояснения3",    Новый Структура());
	Контейнер.Вставить("Пояснения4",    Новый Структура());
	Контейнер.Вставить("Пояснения5",    Новый Структура());
	Контейнер.Вставить("Пояснения6",    Новый Структура());
	Контейнер.Вставить("Пояснения7",    Новый Структура());
	Контейнер.Вставить("Пояснения8",    Новый Структура());
	Контейнер.Вставить("Пояснения9",    Новый Структура());
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьПоказателиАвтозаполненияБухгалтерскойОтчетности(ПараметрыОтчета, Контейнер);
	
	ДанныеАвтозаполнения = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ДанныеАвтозаполнения <> Неопределено Тогда
		Для Каждого ЭлементРезультата Из РезультатАвтозаполнения Цикл
			ИмяЭлемента = ЭлементРезультата.Ключ;
			
			Префикс = "П000100";
			КодСтроки = Лев(ИмяЭлемента, 4);
			КодПериода = Прав(ИмяЭлемента, 1);
			Постфикс = Формат(Число(КодПериода) + 1, "ЧЦ=2; ЧВН=");
			
			ИмяПоказателя = Префикс + КодСтроки + Постфикс;
			
			Если Лев(ИмяЭлемента, 1) = "1" Тогда
				ИмяРаздела = "Баланс";
			Иначе
				ИмяРаздела = "ФормаОтчета";
			КонецЕсли;
			
			Если ДанныеАвтозаполнения.Контейнер[ИмяРаздела].Свойство(ИмяПоказателя) Тогда
				РезультатАвтозаполнения.Вставить(ИмяЭлемента, ДанныеАвтозаполнения.Контейнер[ИмяРаздела][ИмяПоказателя]);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат РезультатАвтозаполнения;
	
КонецФункции

// Возвращает признак доступности для просмотра формы регламентированной отчетности
// текущему пользователю.
//
// Возвращаемое значение:
//   Булево - признак доступности для просмотра формы регламентированной отчетности
//            текущему пользователю.
//
Функция ДоступнаФормаРегламентированнаяОтчетностьТекущемуПользователю() Экспорт
	
	Если ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.РегламентированнаяОтчетность) Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Добавляет в форме регламентированного отчета кнопку ("скрепку")
// для открытия формы с присоединенными файлами.
//
// Параметры:
//  Форма - УправляемаяФорма - форма регламентированного отчета.
//
Процедура ДобавитьКнопкуПрисоединенныеФайлы(Форма) Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		
		Если СтрНайти(Форма.ИмяФормы, "Отчет.РегламентированныйОтчет") > 0
		 ИЛИ СтрНайти(Форма.ИмяФормы, "Отчет.РегламентированноеУведомление") > 0 Тогда
			
			ИмяКоманды = "ПрисоединенныеФайлы";
			
			КомандаПрисоединенныеФайлы = Форма.Команды.Найти(ИмяКоманды);
			
			Если ТипЗнч(КомандаПрисоединенныеФайлы) = Тип("КомандаФормы") Тогда
				Возврат;
			КонецЕсли;
			
			КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
			КомандаФормы.Действие = "Подключаемый_ОткрытьПрисоединенныеФайлы";
			КомандаФормы.Заголовок = "Присоединенные файлы";
			КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
			КомандаФормы.Отображение = ОтображениеКнопки.Картинка;
			КомандаФормы.Картинка = БиблиотекаКартинок.Скрепка;
			
			// Кнопка "со скрепкой" добавляется в конец командной панели формы.
			Группа = Форма.Элементы.Вставить("ГруппаПрисоединенныеФайлы",
			Тип("ГруппаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
			Группа.Вид = ВидГруппыФормы.ГруппаКнопок;
			
			Кнопка = Форма.Элементы.Добавить("ПрисоединенныеФайлы",
				Тип("КнопкаФормы"), Форма.Элементы.ГруппаПрисоединенныеФайлы);
			Кнопка.ИмяКоманды = ИмяКоманды;
			Кнопка.Заголовок = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает признак наличия файлов, присоединенных к объекту.
//
// Параметры:
//   ВладелецФайлов - ДокументСсылка, СправочникСсылка - ссылка на объект в регистре сведений "Журнал
//                    отчетов статусы" или регистре сведений "Журнал отправок в контролирующие органы".
//
Функция ЕстьФайлыПрисоединенныеКОбъекту(ВладелецФайлов) Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяРегистраСведенийНФ = "НаличиеФайлов";
	
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистраСведенийНФ) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОтборНФ = Новый Структура("ОбъектСФайлами", ВладелецФайлов);
	
	ВыборкаНФ = РегистрыСведений[ИмяРегистраСведенийНФ].Выбрать(ОтборНФ);
	
	Если ВыборкаНФ.Следующий() Тогда
		Если ВыборкаНФ.ОбъектСФайлами <> Неопределено Тогда // обход ошибки платформы
			Возврат ВыборкаНФ.ЕстьФайлы;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область РучнойВводСтатусовОтправки

// Сохраняет статус отправки, установленный вручную в форме регламентированного отчета.
// Предназначена для записи в регистр сведений "Журнал отчетов статусы" только по ссылкам
// типа "ДокументСсылка.РегламентированныйОтчет".
//
// Параметры:
//   Форма - УправляемаяФорма - форма регламентированного отчета.
//
Процедура СохранитьСтатусОтправкиРеглОтчета(Форма) Экспорт
	
	ВыборкаЖОС = РегистрыСведений.ЖурналОтчетовСтатусы.Выбрать(
	Новый Структура("Ссылка", Форма.СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка));
	
	ЭтоОтчетМинобороны = Ложь; // ДЕНЬГИ Форма.СтруктураРеквизитовФормы.мСохраненныйДок.ИсточникОтчета = "РегламентированныйОтчетИсполнениеКонтрактовГОЗ";
	// ДЕНЬГИ
	КонтроллирующийОрган = Неопределено;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
	Если ВыборкаЖОС.Следующий() Тогда
		
		Если РегламентированнаяОтчетностьКлиентСервер.ОбъектНеОтправлялсяЧерез1СОтчетность(
			ВыборкаЖОС.СостояниеСдачиОтчетности) ИЛИ
			ЭтоОтчетМинобороны Тогда
			
			СтатусыОбъектов
				= РегламентированнаяОтчетностьКлиентСервер.СтатусыОбъектовРеглОтчетностиПриРучномВводе(Форма, КонтроллирующийОрган);
			
			ТекСтатус = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1'"), Форма.Элементы.НаименованиеЭтапа.Заголовок);
			
			Если ЭтоОтчетМинобороны И ТекСтатус = "Передано в Минобороны" Тогда
				ТекСтатус = "Передано";
			КонецЕсли; 
			
			Если СтатусыОбъектов.Найти(ТекСтатус) <> Неопределено ИЛИ ЭтоОтчетМинобороны Тогда
				
				ЗаписьЖОС = ВыборкаЖОС.ПолучитьМенеджерЗаписи();
				ЗаписьЖОС.Статус = ТекСтатус;
				ЗаписьЖОС.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет статус отправки, установленный вручную в форме уведомления о спецрежимах налогообложения.
// Предназначена для записи в регистр сведений "Журнал отправок в контролирующие органы" только по
// ссылкам типа "ДокументСсылка.УведомлениеОСпецрежимахНалогообложения".
//
// Параметры:
//   Форма - УправляемаяФорма - форма уведомления о спецрежимах налогообложения.
//
Процедура СохранитьСтатусОтправкиУведомления(Форма) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

// Возвращает статус отправки регламентированного отчета по данным регистра сведений
// "Журнал отчетов статусы" только по ссылкам типа "ДокументСсылка.РегламентированныйОтчет".
//
// Параметры:
//  РеглОтчет: ДокументСсылка.РегламентированныйОтчет - ссылка на объект
//             в регистре сведений "Журнал отчетов статусы".
//
// Возвращаемое значение:
//  Строка - статус отправки.
//
Функция СохраненныйСтатусОтправкиРеглОтчета(РеглОтчет) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЖурналОтчетовСтатусы.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЖурналОтчетовСтатусы КАК ЖурналОтчетовСтатусы
	|ГДЕ
	|	ЖурналОтчетовСтатусы.Организация = &Организация
	|	И ЖурналОтчетовСтатусы.Ссылка = &РеглОтчет";
	
	Запрос.УстановитьПараметр("Организация", РеглОтчет.Организация);
	Запрос.УстановитьПараметр("РеглОтчет", РеглОтчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает статус отправки уведомления о спецрежимах налогообложения по данным
// регистра сведений "Журнал отправок в контролирующие органы" только по ссылкам типа
// "ДокументСсылка.УведомлениеОСпецрежимахНалогообложения".
//
// Параметры:
//  Уведомление: ДокументСсылка.УведомлениеОСпецрежимахНалогообложения - ссылка на объект
//               в регистре сведений "Журнал отправок в контролирующие органы".
//
// Возвращаемое значение:
//  Строка - статус отправки.
//
Функция СохраненныйСтатусОтправкиУведомления(Уведомление) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЖурналОтправокВКонтролирующиеОрганы.СтатусОтправки КАК СтатусОтправки
	|ИЗ
	|	РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы КАК ЖурналОтправокВКонтролирующиеОрганы
	|ГДЕ
	|	ЖурналОтправокВКонтролирующиеОрганы.Организация = &Организация
	|	И ЖурналОтправокВКонтролирующиеОрганы.Ссылка = &Уведомление";
	
	Запрос.УстановитьПараметр("Организация", Уведомление.Организация);
	Запрос.УстановитьПараметр("Уведомление", Уведомление);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтатусОтправки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
// Синтаксис процедуры ДобавитьКомандыПечати см. в документации к подсистеме.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	

КонецПроцедуры

#Область Используется1СОтчетность

// Функция возвращает признак использования отправки регламентированной отчетности.
//
// Возвращаемое значение:
//  Истина - отправка регл. отчетности выполняется в стандартном режиме (при подключенном сервисе "1С-Отчетность");
//  Ложь   - отправка регл. отчетности выполняется через DataTransfer БТС.
//
Функция Используется1СОтчетность() Экспорт
	
	ПризнакИспользования = Истина;
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьПризнакИспользования1СОтчетности(ПризнакИспользования);
	
	Возврат ПризнакИспользования;
	
КонецФункции

#КонецОбласти

// Возвращает адрес в формате 9-ти запятых.
//
// Параметры:
//   Запись - СправочникТабличнаяЧастьСтрока.Организации.КонтактнаяИнформация,
//			  СправочникТабличнаяЧастьСтрока.ФизическоеЛицо.КонтактнаяИнформация
//				- контактная информация (например, см. УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта()).
//
// Возвращаемое значение:
//   Строка - адрес в формате 9-ти запятых.
//
Функция АдресВФормате9Запятых(Запись) Экспорт
	
	Если СтрЧислоСтрок(Запись.ЗначенияПолей) = 1
	   И СтрЧислоВхождений(Запись.ЗначенияПолей, "КонтактнаяИнформация") = 2 Тогда
		
		СтруктураАдресаЗаписи = РаботаСАдресами.СведенияОбАдресе(Запись.ЗначенияПолей);
		
		СокращенияОбъектовАдресацииАдресаРФ = РегламентированнаяОтчетностьКлиентСервер.СокращенияОбъектовАдресацииАдресаРФ();
		
		Корпуса = "";
		ПредставлениеКорпуса = "";
		
		Если СтруктураАдресаЗаписи.Свойство("Корпуса", Корпуса) Тогда
									
			Для Индекс = 0 По Корпуса.Количество() - 1 Цикл
				
				Корпус = Корпуса[Индекс];
				
				ПредставлениеКорпуса = ПредставлениеКорпуса
					+ СокрЛП(?(Корпус.Свойство("ТипКорпуса") И Индекс > 0,
							НРег(СокращенияОбъектовАдресацииАдресаРФ[НРег(Корпус.ТипКорпуса)]), ""))
					+ " "
					+ СокрЛП(?(Корпус.Свойство("Номер"), Корпус.Номер, ""))
					+ " ";
				
			КонецЦикла;
			
		КонецЕсли;	
		
		Помещения = "";
		ПредставлениеПомещения = "";
		
		Если СтруктураАдресаЗаписи.Свойство("Помещения", Помещения) Тогда
									
			Для Индекс = 0 По Помещения.Количество() - 1 Цикл
				
				Помещение = Помещения[Индекс];
				
				ПредставлениеПомещения = ПредставлениеПомещения
					+ СокрЛП(?(Помещение.Свойство("ТипПомещения") И Индекс > 0,
							НРег(СокращенияОбъектовАдресацииАдресаРФ[НРег(Помещение.ТипПомещения)]), ""))
					+ " "
					+ СокрЛП(?(Помещение.Свойство("Номер"), Помещение.Номер, ""))
					+ " ";
				
			КонецЦикла;
			
		КонецЕсли;
		
		АдресБезКодаСтраны
			= СокрЛП(СтруктураАдресаЗаписи.Индекс)
			+ ","
			+ СокрЛП(СокрЛП(СтруктураАдресаЗаписи.Регион)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.РегионСокращение))
			+ ","
			+ СокрЛП(СокрЛП(СтруктураАдресаЗаписи.Район)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.РайонСокращение))
			+ ","
			+ СокрЛП(СокрЛП(СтруктураАдресаЗаписи.Город)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.ГородСокращение))
			+ ","
			+ СокрЛП(СокрЛП(СтруктураАдресаЗаписи.НаселенныйПункт)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.НаселенныйПунктСокращение)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.Территория)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.ТерриторияСокращение))
			+ ","
			+ СокрЛП(СокрЛП(СтруктураАдресаЗаписи.Улица)
			+ " "
			+ СокрЛП(СтруктураАдресаЗаписи.УлицаСокращение))
			+ ","
			+ СокрЛП(?(СтруктураАдресаЗаписи.Свойство("Здание")
				 	И СтруктураАдресаЗаписи.Здание.Свойство("Номер"),
				 	СтруктураАдресаЗаписи.Здание.Номер, ""))
			+ ","
			+ СокрЛП(ПредставлениеКорпуса)
			+ ","
			+ СокрЛП(ПредставлениеПомещения);
				 
		АдресБезКодаСтраны
			= АдресБезКодаСтраны
			+ ","
			+ ?(СтруктураАдресаЗаписи.Свойство("Здание")
		  	И СтруктураАдресаЗаписи.Здание.Свойство("ТипЗдания")
		  	И НЕ СокрЛП(СтруктураАдресаЗаписи.Здание.ТипЗдания) = "",
		  	НРег(СокрЛП(СтруктураАдресаЗаписи.Здание.ТипЗдания)), "")
			+ ","
			+ ?(СтруктураАдресаЗаписи.Свойство("Корпуса")
		  	И СтруктураАдресаЗаписи.Корпуса.Количество() > 0
		  	И СтруктураАдресаЗаписи.Корпуса[0].Свойство("ТипКорпуса")
		  	И НЕ СокрЛП(СтруктураАдресаЗаписи.Корпуса[0].ТипКорпуса) = "",
		  	НРег(СокрЛП(СтруктураАдресаЗаписи.Корпуса[0].ТипКорпуса)), "")
			+ ","
			+ ?(СтруктураАдресаЗаписи.Свойство("Помещения")
		  	И СтруктураАдресаЗаписи.Помещения.Количество() > 0
		  	И СтруктураАдресаЗаписи.Помещения[0].Свойство("ТипПомещения")
		  	И НЕ СокрЛП(СтруктураАдресаЗаписи.Помещения[0].ТипПомещения) = "",
		  	НРег(СокрЛП(СтруктураАдресаЗаписи.Помещения[0].ТипПомещения)), "");
		
	Иначе
			
		СтруктураАдреса	= Новый Структура(
			"Индекс, Регион, Район, Город, НаселенныйПункт, Улица, Дом, Корпус, Квартира, ТипДома, ТипКорпуса, ТипКвартиры");
		
		СтруктураАдресаЗаписи = РаботаСАдресами.ПредыдущаяСтруктураКонтактнойИнформацииXML(Запись.ЗначенияПолей);
		ЗаполнитьЗначенияСвойств(СтруктураАдреса, СтруктураАдресаЗаписи);
		
		АдресБезКодаСтраны
			= СокрЛП(СтруктураАдреса.Индекс)
			+ ","
			+ СокрЛП(СтруктураАдреса.Регион)
			+ ","
			+ СокрЛП(СтруктураАдреса.Район)
			+ ","
			+ СокрЛП(СтруктураАдреса.Город)
			+ ","
			+ СокрЛП(СтруктураАдреса.НаселенныйПункт)
			+ ","
			+ СокрЛП(СтруктураАдреса.Улица)
			+ ","
			+ СокрЛП(СтруктураАдреса.Дом)
			+ ","
			+ СокрЛП(СтруктураАдреса.Корпус)
			+ ","
			+ СокрЛП(СтруктураАдреса.Квартира);
		
		Если СтруктураАдреса.Свойство("ТипДома")
		   И СтруктураАдреса.Свойство("ТипКорпуса")
		   И СтруктураАдреса.Свойство("ТипКвартиры") Тогда
			
			АдресБезКодаСтраны
				= АдресБезКодаСтраны
				+ ","
				+ ?(СокрЛП(СтруктураАдреса.Дом) = "", "", НРег(СокрЛП(СтруктураАдреса.ТипДома)))
				+ ","
				+ ?(СокрЛП(СтруктураАдреса.Корпус) = "", "", НРег(СокрЛП(СтруктураАдреса.ТипКорпуса)))
				+ ","
				+ ?(СокрЛП(СтруктураАдреса.Квартира) = "", "", НРег(СокрЛП(СтруктураАдреса.ТипКвартиры)));
			
		КонецЕсли;												  					
		
	КонецЕсли;
	
	Если АдресБезКодаСтраны = ",,,,,,,,,,," Тогда
		
		Возврат ",,,,,,,,,";
		
	Иначе
		
		Возврат "643," + АдресБезКодаСтраны;
		
	КонецЕсли;
	
КонецФункции

// Возвращает признак уплаты налогоплательщиком единого налога на вмененный доход (ЕНВД) за указанный период.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   НачалоПериода - Дата - дата начала периода, за который нужно получить признак.
//   КонецПериода  - Дата - дата конца периода, за который нужно получить признак.
//
// Возвращаемое значение:
//   Истина - налогоплательщик уплачивает ЕНВД.
//   Ложь   - налогоплательщик не уплачивает ЕНВД.
//
Функция ЭтоПлательщикЕНВД(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Возврат РегламентированнаяОтчетностьПереопределяемый.ПлательщикЕНВД(Организация, КонецПериода, НачалоПериода);
	
КонецФункции

// Возвращает признак применения налогоплательщиком упрощенной системы налогообложения (УСН).
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   Период      - Дата - дата, на которую нужно определить применение УСН.
//
/// Возвращаемое значение:
//   Истина - налогоплательщик применяет УСН.
//   Ложь   - налогоплательщик не применяет УСН.
//
Функция ПрименяетсяУСН(Организация, Период) Экспорт
	
	СистемаНалогообложения = РегламентированнаяОтчетностьПереопределяемый.СистемаНалогообложения(Организация, Период);
	
	Возврат СистемаНалогообложения = "Упрощенная";
	
КонецФункции

// Функция возвращает ссылку на головную организацию.
//
// Возвращаемое значение: ссылка на элемент справочника организаций.
//
// Параметры:
// 	Организация - ссылка на элемент справочника организаций.
//
Функция ГоловнаяОрганизация(Организация) Экспорт
	
	ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ГоловнаяОрганизация");
	
	Если НЕ ЗначениеЗаполнено(Организация)
	 ИЛИ НЕ ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
	 
		Возврат Организация;
		
	Иначе
		
		Возврат ГоловнаяОрганизация; 
		
	КонецЕсли;

КонецФункции 

Функция ВерсияПрограммы() Экспорт
	
	Возврат СокрЛП(Метаданные.Версия);
	
КонецФункции

Функция НазваниеПрограммы() Экспорт
	
	Возврат РегламентированнаяОтчетностьПереопределяемый.КраткоеНазваниеПрограммы();
	
КонецФункции

Функция НазваниеИВерсияПрограммы() Экспорт
	
	Возврат ВРЕГ(Лев(НазваниеПрограммы() + " " + ВерсияПрограммы(), 40));
	
КонецФункции

Процедура ВставитьПоказательВСтруктуру(СтруктураПоказателей, ИмяПоказателя, ПризнакАвтозаполнения, ПризнакРасшифровки, ПризнакЗапретаРедактирования = Ложь) Экспорт	
	
	// Вставляем в структуру новый показатель.
	СтруктураПоказателей.Вставить(ИмяПоказателя, Новый Массив(3));	
	
	// Устанавливаем признак автозаполнения показателя.
	СтруктураПоказателей[ИмяПоказателя][0] = ПризнакАвтозаполнения;
	
	// Устанавливаем признак расшифровки показателя.
	СтруктураПоказателей[ИмяПоказателя][1] = ПризнакРасшифровки;
	
	// Устанавливаем признак запрета редактирования показателя.
	СтруктураПоказателей[ИмяПоказателя][2] = ПризнакЗапретаРедактирования;
	
КонецПроцедуры

Функция ПолучитьДокФизЛица(ФизЛицо, ДатаЗначения) Экспорт
	
	// ДЕНЬГИ
	Возврат Неопределено;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецФункции

Функция ПолучитьНомерПачкиВыгруженныхФайловПФР(Организация, Год) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НумераторПачекПФР.НомерПачки КАК НомерПачки
	                      |ИЗ
	                      |	РегистрСведений.НумераторПачекПФР КАК НумераторПачекПФР
	                      |ГДЕ
	                      |	НумераторПачекПФР.Организация = &Организация
	                      |	И НумераторПачекПФР.Год = &Год");
						  
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Год", Год);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат ?(НЕ ЗначениеЗаполнено(Выборка.НомерПачки), 0, Выборка.НомерПачки);
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
	
КонецФункции

Функция ПолучитьПоКодамРегистрациюВИФНС(Организация, КодНО, КПП = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	РегистрацииВНалоговомОргане.Ссылка
	               |ИЗ
	               |	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	               |ГДЕ
	               |	РегистрацииВНалоговомОргане.Владелец = &Организация
				   |	И РегистрацииВНалоговомОргане.Код = &КодНО
				   |	И РегистрацииВНалоговомОргане.ПометкаУдаления = &ПометкаУдаления";
				   
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);			   
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КодНО", КодНО);
	
	Если КПП <> Неопределено Тогда
		ТекстЗапроса = ТекстЗапроса + " И РегистрацииВНалоговомОргане.КПП = &КПП";
		Запрос.УстановитьПараметр("КПП", КПП);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СвойстваПрочихОтчетов(Ссылка) Экспорт
	
	ТаблицаОписанияОбъектовНеВходящихВБРО = ТаблицаОписанияОбъектовРегламентированнойОтчетности();
	СтрокаТаблицыОписания = ТаблицаОписанияОбъектовНеВходящихВБРО.Найти(ТипЗнч(Ссылка), "ТипОбъекта");
	
	ПараметрыОтчета = Новый Структура; // ДЕНЬГИ ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПараметрыОтображенияВЖурналеОтчетов();
	
	ПараметрыОтчета.Вставить("ДокСсылка",                Ссылка);
	ПараметрыОтчета.Вставить("НаименованиеОтчета",       СтрокаТаблицыОписания.Наименование);
	ПараметрыОтчета.Вставить("ВидКонтролирующегоОргана", СтрокаТаблицыОписания.ВидКонтролирующегоОргана);
	
	ОпределениеСвойстваОбъектаДляОтображенииВФормеОтчетность(Ссылка, ПараметрыОтчета);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

Функция СвойстваРегламентированногоОтчета(Ссылка) Экспорт
	
	ВидКонтролирующегоОргана = ВидКонтролирующегоОргана(Ссылка.ИсточникОтчета);
	
	ОрганизацияОтчета = Ссылка.Организация;

	ОтражаетсяВЖурналеОтчетов = Истина;
	
	// ДЕНЬГИ
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
	ПараметрыОтчета = Новый Структура; // ДЕНЬГИ ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ПараметрыОтображенияВЖурналеОтчетов();
	
	ПараметрыОтчета.Вставить("ДокСсылка",                "");
	ПараметрыОтчета.Вставить("НаименованиеОтчета",       "");
	ПараметрыОтчета.Вставить("ВидКонтролирующегоОргана", ВидКонтролирующегоОргана);
	ПараметрыОтчета.Вставить("КодКонтролирующегоОргана", "");
	ПараметрыОтчета.Вставить("ДатаНачалаОП",             "");
	ПараметрыОтчета.Вставить("ДатаОкончанияОП",          "");
	ПараметрыОтчета.Вставить("Организация",              ОрганизацияОтчета);
	ПараметрыОтчета.Вставить("СтатусОтправки",           "В работе");
	ПараметрыОтчета.Вставить("ПредставлениеВида",        "");
	ПараметрыОтчета.Вставить("ДатаСоздания",             "");
	ПараметрыОтчета.Вставить("Комментарий",              "");
	ПараметрыОтчета.Вставить("Банк",                     "");

	ПараметрыОтчета.Вставить("ОтражаетсяВЖурналеОтчетов", ОтражаетсяВЖурналеОтчетов);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

Процедура УстановитьНомерПачкиВыгруженныхФайловПФР(Организация, Год, НомерПачки) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

#Область ИнтерфейсВзаимодействияСКонфигурациямиПотребителями

// Функция возвращает массив ссылок на сохраненные первичные регламентированные отчеты заданного вида
// для указанной организации за нужный отчетный период. Ссылки на регл. отчеты отсортированы
// в хронологическом порядке по убыванию.
//
// Возвращаемое значение: массив ссылок.
//
// Параметры:
//	ИсточникОтчета - строка с наименованием регламентированного отчета (совпадает с именем объекта метаданных).
// 	Организация    - ссылка на элемент справочника организаций.
//  ДатаОкончания  - дата окончания отчетного периода (правая граница отчетного периода).
//  КорректирующийОтчет - если значение данного параметра = Истина, то отчет является корректирующим.
//  ФормаОтчета - строка с идентификатором формы отчета
//
// Пример:
// 	РегламентированнаяОтчетность.ПолучитьСсылкуНаРеглОтчет("РегламентированныйОтчетРСВ1", Организация, '20120331');
//
Функция ПолучитьСсылкуНаРеглОтчет(ИсточникОтчета, Организация, ДатаОкончания, КорректирующийОтчет = Ложь, РегистрацияВНалоговомОргане = Неопределено, ФормаОтчета = "") Экспорт
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане) Тогда
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацииВНалоговомОргане.Код
		|ПОМЕСТИТЬ НалоговыйОрган
		|ИЗ
		|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|ГДЕ
		|	РегистрацииВНалоговомОргане.Ссылка = &РегистрацияВНалоговомОргане";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегламентированныйОтчет.Дата,
	|	РегламентированныйОтчет.Вид,
	|	РегламентированныйОтчет.Ссылка
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ "
	+ ?(КорректирующийОтчет, "РегламентированныйОтчет.Вид > 0", "РегламентированныйОтчет.Вид = 0")
	+ " И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
	|	И РегламентированныйОтчет.ВыбраннаяФорма ПОДОБНО &ВыбраннаяФорма
	|	И РегламентированныйОтчет.Организация = &Организация
	|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
	|	И НЕ РегламентированныйОтчет.ПометкаУдаления"
	+ ?(ЗначениеЗаполнено(РегистрацияВНалоговомОргане), 
	" 	И РегламентированныйОтчет.КодНалоговогоОргана В
	|		(ВЫБРАТЬ
	|			НалоговыйОрган.Код
	|		ИЗ
	|			НалоговыйОрган)", "");
	
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(ФормаОтчета) Тогда
		ВыбраннаяФорма = ФормаОтчета;
	Иначе
		ВыбраннаяФорма = РегламентированнаяОтчетностьВызовСервера.ИмяФормыРеглОтчетаДействующейВОтчетномПериоде(ИсточникОтчета, ДатаОкончания);
		Если ВыбраннаяФорма = Неопределено Тогда
			ВыбраннаяФорма = "";
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИсточникОтчета", ИсточникОтчета);
	Запрос.УстановитьПараметр("ВыбраннаяФорма", ВыбраннаяФорма);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса.Сортировать("Дата Убыв, Вид Убыв, Ссылка Убыв", Новый СравнениеЗначений);
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция возвращает номер пачки регл. отчета РСВ-1.
//
// Возвращаемое значение: номер пачки регл. отчета РСВ-1.
//
// Параметры:
//  СсылкаНаСохрРеглОтчет - ссылка на сохраненный регламентированный отчет РСВ-1, номер пачки которого нужно получить.
//
Функция НомерПачкиРСВ1(СсылкаНаСохрРеглОтчет) Экспорт
	
	Возврат СсылкаНаСохрРеглОтчет.ПолучитьОбъект().НомерПачки;
	
КонецФункции

// Процедура возвращает структуру с табличными документами разделов 2.5 и 6 формы РСВ-1.
//
// Параметры:
//  СсылкаНаСохрРеглОтчет           - ссылка на сохраненный документ "РегламентированныйОтчет".
//  СтруктураРазделов               - структура:
//    ключ     - имя раздела;
//    значение - массив структур с полями:
//      Описание          - строка;
//      ТабличныйДокумент - табличный документ;
//  НумероватьСтраницы              - булево;
//  НомерПервойстраницыРаздела25    - число;
//  НомерПоследнейстраницыРаздела25 - число;
//  НомерПервойстраницыРаздела6     - число;
//  ОбщееКоличествоСтраницРаздела6  - число.
//
Процедура ПолучитьРаздел25иРаздел6ФормыРСВ1(СсылкаНаСохрРеглОтчет, СтруктураРазделов,
	НумероватьСтраницы = Ложь, НомерПервойстраницыРаздела25 = 0, НомерПоследнейстраницыРаздела25 = 0,
	НомерПервойстраницыРаздела6 = 0, ОбщееКоличествоСтраницРаздела6 = 0) Экспорт
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьРаздел25иРаздел6ФормыРСВ1(
		СсылкаНаСохрРеглОтчет, СтруктураРазделов, НумероватьСтраницы, НомерПервойстраницыРаздела25,
		НомерПоследнейстраницыРаздела25, НомерПервойстраницыРаздела6, ОбщееКоличествоСтраницРаздела6);
	
КонецПроцедуры

// Функция возвращает для формы РСВ-1 пустую структуру с ключами:
//   "Описание", "ТабличныйДокумент", "Идентификатор".
//
Функция ПустаяСтруктураДляРазделовФормыРСВ_1() Экспорт
	
	ПустаяСтруктура = Новый Структура;
	
	ПустаяСтруктура.Вставить("Описание");
	ПустаяСтруктура.Вставить("ТабличныйДокумент");
	ПустаяСтруктура.Вставить("Идентификатор");
	
	Возврат ПустаяСтруктура;
	
КонецФункции

// Функция возвращает для формы РСВ-1 структуру с ключами:
//   "СтраницыРаздела", "ПолучатьСтруктуруРаздела", "ПолучатьТабличныеДокументыРаздела".
//
Функция ОписаниеЗапрашиваемыхДанныхРазделаРСВ_1() Экспорт
	
	СтруктураОписание = Новый Структура;
	
	СтруктураОписание.Вставить("СтраницыРаздела",                   Новый Массив);
	СтруктураОписание.Вставить("ПолучатьСтруктуруРаздела",          Истина);
	СтруктураОписание.Вставить("ПолучатьТабличныеДокументыРаздела", Истина);
	
	Возврат СтруктураОписание;
	
КонецФункции

// Процедура устанавливает номер пачки регл. отчета РСВ-1.
//
// Параметры:
//  СсылкаНаСохрРеглОтчет - ссылка на сохраненный регламентированный отчет РСВ-1, номер пачки которого нужно установить.
//  НомерПачки            - номер пачки.
//
Процедура УстановитьНомерПачкиРСВ1(СсылкаНаСохрРеглОтчет, НомерПачки) Экспорт
	
	РеглОтчет = СсылкаНаСохрРеглОтчет.ПолучитьОбъект();
	
	РеглОтчет.Заблокировать();
	
	РеглОтчет.НомерПачки = НомерПачки;
	
	РеглОтчет.Записать();
	
	РеглОтчет.Разблокировать();
	
КонецПроцедуры

// Функция возвращает признак изменения данных отчета вручную.
//
// Возвращаемое значение: Истина - данные отчета изменены вручную
//                        Ложь   - данные отчета вручную не изменялись.
//
// Параметры:
//  СсылкаНаСохрРеглОтчет - ссылка на сохраненный регламентированный отчет РСВ-1,
//  для которого необходимо получить признак изменения данных.
//
Функция ДанныеОтчетаИзмененыВручную(СсылкаНаСохрРеглОтчет) Экспорт
	
	СписокСохранения = СсылкаНаСохрРеглОтчет.ДанныеОтчета.Получить();
	
	ДанныеОтчетаИзмененыВручную = Ложь;
	
	Если СписокСохранения.Свойство("ДанныеОтчетаИзмененыВручную") Тогда
		СписокСохранения.Свойство("ДанныеОтчетаИзмененыВручную", ДанныеОтчетаИзмененыВручную);
	КонецЕсли;
		
	Возврат ДанныеОтчетаИзмененыВручную;
			
КонецФункции

// Функция возвращает признак ведения персонифицированного учета во внешней программе.
//
// Возвращаемое значение:
//  Истина - персонифицированный учет ведется во внешней программе;
//  Ложь   - персонифицированный учет ведется в конфигурации.
//
Функция ПерсонифицированныйУчетВедетсяВоВнешнейПрограмме() Экспорт
	
	ПризнакПерсУчета = Ложь;
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьПризнакВеденияПерсонифицированногоУчетаВоВнешнейПрограмме(ПризнакПерсУчета);
	
	Возврат ПризнакПерсУчета;
	
КонецФункции

// Функция возвращает массив ссылок на элементы справочника "РегистрацииВНалоговомОргане".
//
// Возвращаемое значение: массив ссылок на элементы справочника "РегистрацииВНалоговомОргане".
//
// Параметры:
//  Организация     - ссылка на элемент справочника организаций.
//  ПараметрыОтбора - структура (необязательный):
//    ключ "КодНО" (необязательный), значение - код налогового органа (строка);
//    ключ "КПП"   (необязательный), значение - КПП (строка);
//    ключ "ОКТМО" (необязательный), значение - код по ОКТМО (строка);
//    ключ "КодыПричиныПостановкиНаУчет" (необязательный), значение - символы в КПП на 5-6 позициях (массив).
//
Функция РегистрацииОрганизацииВНалоговомОргане(Организация, ПараметрыОтбора = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникИФНС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РегистрацииВНалоговомОргане КАК СправочникИФНС
		|ГДЕ
		|	(СправочникИФНС.Владелец = &Организация ИЛИ СправочникИФНС.Владелец = &ГоловнаяОрганизация)
		|	И НЕ СправочникИФНС.ПометкаУдаления
		|";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация(Организация));
	
	Регистрации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда
		КолРегистраций = Регистрации.Количество();
		Для Инд = 0 По КолРегистраций - 1 Цикл
			ОбрИнд = КолРегистраций - 1 - Инд;
			Если ПараметрыОтбора.Свойство("КодНО") Тогда
				Если СокрЛП(Регистрации[ОбрИнд].Код) <> СокрЛП(ПараметрыОтбора.КодНО) Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыОтбора.Свойство("КПП") Тогда
				Если ВРег(СокрЛП(Регистрации[ОбрИнд].КПП)) <> ВРег(СокрЛП(ПараметрыОтбора.КПП)) Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыОтбора.Свойство("КодыПричиныПостановкиНаУчет") Тогда
				Если ПараметрыОтбора.КодыПричиныПостановкиНаУчет.Найти(
					Сред(ВРег(СокрЛП(Регистрации[ОбрИнд].КПП)), 5, 2)) = Неопределено Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если ПараметрыОтбора.Свойство("ОКТМО") Тогда
				Если СокрЛП(Регистрации[ОбрИнд].КодПоОКТМО) <> СокрЛП(ПараметрыОтбора.ОКТМО) Тогда
					Регистрации.Удалить(ОбрИнд);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Регистрации;
	
КонецФункции

// Функция возвращает структуру с данными регламентированного отчета.
// Ключ структуры совпадает с наименованием раздела регл. отчета,
// значение структуры содержит данные раздела регл. отчета.
// Все разделы регл. отчета подразделяются на два вида: одностраничные, многостраничные.
// Одностраничные разделы имеют тип Структура, в которой содержатся имена показателей
// вместе с их значениями.
// Многостраничные разделы имеют тип ТаблицаЗначений. Каждый элемент таблицы значений
// - это отдельная страница раздела. Данные страницы содержатся в колонке Данные
// с типом Структура, в которой содержатся имена показателей вместе с их значениями.
//
// Возвращаемое значение: структура с данными регл. отчета.
//
// Параметры:
//  СсылкаНаСохрРеглОтчет - ссылка на сохраненный регламентированный отчет, данные которого нужно получить.
//
Функция ПолучитьДанныеРеглОтчета(СсылкаНаСохрРеглОтчет) Экспорт
	
	Перем ДанныеМногостраничныхРазделов;
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиРеглОтчета;
	
	ДанныеРеглОтчета = Новый Структура;
	
	Если СсылкаНаСохрРеглОтчет.ИсточникОтчета = "РегламентированныйОтчетРСВ1"
		И Год(СсылкаНаСохрРеглОтчет.ДатаОкончания) >= 2015 Тогда
		
		ПризнакАктуальностиФормы = РегламентированнаяОтчетностьВызовСервера.ФормаРеглОтчетаДействуетВОтчетномПериоде(
			СсылкаНаСохрРеглОтчет.ИсточникОтчета, СсылкаНаСохрРеглОтчет.ДатаОкончания, СсылкаНаСохрРеглОтчет.ВыбраннаяФорма);
		
	Иначе
		
		ПризнакАктуальностиФормы = (СсылкаНаСохрРеглОтчет.ВыбраннаяФорма
			= РегламентированнаяОтчетностьВызовСервера.ИмяФормыРеглОтчетаДействующейВОтчетномПериоде(
			СсылкаНаСохрРеглОтчет.ИсточникОтчета, СсылкаНаСохрРеглОтчет.ДатаОкончания));
		
	КонецЕсли;
	
	ДанныеРеглОтчета.Вставить("ФормаРеглОтчетаДействуетВТекущемОтчетномПериоде", ПризнакАктуальностиФормы);
	
	ДанныеРеглОтчета.Вставить("Организация", СсылкаНаСохрРеглОтчет.Организация.Ссылка);
	
	ДанныеРазделовРеглОтчета = Новый Структура;
	
	СписокСохранения = СсылкаНаСохрРеглОтчет.ДанныеОтчета.Получить();
	
	Если СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиРеглОтчета) Тогда
		
		ВосстановитьСведенияОбОрганизацииИзТитульногоЛистаСтарогоОбразцаФормыРСВ1(ПоказателиРеглОтчета, ПоказателиРеглОтчета["ПолеТабличногоДокументаТитульный"]);
		
		Для Каждого ЭлементСтруктуры Из ПоказателиРеглОтчета Цикл
			
			ДанныеРазделовРеглОтчета.Вставить(СтрЗаменить(ЭлементСтруктуры.Ключ, "ПолеТабличногоДокумента", ""), ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокСохранения.Свойство("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов) Тогда
		
		Если ДанныеМногостраничныхРазделов.Свойство("Раздел12") Тогда
			
			КонвертироватьДанныеРаздела12СтарогоОбразцаФормыРСВ1(ДанныеМногостраничныхРазделов.Раздел12);
			
		КонецЕсли;
		
		Если ДанныеМногостраничныхРазделов.Свойство("Раздел2") Тогда
			
			КонвертироватьДанныеРаздела2СтарогоОбразцаФормыРСВ1(ДанныеМногостраничныхРазделов.Раздел2);
			
		КонецЕсли;
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногостраничныхРазделов Цикл
			
			ДанныеРазделовРеглОтчета.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокСохранения.Свойство("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			Для Каждого РазделРеглОтчета Из ПоказателиРеглОтчета Цикл
				
				Для Каждого ПоказательРеглОтчета Из РазделРеглОтчета.Значение Цикл
					
					Если Лев(ПоказательРеглОтчета.Ключ, 11) = ЭлементСтруктуры.Ключ Тогда
						
						ДанныеРазделовРеглОтчета.Вставить(СтрЗаменить(РазделРеглОтчета.Ключ, "ПолеТабличногоДокумента", "") + "_ДанныеДопСтрок", ЭлементСтруктуры.Значение);
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеРеглОтчета.Вставить("ДанныеРазделовРеглОтчета", ДанныеРазделовРеглОтчета);
	
	Если СсылкаНаСохрРеглОтчет.ПолучитьОбъект().ИсточникОтчета = "РегламентированныйОтчетРСВ1" Тогда
		
		ДанныеРеглОтчета.Вставить("КорректирующаяФорма", СсылкаНаСохрРеглОтчет.ПолучитьОбъект().Вид > 0);
		
	КонецЕсли;
	
	Возврат ДанныеРеглОтчета;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Диспетчер запуска основной процедуры заполнения регламентированного отчета в фоне.
//
// Параметры:
//   ПараметрыОтчета - Структура - параметры вызова основной функции заполнения отчета:
//     * ИДОтчета - Строка     - идентификтор отчета;
//     * ИДРедакцииОтчета      - Строка - идентификатор формы отчета;
//     * ПараметрыОтчета       - Структура - параметры заполнения отчета;
//     * Контейнер - Структура - показатели отчета по разделам;
//   НеиспользуемыйАдресХранилища - Строка - параметр необходим для совместимости с БСП.
//
Процедура ЗаполнитьОтчетВФоне(ПараметрыОтчета, НеиспользуемыйАдресХранилища) Экспорт
	
	РегламентированнаяОтчетностьПереопределяемый.ЗаполнитьОтчет(
		ПараметрыОтчета.ИДОтчета, ПараметрыОтчета.ИДРедакцииОтчета,
		ПараметрыОтчета.ПараметрыОтчета, ПараметрыОтчета.Контейнер);
	
КонецПроцедуры

Процедура УдалитьСтарыеПечатныеБланкиРегламентированныхОтчетов() Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПечатныеБланкиРегламентированныхОтчетов.РегламентированныйОтчет КАК РегламентированныйОтчет,
	|	ПечатныеБланкиРегламентированныхОтчетов.УникальныйИдентификатор КАК УникальныйИдентификатор
	|ИЗ
	|	РегистрСведений.ПечатныеБланкиРегламентированныхОтчетов КАК ПечатныеБланкиРегламентированныхОтчетов
	|ГДЕ
	|	ПечатныеБланкиРегламентированныхОтчетов.ДатаЗаписи < &ДатаЗаписи";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ДатаЗаписи", ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ЗаписьРегистраСведений = РегистрыСведений.ПечатныеБланкиРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
		
		Выборка = РезультатЗапроса.Выбрать();
						
		Пока Выборка.Следующий() Цикл
			
			ЗаписьРегистраСведений.РегламентированныйОтчет = Выборка.РегламентированныйОтчет;
			ЗаписьРегистраСведений.УникальныйИдентификатор = Выборка.УникальныйИдентификатор;
			
			ЗаписьРегистраСведений.Удалить();
			
		КонецЦикла;
					
	КонецЕсли;   
	
КонецПроцедуры

#Область ОбработкаАдресаВФорматеФИАС

// Возвращает сведения об адресе в виде отдельных частей адреса и различных кодов в формате ФИАС.
//
// Параметры:
//   Адрес - Строка - адрес во внутреннем формате JSON.
//   ДополнительныеПараметры - Структура (необязательный параметр):
//        * ВерсияАдреса     - Число - внутренняя версия адреса (необязательное свойство):
//                                     1 - возвращаемое свойство "МуниципальныйРайонВид" не может быть равно "4";
//                                     2 - возвращаемое свойство "МуниципальныйРайонВид" может быть равно "4".
//
// Возвращаемое значение:
//   Структура - сведения об адресе:
//        * ИдентификаторАдресногоОбъекта - УникальныйИдентификатор - идентификационный код дома (строения) адресного
//                                          объекта (например, для "Москва г., Дмитровское ш., д.9" - это идентификатор
//                                          дома), а в случае, если идентификационный код дома (строения) адресного
//                                          объекта не задан - идентификационный код последнего адресного объекта
//                                          в иерархии адреса (например, для "Москва г., Дмитровское ш., д.9" - это
//                                          идентификатор улицы).
//        * Индекс                        - Строка - почтовый индекс.
//        * КодРегиона                    - Строка - код региона Российской Федерации.
//        * РегионСокращение              - Строка - сокращение региона.
//        * МуниципальныйРайонВид         - Строка - код ("1" - муниципальный район; "2" - городской округ;
//                                          "3" - внутригородская территория города федерального значения;
//                                          "4" - муниципальный округ).
//        * МуниципальныйРайон            - Строка - текстовое представление муниципального района.
//        * МуниципальныйРайонСокращение  - Строка - сокращение муниципального района.
//        * ПоселениеВид                  - Строка - код ("1" - городское поселение; "2" - сельское поселение;
//                                          "3" - межселенная территория в составе муниципального района;
//                                          "4" - внутригородской район городского округа).
//        * Поселение                     - Строка - текстовое представление поселения.
//        * ПоселениеСокращение           - Строка - сокращение поселения.
//        * НаселенныйПунктВид            - Строка - полное наименование сокращения населенного пункта.
//        * НаселенныйПункт               - Строка - текстовое представление населенного пункта.
//        * НаселенныйПунктСокращение     - Строка - сокращение населенного пункта.
//        * ТерриторияТип                 - Строка - полное наименование сокращения территории.
//        * Территория                    - Строка - текстовое представление территории.
//        * ТерриторияСокращение          - Строка - сокращение территории.
//        * УлицаТип                      - Строка - полное наименование сокращения улицы.
//        * Улица                         - Строка - текстовое представление улицы.
//        * УлицаСокращение               - Строка - сокращение улицы.
//        * Здания                        - Массив - содержит структуры (поля структуры: ЗданиеТип, ЗданиеНомер)
//                                          с перечнем зданий, сооружений, объектов незавершенного строительства.
//        * ПомещениеВЗданииТип           - Строка - тип помещения внутри здания, сооружения, машино-места.
//        * ПомещениеВЗданииНомер         - Строка - номер помещения внутри здания, сооружения, машино-места.
//        * ПомещениеВКвартиреТип         - Строка - тип помещения в пределах квартиры.
//        * ПомещениеВКвартиреНомер       - Строка - номер помещения в пределах квартиры.
//
Функция АдресВФорматеФИАС(Адрес, ДополнительныеПараметры = Неопределено) Экспорт
	
	ВерсияАдреса = 1;
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("ВерсияАдреса") Тогда
		ВерсияАдреса = ДополнительныеПараметры.ВерсияАдреса;
	КонецЕсли;
	
	ВозвращаемыйАдрес = Новый Структура;
	
	// Получение реквизитов адреса с сокращениями.
	//
	ДопПараметры = Новый Структура("КодыАдреса", Истина);
	
	СтруктураАдресаЗаписи = РаботаСАдресами.СведенияОбАдресе(Адрес, ДопПараметры);
	
	ОдноименныеСвойства = Новый Массив;
	ОдноименныеСвойства.Добавить("Индекс");
	ОдноименныеСвойства.Добавить("КодРегиона");
	ОдноименныеСвойства.Добавить("РегионСокращение");
	ОдноименныеСвойства.Добавить("МуниципальныйРайон");
	ОдноименныеСвойства.Добавить("МуниципальныйРайонСокращение");
	ОдноименныеСвойства.Добавить("Поселение");
	ОдноименныеСвойства.Добавить("ПоселениеСокращение");
	ОдноименныеСвойства.Добавить("НаселенныйПункт");
	ОдноименныеСвойства.Добавить("НаселенныйПунктСокращение");
	ОдноименныеСвойства.Добавить("Территория");
	ОдноименныеСвойства.Добавить("ТерриторияСокращение");
	ОдноименныеСвойства.Добавить("Улица");
	ОдноименныеСвойства.Добавить("УлицаСокращение");
	
	Для каждого ИмяСвойства Из ОдноименныеСвойства Цикл
		ВозвращаемыйАдрес.Вставить(ИмяСвойства,
		?(СтруктураАдресаЗаписи.Свойство(ИмяСвойства), СтруктураАдресаЗаписи[ИмяСвойства], ""));
	КонецЦикла;
	
	ЗначениеСвойства = "";
	СтруктураАдресаЗаписи.Свойство("ИдентификаторДома", ЗначениеСвойства);
	Если НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		СтруктураАдресаЗаписи.Свойство("ИдентификаторАдресногоОбъекта", ЗначениеСвойства);
	КонецЕсли;
	ВозвращаемыйАдрес.Вставить("ИдентификаторАдресногоОбъекта",
	?(ЗначениеЗаполнено(ЗначениеСвойства), ЗначениеСвойства, ""));
	
	ЗначениеСвойства = "";
	Если СтруктураАдресаЗаписи.Свойство("КодМуниципальногоРайона", ЗначениеСвойства) Тогда
		ВозможныеКодыМуниципальногоРайона = СтрРазделить("1,2,3,4", ",", Ложь);
		Если ВозможныеКодыМуниципальногоРайона.Найти(ЗначениеСвойства) = Неопределено Тогда
			ЗначениеСвойства = "";
		КонецЕсли;
	Иначе
		ЗначениеСвойства = "";
		Сокращение = НРег(СокрЛП(ВозвращаемыйАдрес.МуниципальныйРайонСокращение));
		Если Сокращение = "м.р-н" Тогда
			ЗначениеСвойства = "1";
		ИначеЕсли Сокращение = "г.о." Тогда
			ЗначениеСвойства = "2";
		ИначеЕсли Сокращение = "вн.тер." ИЛИ Сокращение = "вн.тер. г." Тогда
			ЗначениеСвойства = "3";
		ИначеЕсли Сокращение = "мун. окр." Тогда
			ЗначениеСвойства = "4";
		КонецЕсли;
	КонецЕсли;
	Если ВерсияАдреса = 1 И ЗначениеСвойства = "4" Тогда
		ЗначениеСвойства = "1";
	КонецЕсли;
	ВозвращаемыйАдрес.Вставить("МуниципальныйРайонВид", ЗначениеСвойства);
	
	ЗначениеСвойства = "";
	Если СтруктураАдресаЗаписи.Свойство("КодПоселения", ЗначениеСвойства) Тогда
		ВозможныеКодыПоселения = СтрРазделить("1,2,3,4", ",", Ложь);
		Если ВозможныеКодыПоселения.Найти(ЗначениеСвойства) = Неопределено Тогда
			ЗначениеСвойства = "";
		КонецЕсли;
	Иначе
		ЗначениеСвойства = "";
		Сокращение = НРег(СокрЛП(ВозвращаемыйАдрес.ПоселениеСокращение));
		Если Сокращение = "г. п." Тогда
			ЗначениеСвойства = "1";
		ИначеЕсли Сокращение = "с.п." Тогда
			ЗначениеСвойства = "2";
		ИначеЕсли Сокращение = "меж.тер." Тогда
			ЗначениеСвойства = "3";
		ИначеЕсли Сокращение = "вн.р-н" Тогда
			ЗначениеСвойства = "4";
		КонецЕсли;
	КонецЕсли;
	ВозвращаемыйАдрес.Вставить("ПоселениеВид", ЗначениеСвойства);
	
	Здания = Новый Массив;
	Здание = Неопределено;
	Если СтруктураАдресаЗаписи.Свойство("Здание", Здание) И ТипЗнч(Здание) = Тип("Структура") Тогда
		ЗданиеТип = Неопределено;
		Здание.Свойство("ТипЗдания", ЗданиеТип);
		ЗданиеНомер = Неопределено;
		Здание.Свойство("Номер", ЗданиеНомер);
		Если ЗначениеЗаполнено(ЗданиеТип) И ЗначениеЗаполнено(ЗданиеНомер) Тогда
			Здания.Добавить(Новый Структура("ЗданиеТип, ЗданиеНомер", ЗданиеТип, ЗданиеНомер));
		КонецЕсли;
	КонецЕсли;
	Корпуса = Неопределено;
	Если СтруктураАдресаЗаписи.Свойство("Корпуса", Корпуса) И ТипЗнч(Корпуса) = Тип("Массив") Тогда
		Для каждого Корпус Из Корпуса Цикл
			Если ТипЗнч(Корпус) = Тип("Структура") Тогда
				КорпусТип = Неопределено;
				Корпус.Свойство("ТипКорпуса", КорпусТип);
				КорпусНомер = Неопределено;
				Корпус.Свойство("Номер", КорпусНомер);
				Если ЗначениеЗаполнено(КорпусТип) И ЗначениеЗаполнено(КорпусНомер) Тогда
					Здания.Добавить(Новый Структура("ЗданиеТип, ЗданиеНомер", КорпусТип, КорпусНомер));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ВозвращаемыйАдрес.Вставить("Здания", Здания);
	
	Помещения = Неопределено;
	ПомещениеВЗданииТип   = "";
	ПомещениеВЗданииНомер = "";
	ПомещениеВКвартиреТип   = "";
	ПомещениеВКвартиреНомер = "";
	Если СтруктураАдресаЗаписи.Свойство("Помещения", Помещения) Тогда
		Для каждого Помещение Из Помещения Цикл
			ПомещениеТип   = Неопределено;
			ПомещениеНомер = Неопределено;
			Если Помещение.Свойство("ТипПомещения", ПомещениеТип) И Помещение.Свойство("Номер", ПомещениеНомер) Тогда
				Если ПомещениеВКвартиреТип = "" И ПомещениеВКвартиреНомер = "" И ЗначениеЗаполнено(ПомещениеНомер)
					И НРег(ПомещениеТип) = "комната" Тогда
					ПомещениеВКвартиреТип = "Комната";
					ПомещениеВКвартиреНомер = ПомещениеНомер;
				ИначеЕсли ПомещениеВЗданииТип = "" И ПомещениеВЗданииНомер = "" И ЗначениеЗаполнено(ПомещениеНомер)
					И ЗначениеЗаполнено(ПомещениеТип) И НРег(ПомещениеТип) <> "комната" Тогда
					ПомещениеВЗданииТип = ПомещениеТип;
					ПомещениеВЗданииНомер = ПомещениеНомер;
				КонецЕсли;
			КонецЕсли;
			Если ПомещениеВЗданииТип <> "" И ПомещениеВЗданииНомер <> ""
				И ПомещениеВКвартиреТип <> "" И ПомещениеВКвартиреНомер <> "" Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ВозвращаемыйАдрес.Вставить("ПомещениеВЗданииТип",   ПомещениеВЗданииТип);
	ВозвращаемыйАдрес.Вставить("ПомещениеВЗданииНомер", ПомещениеВЗданииНомер);
	ВозвращаемыйАдрес.Вставить("ПомещениеВКвартиреТип",   ПомещениеВКвартиреТип);
	ВозвращаемыйАдрес.Вставить("ПомещениеВКвартиреНомер", ПомещениеВКвартиреНомер);
	
	// Получение полных наименований сокращений.
	//
	ДопПараметры = Новый Структура("КодыАдреса,ПолноеНаименованиеСокращений", Истина, Истина);
	
	СтруктураАдресаЗаписи = РаботаСАдресами.СведенияОбАдресе(Адрес, ДопПараметры);
	
	ВозвращаемыйАдрес.Вставить("НаселенныйПунктВид", ?(СтруктураАдресаЗаписи.Свойство("НаселенныйПунктСокращение"),
	СтруктураАдресаЗаписи["НаселенныйПунктСокращение"], ""));
	
	ВозвращаемыйАдрес.Вставить("ТерриторияТип", ?(СтруктураАдресаЗаписи.Свойство("ТерриторияСокращение"),
	СтруктураАдресаЗаписи["ТерриторияСокращение"], ""));
	
	ВозвращаемыйАдрес.Вставить("УлицаТип", ?(СтруктураАдресаЗаписи.Свойство("УлицаСокращение"),
	СтруктураАдресаЗаписи["УлицаСокращение"], ""));
	
	Возврат ВозвращаемыйАдрес;
	
КонецФункции

Процедура ЗаполнитьАдресВФорматеФИАСНаСтраницеРеглОтчета(СтраницаРаздела, ПараметрыЗаполнения) Экспорт
	
	СоответствиеПоказателейСтраницыРеквизитамАдреса = ПараметрыЗаполнения.СоответствиеПоказателейСтраницыРеквизитамАдреса;
	
	ДополнительныеПараметры = Неопределено;
	Если ПараметрыЗаполнения.Свойство("ВерсияАдреса") Тогда
		ДополнительныеПараметры = Новый Структура("ВерсияАдреса", ПараметрыЗаполнения.ВерсияАдреса);
	КонецЕсли;
	
	СтруктураАдреса = АдресВФорматеФИАС(ПараметрыЗаполнения.Адрес, ДополнительныеПараметры);
	
	ДанныеСтраницы = СтраницаРаздела.Данные;
	
	Для каждого Элем Из СоответствиеПоказателейСтраницыРеквизитамАдреса Цикл
		
		Если ДанныеСтраницы.Свойство(Элем.Ключ) Тогда
			
			// Немногострочные данные.
			//
			ДанныеСтраницы.Вставить(Элем.Ключ, СтруктураАдреса[Элем.Значение]);
			
		ИначеЕсли СтраницаРаздела.ДанныеМногострочныхЧастей.Свойство(Элем.Ключ)
			И ТипЗнч(Элем.Значение) = Тип("Массив") И Элем.Значение.Количество() >= 2
			И ТипЗнч(Элем.Значение[0]) = Тип("Строка") И ЗначениеЗаполнено(Элем.Значение[0])
			И СтруктураАдреса.Свойство(Элем.Значение[0]) И ТипЗнч(СтруктураАдреса[Элем.Значение[0]]) = Тип("Массив")
			И ТипЗнч(Элем.Значение[1]) = Тип("Структура") Тогда
			
			// Многострочные данные.
			//
			ДеревоМногострочнойЧасти = СтраницаРаздела.ДанныеМногострочныхЧастей[Элем.Ключ];
			ДеревоМногострочнойЧасти.Строки.Очистить();
			
			СоответствиеМногострочнойЧастиМножественномуРеквизитуАдреса = Элем.Значение[1];
			
			МножественныйРеквизитАдреса = СтруктураАдреса[Элем.Значение[0]];
			
			Для каждого РеквизитАдреса Из МножественныйРеквизитАдреса Цикл
				СтрокаМногострочнойЧасти = ДеревоМногострочнойЧасти.Строки.Добавить();
				СтрокаМногострочнойЧасти.Данные = Новый Структура;
				СтрокаМногострочнойЧасти.ДанныеМногострочныхЧастей = Новый Структура;
				Для каждого ЭлемСоответствия Из СоответствиеМногострочнойЧастиМножественномуРеквизитуАдреса Цикл
					СтрокаМногострочнойЧасти.Данные.Вставить(ЭлемСоответствия.Ключ, РеквизитАдреса[ЭлемСоответствия.Значение]);
				КонецЦикла;
			КонецЦикла;
			
			Если ДеревоМногострочнойЧасти.Строки.Количество() = 0 Тогда
				СтрокаМногострочнойЧасти = ДеревоМногострочнойЧасти.Строки.Добавить();
				СтрокаМногострочнойЧасти.Данные = Новый Структура;
				СтрокаМногострочнойЧасти.ДанныеМногострочныхЧастей = Новый Структура;
				Для каждого ЭлемСоответствия Из СоответствиеМногострочнойЧастиМножественномуРеквизитуАдреса Цикл
					СтрокаМногострочнойЧасти.Данные.Вставить(ЭлемСоответствия.Ключ, "");
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Возвращает признак учета отложенного налога балансовым методом
// по ПБУ 18/02 с изменениями по приказу Минфина от 20.11.2018 N 236н.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//   Период      - Дата - дата, на которую нужно получить признак.
//
// Возвращаемое значение:
//   Истина - Учет ведется балансовым методом.
//   Ложь   - Учет балансовым методом не ведется.
//
Функция УчетОтложенногоНалогаБалансовымМетодом(Организация, Период) Экспорт
	
	УчетБалансовымМетодом = Ложь;
	
	РегламентированнаяОтчетностьПереопределяемый.ОпределитьУчетОтложенногоНалогаБалансовымМетодом(
		УчетБалансовымМетодом, Организация, Период);
	
	Возврат УчетБалансовымМетодом;
	
КонецФункции

// Помещает данные во временное хранилище и устанавливает новый адрес.
// Если исходный адрес данных не пустой, то производит предварительную очистку хранилища.
//
// Параметры:
//   ПомещаемыеДанные - Произвольный - данные, которые необходимо поместить во временное хранилище.
//   ИдентификаторСеанса - УникальныйИдентификатор - уникальный идентификатор, необходимый для помещения
//     во временное хранилище.
//   АдресДанных - Строка, Неопределено - переменная, содержащая адрес во временном хранилище.
//
Процедура ПоместитьВКэш(ПомещаемыеДанные, ИдентификаторСеанса, АдресДанных) Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресДанных) Тогда
		УдалитьИзВременногоХранилища(АдресДанных);
	КонецЕсли;
	
	АдресДанных = ПоместитьВоВременноеХранилище(ПомещаемыеДанные, ИдентификаторСеанса);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСоСтатистическимиОтчетами

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции работы со статистическими отчетами.

// Функция возвращает значение формата выгрузки статотчетности
// для пользователя текущего сеанса, в разрезе организаций.
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//
// Возвращаемое значение: Число 1 или 2, либо "Неопределено".
//  2 - "новый"
//      (формат ПО Росстата «Заполнение форм статистической отчетности», версии 2.4.4);
//  1 - "старый"
//      (формат ПО Росстата «Формы статотчетности (предприятие)», версии 1.21).
//
Функция ФорматВыгрузкиСтатистическойОтчетностиВЭлектронномВиде(Организация) Экспорт
	
	СтруктураФорматовВыгрузки = ХранилищеНастроекДанныхФорм.Загрузить(
		"Обработка.ОбщиеОбъектыРеглОтчетности.Форма.НастройкиФорматаВыгрузкиОтчетовСтатистики",
		"ФорматыВыгрузкиСтатистическойОтчетностиВЭлектронномВиде");
	
	ПустоеПодразделение = Ложь;
	СпрПодразделенияОрганизаций = РегламентированнаяОтчетностьПереопределяемый.ИмяСправочникаОбособленныхПодразделений();
	Если ЗначениеЗаполнено(СпрПодразделенияОрганизаций) И Организация = Справочники[СпрПодразделенияОрганизаций].ПустаяСсылка() Тогда 
		ПустоеПодразделение = Истина;
	КонецЕсли;
	
	Если Не (ТипЗнч(СтруктураФорматовВыгрузки) = Тип("Структура"))
		Или Организация = Справочники.Организации.ПустаяСсылка()
		Или ПустоеПодразделение Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для НомерФормата = 1 По 2 Цикл
		МассивОрганизаций = СтруктураФорматовВыгрузки["Формат" + Формат(НомерФормата, "ЧГ=")];
		Если МассивОрганизаций.Найти(Организация) <> Неопределено Тогда
			Возврат НомерФормата;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Функция преобразует значения, из которых формируется имя файла,
// в соответствии с форматом выгрузки статотчетности.
//
Функция КодыДляИмениФайлаВФорматеВыгрузки(Параметры) Экспорт
	
	Если ФорматВыгрузкиСтатистическойОтчетностиВЭлектронномВиде(Параметры["Документ"]["Организация"]) = 2 Тогда // "новый" формат выгрузки
		
		Пока СтрДлина(Параметры["КодФормы"]) < 3 Цикл
			Параметры["КодФормы"] = "0" + Параметры["КодФормы"];
		КонецЦикла;
		
		Пока СтрДлина(Параметры["Периодичность"]) < 3 Цикл
			Параметры["Периодичность"] = "0" + Параметры["Периодичность"];
		КонецЦикла;
		
		ТекДата = ТекущаяДатаСеанса();
		ТекГод  = Формат(Год(ТекДата),   "ЧГ=");
		ТекМес  = Формат(Месяц(ТекДата), "ЧЦ=2; ЧВН=");
		ТекДен  = Формат(День(ТекДата),  "ЧЦ=2; ЧВН=");
		Параметры["ДатаВыгрузки"] = ТекГод + ТекМес + ТекДен;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Функция преобразует выгружаемые атрибуты,
// в соответствии с форматом выгрузки статотчетности.
//
Функция АтрибутыВФорматеВыгрузки(Параметры) Экспорт
	
	Организация = Параметры["Документ"]["Организация"];
	ПризнакИспользования = Ложь;
	РегламентированнаяОтчетностьПереопределяемый.ИспользуетсяОтправкаВРосстатПоРазнымНаправлениям(ПризнакИспользования);
	Если ПризнакИспользования Тогда 
		Попытка
			ДанныеОтчета = Параметры["Документ"].ДанныеОтчета.Получить();
			Если ДанныеОтчета.Свойство("ОбособленноеПодразделение") Тогда 
				ОбособленноеПодразделение = ДанныеОтчета.ОбособленноеПодразделение;
				Если ЗначениеЗаполнено(ОбособленноеПодразделение) Тогда 
					Организация = ОбособленноеПодразделение;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ФорматВыгрузкиСтатистическойОтчетностиВЭлектронномВиде(Организация) = 2 Тогда // "новый" формат выгрузки
		
		КодНомера = Формат(ПорядковыйНомерПериодаВГоду(Параметры["Документ"]["ДатаОкончания"], Параметры["КодПериодичности"]), "ЧЦ=2; ЧН=; ЧВН=");
		КодПериод = Формат(Параметры["КодПериодичности"], "ЧН=");
		Параметры["ОтчПериод"] = КодПериод + КодНомера;
		Пока СтрДлина(Параметры["ОтчПериод"]) < 4 Цикл
			Параметры["ОтчПериод"] = "0" + Параметры["ОтчПериод"];
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Функция ПорядковыйНомерПериодаВГоду(ДатаВПериоде, Периодичность)
	
	Перем НомерПериода;
	
	ДатаМесяц = Месяц(ДатаВПериоде);
	ДатаГод   = Год(ДатаВПериоде);
	
	Если Периодичность = 1 Тогда       // годовая
		
		НомерПериода = 1;
		
	ИначеЕсли Периодичность = 2 Тогда  // полугодовая
		
		НомерПериода = 1;
		
		Если ДатаВПериоде > КонецМесяца(Дата(ДатаГод, 6, 1)) Тогда
			НомерПериода = 2;
		КонецЕсли;
		
	ИначеЕсли Периодичность = 4 Тогда  // квартальная
		
		НомерПериода = Число(Формат(ДатаВПериоде, "ДФ=к"));
		
	ИначеЕсли Периодичность = 12 Тогда // месячная
		
		НомерПериода = ДатаМесяц;
		
	ИначеЕсли Периодичность = 36 Тогда // декадная
		
		// Дата обязательно должна указывать на конец декады.
		НомерПериода = Окр((ДеньГода(ДатаВПериоде) - 2) / 10, 0);
		
	ИначеЕсли Периодичность = 52 Тогда // недельная
		
		НомерПериода = НеделяГода(ДатаВПериоде);
		
	Иначе // месячная по умолчанию
		
		НомерПериода = ДатаМесяц;
		
	КонецЕсли;
	
	Возврат НомерПериода;
	
КонецФункции

Процедура НачальныеОперацииСМногострочнымиБлоками(Форма) Экспорт 
	Перем ИсходноеКоличествоСтрокГруппы;
	
	Для Каждого ЭлементСтруктуры Из Форма.мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = Форма[ЭлементСтруктуры.Значение];
		СтруктураГруппы.Очистить();

		Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
			СтруктураГруппы.Добавить();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ДопСведенияОПоказателе(Форма, ИмяПоказателя, ИмяПараметра)
	
	КодПоказателяДляПоиска = ИмяПоказателя;
	
	СмысловаяЧастьПоказателя = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяПоказателя);
	
	Если Прав(СмысловаяЧастьПоказателя, 1) = "_" Тогда
		КодПоказателяДляПоиска = Лев(СмысловаяЧастьПоказателя, СтрДлина(СмысловаяЧастьПоказателя) - 1);
	КонецЕсли;
	
	НайденноеЗначение = Форма.мТаблицаСоставПоказателей.НайтиСтроки(Новый Структура("КодПоказателяПоСоставу", КодПоказателяДляПоиска));
	
	Если НайденноеЗначение.Количество() > 0 Тогда
		
		ЗначениеПараметра = Неопределено;
		НайденноеЗначение[0].Свойство(ИмяПараметра, ЗначениеПараметра);
		
		Возврат ЗначениеПараметра;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПоказательВходитВМногострочнуюЧасть(Форма, ИмяПоказателя) Экспорт
	
	Если НЕ РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Форма, "мСтруктураМногострочныхРазделов") Тогда
		Возврат 0;
	КонецЕсли;
	
	ДлиннаИмениГруппы = 11;
	Для Каждого КЗ Из Форма.мСтруктураМногострочныхРазделов Цикл
		ДлиннаИмениГруппы = СтрДлина(КЗ.Ключ);
		Прервать;
	КонецЦикла;
	
	ИмяГруппы = Лев(ИмяПоказателя, ДлиннаИмениГруппы);
	
	СтруктураГруппы = Неопределено;
	
	Если НЕ Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы) Тогда
		Возврат 0;
	Иначе
		СтруктураГруппы = Форма[СтруктураГруппы];
		Возврат СтруктураГруппы.Количество();
	КонецЕсли;

КонецФункции

Функция КонвертированныеЗначенияПоказателейСтатистическойОтчетности(Форма, КонвертируемыеПоказатели, НаправлениеИзКонтейнера = Истина) Экспорт 
	
	Если ТипЗнч(КонвертируемыеПоказатели) = Тип("Структура") Тогда
		
		КонвертированныеПоказатели = Новый Структура;
		
		Для каждого КлючИЗначение Из КонвертируемыеПоказатели Цикл
			
			ИмяПоказателя      = КлючИЗначение.Ключ;
			ЗначениеПоказателя = КлючИЗначение.Значение;
			
			Если РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(Форма, ИмяПоказателя) <> 0 Тогда
				Продолжить;
			КонецЕсли;
			Если Лев(ИмяПоказателя, 2) = "ЧН" И РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(Форма, Сред(ИмяПоказателя, 3)) <> 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ЗначениеПоказателя) = Тип("Число") Тогда
				Делитель = ДопСведенияОПоказателе(Форма, ИмяПоказателя, "ДелительДанныхИБ");
				Если Делитель = Неопределено ИЛИ Делитель = 0 Тогда
					НовоеЗначениеПоказателя = ЗначениеПоказателя;
				Иначе
					НовоеЗначениеПоказателя = ЗначениеПоказателя * ?(НаправлениеИзКонтейнера, 1 / Делитель, Делитель);
				КонецЕсли;
				
				СтрТипДанных = ДопСведенияОПоказателе(Форма, ИмяПоказателя, "ТипДанныхПоказателя");
				Если НаправлениеИзКонтейнера И Лев(СтрТипДанных, 1) = "N" Тогда
					СтрФормат = СокрЛП(СтрЗаменить(СтрЗаменить(СтрЗаменить(Сред(СтрТипДанных, 2), "(", ""), ")", ""), " ", ""));
					ПозицияРазделителя = Макс(СтрНайти(СтрФормат, ","), СтрНайти(СтрФормат, "."));
					ТочностьОкругления = Число("0" + ?(ПозицияРазделителя > 0, Сред(СтрФормат, ПозицияРазделителя + 1), "0"));
					НовоеЗначениеПоказателя = Окр(НовоеЗначениеПоказателя, ТочностьОкругления);
				КонецЕсли;
			Иначе
				НовоеЗначениеПоказателя = ЗначениеПоказателя;
			КонецЕсли;
			
			КонвертированныеПоказатели.Вставить(ИмяПоказателя, НовоеЗначениеПоказателя);
			
		КонецЦикла;
		
		Возврат КонвертированныеПоказатели;
		
	Иначе
		
		КонвертированныеПоказатели = Новый ТаблицаЗначений;
		
		Если ТипЗнч(КонвертируемыеПоказатели) = Тип("ТаблицаЗначений") Тогда
			КонвертированныеПоказатели = КонвертируемыеПоказатели.Скопировать();
		Иначе
			КонвертированныеПоказатели = ДанныеФормыВЗначение(КонвертируемыеПоказатели, Тип("ТаблицаЗначений"));
		КонецЕсли;
		
		Для каждого КолонкаТаблицы Из КонвертированныеПоказатели.Колонки Цикл
			Если КолонкаТаблицы.ТипЗначения.СодержитТип(Тип("Число")) Тогда
				
				Делитель = ДопСведенияОПоказателе(Форма, КолонкаТаблицы.Имя, "ДелительДанныхИБ");
				
				Если Делитель = Неопределено ИЛИ Делитель = 0 Тогда
					Коэффициент = 1;
				Иначе
					Коэффициент = ?(НаправлениеИзКонтейнера, 1 / Делитель, Делитель);
				КонецЕсли;
				
				Для каждого СтрокаТаблицы Из КонвертированныеПоказатели Цикл
					
					СтрокаТаблицы[КолонкаТаблицы.Имя] = СтрокаТаблицы[КолонкаТаблицы.Имя] * Коэффициент;
					
					СтрТипДанных = ДопСведенияОПоказателе(Форма, КолонкаТаблицы.Имя, "ТипДанныхПоказателя");
					Если НаправлениеИзКонтейнера И Лев(СтрТипДанных, 1) = "N" Тогда
						СтрФормат = СокрЛП(СтрЗаменить(СтрЗаменить(СтрЗаменить(Сред(СтрТипДанных, 2), "(", ""), ")", ""), " ", ""));
						ПозицияРазделителя = Макс(СтрНайти(СтрФормат, ","), СтрНайти(СтрФормат, "."));
						ТочностьОкругления = Число("0" + ?(ПозицияРазделителя > 0, Сред(СтрФормат, ПозицияРазделителя + 1), "0"));
						СтрокаТаблицы[КолонкаТаблицы.Имя] = Окр(СтрокаТаблицы[КолонкаТаблицы.Имя], ТочностьОкругления);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НаправлениеИзКонтейнера Тогда
			
			ДлиннаИмениГруппы = 11;
			Для Каждого КЗ Из Форма.мСтруктураИсхКолвоСтрокРазделов Цикл
				ДлиннаИмениГруппы = СтрДлина(КЗ.Ключ);
				Прервать;
			КонецЦикла;
			
			ИмяГруппы = Лев(КонвертированныеПоказатели.Колонки[0].Имя, ДлиннаИмениГруппы);
			
			ИсходноеКоличествоСтрокГруппы = 0;
			Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
			
			ТекущееКоличествоСтрокГруппы = КонвертированныеПоказатели.Количество();
			
			Для НСтр = ТекущееКоличествоСтрокГруппы По ИсходноеКоличествоСтрокГруппы - 1 Цикл
				КонвертированныеПоказатели.Добавить();
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат КонвертированныеПоказатели;
		
	КонецЕсли;
	
	//@skip-warning
	Возврат КонвертируемыеПоказатели;
	
КонецФункции

Функция НоваяСтраница() Экспорт 
	ПечатнаяФорма = Новый ТабличныйДокумент();
	ПечатнаяФорма.ОтображатьЗаголовки = Ложь;
	ПечатнаяФорма.ОтображатьСетку     = Ложь;
	ПечатнаяФорма.ЧерноБелыйПросмотр  = Истина;
	ПечатнаяФорма.ЧерноБелаяПечать    = Истина;
	ПечатнаяФорма.Автомасштаб         = Истина;
	ПечатнаяФорма.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	Возврат ПечатнаяФорма;
КонецФункции

Процедура СформироватьСтруктуруЦветовРаскраски(Форма) Экспорт 
	
	ЦветЗаполняетсяТолькоВручную     = Новый Цвет(255, 255, 225);
	ЦветЗаполняетсяАвтоКорректир     = Новый Цвет(255, 240, 200);
	ЦветЗаполняетсяАвтоБезКорректир  = Новый Цвет(230, 240, 220);
	ЦветЗаполняетсяАвтоАрифметика    = Новый Цвет(192, 220, 192);
	ЦветЗаполняетсяОднозначноВручную = Новый Цвет(255, 255, 192);
	ЦветЗаполняетсяАвтоматически     = Новый Цвет(255, 255, 255);
	ЦветАвто                         = Новый Цвет(0, 0, 0);
	
	Форма.мСтруктураЦветовРаскраски = Новый Структура;
	Форма.мСтруктураЦветовРаскраски.Вставить("_1", ЦветЗаполняетсяТолькоВручную);
	Форма.мСтруктураЦветовРаскраски.Вставить("_2", ЦветЗаполняетсяАвтоКорректир);
	Форма.мСтруктураЦветовРаскраски.Вставить("_3", ЦветЗаполняетсяАвтоБезКорректир);
	Форма.мСтруктураЦветовРаскраски.Вставить("_4", ЦветЗаполняетсяАвтоАрифметика);
	Форма.мСтруктураЦветовРаскраски.Вставить("_0", ЦветЗаполняетсяОднозначноВручную);
	Форма.мСтруктураЦветовРаскраски.Вставить("_5", ЦветЗаполняетсяАвтоматически);
	Форма.мСтруктураЦветовРаскраски.Вставить("_6", ЦветАвто);
	Форма.мСтруктураЦветовРаскраски.Вставить("_7", ЦветЗаполняетсяАвтоБезКорректир);
	
КонецПроцедуры

Функция СформироватьСтруктуруОбязательныхРеквизитовСтатистическогоОтчета() Экспорт 
	
	СтруктураРеквизитовФормы = Новый Структура;
	
	СтруктураРеквизитовФормы.Вставить("мДелитель");
	СтруктураРеквизитовФормы.Вставить("мДокументВосстановлен");
	СтруктураРеквизитовФормы.Вставить("НаимТекущегоРаздела");
	СтруктураРеквизитовФормы.Вставить("ВыводитьСтраницуВТаблДокНаСервере");
	СтруктураРеквизитовФормы.Вставить("мПечатаемыеРазделы");
	СтруктураРеквизитовФормы.Вставить("ТекущаяСтрокаРазделовОтчета");
	СтруктураРеквизитовФормы.Вставить("ВидДокумента");
	СтруктураРеквизитовФормы.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитовФормы.Вставить("мАдресвФорматеДляВыгрузки");
	СтруктураРеквизитовФормы.Вставить("мВариант");
	СтруктураРеквизитовФормы.Вставить("мВерсияФормы");
	СтруктураРеквизитовФормы.Вставить("мБезОткрытияФормы");	
	СтруктураРеквизитовФормы.Вставить("мВПрограммеИзмененаОрганизация");
	СтруктураРеквизитовФормы.Вставить("мВыбраннаяФорма");
	СтруктураРеквизитовФормы.Вставить("мДатаКонцаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мДатаНачалаПериодаОтчета");
	СтруктураРеквизитовФормы.Вставить("мЗаписываетсяНовыйДокумент");
	СтруктураРеквизитовФормы.Вставить("мЗаписьЗапрещена");
	СтруктураРеквизитовФормы.Вставить("мКодОтчета");
	СтруктураРеквизитовФормы.Вставить("мПериодичность");
	СтруктураРеквизитовФормы.Вставить("мПечатныеФормы");
	СтруктураРеквизитовФормы.Вставить("мСкопированаФорма");
	СтруктураРеквизитовФормы.Вставить("мСохраненныйДок");
	СтруктураРеквизитовФормы.Вставить("Организация");
	СтруктураРеквизитовФормы.Вставить("СправочникиВидыКонтактнойИнформацииПочтовыйАдресОрганизации");
	СтруктураРеквизитовФормы.Вставить("ТочностьЕдиницыИзмерения");
	СтруктураРеквизитовФормы.Вставить("мСоответствияМнгЧ");
	СтруктураРеквизитовФормы.Вставить("СтрПериодОтчета");
	СтруктураРеквизитовФормы.Вставить("НаимОрганизации");
	СтруктураРеквизитовФормы.Вставить("СписокПечатаемыхЛистов");
	СтруктураРеквизитовФормы.Вставить("мСтрокаФормата");
	СтруктураРеквизитовФормы.Вставить("мСчетчикСтраниц");
	СтруктураРеквизитовФормы.Вставить("мБезОткрытияФормы");
	СтруктураРеквизитовФормы.Вставить("мРежимПечати");
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповЧислоЕ");
	СтруктураРеквизитовФормы.Вставить("мОписаниеТиповБулево");
	СтруктураРеквизитовФормы.Вставить("мСоставПоказателей");
	СтруктураРеквизитовФормы.Вставить("ЦветЗаполняетсяАвтоАрифметика");
	СтруктураРеквизитовФормы.Вставить("мАвтоВыборКодов");
	СтруктураРеквизитовФормы.Вставить("ФлажокОтклАвтоРасчет",          Ложь);
	СтруктураРеквизитовФормы.Вставить("НужноРассчитатьОтчетНаСервере", Ложь);
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуЗаполнить",     Ложь);
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуРасшифровать",  Ложь);
	СтруктураРеквизитовФормы.Вставить("мСохранятьРасшифровку",         Истина);
	СтруктураРеквизитовФормы.Вставить("ДоступенМеханизмПечатиРеглОтчетностиСДвухмернымШтрихкодомPDF417", Ложь);
	СтруктураРеквизитовФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", Истина);
	СтруктураРеквизитовФормы.Вставить("ТекстДляЗаголовочнойЧасти");
	СтруктураРеквизитовФормы.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначения.ИнформационнаяБазаФайловая());
	СтруктураРеквизитовФормы.Вставить("АдресВременногоХранилищаРасшифровки");
	СтруктураРеквизитовФормы.Вставить("СформироватьФормуОтчетаАвтоматически", Ложь);
	СтруктураРеквизитовФормы.Вставить("РеализованоАвтозаполнениеДаннымиПредидущегоПериода", Ложь);
	СтруктураРеквизитовФормы.Вставить("ВерсияБСП", СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	СтруктураРеквизитовФормы.Вставить("ОКВЭД",  "");
	СтруктураРеквизитовФормы.Вставить("ОКВЭД2", "");
	СтруктураРеквизитовФормы.Вставить("ИспользуетсяНастройкаПодписантов", Ложь);
	СтруктураРеквизитовФормы.Вставить("Адрес_JSON", "");
	
	РегламентированнаяОтчетностьПереопределяемый.ИспользоватьКонтекстнуюНастройкуПодписантовСтатистики(СтруктураРеквизитовФормы.ИспользуетсяНастройкаПодписантов);
	Возврат СтруктураРеквизитовФормы;
	
КонецФункции

Процедура ЗаполнитьПоказателиОтчетаНаСервере(Форма, ПоказателиОтчета) Экспорт 
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из Форма.мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если НЕ Раздел.МногостраничностьВРазделе Тогда
			ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, Форма["СтруктураДанных" + Раздел.ИмяСтраницы]);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПоказателиРаздела(ДеревоВыгрузки, Раздел) Экспорт 
	
	ПоказателиРаздела = ДеревоВыгрузки.Строки.НайтиСтроки(Новый Структура("Раздел", Раздел), Истина);
	КоличествоСтрокРаздела = ПоказателиРаздела.Количество();
	Для ОбрИнд = 1 По КоличествоСтрокРаздела Цикл
		Инд = КоличествоСтрокРаздела - ОбрИнд;
		ТекСтр = ПоказателиРаздела[Инд];
		Если НЕ ЗначениеЗаполнено(ТекСтр.Ключ) Тогда
			ПоказателиРаздела.Удалить(Инд);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоказателиРаздела;
	
КонецФункции

Функция ПоказательЗаполнен(Показатель, Значение) Экспорт 
	
	Возврат ЗначениеЗаполнено(Значение) И НЕ (СокрЛП(Показатель.Формат) = "N" И Показатель.МаксРазмерность = 15 И ТипЗнч(Значение) = Тип("Число") И Окр(Значение) = 0);
	
КонецФункции

Функция СтраницаПуста(ДанныеСтраницы, Показатели, ДеревоВыгрузки, НепроверяемыеПараметры, РодМногостр)
	
	Если ТипЗнч(Показатели) = Тип("Строка") Тогда
		ПоказателиРаздела = ПолучитьПоказателиРаздела(ДеревоВыгрузки, Показатели);
	Иначе
		ПоказателиРаздела = Показатели;
	КонецЕсли;
	
	Если НепроверяемыеПараметры = Неопределено Тогда 
		ПоказателиНеанализируемыеНаЗаполненность = Новый Массив;
	Иначе 
		ПоказателиНеанализируемыеНаЗаполненность = НепроверяемыеПараметры;
	КонецЕсли;
	
	Для Каждого Пок Из ПоказателиРаздела Цикл
		Если ПоказателиНеанализируемыеНаЗаполненность.Найти(Пок.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Пок.Многострочность Или (РодМногостр И Пок.Родитель.Многострочность) Тогда
			ИндексСтроки = 1;
			ЗначениеПоказателя = Неопределено;
			Пока ДанныеСтраницы.Свойство(Пок.Ключ + "_" + Формат(ИндексСтроки, "ЧГ="), ЗначениеПоказателя) Цикл
				Если ПоказательЗаполнен(Пок, ЗначениеПоказателя) Тогда
					Возврат Ложь;
				КонецЕсли;
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
		Иначе
			ЗначениеПоказателя = Неопределено;
			ДанныеСтраницы.Свойство(СтрЗаменить(Пок.Ключ,"_Ч",""), ЗначениеПоказателя);
			Если ПоказательЗаполнен(Пок, ЗначениеПоказателя) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция РазделПуст(Форма, ДеревоВыгрузки, Раздел, НепроверяемыеПараметры, РодМногостр)
	
	ПоказателиРаздела = ПолучитьПоказателиРаздела(ДеревоВыгрузки, Раздел);
	
	мДанныеОтчета = Форма.мДанныеОтчета;
	ДанныеРаздела = мДанныеОтчета[Раздел];
	
	Если ТипЗнч(ДанныеРаздела) = Тип("ТаблицаЗначений") Тогда
		Для Каждого Стр Из ДанныеРаздела Цикл
			Если НЕ СтраницаПуста(Стр.Данные, ПоказателиРаздела, ДеревоВыгрузки, НепроверяемыеПараметры, РодМногостр) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеРаздела) = Тип("Структура") Тогда
		Если НЕ СтраницаПуста(ДанныеРаздела, ПоказателиРаздела, ДеревоВыгрузки, НепроверяемыеПараметры, РодМногостр) Тогда
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеРаздела) = Тип("ДанныеФормыКоллекция") Тогда
		Попытка
			Данные = ДанныеФормыВЗначение(ДанныеРаздела, Тип("ТаблицаЗначений"));
			Для Каждого Стр Из Данные Цикл
				Если НЕ СтраницаПуста(Стр.Данные, ПоказателиРаздела, ДеревоВыгрузки, НепроверяемыеПараметры, РодМногостр) Тогда
					Возврат Ложь;
				КонецЕсли;
			КонецЦикла;
		Исключение
		КонецПопытки;
		
		Попытка
			Данные = ДанныеФормыВЗначение(ДанныеРаздела, Тип("Структура"));
			Если НЕ СтраницаПуста(Данные, ПоказателиРаздела, ДеревоВыгрузки, НепроверяемыеПараметры, РодМногостр) Тогда
				Возврат Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьРазделыНаНаличиеИнформации(Форма, ДеревоВыгрузки, парамРазделы, НепроверяемыеПараметры = Неопределено, РодМногостр = Ложь) Экспорт 
	
	Разделы = Новый Массив;
	Если ТипЗнч(парамРазделы) = Тип("Строка") Тогда
		Если СтрНайти(парамРазделы, ",") <> 0 Тогда
			СтрРазделы = Новый Структура(парамРазделы);
			Для Каждого Эл Из СтрРазделы Цикл
				Разделы.Добавить(Эл.Ключ);
			КонецЦикла;
		Иначе
			Разделы.Добавить(парамРазделы);
		КонецЕсли;
	КонецЕсли;
	
	РазделыПусты = Истина;
	Для Каждого Раздел Из Разделы Цикл
		Если НЕ РазделПуст(Форма, ДеревоВыгрузки, Раздел, НепроверяемыеПараметры, РодМногостр) Тогда
			РазделыПусты = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ РазделыПусты;
	
КонецФункции

Функция ЧислоПоФормату(Значение, СтрокаФормата, УдалитьНезначащиеНулиПослеРазделителя = Ложь) Экспорт 
	
	ЗначениеПоФормату = СокрЛП(Формат(Значение, СтрокаФормата));
	
	Если  УдалитьНезначащиеНулиПослеРазделителя Тогда
		
		Разд = ".";
		
		ПозРазд = СтрНайти(ЗначениеПоФормату, Разд);
		Если ПозРазд > 0 Тогда
			
			ЦелаяЧасть = Лев(ЗначениеПоФормату, ПозРазд - 1);
			ДробнаяЧасть = Сред(ЗначениеПоФормату, ПозРазд + 1);
			Для Сч = 1 По СтрДлина(ДробнаяЧасть) Цикл
				Если Прав(ДробнаяЧасть, 1) <> "0" Тогда
					Прервать;
				КонецЕсли;
				ДробнаяЧасть = Лев(ДробнаяЧасть, СтрДлина(ДробнаяЧасть) - 1);
			КонецЦикла;
			
			ЗначениеПоФормату = ЦелаяЧасть + ?(ПустаяСтрока(ДробнаяЧасть), "", Разд + ДробнаяЧасть);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначениеПоФормату;
	
КонецФункции

Процедура ИзменитьВариантЗаполненияЯчейки(Форма, НовыйВариант, Показатель = Неопределено) Экспорт 
	
	Если НовыйВариант = 4 И Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
		НовыйВариант = 0;
	КонецЕсли;
	
	ИмяТекущейСтраницыПанели = "ПолеТабличногоДокументаФормаОтчета";
	
	ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(Форма, ИмяТекущейСтраницыПанели);
	
	Если ТаблицаВариантыЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяОбласть  = Форма.Элементы.ПолеТабличногоДокументаФормаОтчета.ТекущаяОбласть;
	Если Показатель = Неопределено Тогда
		ИмяПоказателя   = ТекущаяОбласть.Имя;
	Иначе
		ИмяПоказателя = Показатель;
	КонецЕсли;
	
	НайденнаяСтрока = ТаблицаВариантыЗаполнения.НайтиСтроки(Новый Структура("КодПоказателя", ИмяПоказателя));
	Если НайденнаяСтрока.Количество() > 0 Тогда
		НайденнаяСтрока = НайденнаяСтрока[0];
		НайденнаяСтрока.ВариантЗаполнения = НовыйВариант;
	КонецЕсли;
	
	Форма.УстановитьЦветФонаЯчейкиНаСервере(ИмяПоказателя, НовыйВариант, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

Процедура УстановитьЦветФорматДоступностьЯчеек(Форма) Экспорт 
	
	Форма.УстановитьФорматВыводаВПоляхВвода(Форма);
	СтруктураРеквизитовФормы = Форма.СтруктураРеквизитовФормы;
	
	МакетСоставаПоказателей = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(Форма.ИмяФормы).ПолучитьМакет(Форма.СтруктураРеквизитовФормы.мСоставПоказателей);
	ИмяТекРазделаНаЛисте = МакетСоставаПоказателей.Области[0].Имя;
	Форма.УстановитьЦветФонаЯчейкиНаСервере(,, ИмяТекРазделаНаЛисте);
	
	НезаполняемыеПоля = ИнтерфейсыВзаимодействияБРО.ПоляКоторыеНеВсегдаТребуетсяЗаполнять(
		Сред(Лев(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".Форма.") - 1), 7),
		СтруктураРеквизитовФормы.мВыбраннаяФорма, 
		СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
	Для Каждого ИмяПоля Из НезаполняемыеПоля Цикл
		ИзменитьВариантЗаполненияЯчейки(Форма, 0, ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлементВСтруктуруОшибок(СтруктураОшибок, ТекстФормулы, ОписаниеКС, ОбщееЧислоОшибок, ОбщееЧислоБезОшибок, Расшифровка, Нарушение, Описание, ЭтоОшибка, Комментарий = "") Экспорт 
	
	СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Описание);
	СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Расшифровка);
	СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
	СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ТекстФормулы + ". " + ОписаниеКС);
	СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Нарушение);
	СтруктураОшибок.Вставить("Комментарий" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), Комментарий);
	
КонецПроцедуры

Процедура ДобавитьСтрокуОписанияВвода(ТаблицаПараметров, Показатель, Длина, Тип = Неопределено, ТекстПриВыборе = Неопределено, Значения = Неопределено) Экспорт 
	
	НовСтр = ТаблицаПараметров.Добавить();
	НовСтр.Показатель = Показатель;
	НовСтр.Тип = Тип;
	НовСтр.Длина = Длина;
	НовСтр.ТекстПриВыборе = ТекстПриВыборе;
	Если ТипЗнч(Значения) = Тип("ТаблицаЗначений") Тогда
		НовСтр.ТаблицаЗначений.Загрузить(Значения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНачальныеНастройки(Форма, Таблица = "ТаблицаВариантыЗаполненияПолеТабличногоДокументаФормаОтчета") Экспорт 
	
	МакетСоставаПоказателей = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(Форма.ИмяФормы).ПолучитьМакет(Форма.СтруктураРеквизитовФормы.мСоставПоказателей);
	
	МассивТиповТаблицаЗначений = Новый Массив; 
	МассивТиповТаблицаЗначений.Добавить(Тип("ТаблицаЗначений"));
	
	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
		
		ТекОбласть    = МакетСоставаПоказателей.Области[Инд];
		ИмяСтраницы   = ТекОбласть.Имя;
		
		Форма[Таблица].Добавить();
		
		// Таблица значений содержит информацию о вариантах заполнения показателя отчета.
		// В колонках таблицы значений отображается следующая информация:
		//   - имя ячейки (код показателя);
		//   - вариант заполнения ячейки;
		//   - вычисленное по данным ИБ значение ячейки;
		//   - величина автокорректировки значения ячейки;
		//   - примечание к ячейке.
		//
		
		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			// перебираем строки макета
			
			// Код показателя (по составу показателей) определяется по первой колонке макета
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			
			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;
			
			Если КодПоказателя = "###" Тогда
				Прервать;
			КонецЕсли;
			
			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;
			
			// код показателя по форме отчете (имя ячейки в полях табличного документа формы)
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			// признак многострочности определяется по третьей колонке макета
			ПризнМногострочность = СокрЛП(МакетСоставаПоказателей.Область(Ном, 3).Текст);
			// по четвертой колонке определяется тип данных реквизита
			ТипДанныхРеквизита   = СокрЛП(МакетСоставаПоказателей.Область(Ном, 4).Текст);
			// вариант заполнения ячейки определяется по колонке 6 макета
			стрВариантЗаполнения = СокрЛП(МакетСоставаПоказателей.Область(Ном, 6).Текст);
			// делитель данных заполнения из ИБ для конвертации в данные отчета
			стрДелительДанныхИБ  = СокрЛП(МакетСоставаПоказателей.Область(Ном, 7).Текст);
			// код показателя из структуры, берется из колонки 9
			КодПоказателяПоСтруктуре = СокрЛП(МакетСоставаПоказателей.Область(Ном, 9).Текст);
			
			чВариантЗаполнения   = ?(ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
			чДелительДанныхИБ    = ?(ПустаяСтрока(стрДелительДанныхИБ),  1, Число(стрДелительДанныхИБ));
			
			// формируем таблицу значений, содержащей состав показателей отчета
			НоваяСтрока = Форма.мТаблицаСоставПоказателей.Добавить();
			НоваяСтрока.ИмяПоляТаблДокумента     = ИмяСтраницы;
			НоваяСтрока.КодПоказателяПоСоставу   = КодПоказателя;
			НоваяСтрока.КодПоказателяПоФорме     = КодПоказателяПоФорме;
			НоваяСтрока.ПризнМногострочности     = ПризнМногострочность;
			НоваяСтрока.ТипДанныхПоказателя      = ТипДанныхРеквизита;
			НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяПоСтруктуре;
			НоваяСтрока.ДелительДанныхИБ         = чДелительДанныхИБ;
			
			Если чВариантЗаполнения <> 0 Тогда
				// Если в колонке 6 задан вариант заполнения показателя, 
				// то его значение может определяться по данным ИБ.
				// Дополняем таблицу значений вариантов заполнения
				НоваяСтрока = Форма[Таблица][0].ТаблицаВариантовЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя            = ?(НЕ ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения        = чВариантЗаполнения;
				НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяПоСтруктуре;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Форма[Таблица][0].ТаблицаВариантовЗаполнения.Количество() > 0 Тогда
			// имеются автоматически заполняемые ячейки
			// Создаем структуру, содержащей варианты заполнения показателей отчета.
			//
			// В качестве ключа используется имя страницы основной панели формы, содержащей
			//   табличный документ с автоматически заполняемыми показателями.
			// В качестве значения принимаем Массив из таблицы значений - вариантов заполнения
			//   показателей по каждой странице многостраничного раздела.
			//
			Форма.мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, ИмяСтраницы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНомерКорректировки(ТитульнаяСтраница) Экспорт 
	Если ТипЗнч(ТитульнаяСтраница) <> Тип("ТабличныйДокумент") Тогда 
		Возврат;
	КонецЕсли;
	НК = ТитульнаяСтраница.Области.Найти("ПолеНомерКорректировки");
	Если НК <> Неопределено Тогда
		ТитульнаяСтраница.УдалитьОбласть(НК, ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	НК = ТитульнаяСтраница.Области.Найти("ШапкаОбособленныеПодразделения");
	Если НК <> Неопределено Тогда
		ТитульнаяСтраница.УдалитьОбласть(НК, ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьСлужебныеОбластиОтчетаСтатистики(СтруктураРеквизитовФормы, ИменаЭлементовУправленияСтроками) Экспорт 
	ТекИндекс = 0;
	
	Пока ТекИндекс < СтруктураРеквизитовФормы.мПечатныеФормы.Количество() Цикл
		
		ТабДокЛиста = СтруктураРеквизитовФормы.мПечатныеФормы[ТекИндекс].Значение;
		
		Для каждого ЭлементИмена Из ИменаЭлементовУправленияСтроками Цикл
		
			Если ТабДокЛиста.Области.Найти(ЭлементИмена.Ключ) <> Неопределено Тогда
				
				ТабДокЛиста.УдалитьОбласть(ТабДокЛиста.Область(ЭлементИмена.Ключ), ТипСмещенияТабличногоДокумента.ПоВертикали);
				
				ИмяОбластиЯчейкиУдалитьСтрокуБезИндекса = ЭлементИмена.Значение + "_";
				
				ТекНомерСтроки = 1;
				ОбластьЯчейкиУдалитьСтроку = ТабДокЛиста.Области.Найти(ИмяОбластиЯчейкиУдалитьСтрокуБезИндекса + Формат(ТекНомерСтроки, "ЧГ="));
				Пока ОбластьЯчейкиУдалитьСтроку <> Неопределено Цикл
					ОбластьЯчейкиУдалитьСтроку.Текст = "";
					ТекНомерСтроки = ТекНомерСтроки + 1;
					ОбластьЯчейкиУдалитьСтроку = ТабДокЛиста.Области.Найти(ИмяОбластиЯчейкиУдалитьСтрокуБезИндекса + Формат(ТекНомерСтроки, "ЧГ="));
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Удалим пустые печатные формы
		Если ТабДокЛиста.ВысотаТаблицы = 0 Тогда
			СтруктураРеквизитовФормы.мПечатныеФормы.Удалить(ТекИндекс);
		Иначе
			ТекИндекс = ТекИндекс + 1;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьСпискиВыбораВФоне(ПараметрыОтчета, АдресХранилища) Экспорт
	
	ИмяОтчета = ПараметрыОтчета.ПараметрыЗаполнения.Отчет;
	Макет = ПараметрыОтчета.ПараметрыЗаполнения.Макет;
	МакетСоставаПоказателей = Отчеты[ИмяОтчета].ПолучитьМакет(Макет);
	
	КоллекцияСписковВыбора = Новый Соответствие;
	Для Каждого Область Из МакетСоставаПоказателей.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			ВерхОбласти = Область.Верх;
			НизОбласти = Область.Низ;
			ТаблСписка = Новый ТаблицаЗначений;
			ТаблСписка.Колонки.Добавить("Код",,, МакетСоставаПоказателей.Область(ВерхОбласти, 1, ВерхОбласти, 1).ШиринаКолонки);
			ТаблСписка.Колонки.Добавить("Название",,, МакетСоставаПоказателей.Область(ВерхОбласти, 2, ВерхОбласти, 2).ШиринаКолонки);
			Для НомСтр = ВерхОбласти По НизОбласти Цикл
				КодПоказателя = СокрП(МакетСоставаПоказателей.Область(НомСтр, 1).Текст);
				Если КодПоказателя <> "###" Тогда
					НовСтрока = ТаблСписка.Добавить();
					НовСтрока.Код = КодПоказателя;
					НовСтрока.Название = СокрП(МакетСоставаПоказателей.Область(НомСтр, 2).Текст);
				КонецЕсли;
			КонецЦикла;
			КоллекцияСписковВыбора.Вставить(Область.Имя, ТаблСписка);
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(КоллекцияСписковВыбора, АдресХранилища);
	
КонецПроцедуры

Процедура УстановитьЗначениеИФорматВПоле(ТекТабличноеПоле, ИмяПоказателя, ЗначениеПоказателя) Экспорт 
	Если Лев(ИмяПоказателя, 2) = "ЧН" Тогда
		Область = ТекТабличноеПоле.Области.Найти(Сред(ИмяПоказателя, 3));
		Если Область <> Неопределено Тогда
			Область.Формат = РегламентированнаяОтчетностьКлиентСервер.ЗаменитьПредставлениеНуляВСтрокеФормата(Область.Формат, ЗначениеПоказателя);
		КонецЕсли;
	Иначе
		Область = ТекТабличноеПоле.Области.Найти(ИмяПоказателя);
		Если Область <> Неопределено Тогда
			Если Область.СодержитЗначение Тогда
				Область.Значение = ЗначениеПоказателя;
			Иначе
				Область.Текст = Строка(ЗначениеПоказателя);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьШаблон(Форма, ИмяМакетаШаблона) Экспорт 
	Результат = Новый Структура("ИмяФайлаШаблона, Шаблон");
	ДД = Отчеты[Сред(Лев(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".Форма.") - 1), 7)].ПолучитьМакет(ИмяМакетаШаблона);
	
	КаталогРазархивирования = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогРазархивирования);
	КаталогРазархивирования = КаталогРазархивирования + ПолучитьРазделительПути();
	
	ВФАрх = КаталогРазархивирования + Строка(Новый УникальныйИдентификатор);
	ДД.Записать(ВФАрх);
	
	ЧтениеZip = Новый ЧтениеZipФайла(ВФАрх);
	ЧтениеZip.Извлечь(ЧтениеZip.Элементы[0], КаталогРазархивирования);
	ИтоговыйФайл = КаталогРазархивирования + ЧтениеZip.Элементы[0].Имя;
	Результат.ИмяФайлаШаблона = ЧтениеZip.Элементы[0].Имя;
	Результат.Шаблон = Новый ДвоичныеДанные(ИтоговыйФайл);
	ЧтениеZip.Закрыть();
	
	УдалитьФайлы(КаталогРазархивирования);
	Возврат Результат;
КонецФункции

Функция ПолучитьПараметрыИнициализацииУниверсальногоОтчета(Форма, ИмяМакетаАтрибутов, ИмяМакетаШаблона, ИмяСхемы) Экспорт 
	Попытка
		Результат = Новый Структура;
		СтруктураРеквизитовФормы = Форма.СтруктураРеквизитовФормы;
		Результат.Вставить("мСохраненныйДок", СтруктураРеквизитовФормы.мСохраненныйДок);
		Результат.Вставить("мДатаКонцаПериодаОтчета", СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		Результат.Вставить("мДатаНачалаПериодаОтчета", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
		Результат.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
		Результат.Вставить("мАвтоВыборКодов", Истина);
		Результат.Вставить("мПериодичность", СтруктураРеквизитовФормы.мПериодичность);
		
		СведШаблон = ПолучитьСведенияОШаблоне(Форма, ИмяМакетаАтрибутов);
		Для Каждого КЗ Из СведШаблон Цикл 
			Результат.Вставить(КЗ.Ключ, КЗ.Значение);
		КонецЦикла;
		
		ДанныеШаблона = ПолучитьШаблон(Форма, ИмяМакетаШаблона);
		Результат.Вставить("ИмяФайлаШаблона", ДанныеШаблона.ИмяФайлаШаблона);
		Результат.Вставить("Шаблон", Новый ХранилищеЗначения(ДанныеШаблона.Шаблон));
		
		СформироватьСтруктуруПоказателей(Форма);
		ПараметрыВыгрузки = Форма.СформироватьСтруктуруПараметров();
		ДеревоВыгрузки = ПолучитьДеревоВыгрузки(Форма, ИмяСхемы);
		Форма.ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
		ТекстВыгрузки = ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
		Результат.Вставить("ВХ", ТекстВыгрузки);
		Возврат Результат;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция ПолучитьСведенияОШаблоне(Форма, ИмяМакетаАтрибутов) Экспорт 
	Результат = Новый Структура("ОКУД,КодШаблона,Версия,Шифр,КодФормы,Наименование,КодПериодичности");
	ДопАтрибуты = СформироватьСтруктуруДопАтрибутов(Форма.ИмяФормы, ИмяМакетаАтрибутов);
	ДопАтрибуты.Свойство("OKUD", Результат.ОКУД);
	ДопАтрибуты.Свойство("code", Результат.КодШаблона);
	ДопАтрибуты.Свойство("version", Результат.Версия);
	ДопАтрибуты.Свойство("shifr", Результат.Шифр);
	ДопАтрибуты.Свойство("name", Результат.Наименование);
	ДопАтрибуты.Свойство("idf", Результат.КодФормы);
	ДопАтрибуты.Свойство("idp", Результат.КодПериодичности);
	
	ТипЧисло = Новый ОписаниеТипов("Число");
	Результат.КодФормы = ТипЧисло.ПривестиЗначение(Результат.КодФормы);
	Результат.КодПериодичности = ТипЧисло.ПривестиЗначение(Результат.КодПериодичности);
	Возврат Результат;
КонецФункции
#КонецОбласти

#Область ПроцедурыИФункцииВыгрузки

Функция УзелПуст(Узел, ПоказателиНеанализируемыеНаЗаполненность = Неопределено) Экспорт 
	
	Если (СтрНайти(Узел.Тип, "A") <> 0 ИЛИ СтрНайти(Узел.Тип, "А") <> 0)
	   И (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) Тогда // учтем оба варианта: кириллицу и латиницу
		Возврат Истина;
	КонецЕсли;
	
	Если Узел.Формат = "N" Тогда
		ОбязательноеНулевоеЗначение = Ложь;
		Если ТипЗнч(Узел.Показатели) = Тип("Структура") Тогда
			ФорматПредставленияНуля = Неопределено;
			Если Узел.Показатели.Свойство("ЧН" + Узел.Ключ, ФорматПредставленияНуля) Тогда
				ОбязательноеНулевоеЗначение = НЕ ПустаяСтрока(Формат(0, ФорматПредставленияНуля));
			КонецЕсли; 
		КонецЕсли;
		ПустойУзел = (Узел.Значение = "0" ИЛИ НЕ ЗначениеЗаполнено(Узел.Значение)) И НЕ ОбязательноеНулевоеЗначение;
	Иначе
		ПустойУзел = НЕ ЗначениеЗаполнено(Узел.Значение);
	КонецЕсли;
	
	Для Каждого Стр Из Узел.Строки Цикл
		Если НЕ УзелПуст(Стр) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат ПустойУзел;
	
КонецФункции

Функция СкопироватьУзел(Родитель, Узел) Экспорт 
	
	// находим узел с максимальным индексом и с тем же кодом, что и у копируемого, и добавляем новый сразу после найденного
	СтрокиСТемЖеКодом = Родитель.Строки.НайтиСтроки(Новый Структура("Код", Узел.Код), Ложь);
	МаксИндекс = -1;
	Для Каждого СтрокаСТемЖеКодом Из СтрокиСТемЖеКодом Цикл
		ТекИндекс = Родитель.Строки.Индекс(СтрокаСТемЖеКодом);
		Если ТекИндекс > МаксИндекс Тогда
			МаксИндекс = ТекИндекс;
		КонецЕсли;
	КонецЦикла;
	
	ИндексСоздаваемогоУзла = МаксИндекс + 1;
	Если ИндексСоздаваемогоУзла >= Родитель.Строки.Количество() ИЛИ ИндексСоздаваемогоУзла = 0 Тогда // если аналогичный узел не найден или найденный узел - последний
		НовыйУзел = Родитель.Строки.Добавить();
	Иначе
		НовыйУзел = Родитель.Строки.Вставить(ИндексСоздаваемогоУзла);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйУзел, Узел, , "Родитель, Строки");
	Для Каждого Стр Из Узел.Строки Цикл
		СкопироватьУзел(НовыйУзел, Стр);
	КонецЦикла;
	Возврат НовыйУзел;
	
КонецФункции

Функция ПолучитьПервыйПодчиненныйУзелСЗаполненнымКлючом(Родитель) Экспорт 
	
	Для Каждого Стр Из Родитель.Строки Цикл
		Если ЗначениеЗаполнено(Стр.Ключ) Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

Процедура УдалитьУзел(Узел) Экспорт 
	
	РодительУзла = ?(Узел.Родитель = Неопределено, Узел.Владелец(), Узел.Родитель);
	РодительУзла.Строки.Удалить(Узел);
	
КонецПроцедуры

Функция ИзвлечьСтруктуруXML(ИмяФормы, ИмяМакета) Экспорт 
	
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("Код");
	ДеревоСтруктуры.Колонки.Добавить("Тип");
	ДеревоСтруктуры.Колонки.Добавить("Формат");
	ДеревоСтруктуры.Колонки.Добавить("МинРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("МаксРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("Обязательность");
	ДеревоСтруктуры.Колонки.Добавить("Многостраничность");
	ДеревоСтруктуры.Колонки.Добавить("Многострочность");
	ДеревоСтруктуры.Колонки.Добавить("Раздел");
	ДеревоСтруктуры.Колонки.Добавить("Ключ");
	ДеревоСтруктуры.Колонки.Добавить("Условие");
	ДеревоСтруктуры.Колонки.Добавить("ЗначениеПоУмолчанию");
	ДеревоСтруктуры.Колонки.Добавить("Значение");
	ДеревоСтруктуры.Колонки.Добавить("Представление");
	ДеревоСтруктуры.Колонки.Добавить("Показатели");
	
	Если ТипЗнч(ИмяФормы) = Тип("Строка") Тогда 
		Если Метаданные.Отчеты.Найти(ИмяФормы) = Неопределено Тогда 
			Макет = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ИмяФормы).ПолучитьМакет(ИмяМакета);
		Иначе
			Макет = Отчеты[ИмяФормы].ПолучитьМакет(ИмяМакета);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ИмяФормы) = Тип("ФормаКлиентскогоПриложения") Тогда 
		Макет = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ИмяФормы.ИмяФормы).ПолучитьМакет(ИмяМакета);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	УчтенныеГруппы = Новый Соответствие;
	
	Для Уровень = 0 По Макет.КоличествоУровнейГруппировокСтрок() - 1 Цикл
		Макет.ПоказатьУровеньГруппировокСтрок(Уровень);
		Для НомерСтроки = 2 По ВысотаТаблицы Цикл
			НомСтр = ВысотаТаблицы - НомерСтроки + 2;
			Видимость = Макет.Область(НомСтр, 0, НомСтр, 0).Видимость;
			Если Видимость И УчтенныеГруппы.Получить(НомСтр) = Неопределено Тогда
				
				РодительскийУзел = ДеревоСтруктуры;
				Если Уровень <> 0 Тогда
					Для Инд = 1 По НомСтр - 2 Цикл
						Узел = УчтенныеГруппы.Получить(НомСтр - Инд);
						Если Узел <> Неопределено Тогда
							РодительскийУзел = Узел;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				НовСтр = РодительскийУзел.Строки.Вставить(0);
				НовСтр.Код = СокрЛП(Макет.Область(НомСтр, 1, НомСтр, 1).Текст);
				НовСтр.Раздел = СокрЛП(Макет.Область(НомСтр, 2, НомСтр, 2).Текст);
				НовСтр.Ключ = СокрЛП(Макет.Область(НомСтр, 3, НомСтр, 3).Текст);
				НовСтр.Тип = СокрЛП(Макет.Область(НомСтр, 4, НомСтр, 4).Текст);
				НовСтр.Формат = СокрЛП(Макет.Область(НомСтр, 5, НомСтр, 5).Текст);
				МинРазмерность = СокрЛП(Макет.Область(НомСтр, 6, НомСтр, 6).Текст);
				НовСтр.МинРазмерность = ?(ПустаяСтрока(МинРазмерность), ?(НовСтр.Формат = "N", 99999, 0), Число(МинРазмерность));
				МаксРазмерность = СокрЛП(Макет.Область(НомСтр, 7, НомСтр, 7).Текст);
				НовСтр.МаксРазмерность = ?(ПустаяСтрока(МаксРазмерность), 99999, Число(МаксРазмерность));
				НовСтр.Обязательность = СокрЛП(Макет.Область(НомСтр, 8, НомСтр, 8).Текст);
				НовСтр.Многостраничность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 9, НомСтр, 9).Текст);
				НовСтр.Многострочность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 10, НомСтр, 10).Текст);
				НовСтр.Условие = СокрЛП(Макет.Область(НомСтр, 11, НомСтр, 11).Текст);
				НовСтр.ЗначениеПоУмолчанию = СокрЛП(Макет.Область(НомСтр, 12, НомСтр, 12).Текст);
				НовСтр.Представление = СокрЛП(Макет.Область(НомСтр, 13, НомСтр, 13).Текст);
				
				УчтенныеГруппы.Вставить(НомСтр, НовСтр);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

Функция ПолучитьДеревоВыгрузки(Форма, ИмяМакета) Экспорт 
	СтруктураВыгрузки = Неопределено;
	Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда 
		Для Каждого Реквизит Из Форма.ПолучитьРеквизиты() Цикл
			Если Нрег(Реквизит.Имя) = Нрег("СтруктураВыгрузки") Тогда 
				СтруктураВыгрузки = Форма.СтруктураВыгрузки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(СтруктураВыгрузки) = Тип("ДанныеФормыДерево") Тогда 
		Если СтруктураВыгрузки.ПолучитьЭлементы().Количество() > 0 Тогда 
			ДеревоВыгрузки = ДанныеФормыВЗначение(СтруктураВыгрузки, Тип("ДеревоЗначений"));
		Иначе 
			Если ТипЗнч(Форма) = Тип("Структура") И Форма.Свойство("ИмяФормы") Тогда 
				ДеревоВыгрузки = ИзвлечьСтруктуруXML(Форма.ИмяФормы, ИмяМакета);
			Иначе
				ДеревоВыгрузки = ИзвлечьСтруктуруXML(Форма, ИмяМакета);
			КонецЕсли;
			ЗначениеВДанныеФормы(ДеревоВыгрузки, СтруктураВыгрузки);
		КонецЕсли;
		Возврат ДеревоВыгрузки;
	Иначе
		Если ТипЗнч(Форма) = Тип("Структура") И Форма.Свойство("ИмяФормы") Тогда 
			Возврат ИзвлечьСтруктуруXML(Форма.ИмяФормы, ИмяМакета)
		Иначе 
			Возврат ИзвлечьСтруктуруXML(Форма, ИмяМакета)
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ИмеютсяАналогичныеСоседниеУзлыКлючРаздел(Стр) Экспорт 
	
	Возврат (Стр.Родитель.Строки.НайтиСтроки(Новый Структура("Ключ, Раздел", Стр.Ключ, Стр.Раздел), Ложь).Количество() > 1);
	
КонецФункции

Функция ИмеютсяАналогичныеСоседниеУзлыКлюч(Стр) Экспорт 
	
	Возврат (Стр.Родитель.Строки.НайтиСтроки(Новый Структура("Ключ", Стр.Ключ), Ложь).Количество() > 1);
	
КонецФункции

Функция СоздатьНовыйПотокXML(Кодировка = "utf-8") Экспорт
	
	ПотокXML = Новый ЗаписьXML();
	ПотокXML.Отступ = Истина;
	ПотокXML.УстановитьСтроку(Кодировка);
	ПотокXML.ЗаписатьОбъявлениеXML();
	Возврат ПотокXML;
	
КонецФункции

Функция УсловиеВыполнено(Владелец, ПараметрыВыгрузки, Условие, ИмяРаздела = "Титульный", Узел = Неопределено) Экспорт
	
	Попытка
		РезультатВычисленияВыражения = ОбщегоНазначения.ВычислитьВБезопасномРежиме(
			СтрЗаменить(Условие, "&", "Параметры."), ПараметрыВыгрузки);
		
		Если РезультатВычисленияВыражения <> Неопределено Тогда
			Если РезультатВычисленияВыражения = 1 ИЛИ РезультатВычисленияВыражения = 0
			 ИЛИ РезультатВычисленияВыражения = Истина ИЛИ РезультатВычисленияВыражения = Ложь Тогда
				Возврат НЕ (Булево(РезультатВычисленияВыражения) = Ложь);
			Иначе
				СообщитьВТаблицуСообщений(Владелец, "Не удалось вычислить выражение-условие: """ + Условие + """!", ИмяРаздела, "");
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		СообщитьВТаблицуСообщений(Владелец, "Не удалось вычислить выражение-условие: """ + Условие + """!", ИмяРаздела, "");
		Возврат Истина;
		
	КонецПопытки;
	
КонецФункции

Процедура ДополнитьСтруктуруПараметров(мДанныеОтчета, ПараметрыВыгрузки, Узел) Экспорт 
	
	Если НЕ ПустаяСтрока(Узел.Раздел) Тогда
		Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(мДанныеОтчета, Узел.Раздел) Тогда
			ПоказателиРаздела = мДанныеОтчета[Узел.Раздел];
			Если ТипЗнч(ПоказателиРаздела) = Тип("Структура") Тогда
				Для Каждого Эл Из ПоказателиРаздела Цикл
					ПараметрыВыгрузки.Вставить(Эл.Ключ, Эл.Значение);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ПоказателиРаздела = мДанныеОтчета[Узел.Раздел];
			Для Каждого Эл Из ПоказателиРаздела Цикл
				ПараметрыВыгрузки.Вставить(Эл.Ключ, Эл.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьСтруктуруПараметровПрочиеОтчеты(мДанныеОтчета, ПараметрыВыгрузки, Узел) Экспорт 
	
	Если НЕ ПустаяСтрока(Узел.Раздел) Тогда
		Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(мДанныеОтчета, "ПолеТабличногоДокумента" + Узел.Раздел) Тогда
			ПоказателиРаздела = мДанныеОтчета["ПолеТабличногоДокумента" + Узел.Раздел];
			Для Каждого Эл Из ПоказателиРаздела Цикл
				ПараметрыВыгрузки.Вставить(Эл.Ключ, Эл.Значение);
			КонецЦикла;
		Иначе
			ПоказателиРаздела = мДанныеОтчета[Узел.Раздел];
			Для Каждого Эл Из ПоказателиРаздела Цикл
				ПараметрыВыгрузки.Вставить(Эл.Ключ, Эл.Значение);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьУзелДереваВXML(СтрокаДерева, ПотокXML, ПараметрыВыгрузки) Экспорт
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДеревоЗначений") Тогда
		Для каждого Стр Из СтрокаДерева.Строки Цикл
			ЗаписатьУзелДереваВXML(Стр, ПотокXML, ПараметрыВыгрузки);
		КонецЦикла;
	Иначе
		Если СтрокаДерева.Тип = "А" ИЛИ СтрокаДерева.Тип = "A" Тогда 
			ПотокXML.ЗаписатьАтрибут(СтрокаДерева.Код, Строка(СтрокаДерева.Значение));
		Иначе
			ПотокXML.ЗаписатьНачалоЭлемента(СтрокаДерева.Код);
			Для каждого Лист Из СтрокаДерева.Строки Цикл
				Если Лист.Тип = "А" ИЛИ Лист.Тип = "A" Тогда 
					ЗаписатьУзелДереваВXML(Лист, ПотокXML, ПараметрыВыгрузки);
				КонецЕсли;
			КонецЦикла;
			Для каждого Лист Из СтрокаДерева.Строки Цикл
				Если Не (Лист.Тип = "А" ИЛИ Лист.Тип = "A") Тогда 
					ЗаписатьУзелДереваВXML(Лист, ПотокXML, ПараметрыВыгрузки);
				КонецЕсли;
			КонецЦикла;
			ПотокXML.ЗаписатьТекст(Строка(СтрокаДерева.Значение));
			ПотокXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗначениеСоответствуетФормату(Форма, Стр) Экспорт
	
	СтатусПроверки = Истина;
	Если Стр.Формат = "Т" ИЛИ Стр.Формат = "T" Тогда // учтем оба варианта: кириллицу и латиницу
		ДлинаЗначения = СтрДлина(Стр.Значение);
		Если ДлинаЗначения < Стр.МинРазмерность Тогда
			СтатусПроверки = Ложь;
			СообщитьВТаблицуСообщений(Форма, "Длина значения показателя """ + ПредставлениеПоказателя(Стр) + """ меньше минимально возможной (" + ДлинаЗначения + " < " + Стр.МинРазмерность + ")", "Титульный", "");
		КонецЕсли;
		Если ДлинаЗначения > Стр.МаксРазмерность Тогда
			СтатусПроверки = Ложь;
			СообщитьВТаблицуСообщений(Форма, "Длина значения показателя """ + ПредставлениеПоказателя(Стр) + """ больше максимально возможной (" + ДлинаЗначения + " > " + Стр.МаксРазмерность + ")", "Титульный", "");
		КонецЕсли;
	КонецЕсли;
	Возврат СтатусПроверки;
	
КонецФункции 

Функция ПредставлениеПоказателя(Стр) Экспорт 
	
	Возврат ?(ПустаяСтрока(Стр.Представление), Стр.Код, Стр.Представление);
	
КонецФункции

Функция ВывестиПоказательСтатистикиВXML(Узел, ЗначениеПоказателя, ФорматПредставленияНуля = "") Экспорт 
	
	МаксШирина = Узел.МаксРазмерность;
	
	Если Узел.Формат = "T" ИЛИ Узел.Формат = "Т" Тогда      // учтем оба варианта: кириллицу и латиницу
		Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			Узел.Значение = ?(МаксШирина < СтрДлина(СокрЛП(ЗначениеПоказателя)), СокрЛП(Лев(СокрЛП(ЗначениеПоказателя), МаксШирина)), СокрЛП(ЗначениеПоказателя));
		Иначе
			Узел.Значение = Неопределено;
		КонецЕсли;
	ИначеЕсли Узел.Формат = "B" ИЛИ Узел.Формат = "В" Тогда // учтем оба варианта: кириллицу и латиницу
		Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			Узел.Значение = ?(ТипЗнч(ЗначениеПоказателя) = Тип("Строка"), СокрЛП(ЗначениеПоказателя), ?(Булево(0 + ЗначениеПоказателя), "true", "false"));
		Иначе
			Узел.Значение = Неопределено;
		КонецЕсли;
	ИначеЕсли Узел.Формат = "N" Тогда
		СтрокаФормата = "ЧРД=.;ЧН=0;ЧГ=;";
		Если Узел.МаксРазмерность <> 0 И Узел.МаксРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧЦ=" + Формат(Узел.МаксРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Если Узел.МинРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧДЦ=" + Формат(Узел.МинРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Узел.Значение = ЧислоПоФормату(ЗначениеПоказателя, СтрокаФормата, Истина);
		Если СтрНайти(ФорматПредставленияНуля, "ЧН=") > 0 Тогда
			Узел.Показатели = Новый Структура("ЧН" + СокрЛП(Узел.Ключ), ФорматПредставленияНуля);
		КонецЕсли;
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Если ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
			Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
				Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, "ДФ=гггг"));
			Иначе
				Узел.Значение = Неопределено;
			КонецЕсли;
		Иначе
			Узел.Значение = Прав(СокрЛП(ЗначениеПоказателя), 4);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОтсечьНезаполненныеНеобязательныеУзлыСтатистики(Узел) Экспорт 
	
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Стр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		ОтсечьНезаполненныеНеобязательныеУзлыСтатистики(Стр);
	КонецЦикла;
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если (СтрНайти(Узел.Тип, "A") <> 0 ИЛИ СтрНайти(Узел.Тип, "А") <> 0) // Необязательные атрибуты пропускаем (они удаляются только вместе с узлом)
			И (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) Тогда // учтем оба варианта: кириллицу и латиницу
			Возврат;
		КонецЕсли;
		
		Если (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) И УзелПуст(Узел) Тогда // учтем оба варианта: кириллицу и латиницу
			УдалитьУзел(Узел);
		ИначеЕсли (СтрНайти(Узел.Обязательность, "М") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "M") <> 0) // учтем оба варианта: кириллицу и латиницу
			И УзелПуст(Узел)
			И ?(СтрНайти(Узел.Обязательность, "О") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "O") <> 0, ИмеютсяАналогичныеСоседниеУзлыКлючРаздел(Узел), Истина) Тогда
			УдалитьУзел(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьДанные(Форма, Узел) Экспорт 
	
	СтатусПроверки = Истина;
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если НЕ ЗначениеСоответствуетФормату(Форма, Узел) Тогда
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Стр Из Узел.Строки Цикл
		СтатусПроверки = (ПроверитьДанные(Форма, Стр) И СтатусПроверки); // именно в указанном порядке для выдачи всех ошибок
	КонецЦикла;
	Возврат СтатусПроверки;
	
КонецФункции

Функция СформироватьСтруктуруДопАтрибутов(ИмяФормы, ИмяМакета) Экспорт 
	
	ДопАтрибуты = Новый Структура;
	
	Если ТипЗнч(ИмяФормы) = Тип("ФормаКлиентскогоПриложения") Тогда 
		Макет = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ИмяФормы.ИмяФормы).ПолучитьМакет(ИмяМакета);
	Иначе 
		Макет = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ИмяФормы).ПолучитьМакет(ИмяМакета);
	КонецЕсли;
	
	Для НомСтр = 1 По Макет.ВысотаТаблицы Цикл
		АтрКлюч = СокрЛП(Макет.Область(НомСтр, 1, НомСтр, 1).Текст);
		Если НЕ ПустаяСтрока(АтрКлюч) Тогда
			АтрКлюч = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(".- ", АтрКлюч, "___");
			ДопАтрибуты.Вставить(АтрКлюч, СокрЛП(Макет.Область(НомСтр, 2, НомСтр, 2).Текст));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДопАтрибуты;
	
КонецФункции

// Функция возвращеат формат выгрузки стат. отчета в формате **-**-****, например, 16-09-2013
// ИсточникОтчета - Строка, имя отчета, например, РегламентированныйОтчетСтатистикаФормаП1
// ИмяФормы - Строка, имя формы, например, ФормаОтчета2016Кв1
// ДопПараметры - Неопределено или структура с доп. параметрами
Функция ПолучитьВерсиюВыгрузкиСтатОтчета(ИсточникОтчета, ИмяФормы, ДопПараметры = Неопределено) Экспорт
	ИмяМакетаАттр = СтрЗаменить(ИмяФормы, "ФормаОтчета", "АтрибВыгрузкиXML");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	0 КАК Ссылка
	|ИЗ
	|	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	|ГДЕ
	|	РегламентированныеОтчеты.ИсточникОтчета = &ИсточникОтчета
	|	И НЕ РегламентированныеОтчеты.ПометкаУдаления
	|	И РегламентированныеОтчеты.ВнешнийОтчетИспользовать";
	
	Запрос.УстановитьПараметр("ИсточникОтчета", ИсточникОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОтчетИмя = "ВнешнийОтчет."+ИсточникОтчета+".Форма."+ИмяФормы;
	Иначе
		ОтчетИмя = "Отчет."+ИсточникОтчета+".Форма."+ИмяФормы;
	КонецЕсли;
	
	ВерсияРезультат = "";
	Для Каждого Макет Из Метаданные.Отчеты[ИсточникОтчета].Макеты Цикл 
		Если СтрНачинаетсяС(Макет.Имя, ИмяМакетаАттр) Тогда
			ДопАтрибуты = СформироватьСтруктуруДопАтрибутов(ОтчетИмя, Макет.Имя);
			ДопАтрибуты.Свойство("version", ВерсияРезультат);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВерсияРезультат;
КонецФункции

Процедура ОбработатьУсловныеЭлементы(Форма, Знач ПараметрыВыгрузки, Узел) Экспорт 
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если Узел.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
			Возврат;
		КонецЕсли;
		ДополнитьСтруктуруПараметров(Форма.мДанныеОтчета, ПараметрыВыгрузки, Узел);
	КонецЕсли;
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		ТекСтр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		Если НЕ ПустаяСтрока(ТекСтр.Условие) Тогда
			Если НЕ УсловиеВыполнено(Форма, ПараметрыВыгрузки, ТекСтр.Условие, , Узел) Тогда
				Узел.Строки.Удалить(ТекСтр);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ОбработатьУсловныеЭлементы(Форма,ПараметрыВыгрузки, ТекСтр);
	КонецЦикла;
	
КонецПроцедуры

Функция ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки, Кодировка = "utf-8") Экспорт 
	
	ПотокXML = СоздатьНовыйПотокXML(Кодировка); // создаем новый поток для записи
	ЗаписатьУзелДереваВXML(ДеревоВыгрузки, ПотокXML, ПараметрыВыгрузки); // пишем дерево в поток
	ТекстДляЗаписи = ПотокXML.Закрыть(); // получаем текст XML
	
	Возврат ТекстДляЗаписи;
	
КонецФункции

#КонецОбласти

#Область НоваяФормаРегламентированнойОтчетности

#Область ЗаписьОбъектовВРегистрЖурналОтчетовСтатусы

// Определяет вид государственного органа, в который сдается отчет переданного вида.
//
// Параметры:
//   ИмяОтчета - Строка - название регламентированного отчета, см. ИмяРеглОтчета().
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ТипыКонтролирующихОрганов - вид государственного органа.
//
Функция ВидКонтролирующегоОргана(ИмяОтчета) Экспорт
	
	// ДЕНЬГИ
	ВидКонтролирующегоОргана = "ФНС";
	// Конец ДЕНЬГИ	
	
	Возврат ВидКонтролирующегоОргана;
	
КонецФункции

Функция ОпределитьСвойстваОбъектовДляОтображенияВФормеОтчетность(Ссылки) Экспорт
	
	// Формируем массив ссылок, для которых будем определять свойства
	Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
		МассивСсылок = Ссылки;
	Иначе
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(Ссылки);
	КонецЕсли;
	
	ТаблицаСвойств = Новый ТаблицаЗначений;
	ТаблицаСвойств.Колонки.Добавить("Ссылка");
	ТаблицаСвойств.Колонки.Добавить("ДатаСоздания", 			Новый ОписаниеТипов("Дата"));
	ТаблицаСвойств.Колонки.Добавить("Наименование", 			Новый ОписаниеТипов("Строка"));
	ТаблицаСвойств.Колонки.Добавить("КодКонтролирующегоОргана", Новый ОписаниеТипов("Строка"));
	ТаблицаСвойств.Колонки.Добавить("ДатаНачала",				Новый ОписаниеТипов("Дата"));
	ТаблицаСвойств.Колонки.Добавить("ДатаОкончания", 			Новый ОписаниеТипов("Дата"));
	ТаблицаСвойств.Колонки.Добавить("ВариантОтчета", 			Новый ОписаниеТипов("Строка,Число"));
	ТаблицаСвойств.Колонки.Добавить("ПометкаУдаления", 			Новый ОписаниеТипов("Булево"));
	ТаблицаСвойств.Колонки.Добавить("Комментарий", 				Новый ОписаниеТипов("Строка"));
	ТаблицаСвойств.Колонки.Добавить("Организация");
	
	// Заполняем колонку ссылок
	Для каждого ЭлементМассив Из МассивСсылок Цикл
		НоваяСтрока = ТаблицаСвойств.Добавить();
		НоваяСтрока.Ссылка = ЭлементМассив;
	КонецЦикла;
	
	// Определяем свойства для ссылок
	РегламентированнаяОтчетностьПереопределяемый.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(ТаблицаСвойств);
	
	Возврат ТаблицаСвойств;
	
КонецФункции

Процедура ОпределениеСвойстваОбъектаДляОтображенииВФормеОтчетность(Ссылка, ЗначенияЗаполнения)
	
	ТаблицаСвойств = ОпределитьСвойстваОбъектовДляОтображенияВФормеОтчетность(Ссылка);
	СвойстваСсылки = ТаблицаСвойств.Найти(Ссылка, "Ссылка");
	
	Если СвойстваСсылки <> Неопределено Тогда
		
		ЗначенияЗаполнения.ДатаСоздания = СвойстваСсылки.ДатаСоздания;
		Если ЗначениеЗаполнено(СвойстваСсылки.Наименование) Тогда
			ЗначенияЗаполнения.НаименованиеОтчета = СвойстваСсылки.Наименование;
		КонецЕсли;
		ЗначенияЗаполнения.ДатаНачалаОП             = СвойстваСсылки.ДатаНачала;
		ЗначенияЗаполнения.ДатаОкончанияОП          = СвойстваСсылки.ДатаОкончания;
		ЗначенияЗаполнения.ДатаСоздания             = СвойстваСсылки.ДатаСоздания;
		ЗначенияЗаполнения.Организация              = СвойстваСсылки.Организация;
		ЗначенияЗаполнения.КодКонтролирующегоОргана = СвойстваСсылки.КодКонтролирующегоОргана;
		ЗначенияЗаполнения.Комментарий              = СвойстваСсылки.Комментарий;
		Если ТипЗнч(СвойстваСсылки.ВариантОтчета) = Тип("Число") Тогда
			ЗначенияЗаполнения.ПредставлениеВида = ?(СвойстваСсылки.ВариантОтчета = 0, "П", "К/" + СвойстваСсылки.ВариантОтчета);
		Иначе
			ЗначенияЗаполнения.ПредставлениеВида = Строка(СвойстваСсылки.ВариантОтчета);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодпискаНаСобытие

// Обработчик подписки на событие "ЗаписьОбъектовРегламентированнойОтчетности".
//
Процедура ЗаписьОбъектовРегламентированнойОтчетности(Источник, Отказ) Экспорт
	
	Ссылка = Источник.Ссылка;
	Если Ссылка <> Источник Тогда
		// Проверка только если это объект, а не ссылка 
		Если Источник.ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// От записи объекта можно отказаться
	СтандартнаяОбработка = Истина;
	РегламентированнаяОтчетностьПереопределяемый.ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

// Обработчик подписки на событие "ВыполнитьДействияПередУдалениемПрисоединенногоФайлаБРО"
// (для изменения индекса картинки в регистре сведений "Журнал отчетов статусы" и признака
// наличия присоединенных файлов в регистре сведений "Журнал отправок в контролирующие органы").
//
// Параметры:
//  Источник   - СправочникОбъект - объект справочника с именем "*ПрисоединенныеФайлы".
//  Отказ      - Булево - параметр, передаваемый в подписку на событие ПередЗаписью.
//
Процедура ВыполнитьДействияПередУдалениемПрисоединенногоФайла(Источник, Отказ) Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Вычислить("Тип(""СправочникОбъект.ВерсииФайлов"")") Тогда // ДЕНЬГИ
		Возврат;
	КонецЕсли;
	
	Если СтандартныеПодсистемыСервер.ЭтоИдентификаторОбъектаМетаданных(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВладелецФайлов = Источник.ВладелецФайла;
			
	МассивФайловВладельца = ПолучитьВсеПодчиненныеФайлы(ВладелецФайлов);
	
	ОбъектИмеетФайлыНеПомеченныеНаУдаление = Ложь;
			
	Для Каждого ФайлВладельца Из МассивФайловВладельца Цикл
		
		Если НЕ ФайлВладельца.ПометкаУдаления Тогда
			
			ОбъектИмеетФайлыНеПомеченныеНаУдаление = Истина;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ОбъектИмеетФайлыНеПомеченныеНаУдаление Тогда
		
		ИмяРегистраСведенийНФ = "НаличиеФайлов";
		
		Если Метаданные.РегистрыСведений.Найти(ИмяРегистраСведенийНФ) = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОтборНФ = Новый Структура("ОбъектСФайлами", ВладелецФайлов);
		ВыборкаНФ = РегистрыСведений[ИмяРегистраСведенийНФ].Выбрать(ОтборНФ);
		
		Если ВыборкаНФ.Следующий() Тогда
			
			// ДЕНЬГИ
			УстановитьИндексКартинкиОтчета(ВладелецФайлов, "УдалениеФайла");
			Возврат;
			// удален вызов других подсистем
			// Конец ДЕНЬГИ	
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подписки на событие "ВыполнитьДействияПриЗаписиПрисоединенногоФайлаБРО"
// (для изменения индекса картинки в регистре сведений "Журнал отчетов статусы" и признака
// наличия присоединенных файлов в регистре сведений "Журнал отправок в контролирующие органы").
//
// Параметры:
//  Источник   - СправочникОбъект - объект справочника с именем "*ПрисоединенныеФайлы".
//  Отказ      - Булево - параметр, передаваемый в подписку на событие ПередЗаписью.
//
Процедура ВыполнитьДействияПриЗаписиПрисоединенногоФайла(Источник, Отказ) Экспорт
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Вычислить("Тип(""СправочникОбъект.ВерсииФайлов"")") Тогда // ДЕНЬГИ
		Возврат;
	КонецЕсли;
	
	Если СтандартныеПодсистемыСервер.ЭтоИдентификаторОбъектаМетаданных(Источник) Тогда
		Возврат;
	КонецЕсли;
			
	УстановитьПривилегированныйРежим(Истина);
	
	ВладелецФайлов = Источник.ВладелецФайла;
	
		// ДЕНЬГИ
		УстановитьИндексКартинкиОтчета(ВладелецФайлов, "ПрисоединениеФайла");
		// удален вызов других подсистем
		// Конец ДЕНЬГИ	
		
	
КонецПроцедуры

#КонецОбласти

// Формирует таблицу для получения данных из переопределяемого метода
Функция ТаблицаОписанияОбъектовРегламентированнойОтчетности() Экспорт
	
	ТаблицаОписания = ПустаяТаблицаОписанияОбъектовРегламентированнойОтчетности();
	
	// ДЕНЬГИ ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);
	
	РегламентированнаяОтчетностьПереопределяемый.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);
	
	ЗаполнитьНаименованиеВТаблицеОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);
	
	Возврат ТаблицаОписания;
	
КонецФункции

// Устанавливает переменную "ОбъектОтправляется" в "Ложь", если регламентированный отчет не отправляется в контролирующие органы
Процедура РегламентированныйОтчетОтправляетсяВКонтролирующиеОрганы(ДокСсылка, ОбъектОтправляется) Экспорт
	
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы = Новый Массив;
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетДвижениеСредствПоСчетуВБанкеЗаПределамиРФ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетДеятельностьИнОргВРФ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетДоходыОтТуристскоРекреационнойДеятельности");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетЖивотныйМирСведенияОВыданныхЛицензиях");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетИсполнениеКонтрактовГОЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетПодтверждениеРазмещенияОтчетаНИОКРвГИС");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетПрибыльСколковоРасчетНалоговойБазы");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРасчетПоОплатеЗаВоду");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФНаПереработкуБензина");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоАвиационномуКеросину");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоБензинуИзДавальческогоСырья");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоБензинуИзСобственногоСырья");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоБензолуПараксилолуОртоксилолу");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоНефтяномуСырью");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоСреднимДистиллятам");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетРеестрСФПоЭтиловомуСпирту");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСведенияОрублевыхСчетах");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСведенияОСчетахвВиностраннойВалюте");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСоответствиеУсловийТруда");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистика1Квотирование");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма1ДМ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМДавальческоеСырье");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма4ДМ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФорма2ДМприл");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФормаП1Приложение3");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтраховыеВзносыНСИПЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетФорма1ГОЗ");
	РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Добавить("РегламентированныйОтчетСтатистикаФормаМГОЗ");
	
	Если РеглОтчетыНеОтправляютсяВКонтролирующиеОрганы.Найти(ДокСсылка.ИсточникОтчета) <> Неопределено Тогда
	
		ОбъектОтправляется = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры

// Дополняет дерево видов отчетов другими видами, входящими и не входящими в БРО
Процедура ДобавитьВДеревоРегламентированныхОтчетовДругиеОтчеты(ДеревоОтчетов) Экспорт
	
	// ДЕНЬГИ
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
	// Добавим дерево отчетов из пользовательских конфигураций
	РегламентированнаяОтчетностьПереопределяемый.ДобавитьВДеревоРегламентированныхОтчетовДругиеОтчеты(ДеревоОтчетов);
	
КонецПроцедуры

Процедура ДобавитьОтчетВДеревоРегламентированныхОтчетов(ДеревоОтчетов, ЗначенияКолонок)
	
	Перем Категория;
	
	УзелДерева = ДеревоОтчетов;
	
	Если ЗначенияКолонок.Свойство("Категория", Категория) И ЗначениеЗаполнено(Категория) Тогда
		НайденныеГруппы = ДеревоОтчетов.Строки.НайтиСтроки(Новый Структура("Наименование,ЭтоГруппа", Категория, Истина), Истина);
		Если НайденныеГруппы.Количество() > 0 Тогда
			УзелДерева = НайденныеГруппы[0];
		Иначе // создаем папку
			УзелДерева = ДеревоОтчетов.Строки.Добавить();
			УзелДерева.Наименование = Категория;
			УзелДерева.ЭтоГруппа = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаДерева = УзелДерева.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаДерева, ЗначенияКолонок);
	
КонецПроцедуры

Процедура ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма) Экспорт

	РегламентированнаяОтчетностьПереопределяемый.ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма);

КонецПроцедуры

Процедура СправочникРегламентированныеОтчеты_ПриСозданииНаСервере(Форма) Экспорт

	РегламентированнаяОтчетностьПереопределяемый.СправочникРегламентированныеОтчеты_ПриСозданииНаСервере(Форма);

КонецПроцедуры

Функция КоличествоОбъектовНеЗаписанныхВРегистр(ПараметрыЗапуска) Экспорт
	
	НаименованиеЗадания = НСтр("ru = 'Проверка полноты данных журнала регламентированной отчетности'");
	Результат = ЗапуститьВыполнениеВФоне(
		ПараметрыЗапуска.УникальныйИдентификаторФормы,
		"РегламентированнаяОтчетность.ВыполнитьПроверку",
		ПараметрыЗапуска,
		НаименованиеЗадания);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПроверку(Параметры, АдресХранилища) Экспорт
	
	КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтправокВКонтролирующиеОрганы = 0; // ДЕНЬГИ 
		// ДЕНЬГИ ДокументооборотСКОВызовСервера.КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтправокВКонтролирующиеОрганы();
		
	КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтчетовСтатусы =
		РегламентированнаяОтчетностьВызовСервера.КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтчетовСтатусы();
		
	ОбщееКоличествоОбъектов = КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтправокВКонтролирующиеОрганы
							+ КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтчетовСтатусы;
		
	КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтчетовСтатусы =
		РегламентированнаяОтчетностьВызовСервера.КоличествоНекорректныхЗаписейРегистраЖурналОчетовСтатусы();
	
	РезультатОбработки = Новый Структура();
	РезультатОбработки.Вставить("КоличествоНезаписанныхОбъектов", ОбщееКоличествоОбъектов);
	РезультатОбработки.Вставить("КоличествоНекорректныхЗаписей", КоличествоОбъектовНеЗаписанныхВРегистрЖурналОтчетовСтатусы);
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ДобавлениеОбъектовОтсутствующихВРегистре(ПараметрыЗапуска) Экспорт
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение данных журнала регламентированной отчетности'");
	Результат = ЗапуститьВыполнениеВФоне(
		ПараметрыЗапуска.УникальныйИдентификаторФормы,
		"РегламентированнаяОтчетность.ВыполнитьДобавлениеВРегистр",
		ПараметрыЗапуска,
		НаименованиеЗадания);
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьДобавлениеВРегистр(Параметры, АдресХранилища) Экспорт
	
	// ДЕНЬГИ
	РезультатОбработки = Новый Структура();
	РезультатОбработки.Вставить("ДобавлениеВыполнено", Ложь);
	// Конец ДЕНЬГИ	
	
	ПоместитьВоВременноеХранилище(РезультатОбработки, АдресХранилища);
	
КонецПроцедуры

Функция ЗапуститьВыполнениеВФоне(Знач ИдентификаторФормы, Знач ИмяЭкспортнойПроцедуры, 
	Знач Параметры, Знач НаименованиеЗадания = "", ИспользоватьДополнительноеВременноеХранилище = Ложь) Экспорт
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторФормы);
	
	Если Не ЗначениеЗаполнено(НаименованиеЗадания) Тогда
		НаименованиеЗадания = ИмяЭкспортнойПроцедуры;
	КонецЕсли;
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(Параметры);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	Если ИспользоватьДополнительноеВременноеХранилище Тогда
		АдресХранилищаДополнительный = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторФормы);
		ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилищаДополнительный);
	КонецЕсли;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ИмяЭкспортнойПроцедуры);
	ПараметрыЗадания.Добавить(ПараметрыЭкспортнойПроцедуры);

	Задание = ФоновыеЗадания.Выполнить("ОбщегоНазначения.ВыполнитьМетодКонфигурации", ПараметрыЗадания,, НаименованиеЗадания);
	
	Результат = Новый Структура;
	Результат.Вставить("АдресХранилища",       АдресХранилища);
	Результат.Вставить("ЗаданиеВыполнено",     ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор));
	Результат.Вставить("ИдентификаторЗадания", Задание.УникальныйИдентификатор);
	
	Если ИспользоватьДополнительноеВременноеХранилище Тогда
		Результат.Вставить("АдресХранилищаДополнительный", АдресХранилищаДополнительный);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьСобытие1СОтчетности(ИмяСобытия, СсылкаНаИсточник = Неопределено, ДопПараметрСтруктура = Неопределено) Экспорт
			
	Если СсылкаНаИсточник = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ИмяСобытия = НСтр("ru = 'Регламентированный отчет. Создание'") Тогда
		
		СтатистикаБРОКлиентСервер.ДобавитьСобытие(ИмяСобытия + ". " + КомментарийКСозданиюРеглОтчета(СсылкаНаИсточник));
		
	ИначеЕсли ИмяСобытия = НСтр("ru = 'Регламентированный отчет. Выгрузка'") Тогда
		
		СтатистикаБРОКлиентСервер.ДобавитьСобытие(ИмяСобытия + ". " + КомментарийКВыгрузкеРеглОтчета(СсылкаНаИсточник));
		
	ИначеЕсли ИмяСобытия = НСтр("ru = 'Регламентированный отчет. Проверка выгрузки'") Тогда
		
		СтатистикаБРОКлиентСервер.ДобавитьСобытие(ИмяСобытия + ". " + КомментарийКПроверкеВыгрузки(СсылкаНаИсточник));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииФильтрацииОрганизацийВСтартовойФормеРегламентированногоОтчета

// Процедура возвращает список организаций - юридических лиц.
//
// Параметры:
//  СписокЮрЛиц - СписокЗначений - список организаций, являющихся юридическими лицами
//  Текст       - Строка - подстрока поиска в наименовании организации.
//
Процедура ПолучитьСписокДоступныхЮридическихЛиц(СписокЮрЛиц = Неопределено, Знач Текст = Неопределено) Экспорт
	
	Если СписокЮрЛиц = Неопределено ИЛИ ТипЗнч(СписокЮрЛиц) <> Тип("СписокЗначений") Тогда
		
		СписокЮрЛиц = Новый СписокЗначений;
		
	КонецЕсли;
	
	ДополнитьСтрокуСпециальнымиСимволами(Текст);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Организации.Ссылка,
				   |	Организации.Наименование
				   |ИЗ
				   |	Справочник.Организации КАК Организации
				   |ГДЕ
				   |	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
				   |	И НЕ Организации.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Запрос.Текст = Запрос.Текст + " И Организации.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""";
		Запрос.УстановитьПараметр("Текст", Текст);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Наименование";
	
	РегламентированнаяОтчетностьПереопределяемый.СформироватьТекстЗапросаДляПолученияДоступныхЮридическихЛиц(
		Запрос.Текст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокЮрЛиц.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура возвращает список организаций - индивидуальных предпринимателей.
//
// Параметры:
//  СписокФизЛиц - СписокЗначений - список организаций, являющихся индивидуальными предпринимателями
//  Текст        - Строка - подстрока поиска в наименовании организации.
//
Процедура ПолучитьСписокДоступныхИндивидуальныхПредпринимателей(СписокФизЛиц = Неопределено, Знач Текст = Неопределено) Экспорт
	
	Если СписокФизЛиц = Неопределено ИЛИ ТипЗнч(СписокФизЛиц) <> Тип("СписокЗначений") Тогда
		
		СписокФизЛиц = Новый СписокЗначений;
		
	КонецЕсли;
	
	ДополнитьСтрокуСпециальнымиСимволами(Текст);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Организации.Ссылка,
				   |	Организации.Наименование
				   |ИЗ
				   |	Справочник.Организации КАК Организации
				   |ГДЕ
			// ДЕНЬГИ	   |	Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо) И
				   |	НЕ Организации.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Запрос.Текст = Запрос.Текст + " И Организации.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""";
		Запрос.УстановитьПараметр("Текст", Текст);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Наименование";
	
	// ДЕНЬГИ РегламентированнаяОтчетностьПереопределяемый.СформироватьТекстЗапросаДляПолученияДоступныхИндивидуальныхПредпринимателей(
	// ДЕНЬГИ	Запрос.Текст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокФизЛиц.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательная процедура, дополняющая передаваемую строку спец. символами.
//
// Параметры:
//  Текст - Строка.
//
Процедура ДополнитьСтрокуСпециальнымиСимволами(Знач Текст = Неопределено)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Текст = СтрЗаменить(Текст, "~", "~~");
		Текст = СтрЗаменить(Текст, "%", "~%");
		Текст = СтрЗаменить(Текст, "_", "~_");
		Текст = СтрЗаменить(Текст, "[", "~[");
		Текст = СтрЗаменить(Текст, "-", "~-");
		Текст = Текст + "%";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВсеЮрФизЛица(ЮрЛицо) Экспорт
	
	Попытка
		ЮФЛ = Метаданные.Перечисления.Найти("ЮридическоеФизическоеЛицо");
		ЮФЛРек = Метаданные.Справочники.Организации.Реквизиты.Найти("ЮридическоеФизическоеЛицо");
		Если ЮФЛ <> Неопределено И ЮФЛРек <> Неопределено Тогда 
			Запрос = Новый Запрос;
			// ДЕНЬГИ
			//Запрос.УстановитьПараметр("ФЛ", ?(ЮрЛицо, Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо));
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Организации.*
				|ИЗ
				|	Справочник.Организации КАК Организации
				|ГДЕ
				|	НЕ Организации.ПометкаУдаления
				//|	И Организации.ЮридическоеФизическоеЛицо = &ФЛ
				|";
			// Конец ДЕНЬГИ
			Результат = Новый Массив;
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Результат.Добавить(Выборка.Ссылка);
			КонецЦикла;
			
			Возврат Результат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.*
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	НЕ Организации.ПометкаУдаления";
		
	Результат = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если (ЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Выборка.Ссылка)) Тогда 
			Результат.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивФормСтатистикиТолькоДляОрганизации()
	
	Результат = Новый Массив;
	
	Результат.Добавить("РегламентированныйОтчетАвансыИмущество");
	Результат.Добавить("РегламентированныйОтчетДоходыЗаПределамиРФ");
	Результат.Добавить("РегламентированныйОтчетИмущество");
	Результат.Добавить("РегламентированныйОтчетПрибыль");
	Результат.Добавить("РегламентированныйОтчетПрибыльИностраннойОрганизации");
	Результат.Добавить("РегламентированныйОтчетПрибыльСколковоРасчетПрибыли");
	Результат.Добавить("РегламентированныйОтчетПрибыльСРП");
	Результат.Добавить("РегламентированныйОтчетСведенияОДолеДоходовОтОбразовательнойИлиМедДеятельности");
	Результат.Добавить("РегламентированныйОтчетТранспортныйНалог");
	Результат.Добавить("РегламентированныйОтчетФинансовыйРезультатИнвестиционногоТоварищества");
	
	// Статистические отчеты.
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11К");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11НА");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11Сделка");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11ТЭР");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма11ФСС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма12Строительство");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма12Ф");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма14МЕТлом");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Автотранс");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Администрация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Алкоголь");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1АлкогольОпт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ВЭС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ГС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ДАП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ДАуслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Закупки");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1И");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИЖС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Кадры");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Контракт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1КСРКраткая");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1МБ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1МО");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1МС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1НатураБМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1П");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1РабочаяСила");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1РП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1СХцены");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Т");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТГМС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТЕП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Технология");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТОРГ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ТРавто");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Туст");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Тчзп");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Учет");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ФП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ФПинд");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ЦеныПриобр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХсв");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма24Энергетика");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма26ЖКХ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2ГСГЗ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2МС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2НаукаКр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2Приватизация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2СБСеверСр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма2ЦеныПриобр");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3Информ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3Приватизация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3СБвывоз");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3ТОРГПМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма3Ф");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма4Запасы");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма4Инновация");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма4ТЭР");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма57Т");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма5З");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма65Автотранс");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма7Травматизм");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма85К");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма8ВЭСТрусл");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма8ВЭСуслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9КС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9ФОМС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9ФПФ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма9ФСС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаДАППМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаДАС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаДАФЛ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаИЖС");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПЗдрав");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПКультура");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПНаука");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПОбразование");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПСоц");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМПм");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМПмсх");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП1");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП1Приложение3");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП1СХ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП2");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП2инв");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП2к");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП3");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП4");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП4НЗ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП5М");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаП6");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПМ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПМТорг");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаС1");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаС2");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаТОРГм");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМПСП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаТЗВМП");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаТЗВбюджет");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаПУслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1СОНКО");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1НКО");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Тпроф");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаМГОЗ");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХжилище");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма22ЖКХресурсы");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Конъюнктура");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1КонъюнктураОпт");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФормаЗПФизическаяКультураИСпорт");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивФормСтатистикиТолькоДляИП()
	
	Результат = Новый Массив;
	
	// Статистические отчеты.
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПсвед");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1Предприниматель");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПмес");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПуслуги");
	Результат.Добавить("РегламентированныйОтчетСтатистикаФорма1ИПАвтогруз");
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьОтборВФормеВыбораОтчета(Форма) Экспорт
	
	ИмяОтчета = Форма.ИмяФормы;
	Если СтрНайти(ИмяОтчета, "ОсновнаяФорма") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОтчета = Сред(СтрЗаменить(ИмяОтчета, "ВнешнийОтчет.", "Отчет."), СтрДлина("Отчет.") + 1);
	ИмяОтчета = Лев(ИмяОтчета, СтрНайти(ИмяОтчета, ".") - 1);
	
	Попытка
		Отчеты[ИмяОтчета].УстановитьФильтр(Форма);
		Возврат;
	Исключение
	КонецПопытки;
	
	Если ПолучитьМассивФормСтатистикиТолькоДляОрганизации().Найти(ИмяОтчета) <> Неопределено Тогда
		
		МассивОтбора = ВсеЮрФизЛица(Истина);
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбора)));
		Форма.Элементы.Организация.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		Если МассивОтбора.Найти(Форма.Организация) = Неопределено Тогда
			Форма.Организация = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ПолучитьМассивФормСтатистикиТолькоДляИП().Найти(ИмяОтчета) <> Неопределено Тогда
		
		МассивОтбора = ВсеЮрФизЛица(Ложь);
		МассивПараметровВыбора = Новый Массив;
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОтбора)));
		Форма.Элементы.Организация.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		Если МассивОтбора.Найти(Форма.Организация) = Неопределено Тогда
			Форма.Организация = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПоказателиОценкиРискаВыезднойНалоговойПроверки

Функция ОтчетыОценкиРисков(Организация, ДатаНачала, ДатаОкончания)
	
	ТаблицаОтчетов = Новый ТаблицаЗначений;
	ТаблицаОтчетов.Колонки.Добавить("РегламентированныйОтчет");
	ТаблицаОтчетов.Колонки.Добавить("ИсточникОтчета");
	ТаблицаОтчетов.Колонки.Добавить("ВыбраннаяФорма");
	ТаблицаОтчетов.Колонки.Добавить("ПериодДокумента");
	ТаблицаОтчетов.Колонки.Добавить("КодНалоговогоОргана");
	ТаблицаОтчетов.Колонки.Добавить("Вид");
	ТаблицаОтчетов.Колонки.Добавить("МоментВремени");
	ТаблицаОтчетов.Колонки.Добавить("ДатаОтчета");
	ТаблицаОтчетов.Колонки.Добавить("ОтчетныйПериод");
	ТаблицаОтчетов.Колонки.Добавить("Периодичность");
	ТаблицаОтчетов.Колонки.Добавить("ДатаНачала");
	ТаблицаОтчетов.Колонки.Добавить("ДатаОкончания");
	
	ВидыОтчетов = ВидыОтчетовОценкиРисков();
	Выборка = ВыборкаРегламентированныхОтчетов(Организация, ДатаНачала, ДатаОкончания, ВидыОтчетов);
	
	Пока Выборка.Следующий() Цикл
		
		УсловияПоиска = Новый Структура("ИсточникОтчета, ПериодДокумента, КодНалоговогоОргана");
		ЗаполнитьЗначенияСвойств(УсловияПоиска, Выборка);
		
		СтрокиТаблицыОтчетов = ТаблицаОтчетов.НайтиСтроки(УсловияПоиска);
		
		Если СтрокиТаблицыОтчетов.Количество() = 0 Тогда
			// Отчет еще не учитывался.
			НоваяСтрокаТаблицы = ТаблицаОтчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, Выборка);
			
		Иначе
			СтрокаТаблицы = СтрокиТаблицыОтчетов[0];
			
			Если СтрСравнить(Выборка.ВыбраннаяФорма, СтрокаТаблицы.ВыбраннаяФорма) > 0 Тогда
				// Поздняя форма отчета вытесняет предшествующие.
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				
			ИначеЕсли СтрСравнить(Выборка.ВыбраннаяФорма, СтрокаТаблицы.ВыбраннаяФорма) = 0 Тогда
				Если Выборка.Вид > СтрокаТаблицы.Вид Тогда
					// Поздние корректировки вытесняют предшествующие.
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
					
				ИначеЕсли Выборка.Вид = СтрокаТаблицы.Вид Тогда
					Если Выборка.МоментВремени.Сравнить(СтрокаТаблицы.МоментВремени) > 0 Тогда
						// Отчеты созданные позже вытесняют предшествующие.
						ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаОтчетов;
	
КонецФункции

Функция ВидыОтчетовОценкиРисков()
	
	ВидыОтчетов = Новый Массив;
	
	ВидыОтчетов.Добавить("РегламентированныйОтчетИмущество");
	ВидыОтчетов.Добавить("РегламентированныйОтчетЗемельныйНалог");
	ВидыОтчетов.Добавить("РегламентированныйОтчетНДПИ");
	ВидыОтчетов.Добавить("РегламентированныйОтчетНедра");
	ВидыОтчетов.Добавить("РегламентированныйОтчетНалогНаИгорныйБизнес");
	ВидыОтчетов.Добавить("РегламентированныйОтчетЖивотныйМир");
	ВидыОтчетов.Добавить("РегламентированныйОтчетВодныеБиоресурсы");
	ВидыОтчетов.Добавить("РегламентированныйОтчетКосвенныеНалогиТамСоюз");
	ВидыОтчетов.Добавить("РегламентированныйОтчетТранспортныйНалог");
	ВидыОтчетов.Добавить("РегламентированныйОтчетРасчетПоОплатеЗаВоду");
	ВидыОтчетов.Добавить("РегламентированныйОтчетПрибыль");
	ВидыОтчетов.Добавить("РегламентированныйОтчетУСН");
	ВидыОтчетов.Добавить("РегламентированныйОтчетБухОтчетность");
	ВидыОтчетов.Добавить("РегламентированныйОтчетНДС");
	ВидыОтчетов.Добавить("РегламентированныйОтчет3НДФЛ");
	ВидыОтчетов.Добавить("РегламентированныйОтчет4ФСС");
	ВидыОтчетов.Добавить("РегламентированныйОтчетАкцизыПриложение1");
	ВидыОтчетов.Добавить("РегламентированныйОтчетАкцизыПриложение5");
	ВидыОтчетов.Добавить("РегламентированныйОтчетАкцизыПриложение7");
	ВидыОтчетов.Добавить("РегламентированныйОтчетАкцизыГСМ");
	ВидыОтчетов.Добавить("РегламентированныйОтчетАкцизыАлкоголь");
	ВидыОтчетов.Добавить("РегламентированныйОтчетАкцизыТабак");
	ВидыОтчетов.Добавить("РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход");
	
	Возврат ВидыОтчетов;
	
КонецФункции

Функция НоваяТаблицаПоказателейОценкиРисков();
	
	ТипСтрока  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	ТипСтрока4 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4));
	ТипДата    = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты);
	ТипЧисло   = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	ТаблицаПоказателей = Новый ТаблицаЗначений;
	ТаблицаПоказателей.Колонки.Добавить("Показатель", ТипСтрока);
	ТаблицаПоказателей.Колонки.Добавить("ИсточникОтчета", ТипСтрока);
	ТаблицаПоказателей.Колонки.Добавить("ДатаОтчета", ТипДата);
	ТаблицаПоказателей.Колонки.Добавить("РегламентированныйОтчет", ОбщегоНазначения.ОписаниеТипаВсеСсылки());
	ТаблицаПоказателей.Колонки.Добавить("ОтчетныйПериод", ТипДата);
	ТаблицаПоказателей.Колонки.Добавить("КодНалоговогоОргана", ТипСтрока4);
	ТаблицаПоказателей.Колонки.Добавить("Периодичность");
	ТаблицаПоказателей.Колонки.Добавить("ДатаНачала", ТипДата);
	ТаблицаПоказателей.Колонки.Добавить("ДатаОкончания", ТипДата);
	ТаблицаПоказателей.Колонки.Добавить("ПериодДокумента", ТипСтрока);
	ТаблицаПоказателей.Колонки.Добавить("ЗначениеПоказателя", ТипЧисло);
	
	Возврат ТаблицаПоказателей;
	
КонецФункции

Процедура ВставитьПоказательВТаблицуОценкиРисков(ТаблицаПоказателей, ОписаниеОтчета)
	
	Если ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетИмущество" Тогда
		ВставитьПоказатели_Имущество(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетЗемельныйНалог" Тогда
		ВставитьПоказатели_ЗемельныйНалог(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетНДПИ" Тогда
		ВставитьПоказатели_НДПИ(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетНедра" Тогда
		ВставитьПоказатели_Недра(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетНалогНаИгорныйБизнес" Тогда
		ВставитьПоказатели_НалогНаИгорныйБизнес(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетЖивотныйМир" Тогда
		ВставитьПоказатели_ЖивотныйМир(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетВодныеБиоресурсы" Тогда
		ВставитьПоказатели_ВодныеБиоресурсы(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетКосвенныеНалогиТамСоюз" Тогда
		ВставитьПоказатели_КосвенныеНалогиТамСоюз(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетТранспортныйНалог" Тогда
		ВставитьПоказатели_ТранспортныйНалог(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетРасчетПоОплатеЗаВоду" Тогда
		ВставитьПоказатели_РасчетПоОплатеЗаВоду(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетПрибыль" Тогда
		ВставитьПоказатели_Прибыль(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетУСН" Тогда
		ВставитьПоказатели_УСН(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетБухОтчетность" Тогда
		ВставитьПоказатели_БухОтчетность(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетНДС" Тогда
		ВставитьПоказатели_НДС(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчет3НДФЛ" Тогда
		ВставитьПоказатели_3НДФЛ(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчет4ФСС" Тогда
		ВставитьПоказатели_4ФСС(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетАкцизыПриложение1" Тогда
		ВставитьПоказатели_АкцизыПриложение1(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетАкцизыПриложение5" Тогда
		ВставитьПоказатели_АкцизыПриложение5(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетАкцизыПриложение7" Тогда
		ВставитьПоказатели_АкцизыПриложение7(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетАкцизыГСМ" Тогда
		ВставитьПоказатели_АкцизыГСМ(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетАкцизыАлкоголь" Тогда
		ВставитьПоказатели_АкцизыАлкоголь(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетАкцизыТабак" Тогда
		ВставитьПоказатели_АкцизыТабак(ТаблицаПоказателей, ОписаниеОтчета);
		
	ИначеЕсли ОписаниеОтчета.ИсточникОтчета = "РегламентированныйОтчетЕдиныйНалогНаВмененныйДоход" Тогда
		ВставитьПоказатели_ЕдиныйНалогНаВмененныйДоход(ТаблицаПоказателей, ОписаниеОтчета);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьПоказатели_Имущество(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв4" Тогда
		
		ЗначениеПоказателя = 0;
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв1"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв4" Тогда
		
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
			
			Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел2 Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000020022003")
				                   - ПоказательОтчета(ДанныеЛиста, "П000020025003");
			КонецЦикла;
			
			Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел3 Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000030010003")
				                   - ПоказательОтчета(ДанныеЛиста, "П000030013003");
			КонецЦикла;
			
		Иначе
			
			ДеревоРаздела = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел2"];
			Для Каждого Лист Из ДеревоРаздела.Строки Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000020022003")
				                   - ПоказательОтчета(ДанныеЛиста, "П000020025003");
			КонецЦикла;
			
			ДеревоРаздела = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел3"];
			Для Каждого Лист Из ДеревоРаздела.Строки Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000030010003")
				                   - ПоказательОтчета(ДанныеЛиста, "П000030013003");
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел2 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000020022003")
			                   - ПоказательОтчета(ДанныеЛиста, "П000020025003");
		КонецЦикла;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел3 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000030010003")
			                   - ПоказательОтчета(ДанныеЛиста, "П000030013003");
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНалогаНаИмущество";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_ЗемельныйНалог(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018Кв3"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018Кв1"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв4" Тогда
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
			Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
				ДанныеЛиста = Лист.Данные;
				Для Инд = 1 По 2 Цикл
					Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
					ЗначениеПоказателя = ЗначениеПоказателя
					                   + ПоказательОтчета(ДанныеЛиста, "П000010002103" + Постфикс);
				КонецЦикла;
			КонецЦикла;
		Иначе
			ДанныеМногострочнойЧастиРаздела1
			= СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел1"].Строки[0].ДанныеМногострочныхЧастей["П0000100"];
			Для каждого СтрокаМнЧ Из ДанныеМногострочнойЧастиРаздела1.Строки Цикл
				ЗначениеПоказателя = ЗначениеПоказателя + СтрокаМнЧ.Данные.П000010002103;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2014Кв4"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2013Кв4"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2011Кв1" Тогда
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
			ДанныеЛиста = Лист.Данные;
			Для Инд = 1 По 2 Цикл
				Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000010002103" + Постфикс);
			КонецЦикла;
		КонецЦикла;
	Иначе // "ФормаОтчета2009Кв1"
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
			ДанныеЛиста = Лист.Данные;
			Для Инд = 1 По 5 Цикл
				Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000010003003" + Постфикс)
				                   - ПоказательОтчета(ДанныеЛиста, "П000010004003" + Постфикс);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНалогаНаЗемлю";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_НДПИ(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв1_Р"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2015Кв2" Тогда
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда
			Префикс = "П0000100030";
		Иначе
			Префикс = "П0001000001";
		КонецЕсли;
	Иначе
		Префикс = "П0001000010";
	КонецЕсли;
	
	ЗначениеПоказателя = 0;
	
	Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
	НомерСтроки = 1;
	Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
	Пока Раздел1.Свойство(Префикс + "03" + Постфикс) Цикл
		ЗначениеПоказателя = ЗначениеПоказателя + Раздел1[Префикс + "03" + Постфикс];
		НомерСтроки = НомерСтроки + 1;
		Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНДПИ";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_Недра(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		ДанныеЛиста = Лист.Данные;
		Для Инд = 1 По 5 Цикл
			Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000010003000" + Постфикс);
		КонецЦикла;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНедра";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_НалогНаИгорныйБизнес(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2007Кв1" Тогда
		ИмяПоказателя = "СумНалогДопл";
	Иначе
		ИмяПоказателя = "П000100003003";
	КонецЕсли;
	
	Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
	
	ЗначениеПоказателя = ПоказательОтчета(Раздел1, ИмяПоказателя);
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНалогаНаИгорныйБизнес";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_ЖивотныйМир(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		ДанныеЛиста = Лист.Данные;
		Для Инд = 1 По 10 Цикл
			Постфикс = ЧислоВСтрокуЧГ0(Инд);
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "Сумма" + Постфикс);
		КонецЦикла;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаСбораЖивотныйМир";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_ВодныеБиоресурсы(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв4" Тогда
		
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
			
		Иначе
			
			ДеревоРаздела1 = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел1"];
			
			Для каждого СтраницаРаздела Из ДеревоРаздела1.Строки Цикл
				
				ЗначениеПоказателя = ЗначениеПоказателя + СтраницаРаздела.Данные["П000010003003"];
				
				ДеревоМногострочнойЧасти = СтраницаРаздела.ДанныеМногострочныхЧастей["П00001М1"];
				Для каждого СтрокаМнЧ Из ДеревоМногострочнойЧасти.Строки Цикл
					ЗначениеПоказателя = ЗначениеПоказателя + СтрокаМнЧ.Данные["П00001М105001"];
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
			ДанныеЛиста = Лист.Данные;
			НомерСтроки = 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
			ЗначениеПоказателя = ЗначениеПоказателя + ПоказательОтчета(ДанныеЛиста, "П000010003003");
			
			Пока ДанныеЛиста.Свойство("П000010005001" + Постфикс) Цикл
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ДанныеЛиста["П000010005001" + Постфикс];
				НомерСтроки = НомерСтроки + 1;
				Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаСбораВодныеБиоресурсы";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_КосвенныеНалогиТамСоюз(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв4" Тогда
		
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
			
		Иначе
			
			ДеревоРаздела1 = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел1"];
			ЗначениеПоказателя = ЗначениеПоказателя + ДеревоРаздела1.Строки[0].Данные["П000010003003"];
			
			ДеревоРаздела2 = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел2"];
			ДеревоМногострочнойЧасти = ДеревоРаздела2.Строки[0].ДанныеМногострочныхЧастей["П00002М1"];
			Для каждого СтрокаМногострочнойЧасти Из ДеревоМногострочнойЧасти.Строки Цикл
				ЗначениеПоказателя = ЗначениеПоказателя + СтрокаМногострочнойЧасти.Данные["П00002М103000"];
			КонецЦикла;
			
			ДеревоРаздела3 = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел3"];
			ДеревоМногострочнойЧасти = ДеревоРаздела3.Строки[0].ДанныеМногострочныхЧастей["П00003М1"];
			Для каждого СтрокаМногострочнойЧасти Из ДеревоМногострочнойЧасти.Строки Цикл
				ЗначениеПоказателя = ЗначениеПоказателя + СтрокаМногострочнойЧасти.Данные["П00003М103000"];
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2010Кв3" Тогда
		
		Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
		
		Если Раздел1.Свойство("П000100003001") Тогда
			ЗначениеПоказателя = ПоказательОтчета(Раздел1, "П000100003001");
		КонецЕсли;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел2 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			+ ПоказательОтчета(ДанныеЛиста, "П000200003001");
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаКосвенныхНалоговТаможенныйСоюз";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_ТранспортныйНалог(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2007Кв1" Тогда
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "Сумма1_1");
		КонецЦикла;
	Иначе
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
			ДанныеЛиста = Лист.Данные;
			Для Инд = 1 По 3 Цикл
				Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000010002103" + Постфикс);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаТранспортногоНалога";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_РасчетПоОплатеЗаВоду(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ФормаОтчета = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаФормаОтчета;
	
	ЗначениеПоказателя = ПоказательОтчета(ФормаОтчета, "П010010009");
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаОплатыЗаВоду";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_Прибыль(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв4" Тогда
		
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
			
		Иначе
			
			ДеревоРаздела = СведенияОтчета.ДанныеМногоуровневыхРазделов["Лист02"];
			
			Для Каждого Лист Из ДеревоРаздела.Строки Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя + ПоказательОтчета(ДанныеЛиста, "П000020006003");
			КонецЦикла;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиОСНО";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = 0;
			
			Для Каждого Лист Из ДеревоРаздела.Строки Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя
				+ ПоказательОтчета(ДанныеЛиста, "П000020019003") + ПоказательОтчета(ДанныеЛиста, "П000020020003");
			КонецЦикла;
			
			ДеревоРаздела = СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел1_3"];
			
			ДеревоМнЧ = ДеревоРаздела.Строки[0].ДанныеМногострочныхЧастей["П00013М1"];
			Для Каждого СтрокаМнЧ Из ДеревоМнЧ.Строки Цикл
				ДеревоПодчМнЧ = СтрокаМнЧ.ДанныеМногострочныхЧастей["П00013М2"];
				Для Каждого СтрокаПодчМнЧ Из ДеревоПодчМнЧ.Строки Цикл
					ЗначениеПоказателя = ЗначениеПоказателя + ПоказательОтчета(СтрокаПодчМнЧ.Данные, "П00013М204003");
				КонецЦикла;
			КонецЦикла;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаНаПрибыль";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = 0;
			
			ДеревоРаздела = СведенияОтчета.ДанныеМногоуровневыхРазделов["Лист02"];
			
			Для Каждого Лист Из ДеревоРаздела.Строки Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя + ПоказательОтчета(ДанныеЛиста, "П000020003003");
			КонецЦикла;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаРасходовПоРеализации";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = 0;
			
			Для Каждого Лист Из ДеревоРаздела.Строки Цикл
				ДанныеЛиста = Лист.Данные;
				ЗначениеПоказателя = ЗначениеПоказателя + ПоказательОтчета(ДанныеЛиста, "П000020001003");
			КонецЦикла;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовОтРеализации";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
		КонецЕсли;
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2016Кв4"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2015Кв1" Тогда
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000200006003");
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаПрибылиОСНО";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000200019003")
			                   + ПоказательОтчета(ДанныеЛиста, "П000200020003");
		КонецЦикла;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1_3 Цикл
			ДанныеЛиста = Лист.Данные;
			НомерСтроки = 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
			Пока ДанныеЛиста.Свойство("П000130004003" + Постфикс) Цикл
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ДанныеЛиста["П000130004003" + Постфикс];
				НомерСтроки = НомерСтроки + 1;
				Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
			КонецЦикла;
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНалогаНаПрибыль";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000200003003");
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаРасходовПоРеализации";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000200001003");
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаДоходовОтРеализации";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
	Иначе
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П002000006003");
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаПрибылиОСНО";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П002000019003")
			                   + ПоказательОтчета(ДанныеЛиста, "П002000020003");
		КонецЦикла;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1_3 Цикл
			ДанныеЛиста = Лист.Данные;
			НомерСтроки = 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
			Пока ДанныеЛиста.Свойство("П000130004003" + Постфикс) Цикл
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ДанныеЛиста["П000130004003" + Постфикс];
				НомерСтроки = НомерСтроки + 1;
				Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
			КонецЦикла;
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНалогаНаПрибыль";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П002000003003");
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаРасходовПоРеализации";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Лист02 Цикл
			ДанныеЛиста = Лист.Данные;
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П002000001003");
		КонецЦикла;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаДоходовОтРеализации";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьПоказатели_УСН(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2015Кв1" Тогда
		
		Раздел11 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел11;
		Раздел21 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел21;
		
		Раздел12 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел12;
		Раздел22 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел22;
		
		ЗаполненРаздел11 = Ложь;
		Если ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110002003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110004003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110005003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110007003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110008003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110010003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110011003")) Тогда
			ЗаполненРаздел11 = Истина;
		КонецЕсли;
		
		ЗаполненРаздел12 = Ложь;
		Если ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120002003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120004003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120005003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120007003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120008003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120010003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120011003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120012003")) Тогда
			ЗаполненРаздел12 = Истина;
		КонецЕсли;
		
		Если ЗаполненРаздел11 И НЕ ЗаполненРаздел12 Тогда
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел21, "П002110011303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел21, "П002110011303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел21, "П002110013303")
							   - ПоказательОтчета(Раздел21, "П002110014303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
		ИначеЕсли ЗаполненРаздел12 И НЕ ЗаполненРаздел11 Тогда
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел22, "П000220021303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел22, "П000220021303")
							   - ПоказательОтчета(Раздел22, "П000220022303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = Макс(ПоказательОтчета(Раздел22, "П000220028003"),
									  ПоказательОтчета(Раздел22, "П000220027303"));
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
		Иначе
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовУСН";
			НоваяСтрока.ЗначениеПоказателя = 0;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиУСН";
			НоваяСтрока.ЗначениеПоказателя = 0;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаУСН";
			НоваяСтрока.ЗначениеПоказателя = 0;
			
		КонецЕсли;
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2014Кв1" Тогда
		
		Раздел11 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел11;
		Раздел21 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел21;
		
		Раздел12 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел12;
		Раздел22 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел22;
		
		ЗаполненРаздел11 = Ложь;
		Если ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110002003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110004003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110005003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110007003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110008003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110010003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел11, "П000110011003")) Тогда
			ЗаполненРаздел11 = Истина;
		КонецЕсли;
		
		ЗаполненРаздел12 = Ложь;
		Если ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120002003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120004003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120005003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120007003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120008003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120010003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120011003"))
		 ИЛИ ЗначениеЗаполнено(ПоказательОтчета(Раздел12, "П000120012003")) Тогда
			ЗаполненРаздел12 = Истина;
		КонецЕсли;
		
		Если ЗаполненРаздел11 И НЕ ЗаполненРаздел12 Тогда
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел21, "П000210011303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел21, "П000210011303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел21, "П000210013303")
							   - ПоказательОтчета(Раздел21, "П000210014303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
		ИначеЕсли ЗаполненРаздел12 И НЕ ЗаполненРаздел11 Тогда
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел22, "П000220021303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = ПоказательОтчета(Раздел22, "П000220021303")
							   - ПоказательОтчета(Раздел22, "П000220022303");
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
			ЗначениеПоказателя = Макс(ПоказательОтчета(Раздел22, "П000220028003"),
									  ПоказательОтчета(Раздел22, "П000220027303"));
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаУСН";
			НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
			
		Иначе
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаДоходовУСН";
			НоваяСтрока.ЗначениеПоказателя = 0;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаПрибылиУСН";
			НоваяСтрока.ЗначениеПоказателя = 0;
			
			НоваяСтрока = ТаблицаПоказателей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
			НоваяСтрока.Показатель = "СуммаНалогаУСН";
			НоваяСтрока.ЗначениеПоказателя = 0;
			
		КонецЕсли;
		
	Иначе
		
		Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
		Раздел2 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел2;
		
		Если ПоказательОтчета(Раздел1, "П000010000103") = "1" Тогда
			ЗначениеПоказателя = ПоказательОтчета(Раздел2, "П000020021003");
			
		ИначеЕсли ПоказательОтчета(Раздел1, "П000010000103") = "2" Тогда
			ЗначениеПоказателя = ПоказательОтчета(Раздел2, "П000020021003")
			                   - ПоказательОтчета(Раздел2, "П000020022003");
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаПрибылиУСН";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = 0;
		
		Если ПоказательОтчета(Раздел1, "П000010000103") = "1" Тогда
			ЗначениеПоказателя = ПоказательОтчета(Раздел2, "П000020026003") - ПоказательОтчета(Раздел2, "П000020028003");
			
		ИначеЕсли ПоказательОтчета(Раздел1, "П000010000103") = "2" Тогда
			ЗначениеПоказателя = Макс(ПоказательОтчета(Раздел2, "П000020026003"), ПоказательОтчета(Раздел2, "П000020027003"));
			
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНалогаУСН";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел2, "П000020021003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаДоходовУСН";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьПоказатели_БухОтчетность(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв1" Тогда
		ОФР = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаОФР;
	Иначе
		ОФР = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаФормаОтчета;
	КонецЕсли;
	
	ЗначениеПоказателя = ПоказательОтчета(ОФР, "П000100230004");
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаПрибылиБУ";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_НДС(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв1"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв1" Тогда
		
		Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
		Раздел3 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел3;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел1, "П000100004003")
		                   - ПоказательОтчета(Раздел1, "П000100005003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНалогаНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел3, "П000300019003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаВычетовПоНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел3, "П000300011805");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНачисленногоНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2015Кв1" Тогда
		
		Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
		Раздел3 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел3;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел1, "П000100004003")
		                   - ПоказательОтчета(Раздел1, "П000100005003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНалогаНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел3, "П000300019003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаВычетовПоНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел3, "П000300011005");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНачисленногоНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
	Иначе
		
		Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
		Раздел3 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел3;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел1, "П000100004003")
		                   - ПоказательОтчета(Раздел1, "П000100005003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНалогаНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел3, "П000300022003");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаВычетовПоНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел3, "П000300012005");
		
		НоваяСтрока = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
		НоваяСтрока.Показатель = "СуммаНачисленногоНДС";
		НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВставитьПоказатели_3НДФЛ(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019кв1"
		Или ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2020кв1" Тогда
		
		СуммаНДФЛКУплатеКлюч = "П000100001040";
		ОбщаяСуммаДоходаКлюч = "П000500001050";
		СуммаФактическиПроизведенныхРасходовКлюч = "П000500001040";
		
		ИмяРазделаСДоходамиИП = "Приложение3";
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2015кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2016кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018кв1" Тогда
		
		СуммаНДФЛКУплатеКлюч = "П000100001040";
		ОбщаяСуммаДоходаКлюч = "П000500001110";
		СуммаФактическиПроизведенныхРасходовКлюч = "П000500001040";		
		
		ИмяРазделаСДоходамиИП = "ЛистВ";
		
	Иначе
		
		СуммаНДФЛКУплатеКлюч = "П000010011003";
		ОбщаяСуммаДоходаКлюч = "П000090001101";
		СуммаФактическиПроизведенныхРасходовКлюч = "П000090001004";
		
		ИмяРазделаСДоходамиИП = "ЛистВ";
		
	КонецЕсли;
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		
		ДанныеЛиста = Лист.Данные;
		ЗначениеПоказателя = ЗначениеПоказателя
		                   + ПоказательОтчета(ДанныеЛиста, СуммаНДФЛКУплатеКлюч);
						   
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНДФЛКУплате";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
	СуммаДоходовИП = 0;
	СуммаРасходовИП = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов[ИмяРазделаСДоходамиИП] Цикл
		
		ДанныеЛиста = Лист.Данные;
		СуммаДоходовИП = СуммаДоходовИП + ПоказательОтчета(ДанныеЛиста, ОбщаяСуммаДоходаКлюч);
		СуммаРасходовИП = СуммаРасходовИП + ПоказательОтчета(ДанныеЛиста, СуммаФактическиПроизведенныхРасходовКлюч);
		
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаДоходовИП";
	НоваяСтрока.ЗначениеПоказателя = СуммаДоходовИП;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаПрофессиональныхВычетовПоНДФЛ";
	НоваяСтрока.ЗначениеПоказателя = СуммаРасходовИП;
	
КонецПроцедуры

Процедура ВставитьПоказатели_4ФСС(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ТитульныйЛист = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТитульный;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв3"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв1" Тогда
		
		Таблица1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаТаблица1;
		
	Иначе
		
		Раздел1_3 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1_3;
		
	КонецЕсли;	
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма <> "ФормаОтчета2010Кв4" Тогда
		
		Если ТитульныйЛист.Свойство("ЧислРаботников") Тогда
			
			ЗначениеПоказателя = ТитульныйЛист["ЧислРаботников"];
			
		ИначеЕсли ТитульныйЛист.Свойство("ЧислРаботников_1") Тогда
			
			Для Ном = 1 По 6 Цикл
				
				ЗначениеПоказателя = "";
				ЗначениеПоказателя = ЗначениеПоказателя + СокрЛП(ТитульныйЛист["ЧислРаботников_" + Ном]);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СреднесписочнаяЧисленность";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв3"
		ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв1" Тогда
		
		ЗначениеПоказателя = ПоказательОтчета(Таблица1, "П000010000103");
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма <> "ФормаОтчета2010Кв4" Тогда
		
		ЗначениеПоказателя = ПоказательОтчета(Раздел1_3, "П000030001003");
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаВыплатФизическимЛицам";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_АкцизыПриложение1(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		ДанныеЛиста = Лист.Данные;
		НомерСтроки = 1;
		Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		Пока ДанныеЛиста.Свойство("П000110002030" + Постфикс) Цикл
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000110002030" + Постфикс)
			                   - ПоказательОтчета(ДанныеЛиста, "П000110002040" + Постфикс);
			НомерСтроки = НомерСтроки + 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел12 Цикл
		ДанныеЛиста = Лист.Данные;
		НомерСтроки = 1;
		Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		Пока ДанныеЛиста.Свойство("П000120002030" + Постфикс) Цикл
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000120002030" + Постфикс)
			                   - ПоказательОтчета(ДанныеЛиста, "П000120002040" + Постфикс);
			НомерСтроки = НомерСтроки + 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		КонецЦикла;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаАкцизовЗаИсключениемТабачныхИзделий";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_АкцизыПриложение5(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		ДанныеЛиста = Лист.Данные;
		Для Инд = 1 По 3 Цикл
			Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "СуммаРаздел1" + Постфикс)
			                   - ПоказательОтчета(ДанныеЛиста, "СуммаВозмещенияРаздел1" + Постфикс);
		КонецЦикла;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаАкцизовНаНефтепродукты";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_АкцизыПриложение7(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		ДанныеЛиста = Лист.Данные;
		ЗначениеПоказателя = ЗначениеПоказателя
		                   + ПоказательОтчета(ДанныеЛиста, "СуммаНалога1");
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаАкцизовНаМинеральноеСырье";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_АкцизыГСМ(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
		ДанныеЛиста = Лист.Данные;
		НомерСтроки = 1;
		Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		Пока ДанныеЛиста.Свойство("П000010000102" + Постфикс) Цикл
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(ДанныеЛиста, "П000010000102" + Постфикс)
			                   - ПоказательОтчета(ДанныеЛиста, "П000010000103" + Постфикс);
			НомерСтроки = НомерСтроки + 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		КонецЦикла;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаАкцизовГСМ";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_АкцизыАлкоголь(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2019Кв1" Тогда
		
	ИначеЕсли ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2016Кв2" Тогда
		
		ИмяРаздела = "Раздел11";
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
			ИмяРаздела = "Раздел1";
		КонецЕсли;
		
		Раздел11 = СведенияОтчета.ПоказателиОтчета["ПолеТабличногоДокумента" + ИмяРаздела];
		
		НомерСтроки = 1;
		Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		Пока Раздел11.Свойство("П000110000102" + Постфикс) Цикл
			ЗначениеПоказателя = ЗначениеПоказателя
			                   + ПоказательОтчета(Раздел11, "П000110000102" + Постфикс)
			                   - ПоказательОтчета(Раздел11, "П000110000103" + Постфикс);
			НомерСтроки = НомерСтроки + 1;
			Постфикс = "_" + ЧислоВСтрокуЧГ0(НомерСтроки);
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаАкцизовАлкоголь";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_АкцизыТабак(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018Кв3" Тогда
		
		Если СведенияОтчета.Свойство("ОкружениеСохранения") Тогда // отчет сохранен в 2.0
		Иначе
			ДанныеМногострочнойЧастиРаздела1
			= СведенияОтчета.ДанныеМногоуровневыхРазделов["Раздел1"].Строки[0].ДанныеМногострочныхЧастей["П00001М1"];
			Для каждого СтрокаМнЧ Из ДанныеМногострочнойЧастиРаздела1.Строки Цикл
				ЗначениеПоказателя = ЗначениеПоказателя + СтрокаМнЧ.Данные.П00001М103003 - СтрокаМнЧ.Данные.П00001М104003;
			КонецЦикла;
		КонецЕсли;
		
	Иначе // "ФормаОтчета2007Кв1"
		
		Раздел1 = СведенияОтчета.ПоказателиОтчета.ПолеТабличногоДокументаРаздел1;
		
		// Конвертация данных при переходе с 2.0 на 3.0.
		ОтчетСформированВ20 = Ложь;
		Для Каждого Показатель Из Раздел1 Цикл
			ИмяПоказателя = Показатель.Ключ;
			Если ИмяПоказателя = "СуммаНалога25Число1_1" Тогда
				ОтчетСформированВ20 = Истина;
				СуммаНалога25 = "";
				Для Ном = 1 По 15 Цикл
					СуммаНалога25 = СуммаНалога25 + СокрЛП(Раздел1["СуммаНалога25Число1_" + Ном]);
				КонецЦикла;
				Если ЗначениеЗаполнено(СуммаНалога25) Тогда
					СуммаНалога25 = Число(СуммаНалога25);
				Иначе
					СуммаНалога25 = 0;
				КонецЕсли;
			ИначеЕсли ИмяПоказателя = "СуммаНалога15Число1_1" Тогда
				ОтчетСформированВ20 = Истина;
				СуммаНалога15 = "";
				Для Ном = 1 По 15 Цикл
					СуммаНалога15 = СуммаНалога15 + СокрЛП(Раздел1["СуммаНалога15Число1_" + Ном]);
				КонецЦикла;
				Если ЗначениеЗаполнено(СуммаНалога15) Тогда
					СуммаНалога15 = Число(СуммаНалога15);
				Иначе
					СуммаНалога15 = 0;
				КонецЕсли;
			ИначеЕсли ИмяПоказателя = "СуммаНалогаКУменьшению1_1" Тогда
				ОтчетСформированВ20 = Истина;
				СуммаНалогаКУменьшению = "";
				Для Ном = 1 По 15 Цикл
					СуммаНалогаКУменьшению = СуммаНалогаКУменьшению + СокрЛП(Раздел1["СуммаНалогаКУменьшению1_" + Ном]);
				КонецЦикла;
				Если ЗначениеЗаполнено(СуммаНалогаКУменьшению) Тогда
					СуммаНалогаКУменьшению = Число(СуммаНалогаКУменьшению);
				Иначе
					СуммаНалогаКУменьшению = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтчетСформированВ20 Тогда
			ЗначениеПоказателя = СуммаНалога25 + СуммаНалога15 - СуммаНалогаКУменьшению;
		Иначе
			ЗначениеПоказателя = ПоказательОтчета(Раздел1, "СуммаНалога25Число1")
			+ ПоказательОтчета(Раздел1, "СуммаНалога15Число1")
			- ПоказательОтчета(Раздел1, "СуммаНалогаКУменьшению1");
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаАкцизовНаТабачныеИзделия";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Процедура ВставитьПоказатели_ЕдиныйНалогНаВмененныйДоход(ТаблицаПоказателей, ОписаниеОтчета)
	
	СведенияОтчета = ОписаниеОтчета.РегламентированныйОтчет.ДанныеОтчета.Получить();
	
	ЗначениеПоказателя = 0;
	
	Если ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018Кв4"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018Кв3"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2018Кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2017Кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2016Кв1"
	 ИЛИ ОписаниеОтчета.ВыбраннаяФорма = "ФормаОтчета2015Кв1" Тогда
		
		Если СведенияОтчета.ДанныеМногострочныхРазделов.Свойство("П00001000") Тогда
			Для Каждого СтрТаблицы Из СведенияОтчета.ДанныеМногострочныхРазделов.П00001000 Цикл
				ЗначениеПоказателя = ЗначениеПоказателя + СтрТаблицы.П000010002003;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Для Каждого Лист Из СведенияОтчета.ДанныеМногостраничныхРазделов.Раздел1 Цикл
			ДанныеЛиста = Лист.Данные;
			Для Инд = 1 По 8 Цикл
				Постфикс = "_" + ЧислоВСтрокуЧГ0(Инд);
				ЗначениеПоказателя = ЗначениеПоказателя
				                   + ПоказательОтчета(ДанныеЛиста, "П000010003003" + Постфикс);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПоказателей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ОписаниеОтчета);
	НоваяСтрока.Показатель = "СуммаНалогаЕНВД";
	НоваяСтрока.ЗначениеПоказателя = ЗначениеПоказателя;
	
КонецПроцедуры

Функция ЧислоВСтрокуЧГ0(ИсходноеЧисло)
	
	Возврат Формат(ИсходноеЧисло, "ЧН=; ЧГ=0");
	
КонецФункции

Процедура ЗапомнитьИменаСправочниковОбособленныхПодразделений(Форма) Экспорт 
	Попытка
		ИмяОтчета = "";
		Если ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда 
			ИмяОтчета = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".")[1];
		КонецЕсли;
	Исключение
		ИмяОтчета = "";
	КонецПопытки;
	
	Форма.ИмяСправочникаОбособленныхПодразделений        = РегламентированнаяОтчетностьПереопределяемый.ИмяСправочникаОбособленныхПодразделений(ИмяОтчета);
	Форма.ИмяРеквизитаПризнакаОбособленногоПодразделения = РегламентированнаяОтчетностьПереопределяемый.ИмяРеквизитаПризнакаОбособленногоПодразделения(ИмяОтчета);
КонецПроцедуры

Процедура ЗаполнитьДанныеВШапкеОбособленныхПодразделений(Форма) Экспорт 
	ТабДок = Форма.ПолеТабличногоДокументаФормаОтчета;
	ИсключитьДанныеОбособленныхПодразделений = Форма.ИсключитьДанныеОбособленныхПодразделений;
	ТабДок.Области.ИсключитьДанныеОбособленныхПодразделений.Значение = ИсключитьДанныеОбособленныхПодразделений;
	ОблОбособленноеПодразделение = ТабДок.Области.ОбособленноеПодразделение;
	Если ИсключитьДанныеОбособленныхПодразделений Тогда 
		ОблОбособленноеПодразделение.Значение = "";
		ОблОбособленноеПодразделение.Защита = Истина;
		ОблОбособленноеПодразделение.ЦветФона = Новый Цвет(255,255,255);
	Иначе
		ОблОбособленноеПодразделение.Значение = Форма.ОбособленноеПодразделение;
		ОблОбособленноеПодразделение.Защита = Ложь;
		ОблОбособленноеПодразделение.ЦветФона = Новый Цвет(255,255,192);
	КонецЕсли;
КонецПроцедуры

// Процедура возвращает список организаций - юридических лиц и индивидуальных предпринимателей.
//
// Параметры:
//  СписокЮрФизЛиц - СписокЗначений - список юридических лиц и индивидуальных предпринимателей
//  Текст          - Строка - подстрока поиска в наименовании организации.
//
Процедура ПолучитьСписокДоступныхОрганизаций(СписокЮрФизЛиц = Неопределено, Знач Текст = Неопределено) Экспорт
	
	Если СписокЮрФизЛиц = Неопределено ИЛИ ТипЗнч(СписокЮрФизЛиц) <> Тип("СписокЗначений") Тогда
		
		СписокЮрФизЛиц = Новый СписокЗначений;
		
	КонецЕсли;
	
	ДополнитьСтрокуСпециальнымиСимволами(Текст);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	Организации.Ссылка,
				   |	Организации.Наименование
				   |ИЗ
				   |	Справочник.Организации КАК Организации
				   |ГДЕ
				   |	НЕ Организации.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		Запрос.Текст = Запрос.Текст + " И Организации.Наименование ПОДОБНО &Текст СПЕЦСИМВОЛ ""~""";
		Запрос.УстановитьПараметр("Текст", Текст);
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Наименование";
	
	РегламентированнаяОтчетностьПереопределяемый.СформироватьТекстЗапросаДляПолученияДоступныхОрганизаций(
		Запрос.Текст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СписокЮрФизЛиц.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПоказательОтчета(ИсточникСведений, ИмяПоказателя)
	
	ЗначениеПоказателя = 0;
	
	Если ТипЗнч(ИсточникСведений) = Тип("Структура") Тогда
		Если ИсточникСведений.Свойство(ИмяПоказателя) Тогда
			ЗначениеПоказателя = ИсточникСведений[ИмяПоказателя];
		КонецЕсли;
		
	Иначе
		ВызватьИсключение "Попытка получить значение показателя, сохраненного в неподдерживаемом типе данных";
		
	КонецЕсли;
	
	Возврат ЗначениеПоказателя;
	
КонецФункции

#КонецОбласти

#Область ЗаписьСведенийВЖурналРегистрации

Функция КомментарийКПроверкеВыгрузки(СсылкаНаСтрокуСообщения)
	
	СсылкаНаОбъект 		   = СсылкаНаСтрокуСообщения.ОтчетДок;
	Наименование  		   = СсылкаНаОбъект.НаименованиеОтчета;
	Период 		  		   = СсылкаНаОбъект.ПредставлениеПериода;
	Вид			  		   = СсылкаНаОбъект.Вид;
	ТекстСообщенияОбОшибке = СсылкаНаСтрокуСообщения.Описание;
		
	ПозицияОКТМО = СтрНайти(ТекстСообщенияОбОшибке, "ОКТМО ");
	
	Если ПозицияОКТМО > 0 Тогда
		
		ЛеваяЧастьТекстаСообщенияОбОшибке  = Лев(ТекстСообщенияОбОшибке, ПозицияОКТМО - 1);
		ПраваяЧастьТекстаСообщенияОбОшибке = Сред(ТекстСообщенияОбОшибке, ПозицияОКТМО + 6);
		
		Если СтрЧислоВхождений("0123456789""", Лев(ПраваяЧастьТекстаСообщенияОбОшибке, 1)) > 0 Тогда
			
			ПозицияПробела = СтрНайти(ПраваяЧастьТекстаСообщенияОбОшибке, " ");
			
			Если ПозицияПробела > 0 Тогда
				
				ПраваяЧастьТекстаСообщенияОбОшибке = Сред(ПраваяЧастьТекстаСообщенияОбОшибке, ПозицияПробела);
				
			Иначе
				
				ПраваяЧастьТекстаСообщенияОбОшибке = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстСообщенияОбОшибке = ЛеваяЧастьТекстаСообщенияОбОшибке + "ОКТМО" + ПраваяЧастьТекстаСообщенияОбОшибке;
		
	КонецЕсли;
	
	ПозицияНекорректныйКонтрагент = СтрНайти(ТекстСообщенияОбОшибке, "некорректные ИНН/КПП покупателя в строке");
	
	Если ПозицияНекорректныйКонтрагент > 0 Тогда
		
		ЛеваяЧастьТекстаСообщенияОбОшибке = Лев(ТекстСообщенияОбОшибке, ПозицияНекорректныйКонтрагент - 1);
		
		ТекстСообщенияОбОшибке = ЛеваяЧастьТекстаСообщенияОбОшибке + "некорректные ИНН/КПП покупателя в строке";
		
	КонецЕсли;
	
	ПозицияПродавцаВСтроке = СтрНайти(ТекстСообщенияОбОшибке, "продавца в строке");
	
	Если ПозицияПродавцаВСтроке > 0 Тогда
		
		ЛеваяЧастьТекстаСообщенияОбОшибке = Лев(ТекстСообщенияОбОшибке, ПозицияПродавцаВСтроке - 1);
		
		ТекстСообщенияОбОшибке = ЛеваяЧастьТекстаСообщенияОбОшибке + "продавца в строке";
		
	КонецЕсли;
	
	ПозицияОплатуВСтроке = СтрНайти(ТекстСообщенияОбОшибке, "оплату в строке");
	
	Если ПозицияОплатуВСтроке > 0 Тогда
		
		ЛеваяЧастьТекстаСообщенияОбОшибке = Лев(ТекстСообщенияОбОшибке, ПозицияОплатуВСтроке - 1);
		
		ТекстСообщенияОбОшибке = ЛеваяЧастьТекстаСообщенияОбОшибке + "оплату в строке";
		
	КонецЕсли;
	
	ПозицияВСтроке = СтрНайти(ТекстСообщенияОбОшибке, "В строке ");
	
	Если ПозицияВСтроке > 0 Тогда
		
		ЛеваяЧастьТекстаСообщенияОбОшибке  = Лев(ТекстСообщенияОбОшибке, ПозицияВСтроке - 1);
		ПраваяЧастьТекстаСообщенияОбОшибке = Сред(ТекстСообщенияОбОшибке, ПозицияВСтроке + 9);
		
		Если СтрЧислоВхождений("0123456789""", Лев(ПраваяЧастьТекстаСообщенияОбОшибке, 1)) > 0 Тогда
			
			ПозицияПробела = СтрНайти(ПраваяЧастьТекстаСообщенияОбОшибке, " ");
			
			Если ПозицияПробела > 0 Тогда
				
				ПраваяЧастьТекстаСообщенияОбОшибке = Сред(ПраваяЧастьТекстаСообщенияОбОшибке, ПозицияПробела);
				
			Иначе
				
				ПраваяЧастьТекстаСообщенияОбОшибке = "";
				
			КонецЕсли;
			
		КонецЕсли;
		
		ТекстСообщенияОбОшибке = ЛеваяЧастьТекстаСообщенияОбОшибке + "В строке" + ПраваяЧастьТекстаСообщенияОбОшибке;
		
	КонецЕсли;
	
	Возврат Наименование + ". " + Вид + ". " + Период + ". " + ТекстСообщенияОбОшибке;
	
КонецФункции

Функция КомментарийКВыгрузкеРеглОтчета(СсылкаНаОбъект)
			
	Наименование = СсылкаНаОбъект.НаименованиеОтчета;
	Период 		 = СсылкаНаОбъект.ПредставлениеПериода;
	Вид			 = СсылкаНаОбъект.Вид;
	
	Возврат Наименование + ". " + Вид + ". " + Период;
	
КонецФункции

Функция КомментарийКСозданиюРеглОтчета(СсылкаНаОбъект)
	
	Наименование = СсылкаНаОбъект.НаименованиеОтчета;
	Период 		 = СсылкаНаОбъект.ПредставлениеПериода;
	Вид			 = СсылкаНаОбъект.Вид;
	
	Возврат Наименование + ". " + Вид + ". " + Период;
	
КонецФункции

#КонецОбласти

#Область ИнтерфейсРаботыСДаннымиДекларацииНДС

// Удаляет все записи регистра дополнительных файлов, ссылающиеся
// на указанный документ регламентированного отчета.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации.
//
Процедура УдалитьДополнительныеФайлыДекларацииНДС(ДекларацияНДС) Экспорт
	
	ЗаписиРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьНаборЗаписей();
	ЗаписиРегистраСведений.Отбор.РегламентированныйОтчет.Установить(ДекларацияНДС);
	
	ЗаписиРегистраСведений.Записать();
	
КонецПроцедуры

// Сохраняет сформированный сегмент пользовательского представления раздела декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   ИмяРаздела - Строка - имя раздела;
//   НомерПервойСтроки - Число - номер первой строки, отраженной в сегменте;
//   ПредставлениеСегмента - Табличный документ - сегмент пользовательского представления раздела декларации по НДС.
//
Процедура ЗаписатьСегментТабличногоДокументаРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, НомерПервойСтроки, ПредставлениеСегмента) Экспорт
	
	ВидДополнительногоФайла = "ТабличныйДокумент" + ИмяРаздела + "." + Формат(НомерПервойСтроки, "ЧН=; ЧГ=0");
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	ПараметрыЗаписи.Вставить("Данные", ПредставлениеСегмента);
	
	ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);
	
КонецПроцедуры

// Считывает из регистра сформированный сегмент пользовательского представления раздела декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   ИмяРаздела - Строка - имя раздела;
//   НомерПервойСтроки - Число - номер первой строки, отраженной в сегменте;
// Возвращаемое значение:
//   Табличный документ - сегмент пользовательского представления раздела декларации по НДС.
//
Функция СегментТабличногоДокументаРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, НомерПервойСтроки) Экспорт
	
	ВидДополнительногоФайла = "ТабличныйДокумент" + ИмяРаздела + "." + Формат(НомерПервойСтроки, "ЧН=; ЧГ=0");
	
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЧтения.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	Возврат ДанныеРегистраДополнительныхФайлов(ПараметрыЧтения);
	
КонецФункции

// Удаляет сегменты пользовательского представления раздела декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   ИмяРаздела - Строка - имя раздела;
//
Процедура УдалитьСегментыТабличногоДокументаРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела) Экспорт
	
	Выборка = ВыборкаСегментовРазделаДекларации(ДекларацияНДС, ИмяРаздела, "ТабличныйДокумент");
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
		Запись.РегламентированныйОтчет = ДекларацияНДС;
		Запись.ВидДополнительногоФайла = Выборка.ВидДополнительногоФайла;
		
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

// Сохраняет итоги для выгрузки электронного представления декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   ИмяРаздела - Строка - имя раздела;
//   Итоги - Структура - Структура с итогами для формирования электронного представления декларации.
//
Процедура ЗаписатьИтогиРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, Итоги) Экспорт
	
	ВидДополнительногоФайла = "Итоги" + ИмяРаздела;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	ПараметрыЗаписи.Вставить("Данные", Итоги);
	
	ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);
	
КонецПроцедуры

// Считывает из регистра итоги для выгрузки электронного представления декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   ИмяРаздела - Строка - имя раздела, с которым связаны данные;
// Возвращаемое значение:
//   Структура - Структура с итогами для формирования электронного представления декларации.
//
Функция ИтогиРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела) Экспорт
	
	ВидДополнительногоФайла = "Итоги" + ИмяРаздела;
	
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЧтения.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	Возврат ДанныеРегистраДополнительныхФайлов(ПараметрыЧтения);
	
КонецФункции

// Удаляет из регистра итоги для выгрузки электронного представления декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   ИмяРаздела - Строка - имя раздела, с которым связаны данные;
//
Процедура УдалитьИтогиРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела) Экспорт
	
	Запись = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	Запись.РегламентированныйОтчет = ДекларацияНДС;
	Запись.ВидДополнительногоФайла = "Итоги" + ИмяРаздела;
	
	Запись.Удалить();
	
КонецПроцедуры

// Сохраняет сформированный сегмент данных раздела для выгрузки электронного представления декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   Раздел - Строка - имя раздела;
//   НомерПервойСтроки - Число - номер первой строки, отраженной в сегменте;
//   СегментДанных - Таблица значений - сегмент данных раздела для выгрузки.
//
Процедура ЗаписатьСегментДанныхРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, НомерПервойСтроки, СегментДанных) Экспорт
	
	ВидДополнительногоФайла = "Данные" + ИмяРаздела + "." + Формат(НомерПервойСтроки, "ЧН=; ЧГ=0");
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЗаписи.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	ПараметрыЗаписи.Вставить("Данные", СегментДанных);
	
	ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи);
	
КонецПроцедуры

// Считывает из регистра сегмент данных раздела для выгрузки электронного представления декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   Раздел - Строка - имя раздела;
//   НомерПервойСтроки - Число - номер первой строки, отраженной в сегменте;
// Возвращаемое значение:
//   Таблица значений - сегмент данных раздела для выгрузки.
//
Функция СегментДанныхРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела, НомерПервойСтроки) Экспорт
	
	ВидДополнительногоФайла = "Данные" + ИмяРаздела + "." + Формат(НомерПервойСтроки, "ЧН=; ЧГ=0");
	
	ПараметрыЧтения = Новый Структура;
	ПараметрыЧтения.Вставить("РегламентированныйОтчет", ДекларацияНДС);
	ПараметрыЧтения.Вставить("ВидДополнительногоФайла", ВидДополнительногоФайла);
	
	Возврат ДанныеРегистраДополнительныхФайлов(ПараметрыЧтения);
	
КонецФункции

// Удаляет из регистра сегменты данных раздела для выгрузки электронного представления декларации по НДС.
// Параметры:
//   ДекларацияНДС - ДокументСсылка.РегламентированныйОтчет - ссылка на документ, в котором сохраняются данные декларации;
//   Раздел - Строка - имя раздела;
//
Процедура УдалитьСегментыДанныхРазделаДекларацииНДС(ДекларацияНДС, ИмяРаздела) Экспорт
	
	Выборка = ВыборкаСегментовРазделаДекларации(ДекларацияНДС, ИмяРаздела, "Данные");
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
		Запись.РегламентированныйОтчет = ДекларацияНДС;
		Запись.ВидДополнительногоФайла = Выборка.ВидДополнительногоФайла;
		
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает все подчиненные файлы.
//
// Параметры:
//  ВладелецФайла - ЛюбаяСсылка - владелец файла.
//
// Возвращаемое значение:
//  Массив - массив файлов.
//
Функция ПолучитьВсеПодчиненныеФайлы(ВладелецФайла)
	
	ИмяСправочника = "Файлы";
		
	Если Метаданные.Справочники.Найти(ИмяСправочника) = Неопределено
	 ИЛИ Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти("ВладелецФайла") = Неопределено Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Файлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ВставитьОбъектМетаданныхПриЕгоНаличииВСпискиСОграничениемДоступа(Списки, ПолноеИмяОбъектаМетаданных)
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	Если НЕ ОбъектМетаданных = Неопределено Тогда
		
		Списки.Вставить(ОбъектМетаданных, Истина);
		
	КонецЕсли;
	          	
КонецПроцедуры

Процедура ДобавитьОшибкуФормированияРеглОтчета(РезультатВыгрузки, ТекстОшибки) Экспорт
	
	Ошибки = Неопределено;
	
	Если НЕ РезультатВыгрузки.Свойство("Ошибки", Ошибки)
		ИЛИ Ошибки = Неопределено Тогда
		Ошибки = Новый Массив;
		РезультатВыгрузки.Вставить("Ошибки", Ошибки);
	КонецЕсли;
	
	Ошибки.Добавить(ТекстОшибки);
	
КонецПроцедуры

Функция НовыйРезультатВыгрузкиРеглОтчета() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ТипФайлаВыгрузки", "");
	Результат.Вставить("ТаблицаСообщений", НовыйТаблицаСообщенийОбОшибкахВыгрузки());
	Результат.Вставить("РеглОтчетВыгружен", Ложь);
	Результат.Вставить("ИмяФайлаВыгрузки", "");
	Результат.Вставить("АдресФайлаВыгрузки", "");
	Результат.Вставить("КодировкаФайлаВыгрузки", "");
	Результат.Вставить("Ошибки", Новый Массив);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйТаблицаСообщенийОбОшибкахВыгрузки() Экспорт
	
	ТаблицаСообщений = Новый ТаблицаЗначений;
	
	ТаблицаСообщений.Колонки.Добавить("ОтчетДок");
	ТаблицаСообщений.Колонки.Добавить("Отчет",     Новый ОписаниеТипов("Строка"));
	ТаблицаСообщений.Колонки.Добавить("Раздел",    Новый ОписаниеТипов("Строка"));
	ТаблицаСообщений.Колонки.Добавить("ИмяЯчейки", Новый ОписаниеТипов("Строка"));
	ТаблицаСообщений.Колонки.Добавить("Описание",  Новый ОписаниеТипов("Строка"));
	ТаблицаСообщений.Колонки.Добавить("Страница",  Новый ОписаниеТипов("Строка"));
		
	Возврат ТаблицаСообщений;
	
КонецФункции

Процедура СообщитьПользователюОбОшибкеВУведомлении(Текст, УИД) Экспорт 
	Сообщ = Новый СообщениеПользователю;
	Если ТипЗнч(УИД) = Тип("УникальныйИдентификатор") Тогда 
		Сообщ.ИдентификаторНазначения = УИД;
	КонецЕсли;
	Сообщ.Текст = Текст;
	Сообщ.Сообщить();
КонецПроцедуры

Функция ПолучитьПризнакУчетаПоВсемОрганизациям() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьЗначениеПоУмолчанию(Настройка, Пользователь = Неопределено) Экспорт

	Если ВРег(Настройка) = ВРег("ОсновнаяОрганизация") Тогда
		
		ПустоеЗначение = Справочники["Организации"].ПустаяСсылка();
		
	ИначеЕсли ВРег(Настройка) = ВРег("ОсновноеПодразделениеОрганизации") Тогда
		
		СпрПодразделенияОрганизаций = РегламентированнаяОтчетностьПереопределяемый.ИмяСправочникаОбособленныхПодразделений();
		Если ЗначениеЗаполнено(СпрПодразделенияОрганизаций) Тогда 
			ПустоеЗначение = Справочники[СпрПодразделенияОрганизаций].ПустаяСсылка();
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЗначениеНастройки = ХранилищеОбщихНастроек.Загрузить(ВРег(Настройка), , , Пользователь);
	
	Возврат ?(ЗначениеНастройки = Неопределено, ПустоеЗначение, ЗначениеНастройки);
	  
КонецФункции

Функция ПолучитьОрганизациюПоУмолчанию() Экспорт
	
	Организация = ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	Если НЕ Организация.Пустая() Тогда
		Если Организация.ПолучитьОбъект() = Неопределено Тогда
			// Нарушена ссылочная целостность информационной базы.
			Организация = Справочники.Организации.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

Процедура УдалитьЭлементОтбораСписка(Список, ИмяПоля)
	
	ЭлементыОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			ЭлементыОтбора.Удалить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
		
КонецПроцедуры

Процедура УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения = Неопределено)
	
	ЭлементОтбора = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
	ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ЭлементОтбора.ВидСравнения     = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	ЭлементОтбора.Использование    = Истина;
	ЭлементОтбора.ПравоеЗначение   = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Список.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки = Строка(Новый УникальныйИдентификатор);
			
КонецПроцедуры

Процедура ИзменитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение = Неопределено, Установить = Ложь, ВидСравнения = Неопределено) Экспорт
	
	УдалитьЭлементОтбораСписка(Список, ИмяПоля);
	
	Если Установить Тогда
		УстановитьЭлементОтбораСписка(Список, ИмяПоля, ПравоеЗначение, ВидСравнения);
	КонецЕсли;
	
КонецПроцедуры

Функция РеглОтчеты(Наим, НеЗапоминатьВКэше = Ложь, ВыводитьСообщение = Истина) Экспорт
	Перем ВременныйФайл;
	
	НайденныйЭлемент = Справочники.РегламентированныеОтчеты.НайтиПоРеквизиту("ИсточникОтчета", Наим);
	Если НайденныйЭлемент = Справочники.РегламентированныеОтчеты.ПустаяСсылка() Тогда
		Если Метаданные.Отчеты.Найти(Наим) <> Неопределено Тогда
			Возврат Отчеты[Наим];
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПризнакИспользованияВнешнегоОтчетаСУчетомКэша(НайденныйЭлемент, НеЗапоминатьВКэше) ИЛИ НайденныйЭлемент.ВнешнийОтчетХранилище = Неопределено Тогда // используется внутренний отчет
		Если Метаданные.Документы.Найти(Наим) <> Неопределено Тогда
			
			Возврат Документы[Наим];
			
		ИначеЕсли Метаданные.Отчеты.Найти(Наим) <> Неопределено Тогда
			
			Возврат Отчеты[Наим];
			
		Иначе
			
			Если ВыводитьСообщение Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден отчет %1!'"), СокрП(Наим));
				Сообщение.Сообщить();
			КонецЕсли;
			
			Возврат Неопределено;
			
		КонецЕсли; 
	Иначе // используется внешний отчет
		Попытка
			ВременныйФайл = ФайлОтчетаСУчетомКэша(НайденныйЭлемент);
			ВнешнийОтчет = ВнешниеОтчеты.Создать(ВременныйФайл, Истина);
			Попытка
				ВнешнийОтчет.мПолноеИмяФайлаВнешнейОбработки = ВременныйФайл;
			Исключение
			КонецПопытки;
			Возврат ВнешнийОтчет;
		Исключение
			
			Если ВыводитьСообщение Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось запустить внешний отчет %1!'"), СокрП(Наим));
				Сообщение.Сообщить();
			КонецЕсли;
			
			Возврат Неопределено;
			
		КонецПопытки;
	КонецЕсли;
	
	//@skip-warning
	Возврат Неопределено;
	
КонецФункции

// Определяет, с учетом кэша, является ли отчет, заданный строкой-идентификатором Наим, внешним.
// Параметры:
//		Наим - строка-идентификатор отчета.
// ВозвращаемоеЗначение:
//		Булево - Истина, если для заданной строки-идентификатора используется внешний отчет.
//				 Ложь - в противном случае.
//				 Неопределено - информация по отчету, заданному строкой-идентификатором 
//  			 отсутствует в справочнике РегламентированныеОтчеты.
Функция ЭтоВнешнийОтчет(Наим) Экспорт
	
	НайденныйЭлемент = Справочники.РегламентированныеОтчеты.НайтиПоРеквизиту("ИсточникОтчета", Наим);
	Если НайденныйЭлемент.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ПризнакИспользованияВнешнегоОтчетаСУчетомКэша(НайденныйЭлемент);
	
КонецФункции

Функция ФормаРеглОтчета(Наим, ВыбраннаяФорма = Неопределено, Владелец = Неопределено, КлючУникальности = Неопределено) Экспорт
	
	Перем ВременныйФайл;
	
	Если Наим = "БухгалтерскаяОтчетностьВБанк"
	 Или Наим = "РасшифровкиБухгалтерскойОтчетности" Тогда
		Возврат Отчеты[Наим];
	КонецЕсли;
	
	НайденныйЭлемент = Справочники.РегламентированныеОтчеты.НайтиПоРеквизиту("ИсточникОтчета", Наим);
	Если НайденныйЭлемент = Справочники.РегламентированныеОтчеты.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ПризнакИспользованияВнешнегоОтчетаСУчетомКэша(НайденныйЭлемент) ИЛИ НайденныйЭлемент.ВнешнийОтчетХранилище = Неопределено Тогда
		// Используется внутренний отчет.
		Если Метаданные.Документы.Найти(Наим) <> Неопределено Тогда
			Возврат Документы[Наим];
			
		ИначеЕсли Метаданные.Отчеты.Найти(Наим) <> Неопределено Тогда
			Возврат Отчеты[Наим];
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден отчет %1!'"), СокрП(Наим));
			Сообщение.Сообщить();
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	Иначе
		// Используется внешний отчет.
		Попытка
			ВременныйФайл = ФайлОтчетаСУчетомКэша(НайденныйЭлемент);
			ВнешнийОтчет = ВнешниеОтчеты.Создать(ВременныйФайл, Ложь);
			
			Попытка
				ВнешнийОтчет.мПолноеИмяФайлаВнешнейОбработки = ВременныйФайл;
			Исключение
				
			КонецПопытки;
			
			Возврат ВнешнийОтчет;
			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден отчет %1!'"), СокрП(Наим));
			Сообщение.Сообщить();
			
			Возврат Неопределено;
			
		КонецПопытки;
		
	КонецЕсли;
	
	//@skip-warning
	Возврат Неопределено;
	
КонецФункции

Функция ЗаблокироватьДокумент(мСохраненныйДок) Экспорт
	
	Попытка
		
		мСохраненныйДок.Заблокировать();
		
		Возврат Истина;
		
	Исключение
				
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
			"ru='Не удается заблокировать документ!%1Возможно, документ уже открыт другим пользователем!'"), Символы.ПС);

		Сообщение.Сообщить();
        
		Возврат Ложь;
		
	КонецПопытки;
			
КонецФункции

Функция ПродолжитьПриНесоответствииВерсийФорм(Знач ВерсияФормы, Знач мВерсияФормы) Экспорт
	
	ПервыйСлеш = СтрНайти(ВерсияФормы, "/");
	ВторойСлеш = СтрНайти(Лев(ВерсияФормы, ПервыйСлеш - 1) + " " + Сред(ВерсияФормы, ПервыйСлеш + 1), "/");
	Если ПервыйСлеш = Неопределено ИЛИ ВторойСлеш = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	ГодВерсияФормы = Сред(ВерсияФормы, ВторойСлеш + 1);
	МесяцВерсияФормы = Сред(ВерсияФормы, ПервыйСлеш + 1, ВторойСлеш - ПервыйСлеш - 1);
	ДеньВерсияФормы = Сред(ВерсияФормы, 1, ПервыйСлеш - 1);
	Если СтрДлина(ГодВерсияФормы) = 2 Тогда
		ГодВерсияФормы = "20" + ГодВерсияФормы;
	КонецЕсли;
	Если СтрДлина(МесяцВерсияФормы) = 1 Тогда
		МесяцВерсияФормы = "0" + МесяцВерсияФормы;
	КонецЕсли;
	Если СтрДлина(ДеньВерсияФормы) = 1 Тогда
		ДеньВерсияФормы = "0" + ДеньВерсияФормы;
	КонецЕсли;
	ДатаВерсияФормы = Дата(ГодВерсияФормы + МесяцВерсияФормы + ДеньВерсияФормы);
	
	ПервыйСлеш = СтрНайти(мВерсияФормы, "/");
	ВторойСлеш = СтрНайти(Лев(мВерсияФормы, ПервыйСлеш - 1) + " " + Сред(мВерсияФормы, ПервыйСлеш + 1), "/");
	Если ПервыйСлеш = Неопределено ИЛИ ВторойСлеш = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	ГодмВерсияФормы = Сред(мВерсияФормы, ВторойСлеш + 1);
	МесяцмВерсияФормы = Сред(мВерсияФормы, ПервыйСлеш + 1, ВторойСлеш - ПервыйСлеш - 1);
	ДеньмВерсияФормы = Сред(мВерсияФормы, 1, ПервыйСлеш - 1);
	Если СтрДлина(ГодмВерсияФормы) = 2 Тогда
		ГодмВерсияФормы = "20" + ГодмВерсияФормы;
	КонецЕсли;
	Если СтрДлина(МесяцмВерсияФормы) = 1 Тогда
		МесяцмВерсияФормы = "0" + МесяцмВерсияФормы;
	КонецЕсли;
	Если СтрДлина(ДеньмВерсияФормы) = 1 Тогда
		ДеньмВерсияФормы = "0" + ДеньмВерсияФормы;
	КонецЕсли;
	ДатамВерсияФормы = Дата(ГодмВерсияФормы + МесяцмВерсияФормы + ДеньмВерсияФормы);
	
	Если ДатамВерсияФормы < ДатаВерсияФормы Тогда
						
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраненные данные не могут быть открыты текущей версией отчета!%1Версия отчета - от %2Версия данных - от %3'"), Символы.ПС, Формат(ДатамВерсияФормы, "ДЛФ=DD; ДП='Пустая дата'") + Символы.ПС, Формат(ДатаВерсияФормы,  "ДЛФ=DD; ДП='Пустая дата'"));
		
		Сообщение.Сообщить();
                  						
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьВариантЗаполненияПоказателяРегОтчета(МакетСоставаПоказателей, Ном) Экспорт
	
	стрВариантЗаполнения = СокрЛП(МакетСоставаПоказателей.Область(Ном, 6).Текст);
	ПозицияРазделителя = СтрНайти(стрВариантЗаполнения, ",");

	// Указан общий вариант заполнения показателя, для всех конфигураций.
	Если ПозицияРазделителя = 0 Тогда
		стрВариантЗаполнения = ?(стрВариантЗаполнения = "4", "4", "");
		Возврат стрВариантЗаполнения;
	КонецЕсли;
	
	Если ПозицияРазделителя > 0 Тогда
		
		ВариантыЗаполнения = СтрЗаменить(стрВариантЗаполнения, ",", Символы.ПС);
		ВариантыЗаполнения = СтрЗаменить(ВариантыЗаполнения, " ", "");
		
		ВариантЗаполнения = СтрПолучитьСтроку(ВариантыЗаполнения, 1);
		ВариантЗаполнения = ?(ВариантЗаполнения = "4", "4", "");
		
		Возврат ВариантЗаполнения;

	КонецЕсли;

КонецФункции

Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставления(Форма) Экспорт

	Если ТипЗнч(Форма.мСвойстваРазделовДекларации) <> Тип("ДанныеФормыДерево") Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаУровня1 Из Форма.мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		Если СтрокаУровня1.ПредставлениеДанных Тогда
			Форма.ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаСервере(СтрокаУровня1.ИмяСтраницы);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПредставительЯвляетсяФизЛицом(Представитель) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Представитель) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// ДЕНЬГИ
	Возврат Истина;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецФункции

Функция ПолучитьФИОФизЛица(ФизЛицо, НаДату = Неопределено) Экспорт
	
	Результат = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	// ДЕНЬГИ
	ЗаполнитьЗначенияСвойств(Результат, ФизЛицо);
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаписиРегламентированногоОтчетаНаСервере(Форма, КодИФНС = "не применимо", Автосохранение = Ложь, Вариант, ВидДокументаНомерКорректировкиИзменен, мСохраненныйДок) Экспорт
	
	Если КодИФНС = Неопределено Тогда
		КодИФНС = "не применимо";
	КонецЕсли;
	
	Если Автосохранение = Неопределено Тогда
		Автосохранение = Ложь;
	КонецЕсли;
			
	Форма.СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = (мСохраненныйДок = Неопределено ИЛИ Форма.СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено);
	
	Если Вариант <> Неопределено И ((мСохраненныйДок = Неопределено) ИЛИ (Форма.СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено) ИЛИ (Вариант <> Форма.СтруктураРеквизитовФормы.мВариант)) Тогда
		
		// Отчет новый или был скопирован.

		Если мСохраненныйДок = Неопределено ИЛИ Форма.СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
						
			// Создаем новый документ вида РегламентированныйОтчет.
						
			мСохраненныйДок = Документы.РегламентированныйОтчет.СоздатьДокумент();
			ЗаблокироватьДокумент(мСохраненныйДок);
			Форма.СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = Истина;
			мСохраненныйДок.Дата = Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
			мСохраненныйДок.УстановитьВремя();
			мСохраненныйДок.УстановитьНовыйНомер();
						
		ИначеЕсли Вариант <> Форма.СтруктураРеквизитовФормы.мВариант Тогда
	
			Если ВидДокументаНомерКорректировкиИзменен Тогда
				
				Если мСохраненныйДок.Заблокирован() Тогда
					мСохраненныйДок.Разблокировать();
				КонецЕсли;
				
				мСохраненныйДок = Документы.РегламентированныйОтчет.СоздатьДокумент();
				ЗаблокироватьДокумент(мСохраненныйДок);
				Форма.СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = Истина;
				мСохраненныйДок.Дата = Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
				мСохраненныйДок.УстановитьВремя();
				мСохраненныйДок.УстановитьНовыйНомер();
							
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетДокументСАналогичнымиРеквизитами(Форма, КодИФНС, КПП = "") Экспорт	
	
	Попытка
		Вариант = Форма.СтруктураРеквизитовФормы.ВидДокумента*Форма.НомерКорректировки;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мСохраненныйДок", ?(Форма.СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено, Неопределено, Форма.СтруктураРеквизитовФормы.мСохраненныйДок.Ссылка));
	
	Запрос.УстановитьПараметр("ИсточникОтчета", Метаданные.Отчеты[Сред(Лев(СтрЗаменить(Форма.ИмяФормы, "Внешний", ""), СтрНайти(СтрЗаменить(Форма.ИмяФормы, "Внешний", ""), ".Форма.") - 1), 7)].Имя);
	
	Запрос.УстановитьПараметр("Организация", Форма.СтруктураРеквизитовФормы.Организация);
	Запрос.УстановитьПараметр("ДатаНачалаНач", НачалоДня(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаНачалаКон", КонецДня(Форма.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаКонцаНач", НачалоДня(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("ДатаКонцаКон", КонецДня(Форма.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета));
	Запрос.УстановитьПараметр("КодНалоговогоОргана", КодИФНС);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("Вариант", Вариант);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РегламентированныйОтчет.Ссылка)
	               |ИЗ
	               |	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	               |ГДЕ
	               |	РегламентированныйОтчет.Ссылка <> &мСохраненныйДок
	               |	И РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
	               |	И РегламентированныйОтчет.Организация = &Организация
	               |	И РегламентированныйОтчет.ДатаНачала МЕЖДУ &ДатаНачалаНач И &ДатаНачалаКон
	               |	И РегламентированныйОтчет.ДатаОкончания МЕЖДУ &ДатаКонцаНач И &ДатаКонцаКон
	               |	И РегламентированныйОтчет.Вид = &Вариант";
				   
	Если КодИФНС <> "не применимо" Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И РегламентированныйОтчет.КодНалоговогоОргана = &КодНалоговогоОргана
				   |	И РегламентированныйОтчет.КПП = &КПП";
	КонецЕсли;
			   
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();			   
	Если РезультатЗапроса.Количество() = 0 ИЛИ РезультатЗапроса.Получить(0).Получить(0) = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ОперацииПриВосстановленииРегламентированногоОтчета(Форма) Экспорт

	Форма.СтруктураРеквизитовФормы.мВариант = Форма.СтруктураРеквизитовФормы.мСохраненныйДок.Вид;
	Если Форма.СтруктураРеквизитовФормы.мВариант = Неопределено Тогда
		Форма.СтруктураРеквизитовФормы.мВариант = 0;
	КонецЕсли;

	Если Форма.СтруктураРеквизитовФормы.мВариант = 0 Тогда
		Если Форма.СтруктураРеквизитовФормы.Свойство("ВидДокумента") Тогда
			Форма.СтруктураРеквизитовФормы.ВидДокумента = 0;
		КонецЕсли;
	Иначе
		Если Форма.СтруктураРеквизитовФормы.Свойство("ВидДокумента") Тогда
			Форма.СтруктураРеквизитовФормы.ВидДокумента = 1;
		КонецЕсли;
		Форма.НомерКорректировки = Форма.СтруктураРеквизитовФормы.мВариант;
	КонецЕсли;
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты("");
	
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
	
		Если РеквизитФормы.Имя = "мДеревоСтраницОтчета"
		   И Форма.мДеревоСтраницОтчета.ПолучитьЭлементы().Количество() > 0 Тогда
			
			Форма.мДеревоСтраницОтчета.ПолучитьЭлементы()[0].ПоказатьСтраницу = 1;
			Форма.мДеревоСтраницОтчета.ПолучитьЭлементы()[0].ВыводНаПечать    = 1;
			
		КонецЕсли;	
	
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьСтрокуДаннымиИзТаблицы(ТаблицаРаздела, Строка1, СтрокаТаблицы, НомерНаФорме) Экспорт
	
	// Заполняем строку.
	Для каждого Колонка Из ТаблицаРаздела.Колонки Цикл
		КолонкаИмя = Колонка.Имя;
		НазвЯчейки = КолонкаИмя + "_" + НомерНаФорме;
		Если Строка1.Области[НазвЯчейки].СодержитЗначение = Истина Тогда
			Строка1.Области[НазвЯчейки].Значение = СтрокаТаблицы[КолонкаИмя];
		Иначе
			Строка1.Области[НазвЯчейки].Текст = СтрокаТаблицы[КолонкаИмя];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция БылиИзмененыКлючевыеРеквизитыОтчета(Форма, КодИФНС, КПП = "") Экспорт
	
	Попытка
		Вариант = Форма.СтруктураРеквизитовФормы.ВидДокумента*Форма.НомерКорректировки;
		мСохраненныйДок = Форма.СтруктураРеквизитовФормы.мСохраненныйДок;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если мСохраненныйДок = Неопределено ИЛИ Форма.СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
		Возврат Истина;
	Иначе
		Если КодИФНС = "не применимо" Тогда
			Возврат Вариант <> мСохраненныйДок.Вид;
		Иначе
			Возврат Вариант <> мСохраненныйДок.Вид ИЛИ СокрЛП(КодИФНС) <> СокрЛП(мСохраненныйДок.КодНалоговогоОргана) ИЛИ СокрЛП(КПП) <> СокрЛП(мСохраненныйДок.КПП);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПредставлениеВидаДокумента(Вид) Экспорт
	
	Если Вид = 0 Тогда
		Возврат "П";
	ИначеЕсли Вид = Неопределено Тогда
		Возврат "-";
	Иначе
		Возврат "К/" + Вид;
	КонецЕсли;
	
КонецФункции

Функция ВывестиСведенияСлужебнойЧасти30(Текст, Организация = Неопределено, Знач ДатаДок = Неопределено, Знач ОргИНН = Неопределено, Знач ОргКПП = Неопределено, Знач КодИнсп = Неопределено, ТипИнф = "ОТЧЕТНОСТЬНП", ВерсияФормата = "3.00") Экспорт
	
	Если ДатаДок = Неопределено Тогда
		ДатаДок = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДатаДокС = Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	
	Если Организация <> Неопределено Тогда
		
		Если ОргИНН = Неопределено ИЛИ ПустаяСтрока(ОргИНН) Тогда
			ОргИНН = СокрЛП(Организация.ИНН);
		КонецЕсли;
		
		Если ОргКПП = Неопределено ИЛИ ПустаяСтрока(ОргКПП) Тогда
			ОргКПП = Организация.КПП;
		КонецЕсли;
		
		Если КодИНСП = Неопределено ИЛИ ПустаяСтрока(КодИНСП) Тогда
			КодИНСП = СокрЛП(РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, , "КодНО").КодНО);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ОргИНН) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Невозможно определить ИНН организации! Выгрузка прервана!'");
		
		Сообщение.Сообщить();
		
		Возврат Ложь;
				
	КонецЕсли;
	
	Если ПустаяСтрока(КодИНСП) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Невозможно определить код налоговой инспекции! Выгрузка прервана!'");
		
		Сообщение.Сообщить();
                 		
		Возврат Ложь;
		
	КонецЕсли;
	
	ОргИНН = СокрЛП(ОргИНН);
	
	КатегорияНП = 1;
	Если СтрДлина(СокрЛП(ОргИНН)) = 12 Тогда
		// Налогоплательщик - физическое лицо.
		КатегорияНП = 2;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ОргКПП) Тогда
		// Если КПП указан.
		Если СтрДлина(ОргИНН) = 10 Тогда
			ИДОтпр = ОргИНН + "**" + ОргКПП;
		Иначе
			ИДОтпр = ОргИНН + ОргКПП;
		КонецЕсли;
	Иначе
		// Если КПП не указан.
		Если КатегорияНП = 1 Тогда 
			// Налогоплательщик - ЮЛ.
			ИДОтпр = ОргИНН + "***********";
		Иначе
			// Налогоплательщик - ФЛ.
			ИДОтпр = ОргИНН + "*********";
		КонецЕсли;
	КонецЕсли;
	
	ИдФайл  = ИДОтпр + Прав(ДатаДокС,4) + Сред(ДатаДокС,4,2) + Лев(ДатаДокС,2)
			+ Формат(Час(ДатаДок),"ЧЦ=2; ЧН=; ЧВН=") + Формат(Минута(ДатаДок),"ЧЦ=2; ЧН=; ЧВН=") + Формат(Секунда(ДатаДок),"ЧЦ=2; ЧН=; ЧВН=");	
	                                         
	Текст.ДобавитьСтроку("ИдФайл:" + ИдФайл);
	Текст.ДобавитьСтроку("ТипИнф:" + ТипИнф);
	Текст.ДобавитьСтроку("ВерсФорм:" + ВерсияФормата); 
	Текст.ДобавитьСтроку("ИдПол:"  + КодИнсп); 
	Текст.ДобавитьСтроку("ВерсПрог:" + НазваниеИВерсияПрограммы());
	Текст.ДобавитьСтроку("КолДок:1");

	Возврат Истина;
	
КонецФункции

Функция ВывестиСведенияОбОтправителе30(Текст, Организация = Неопределено, Знач ОргНазв = Неопределено, Знач ОргТелефон = Неопределено, Знач ОргБухгалтер = Неопределено, ВыгрузкаДекларацииПоАлкоголю = Ложь) Экспорт
	
	Если Организация <> Неопределено Тогда
		
		Если ОргНазв = Неопределено Тогда
			ОргНазв = СокрЛП(Организация.НаименованиеПолное);
		КонецЕсли;
		
		Если ОргТелефон = Неопределено Тогда
			ОргТелефон = СокрЛП(РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДатаСеанса(), "ТелОрганизации").ТелОрганизации);
		КонецЕсли;
		
		Если ОргБухгалтер = Неопределено Тогда
			ОргСведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДатаСеанса(), "ФИОБух");
			ОргБухгалтер = СокрЛП(ОргСведения.ФИОБух);
		КонецЕсли;
		
	КонецЕсли;
	
	ИНН = СокрЛП(Организация.ИНН);
	Если ПустаяСтрока(ИНН) Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ru='Невозможно определить вид налогоплательщика! Выгрузка прервана!'");

		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	КатегорияНП = 1;
	Если СтрДлина(СокрЛП(ИНН)) = 12 Тогда
		// Налогоплательщик - физическое лицо.
		КатегорияНП = 2;
	КонецЕсли;
	
	Если ПустаяСтрока(ОргНазв) Тогда
		
		Сообщение = Новый СообщениеПользователю;

		Сообщение.Текст = НСтр("ru='Невозможно определить полное название организации! Выгрузка прервана!'");

		Сообщение.Сообщить();
        		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если КатегорияНП = 1 И ПустаяСтрока(ОргБухгалтер) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Невозможно определить ФИО главного бухгалтера организации! Выгрузка прервана!'");
		
		Сообщение.Сообщить();

		Возврат Ложь;
		
	КонецЕсли;
	
	Если КатегорияНП = 1 ИЛИ ВыгрузкаДекларацииПоАлкоголю Тогда
		
		// Отправитель - ЮЛ.
		Текст.ДобавитьСтроку("НаимОтпрЮл:" + ВРЕГ(СтрЗаменить(ОргНазв, Символы.ПС, "")));
		Текст.ДобавитьСтроку("ТелОтпр:"    + СокрЛП(ВРЕГ(Лев(ОргТелефон, 20))));
		Текст.ДобавитьСтроку("ДолжнОтпр:ГЛАВНЫЙ БУХГАЛТЕР");
		Текст.ДобавитьСтроку("ФИООтпр:"   + СтрЗаменитьПробелы(ОргБухгалтер));
		Текст.ДобавитьСтроку("@@@"); 
		
	Иначе
		
		// Отправитель - ФЛ.
		ФИООтпрФЛ = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
			Организация, ТекущаяДатаСеанса(), "ФИО").ФИО;
				
		Если ПустаяСтрока(ФИООтпрФЛ) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Невозможно определить ФИО индивидуального предпринимателя! Выгрузка прервана!'");
			
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Текст.ДобавитьСтроку("ФИООтпрФЛ:" + СтрЗаменитьПробелы(ФИООтпрФЛ));
		Текст.ДобавитьСтроку("ТелОтпр:"   + СокрЛП(ВРЕГ(Лев(ОргТелефон, 20))));
		Текст.ДобавитьСтроку("@@@");
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СвернутьДанныеТабличногоПоля(Данные) Экспорт
	
	ТП = Новый ТаблицаЗначений;
	ТП.Колонки.Добавить("Имя");
	ТП.Колонки.Добавить("Кол");
	ТП.Колонки.Добавить("Номер");
	ТП.Колонки.Добавить("Знач");
	
	Для Каждого Стр Из Данные Цикл
		НоваяСтрока = ТП.Добавить();
		НоваяСтрока.Имя = Стр.Ключ;
		НоваяСтрока.Кол = 1;
		НоваяСтрока.Знач = Стр.Значение;
	КонецЦикла;
	
	ТП.Сортировать("Имя");
	
	Для Каждого Стр Из ТП Цикл
		Имя = Стр.Имя;
		
		Если ЭтоКодПоказателяП(Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСимвола = СтрДлина(Имя);
		БылаЦифра = Ложь;
		
		Пока НомерСимвола > 0 Цикл
			
			Симв = Сред(Имя, НомерСимвола, 1);
			КодСимв = КодСимвола(Симв);
			
			Если (КодСимв >= КодСимвола("0") И КодСимв <= КодСимвола("9")) ИЛИ (Симв = "_") Тогда
				
				Если Симв = "_" Тогда
					Если БылаЦифра Тогда
						
						НомерСимвола = НомерСимвола - 1;
						Прервать;
						
					КонецЕсли;
				Иначе
					БылаЦифра = Истина;
				КонецЕсли;
				
			Иначе
				Прервать;
			КонецЕсли;
			
			НомерСимвола = НомерСимвола - 1;
			
		КонецЦикла;
		
		Если БылаЦифра Тогда
			Корень = Лев(Стр.Имя, НомерСимвола);
			Номер = Сред(Стр.Имя, НомерСимвола + 1);
			Попытка
				Стр.Номер = Число( ?( Лев(Номер, 1) = "_", Сред(Номер, 2), Номер));
			Исключение
				
				Сообщение = Новый СообщениеПользователю;

				Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ошибки преобразования номера из окончания: %1 === %2'"), Корень, Номер);
	
				Сообщение.Сообщить();
				
			КонецПопытки;
			Стр.Имя = Корень;
		КонецЕсли;
		
	КонецЦикла;
	
	ТП.Сортировать("Имя, Номер");
	
	ТП2 = ТП.Скопировать();
	ТП2.Свернуть("Имя", "Кол");
	
	Для Каждого Стр Из ТП2 Цикл
		Если Стр.Имя = "П" ИЛИ Стр.Имя = "ЧНП" Тогда
			Продолжить;
		КонецЕсли;
		Если Стр.Кол > 1 Тогда
			ЗначениеСводногоПоказателя = ВычислитьЗначениеПоКорню(ТП, Стр.Имя);
			НайдЗнач = Неопределено;
			Если НЕ Данные.Свойство(Стр.Имя, НайдЗнач) Тогда
				Данные.Вставить(Стр.Имя, ЗначениеСводногоПоказателя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Процедура СформироватьСтруктуруПоказателей(Форма) Экспорт 
	
	Форма.мДанныеОтчета = Новый Структура;
	
	СохрСтруктура = Форма.СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	ПоказателиОтчета = СохрСтруктура.ПоказателиОтчета;
	Для Каждого Раздел Из ПоказателиОтчета Цикл
		Форма.мДанныеОтчета.Вставить(Раздел.Ключ, СвернутьДанныеТабличногоПоля(Раздел.Значение));
	КонецЦикла;
	
КонецПроцедуры

Функция ВычислитьЗначениеПоКорню(Табл, Корень)
	
	Табл2 = Табл.Скопировать();
	ИтоговоеЗначение = "";
	
	Для Каждого Стр Из Табл2 Цикл
		
		Имя = Стр.Имя;
		Если Имя = Корень Тогда
			ИтоговоеЗначение = ИтоговоеЗначение + Стр.Знач;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ((ВРЕГ(Лев(Корень, 4)) = "ДАТА") ИЛИ (СтрЧислоВхождений(Корень, "Дата") <> 0)) 
		И (((СтрДлина(ИтоговоеЗначение)=8) ИЛИ (СтрДлина(ИтоговоеЗначение)=6)) ИЛИ (ПустаяСтрока(ИтоговоеЗначение)))Тогда
		
		Если ПустаяСтрока(ИтоговоеЗначение) Тогда
			ИтоговоеЗначение = "00.00.0000";
		Иначе
			ИтоговоеЗначение = Лев(ИтоговоеЗначение, 2) + "." + Сред(ИтоговоеЗначение, 3, 2) + "." + Сред(ИтоговоеЗначение, 5);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИтоговоеЗначение;
	
КонецФункции

Функция ИННСоответствуетТребованиямБезТипаНаСервере(Знач ИНН) Экспорт
	
	ИННСтр = СокрЛП(ИНН);
	ДлинаИНН =  СтрДлина(ИННСтр);
	
	Если ДлинаИНН = 10 Тогда
		ВладелецИННФизЛицо = Ложь;
	ИначеЕсли ДлинаИНН = 12 Тогда
		ВладелецИННФизЛицо = Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ИНН, ВладелецИННФизЛицо);
	
КонецФункции

Функция ФИОНаписаноВерно(Знач СтрокаПараметр, ПроверятьТолькоРусскиеБуквы = Ложь) Экспорт
	
	СтрокаПараметр = СокрЛП(СтрокаПараметр);
	
	СписокДопустимыхЗначений = Новый Соответствие;
	СписокДопустимыхЗначений.Вставить(КодСимвола(" "), " ");
	СписокДопустимыхЗначений.Вставить(КодСимвола("."), ".");
	СписокДопустимыхЗначений.Вставить(КодСимвола("-"), "-");
	СписокДопустимыхЗначений.Вставить(КодСимвола("ё"), "ё");
	СписокДопустимыхЗначений.Вставить(КодСимвола("Ё"), "Ё");
	
	КодA = КодСимвола("A");
	КодZ = КодСимвола("z");
	КодА = КодСимвола("А");
	КодЯ = КодСимвола("я");
	Если  ПроверятьТолькоРусскиеБуквы Тогда
		Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
			Код = КодСимвола(СтрокаПараметр, Сч);
			Если ((Код >= КодА) И (Код <= КодЯ)) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
				Продолжить;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Сч = 1 По СтрДлина(СтрокаПараметр) Цикл
			Код = КодСимвола(СтрокаПараметр, Сч);
			Если (((Код >= КодA) И (Код <= КодZ)) ИЛИ ((Код >= КодА) И (Код <= КодЯ))) ИЛИ (СписокДопустимыхЗначений.Получить(Код) <> Неопределено) Тогда
				Продолжить;
			Иначе
				Возврат 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	Возврат 1;
	
КонецФункции

Функция РазбитьПоПодразделам(ИмяРаздела, мТаблицаСоставПоказателей, МногострочныеИсключения = Неопределено) Экспорт

	Подразделы = Новый Структура;
	СтрокиФорматаТекРаздела = мТаблицаСоставПоказателей.НайтиСтроки(Новый Структура("ИмяПоляТаблДокумента",ИмяРаздела));
	ПослМногостр = "^^^";
	ПослКодПоказателя = "П000000000000";

	Для Каждого Стр Из СтрокиФорматаТекРаздела Цикл

		КодПоказателя = Стр.КодПоказателяПоСоставу;
		Многостр = Стр.ПризнМногострочности;
		Если КодПоказателя = "###" ИЛИ КодПоказателя = "===" ИЛИ Лев(КодПоказателя, 2) = "//" Тогда
			Продолжить;
		КонецЕсли;
		Если Многостр <> ПослМногостр Тогда
			Подразделы.Вставить(КодПоказателя, Многостр);
			ПослМногостр = Многостр;
		ИначеЕсли (Многостр = ПослМногостр) И (МногоСтр = "/") И (Лев(ПослКодПоказателя, 11) <> Лев(КодПоказателя, 11))
					И ?(МногострочныеИсключения = Неопределено, Истина, МногострочныеИсключения.НайтиПоЗначению(КодПоказателя) = Неопределено) Тогда
			Подразделы.Вставить(КодПоказателя, Многостр);
			ПослМногостр = Многостр;
		КонецЕсли;

		ПослКодПоказателя = КодПоказателя;

	КонецЦикла;

	Возврат Подразделы;

КонецФункции

Функция СкопированнаяСтруктура(Структура1) Экспорт
	
	Структура2 = Новый Структура;
	
	Для Каждого Зап Из Структура1 Цикл
		Структура2.Вставить(Зап.Ключ, Зап.Значение);
	КонецЦикла;
	
	Возврат Структура2;
	
КонецФункции

Функция ПроверитьНаПустоеЗначение(НазваниеОтчета, Стр, Значение, ВыводитьСообщения, НомерСтраницы = Неопределено, НомерСтроки = Неопределено, ПроверкаЗаполненияСтр = 0, ФормаВыводаСообщений = Неопределено) Экспорт
		
	Если СтрНайти(Стр.Обязательность, "Н") <> 0 И ПроверкаЗаполненияСтр = 1 Тогда
		Возврат 1; 
	КонецЕсли;
	
	Если СтрНайти(Стр.Обязательность, "Н") <> 0 И ПроверкаЗаполненияСтр = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Стр.Обязательность = "" и ПроверкаЗаполненияСтр = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Если ВыводитьСообщения Тогда
			Стрк = СтрокаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
			Графа = ГрафаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
			
			Если ФормаВыводаСообщений <> Неопределено Тогда
				НовСтр = ФормаВыводаСообщений.ТаблицаСообщений.Добавить();
				НовСтр.Раздел = Стр.ИмяПоляТаблДокумента;
				НовСтр.Строка = Стрк;
				НовСтр.Графа = Графа;
				НовСтр.Страница = НомерСтраницы;
				НовСтр.СтрокаПП = НомерСтроки;
				КодНаФорме = Стр.КодПоказателяПоСтруктуре;
				Если НЕ ЗначениеЗаполнено(КодНаФорме) Тогда
					КодНаФорме = Стр.КодПоказателяПоФорме;
				КонецЕсли;
				НовСтр.ИмяЯчейки = ?(ПустаяСтрока(КодНаФорме), Стр.КодПоказателяПоСоставу, КодНаФорме); 
				НовСтр.Описание = "Не задано значение";
			КонецЕсли;

		КонецЕсли;
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции

Функция ПроверитьНаКорректность(НазваниеОтчета, Стр, Значение, ВыводитьСообщения, НомерСтраницы = Неопределено, ФормаВыводаСообщений = Неопределено) Экспорт
	
	ДопОписание = СокрЛП(Стр.ДопОписание);
	Если ПустаяСтрока(ДопОписание) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Строка") И ЭтоКодПоказателяП(Стр.КодПоказателяПоСоставу) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ДопОписание = "ИНН" Тогда
		Если НЕ ИННСоответствуетТребованиямБезТипаНаСервере(Значение) Тогда
			Если ФормаВыводаСообщений <> Неопределено Тогда
				НовСтр = ФормаВыводаСообщений.ТаблицаСообщений.Добавить();
				НовСтр.Раздел = Стр.ИмяПоляТаблДокумента;
				НовСтр.Строка = СтрокаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
				НовСтр.Графа = ГрафаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
				НовСтр.Страница = НомерСтраницы;
				НовСтр.СтрокаПП = Неопределено;
				КодНаФорме = Стр.КодПоказателяПоСтруктуре;
				Если НЕ ЗначениеЗаполнено(КодНаФорме) Тогда
					КодНаФорме = Стр.КодПоказателяПоФорме;
				КонецЕсли;
				НовСтр.ИмяЯчейки = ?(ПустаяСтрока(КодНаФорме), Стр.КодПоказателяПоСоставу, КодНаФорме); 
				НовСтр.Описание = "Неверно задан ИНН";
			КонецЕсли;
			Возврат 1;
		КонецЕсли;
		
	ИначеЕсли ДопОписание = "КПП" Тогда
		
		Если НЕ РегламентированнаяОтчетностьКлиентСервер.КППСоответствуетТребованиям(Значение) Тогда
			Если ФормаВыводаСообщений <> Неопределено Тогда
				НовСтр = ФормаВыводаСообщений.ТаблицаСообщений.Добавить();
				НовСтр.Раздел = Стр.ИмяПоляТаблДокумента;
				НовСтр.Строка = СтрокаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
				НовСтр.Графа = ГрафаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
				НовСтр.Страница = НомерСтраницы;
				НовСтр.СтрокаПП = Неопределено;
				КодНаФорме = Стр.КодПоказателяПоСтруктуре;
				Если НЕ ЗначениеЗаполнено(КодНаФорме) Тогда
					КодНаФорме = Стр.КодПоказателяПоФорме;
				КонецЕсли;
				НовСтр.ИмяЯчейки = ?(ПустаяСтрока(КодНаФорме), Стр.КодПоказателяПоСоставу, КодНаФорме); 
				НовСтр.Описание = "Неверно задан КПП";
			КонецЕсли;
			Возврат 1;
		КонецЕсли;
		
	ИначеЕсли ДопОписание = "КБК" Тогда
		
	ИначеЕсли ДопОписание = "ОКАТО" Тогда
		
	ИначеЕсли ДопОписание = "ОГРН" Тогда
		
		Если НЕ ОГРНСоответствуетТребованиям(Значение) Тогда
			Если ФормаВыводаСообщений <> Неопределено Тогда
				НовСтр = ФормаВыводаСообщений.ТаблицаСообщений.Добавить();
				НовСтр.Раздел = Стр.ИмяПоляТаблДокумента;
				НовСтр.Строка = СтрокаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
				НовСтр.Графа = ГрафаПоКодуПоказателя(Стр.КодПоказателяПоСоставу);
				НовСтр.Страница = НомерСтраницы;
				НовСтр.СтрокаПП = Неопределено;
				КодНаФорме = Стр.КодПоказателяПоСтруктуре;
				Если НЕ ЗначениеЗаполнено(КодНаФорме) Тогда
					КодНаФорме = Стр.КодПоказателяПоФорме;
				КонецЕсли;
				НовСтр.ИмяЯчейки = ?(ПустаяСтрока(КодНаФорме), Стр.КодПоказателяПоСоставу, КодНаФорме); 
				НовСтр.Описание = "Неверно задан ОГРН";
			КонецЕсли;
			Возврат 1;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Процедура СообщитьВТаблицуСообщений(Владелец, Описание, Раздел, ИмяЯчейки = "", ФИО = "") Экспорт
	
	НовСтр = Владелец.ТаблицаСообщений.Добавить();
	НовСтр.Раздел    = Раздел;
	НовСтр.ИмяЯчейки = ИмяЯчейки;
	НовСтр.Описание  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), Описание);
	НовСтр.Страница  = ФИО;
	
КонецПроцедуры

Функция ВывестиОбщиеСведенияИнформационнойЧасти30(Текст, Организация = Неопределено, Знач ОргИНН = Неопределено, Знач ОргКПП = Неопределено, Знач ДатаДок = Неопределено, КодИФНС = Неопределено) Экспорт
	
	Если ДатаДок = Неопределено Тогда
		ДатаДок = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ДатаДокС = Формат(ДатаДок, "ДФ=dd.MM.yyyy");
	
	Если Организация <> Неопределено Тогда
		
		Если ОргИНН = Неопределено Тогда
			ОргИНН = СокрЛП(Организация.ИНН);
		КонецЕсли;
		
		Если ОргКПП = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ОргКПП) Тогда	
			Если КодИФНС <> Неопределено Тогда
				ОргКПП = РегламентированнаяОтчетностьВызовСервера.КПППоКомбинацииОрганизацииИКодаИФНС(Организация, КодИФНС);
			Иначе
				ОргКПП = Организация.КПП;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ОргИНН) Тогда
		
		Сообщение = Новый СообщениеПользователю;
				
		Сообщение.Текст = НСтр("ru='Невозможно определить ИНН организации! Выгрузка прервана!'");
				
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	КатегорияНП = 1;
	Если СтрДлина(СокрЛП(ОргИНН)) = 12 Тогда
		// Налогоплательщик - физическое лицо.
		КатегорияНП = 2;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ОргКПП) Тогда
		// Если КПП указан.
		Если СтрДлина(ОргИНН) = 10 Тогда
			ИДОтпр = ОргИНН + "**" + ОргКПП;
		Иначе
			ИДОтпр = ОргИНН + ОргКПП;
		КонецЕсли;
	Иначе
		// Если КПП не указан.
		Если КатегорияНП = 1 Тогда 
			// Налогоплательщик - ЮЛ.
			ИДОтпр = ОргИНН + "***********";
		Иначе
			// Налогоплательщик - ФЛ.
			ИДОтпр = ОргИНН + "*********";
		КонецЕсли;
	КонецЕсли;
	
	СчДок = ПолучитьСчетчикВыгруженныхДокументов(Организация, ДатаДок) + 1;
	ИдДок = ИДОтпр + Прав(ДатаДокС, 4) + Формат(СчДок, "ЧЦ=8; ЧН=; ЧВН=; ЧГ=");
	
	Текст.ДобавитьСтроку("ИдДок:" + СокрЛП(ИдДок)); 
	Текст.ДобавитьСтроку("ДатаДок:" + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy")); 
	Текст.ДобавитьСтроку("###");
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСчетчикВыгруженныхДокументов(Организация, Знач ДатаДокумента = Неопределено, НомерКвартала = 0, Знач ТипСчетчика = Неопределено) Экспорт
	
	Если Организация = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТипСчетчика = Неопределено Тогда
		ТипСчетчика = Перечисления.ТипыСчетчиковВыгрузки.СчетчикДокументовВФормате300;
	КонецЕсли;
	
	Если ДатаДокумента = Неопределено Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                      |	СчетчикиВыгрузок.Значение
	                      |ИЗ
	                      |	РегистрСведений.СчетчикиВыгрузок КАК СчетчикиВыгрузок
	                      |ГДЕ
	                      |	СчетчикиВыгрузок.Период = &Период
	                      |	И СчетчикиВыгрузок.Тип = &Тип
	                      |	И СчетчикиВыгрузок.Организация = &Организация
	                      |	И СчетчикиВыгрузок.НомерКвартала = &НомерКвартала");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Тип", ТипСчетчика);
	Запрос.УстановитьПараметр("Период", НачалоГода(ДатаДокумента));
	Запрос.УстановитьПараметр("НомерКвартала", НомерКвартала);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Если ТипСчетчика = Перечисления.ТипыСчетчиковВыгрузки.СчетчикДокументовАлко И Выборка.Значение = 99 Тогда
			Возврат 0;
		Иначе
			Возврат Выборка.Значение;
		КонецЕсли;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция СтрЗаменитьПробелы(ИсхСтрока) Экспорт
	
	ПромСтр=СокрЛП(ИсхСтрока); 
	
	Если ПустаяСтрока(ПромСтр) Тогда
		ПромСтр = ",,";
		
		Возврат ПромСтр;
	КонецЕсли;

	// Сначала удаляем возможный недопустимый символ '.'.
	ЧП = СтрЧислоВхождений(ПромСтр,".");
	Если ЧП>0 Тогда
		Для К=1 По ЧП Цикл
			РезСтр=СтрЗаменить(ПромСтр,"."," ");
			ПромСтр=РезСтр;
		КонецЦикла; 
	КонецЕсли;
	
	// Число разделительных пробелов.
	ЧП=СтрЧислоВхождений(ПромСтр," ");
	Если ЧП>0 Тогда
		Для К=1 По ЧП Цикл
			РезСтр  = СтрЗаменить(ПромСтр," ",",");
			ПромСтр = РезСтр;
		КонецЦикла; 
	КонецЕсли;
	
	// Проверяем соответствие формату представления.
	КолЗап = СтрЧислоВхождений(ПромСтр,",");
	Если КолЗап < 2 Тогда
		// Дополняем недостающими запятыми.
		Для Ном=(КолЗап+1) По 2 Цикл
			ПромСтр=ПромСтр+",";
		КонецЦикла;
	ИначеЕсли КолЗап > 2 Тогда
		Пока СтрЧислоВхождений(ПромСтр, ",") <> 2 Цикл
			НайденПовтор = 0;
			
			ПозицияЗапятой = СтрНайти(ПромСтр, ",");
			Если Сред(ПромСтр, ПозицияЗапятой + 1, 1) = "," Тогда
				НачПозиция	 = ПозицияЗапятой;
				НайденПовтор = 1;
			Иначе
				ПозицияЗапятой2 = СтрНайти(Сред(ПромСтр, ПозицияЗапятой + 1), ",");
				Если Сред(ПромСтр, ПозицияЗапятой + ПозицияЗапятой2 + 1, 1) = "," Тогда
					НачПозиция	 = ПозицияЗапятой + ПозицияЗапятой2;
					НайденПовтор = 1;
				КонецЕсли;
			КонецЕсли;	
			
			Если НайденПовтор = 1 Тогда
				ПромСтр = Лев(ПромСтр, НачПозиция) + Сред(ПромСтр, НачПозиция + 2);
			Иначе
				Если Прав(ПромСтр, 1) = "," Тогда
					// Лишние хвостовые пробелы удаляем.
					ПромСтр = Лев(ПромСтр, СтрДлина(ПромСтр) - 1);
				Иначе
					// Лишние запятые заменяем пробелами.
					ПромСтр = Лев(ПромСтр, ПозицияЗапятой - 1) + " " + Сред(ПромСтр, ПозицияЗапятой + 1); 
				КонецЕсли;
			КонецЕсли;
				
		КонецЦикла;
	КонецЕсли;
		
	Возврат ВРег(ПромСтр);         
	
КонецФункции

Функция НайтиКолПокФОтч(Текст) Экспорт

	Для Сч = 1 По Текст.Количествострок() Цикл

		ТекИнд = Текст.Количествострок() - Сч + 1;
		Если Лев(Текст.ПолучитьСтроку(ТекИнд), 11) = "КолПокФОтч:" Тогда
			Возврат ТекИнд;
		КонецЕсли;

	КонецЦикла;

	Возврат -1;

КонецФункции

Функция ПолучитьКоличествоПоказателей(Текст) Экспорт
    
	КоличествоПоказателей = 0;

	Для НомСтр = 1 По Текст.КоличествоСтрок() Цикл

		ТекСтр = СокрЛ(Текст.ПолучитьСтроку(Текст.КоличествоСтрок() - НомСтр + 1));

		Если Лев(ТекСтр, 11) = "КолПокФОтч:" Тогда
			Прервать;
		КонецЕсли;

		Если СтрДлина(ТекСтр)<14 Тогда
			Продолжить;
		КонецЕсли;

		Если (Сред(ТекСтр, 1, 1) = "П") и (Сред(ТекСтр, 14, 1) = ":") Тогда

			ЭтоПоказатель = Ложь;

			Для НСимв = 2 По 13 Цикл

				ТекСимв = Сред(ТекСтр, НСимв, 1);

				Если (ТекСимв = "0") ИЛИ (ТекСимв = "1") ИЛИ (ТекСимв = "2") ИЛИ (ТекСимв = "3") ИЛИ (ТекСимв = "4")
					ИЛИ (ТекСимв = "5") ИЛИ (ТекСимв = "6") ИЛИ (ТекСимв = "7") ИЛИ (ТекСимв = "8") ИЛИ (ТекСимв = "9") Тогда

					ЭтоПоказатель = Истина;

				Иначе

					ЭтоПоказатель = Ложь;
					Прервать;

				КонецЕсли;

			КонецЦикла;

			Если ЭтоПоказатель Тогда
				КоличествоПоказателей = КоличествоПоказателей + 1;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;
    	
	Возврат Формат(КоличествоПоказателей, "ЧН=; ЧГ=0");

КонецФункции

Процедура СтандартнаяПостобработкаТекстаВыгрузки(Текст) Экспорт
	
	КоличествоСтрок = Текст.КоличествоСтрок();
	Для Инд = 1 По КоличествоСтрок Цикл
		ТекСтр = Текст.ПолучитьСтроку(Инд);
		ВхождениеДвоеточия = СтрНайти(ТекСтр, ":");
		Если ВхождениеДвоеточия <> 0 Тогда
			Текст.ЗаменитьСтроку(Инд, Лев(ТекСтр, ВхождениеДвоеточия) + ВРЕГ(СокрЛП(Сред(ТекСтр, ВхождениеДвоеточия + 1))));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСчетчикВыгруженныхДокументов(Организация, СчДок, ДатаДокумента = Неопределено, НомерКвартала = 0, ТипСчетчика = Неопределено) Экспорт
	
	МенЗап = РегистрыСведений.СчетчикиВыгрузок.СоздатьМенеджерЗаписи();
	МенЗап.Период = НачалоГода(?(ДатаДокумента = Неопределено, ТекущаяДатаСеанса(), ДатаДокумента));
	МенЗап.Организация = Организация;
	МенЗап.Тип = ?(ТипСчетчика = Неопределено, Перечисления.ТипыСчетчиковВыгрузки.СчетчикДокументовВФормате300, ТипСчетчика);
	МенЗап.НомерКвартала = НомерКвартала;
	МенЗап.Значение = СчДок;
	МенЗап.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСчетчикВыгруженныхФайлов(Организация, ТипСчетчика = Неопределено, Знач ДатаОтчета = Неопределено, ИФНС = "") Экспорт
	
	Если ТипСчетчика = "СчетчикФайловАлко" Тогда
		ТипСчетчика = Перечисления.ТипыСчетчиковВыгрузки.СчетчикФайловАлко;
	КонецЕсли;
		
	Если ДатаОтчета = Неопределено Тогда
		ДатаОтчета = ТекущаяДатаСеанса();
	Иначе
		ДатаОтчета = НачалоГода(ДатаОтчета);
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СчетчикиВыгрузок.Значение КАК Значение
	                      |ИЗ
	                      |	РегистрСведений.СчетчикиВыгрузок КАК СчетчикиВыгрузок
	                      |ГДЕ
	                      |	СчетчикиВыгрузок.Тип = &Тип
	                      |	И СчетчикиВыгрузок.Организация = &Организация
	                      |	И СчетчикиВыгрузок.Период = &Период
						  |	И СчетчикиВыгрузок.ИФНС = &ИФНС");
	Запрос.УстановитьПараметр("Тип", ?(ТипСчетчика = Неопределено, Перечисления.ТипыСчетчиковВыгрузки.СчетчикФайлов, ТипСчетчика));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", НачалоГода(ДатаОтчета));
	Запрос.УстановитьПараметр("ИФНС", ?(ТекущаяДатаСеанса() < '20070701000000', "", ИФНС));
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат ?(НЕ ЗначениеЗаполнено(Выборка.Значение), 0, Выборка.Значение) + 1;
		КонецЕсли;
	КонецЕсли;
	Возврат 1;
	
КонецФункции

Функция ОГРНсоответствуетТребованиям(Знач ОГРН) Экспорт
	Попытка
		ОГРНБезВедущихНулей = Формат(ОГРН,"ЧГ=0");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	ОГРН = Строка(ОГРНБезВедущихНулей);
	Если СтрДлина(ОГРН) <> 13 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина; // Проверка временно отключена.
	КонецЕсли;
КонецФункции

Функция СобратьАдрес(Знач СтруктураАдрес) Экспорт

	Возврат ""+ СтруктураАдрес.Страна + "," + СтруктураАдрес.Индекс + ","+ СтруктураАдрес.Регион + ","
	+ СтруктураАдрес.Район  + "," + СтруктураАдрес.Город  + ","+ СтруктураАдрес.НаселенныйПункт + ","
	+ СтруктураАдрес.Улица  + "," + СтруктураАдрес.Дом    + ","+ СтруктураАдрес.Корпус + "," + СтруктураАдрес.Квартира

КонецФункции

Функция ПредставлениеПериодаДокументаВыгрузкаРегламентированныхОтчетов(Док) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Док.ПериодПо) Тогда
		Возврат "";
	КонецЕсли;
	
	ГодДокСтрока = Формат(Год(Док.ПериодПо), "ЧГ=");
	МесяцДок = Месяц(Док.ПериодПо);
	Если МесяцДок = 1 Тогда
		Возврат "По итогам января " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 2 Тогда
		Возврат "По итогам февраля " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 3 Тогда
		Возврат "По итогам I квартала " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 4 Тогда
		Возврат "По итогам апреля " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 5 Тогда
		Возврат "По итогам мая " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 6 Тогда
		Возврат "По итогам II квартала " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 7 Тогда
		Возврат "По итогам июля " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 8 Тогда
		Возврат "По итогам августа " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 9 Тогда
		Возврат "По итогам III квартала " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 10 Тогда
		Возврат "По итогам октября " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 11 Тогда
		Возврат "По итогам ноября " + ГодДокСтрока + "г.";
	ИначеЕсли МесяцДок = 12 Тогда
		Возврат "По итогам " + ГодДокСтрока + "г.";
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьЗапросКРегиструШаблоновПечатиМашиночитаемыхФорм(ИмяФайлаШаблона = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ШаблоныПечатиМашиночитаемыхФорм.ИмяФайлаШаблона,
	                      |	ШаблоныПечатиМашиночитаемыхФорм.Шаблон
	                      |ИЗ
	                      |	РегистрСведений.ШаблоныПечатиМашиночитаемыхФорм КАК ШаблоныПечатиМашиночитаемыхФорм");
	Если ИмяФайлаШаблона <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
						  |ГДЕ
						  |	ШаблоныПечатиМашиночитаемыхФорм.ИмяФайлаШаблона ПОДОБНО &ИмяФайлаШаблона
						  |УПОРЯДОЧИТЬ ПО
						  |	ШаблоныПечатиМашиночитаемыхФорм.ИмяФайлаШаблона УБЫВ";
		Запрос.УстановитьПараметр("ИмяФайлаШаблона", ИмяФайлаШаблона);
	КонецЕсли;
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ДобавитьПрефиксОрганизации(ДокументОбъект, Префикс) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Если НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента)
		ИЛИ НЕ ЗначениеЗаполнено(ДокументОбъект.Организация.Префикс) Тогда
		Префикс = "0";
	Иначе
		Префикс = ДокументОбъект.Организация.Префикс;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
	
	Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
				
		ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
		Если ПорядковыйНомер <> Неопределено Тогда
			МассивРеквизитов.Удалить(ПорядковыйНомер);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиОбласти(СписокВыводимыхНаПечатьОбластей, ТабличноеПоле, ПечатнаяФорма)
	
	// Выполняем цикл до тех пор, пока не закончатся области, выводимые на печать.
	Пока СписокВыводимыхНаПечатьОбластей.Количество() > 0 Цикл
		
		// В том случае, если в имени области не встречается строка "ПустаяСтрока", то
		// выводим область в результирующую таблицу и удаляем из списка.
		Если СтрЧислоВхождений(ВРег(СписокВыводимыхНаПечатьОбластей[0].Представление), ВРег("ПустаяСтрока")) = 0 Тогда
			
			ОбластьВыводимаяНаПечать = ТабличноеПоле.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей[0].Представление);
			СписокВыводимыхНаПечатьОбластей.Удалить(0);
			
			ПечатнаяФорма.Вывести(ОбластьВыводимаяНаПечать);
			Продолжить;
			
		КонецЕсли;
		
		// Получаем области "ПустаяСтрока" и "Ограничители", одновременно удаляя их из списка.
		ОбластьПустаяСтрока = ТабличноеПоле.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей[0].Представление);
		СписокВыводимыхНаПечатьОбластей.Удалить(0);
		ОбластьОграничители = ТабличноеПоле.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей[0].Представление);
		СписокВыводимыхНаПечатьОбластей.Удалить(0);
				
		// Создаем массив выводимых областей.
		ВыводимыеОбласти = Новый Массив();
		
		// Добавляем в массив выводимые области таблицы для того, 
		// чтобы проверить: поместятся ли они на текущий лист.
		ВыводимыеОбласти.Добавить(ОбластьПустаяСтрока);
		ВыводимыеОбласти.Добавить(ОбластьОграничители);
		
		// Проверяем вывод области "Ограничители".
		ОбластьОграничителиУмещаетсяНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ПечатнаяФорма,ОбластьОграничители, Ложь);
		
		Пока ОбластьОграничителиУмещаетсяНаСтраницу Цикл
			
			// Проверяем вывод областей "ПустаяСтрока" и "Ограничители".
			ВыводимыеОбластиУмещаютсяНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ПечатнаяФорма,ВыводимыеОбласти, Ложь);
			
			Если ВыводимыеОбластиУмещаютсяНаСтраницу Тогда
				ПечатнаяФорма.Вывести(ОбластьПустаяСтрока);
			Иначе
				ПечатнаяФорма.Вывести(ОбластьОграничители);
				ПечатнаяФорма.ВывестиГоризонтальныйРазделительСтраниц();
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;		
	
КонецПроцедуры

Функция ВывестиНаПечатьЛистРаздела(ЗаголовокФормы, СтруктураПараметровЛиста, ТабличноеПоле)
	Перем ИмяЛиста;           
	Перем ОриентацияПриПечати;         
	Перем ВидПечати;          
	Перем ИмяОбластиМногострочнойЧасти;
	Перем ИмяРаздела;
	Перем МногострочныеЧасти;
	Перем Верх;
	Перем Низ;
	
	СписокПечатныхФорм = Новый СписокЗначений;
	
	СтруктураПараметровЛиста.Свойство("НаименованиеЛиста",  ИмяЛиста);
	СтруктураПараметровЛиста.Свойство("ОриентацияЛиста",    ОриентацияПриПечати);
	СтруктураПараметровЛиста.Свойство("ВидПечати",          ВидПечати);
	СтруктураПараметровЛиста.Свойство("ИмяРаздела",         ИмяРаздела);
	СтруктураПараметровЛиста.Свойство("МногострочнаяЧасть", ИмяОбластиМногострочнойЧасти);
	СтруктураПараметровЛиста.Свойство("Верх",               Верх);
	СтруктураПараметровЛиста.Свойство("Низ",                Низ);
			
	Если ИмяОбластиМногострочнойЧасти = Неопределено Тогда
		СписокПечатныхФорм.Добавить(ВывестиНаПечатьЛистРазделаБезМногострочныхЧастей(
			ЗаголовокФормы, СтруктураПараметровЛиста, ТабличноеПоле));
		Возврат СписокПечатныхФорм;
	КонецЕсли;

    // Создаем список выводимых на печать областей таблицы.
	СписокВыводимыхНаПечатьОбластей = Новый СписокЗначений();
	
	// Перебираем все области таблицы и добавляем в список 
	// только те области, которые являются секциями таблицы.
	Для Каждого Область Из ТабличноеПоле.Области Цикл
							
		Если НЕ Тип(Область) = Тип("РисунокТабличногоДокумента")
		   И Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда	
			
			Если Область.Верх < Верх ИЛИ Область.Низ > Низ Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрНайти(ВРЕГ(Область.Имя), "МНОГОСТРОЧНАЯЧАСТЬ") <> 0 Тогда
				СписокВыводимыхНаПечатьОбластей.Добавить(ПолучитьНизМногоСтрочнойЧасти(ТабличноеПоле, Область.Имя), Область.Имя);
			Иначе
				СписокВыводимыхНаПечатьОбластей.Добавить(Область.Низ, Область.Имя);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МногострочныеЧасти = Новый Структура;
	Если ТипЗнч(ИмяОбластиМногострочнойЧасти) = Тип("Строка") Тогда
		МногострочныеЧасти.Вставить(ИмяОбластиМногострочнойЧасти, ПолучитьОбластиМногоСтрочнойЧасти(ТабличноеПоле, ИмяОбластиМногострочнойЧасти));
	Иначе
		Для Каждого Эл Из ИмяОбластиМногострочнойЧасти Цикл
			МногострочныеЧасти.Вставить(Эл, ПолучитьОбластиМногоСтрочнойЧасти(ТабличноеПоле, Эл));
		КонецЦикла;
	КонецЕсли;
	
	// Сортируем список в порядке расположения областей в таблице (по верхней координате).
	СписокВыводимыхНаПечатьОбластей.СортироватьПоЗначению();

	Строки = Новый Массив;
	
	ПустойТабличныйДокумент = Новый ТабличныйДокумент;
	ЗаполнитьЗначенияСвойств(ПустойТабличныйДокумент, ТабличноеПоле, "ПолеСлева, ПолеСверху, ПолеСправа, ПолеСнизу");
	
	ПустыеСтрокиМногострочныхЧастей = Новый Массив(МногострочныеЧасти.Количество());
	НомСтр = 0;
	Для Каждого Эл Из МногострочныеЧасти Цикл
		ПустыеСтрокиМногострочныхЧастей[НомСтр] = ПолучитьПустуюСтрокуМногострочнойЧасти(Эл, 0);
		НомСтр = НомСтр + 1;
	КонецЦикла;
	
	НомСтр = 0;
	Для Каждого Эл Из МногострочныеЧасти Цикл
		Если Эл.Значение.Количество() = 0 Тогда
			Эл.Значение.Добавить(ПустыеСтрокиМногострочныхЧастей[НомСтр], "-1");
		КонецЕсли;
		НомСтр = НомСтр + 1;
	КонецЦикла;
	
	КолВоЛистов = 0;
	Пока МаксимальноеКоличествоОбластейМногострочнойЧасти(МногострочныеЧасти) > 0 Цикл
		
		ПечатнаяФорма = Новый ТабличныйДокумент();
		
		ПечатнаяФорма.ОтображатьЗаголовки = Ложь;
		ПечатнаяФорма.ОтображатьСетку     = Ложь;
		ПечатнаяФорма.ЧерноБелыйПросмотр  = Истина;
		ПечатнаяФорма.ЧерноБелаяПечать    = Истина;
		ПечатнаяФорма.Автомасштаб         = Истина;
		ПечатнаяФорма.ОриентацияСтраницы  = ?(ОриентацияПриПечати = "Портрет", ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);
		
		ЗаполнитьЗначенияСвойств(ПечатнаяФорма, ТабличноеПоле, "ПолеСлева, ПолеСверху, ПолеСправа, ПолеСнизу");
		
		НомСтр = 0;
		Для Каждого Эл Из МногострочныеЧасти Цикл
			Если Эл.Значение.Количество() = 0 Тогда
				Эл.Значение.Добавить(ПустыеСтрокиМногострочныхЧастей[НомСтр], "-1");
			КонецЕсли;
			НомСтр = НомСтр + 1;
		КонецЦикла;
		
		Для Сч = 0 По СписокВыводимыхНаПечатьОбластей.Количество() - 1 Цикл
			ОбластьВыводимаяНаПечать = ТабличноеПоле.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление);
			Если СтрНайти(ВРЕГ(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление), "ОГРАНИЧИТЕЛИ") <> 0 Тогда
				ОбластьОграничители = ОбластьВыводимаяНаПечать;
				Продолжить;
			КонецЕсли;
			Если СтрНайти(ВРЕГ(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление), "ПУСТАЯСТРОКА") <> 0 Тогда
				ОбластьПустаяСтрока = ОбластьВыводимаяНаПечать;
				Продолжить;
			КонецЕсли;                                                                                   
			Если МногострочныеЧасти.Свойство(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление) Тогда
				Продолжить;
			КонецЕсли;
			ПечатнаяФорма.Вывести(ОбластьВыводимаяНаПечать);
		КонецЦикла;
		
		Строки.Очистить();
		Инд = 0;
		Для Каждого Эл Из МногострочныеЧасти Цикл
			Попытка
				Строки.Добавить(Эл.Значение.Получить(0).Значение);
			Исключение
				Строки.Добавить(ПустыеСтрокиМногострочныхЧастей[Инд]);
			КонецПопытки;
			Инд = Инд + 1;
		КонецЦикла;
		Строки.Добавить(ОбластьПустаяСтрока);
		Строки.Добавить(ОбластьОграничители);
		
		Ном = 1;
		Пока ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ПечатнаяФорма, Строки, Ложь) Цикл
			Ном = Ном + 1;
			НомерЭлементаТабличнойЧасти = 0;
			Для Каждого Эл Из МногострочныеЧасти Цикл
				Если Эл.Значение.Количество() > 0 Тогда
					ПечатнаяФорма.Вывести(Строки[НомерЭлементаТабличнойЧасти]);				
					НомерЭлементаТабличнойЧасти = НомерЭлементаТабличнойЧасти + 1;
				КонецЕсли;
			КонецЦикла;

			Если МаксимальноеКоличествоОбластейМногострочнойЧасти(МногострочныеЧасти) >= Ном Тогда
				НомерМнЧ = 0;
				Для Каждого Эл Из МногострочныеЧасти Цикл
					Попытка
						Строки[НомерМнЧ] = Эл.Значение.Получить(Ном - 1).Значение;
					Исключение
						Строки[НомерМнЧ] = ПустойТабличныйДокумент;
					КонецПопытки;
					НомерМнЧ = НомерМнЧ + 1;
				КонецЦикла;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
				
		КоличествоВыводимыхСтрок = Ном - 1;
		// Защита против частей разделов, которые не помещаются на лист, если даже
		// выводить по одной строке из каждой многострочной части.
		Если КоличествоВыводимыхСтрок = 0 Тогда
			КоличествоВыводимыхСтрок = 1;
		КонецЕсли;
		
		ИтоговыйТаблДок = Новый ТабличныйДокумент;
		ИтоговыйТаблДок.ОтображатьЗаголовки = Ложь;
		ИтоговыйТаблДок.ОтображатьСетку     = Ложь;
		ИтоговыйТаблДок.ЧерноБелыйПросмотр  = Истина;
		ИтоговыйТаблДок.ЧерноБелаяПечать    = Истина;
		ИтоговыйТаблДок.Автомасштаб         = Истина;
		ИтоговыйТаблДок.ОриентацияСтраницы  = ?(ОриентацияПриПечати = "Портрет", ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);
		ЗаполнитьЗначенияСвойств(ИтоговыйТаблДок, ТабличноеПоле, "ПолеСлева, ПолеСверху, ПолеСправа, ПолеСнизу");

		КолвоЛистов = КолвоЛистов + 1;
		
		НомерМногострочнойЧасти = -1;
		
		Для Сч = 0 По СписокВыводимыхНаПечатьОбластей.Количество() - 1 Цикл
			ОбластьВыводимаяНаПечать = ТабличноеПоле.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление);
			Если СтрНайти(ВРЕГ(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление), "ОГРАНИЧИТЕЛИ") <> 0 
				  ИЛИ СтрНайти(ВРЕГ(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление), "ПУСТАЯСТРОКА") <> 0 Тогда
				Продолжить;
			КонецЕсли;
			Рез = ЭтоОднаИзМногострочныхЧастей(СписокВыводимыхНаПечатьОбластей.Получить(Сч), МногострочныеЧасти, ПолучитьШагСтрокиДляТабличногоПоля(ТабличноеПоле.ПолучитьОбласть(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление)));
			Если Рез <> Ложь ИЛИ СтрНайти(ВРЕГ(СписокВыводимыхНаПечатьОбластей.Получить(Сч).Представление), "МНОГОСТРОЧНАЯЧАСТЬ") <> 0 Тогда
				НомерМногострочнойЧасти = НомерМногострочнойЧасти + 1;
				Если Рез = Ложь Тогда
					НомМнЧ = -1;
					Для Каждого ЭлСтр Из МногострочныеЧасти Цикл
						НомМнЧ = НомМнЧ + 1;
						Если НомМнЧ = НомерМногострочнойЧасти Тогда
							ИтоговыйТаблДок.Вывести(ЭлСтр.Значение.Получить(0).Значение);
							ЭлСтр.Значение.Удалить(0);
							Прервать;
						КонецЕсли;
					КонецЦикла;
				Иначе
					Для Инд = 0 По КоличествоВыводимыхСтрок - 1 Цикл
						Если Рез.Количество() >= Инд + 1 Тогда
							ИтоговыйТаблДок.Вывести(Рез.Получить(Инд).Значение);
						КонецЕсли;
					КонецЦикла;
					Для Инд = 0 По КоличествоВыводимыхСтрок - 1 Цикл
						Если Рез.Количество() > 0 Тогда
							Рез.Удалить(0);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			ИтоговыйТаблДок.Вывести(ОбластьВыводимаяНаПечать);				
		КонецЦикла;
		
		ВыводимыеОбласти = Новый Массив;
		ВыводимыеОбласти.Добавить(ОбластьОграничители);
		
		// Проверяем вывод области "Ограничители".
		ОбластьОграничителиУмещаетсяНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ИтоговыйТаблДок, ВыводимыеОбласти, Ложь);
		
		// Поиск "Правого присоединения" - секции с ИНН, КПП, номером страницы, находящейся справа.
		ТаблПоле = ТабличноеПоле.ПолучитьОбласть(Верх, , Низ, );
		ПравоеПрисоединение = Неопределено;
		Для НомерПравогоПрисоединения = 0 По 10 Цикл
			ПравоеПрисоединение = ТаблПоле.Области.Найти("ПравоеПрисоединение" + Формат(НомерПравогоПрисоединения, ""));
			Если ПравоеПрисоединение <> Неопределено Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОбластьОграничителиУмещаетсяНаСтраницу Тогда
			
			ВыводимыеОбласти.Добавить(ОбластьПустаяСтрока);
			
			Пока ОбластьОграничителиУмещаетсяНаСтраницу Цикл
				
				// Проверяем вывод областей "ПустаяСтрока" и "Ограничители".
				ВыводимыеОбластиУмещаютсяНаСтраницу = ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ИтоговыйТаблДок, ВыводимыеОбласти);
				
				Если ВыводимыеОбластиУмещаютсяНаСтраницу Тогда
					ИтоговыйТаблДок.Вывести(ОбластьПустаяСтрока);
				Иначе
					ИтоговыйТаблДок.Вывести(ОбластьОграничители);
					Если ПравоеПрисоединение <> Неопределено Тогда
						ИтоговыйТаблДок.ВставитьОбласть(ПравоеПрисоединение, ИтоговыйТаблДок.Область(ПравоеПрисоединение.Верх, ПравоеПрисоединение.Лево, ПравоеПрисоединение.Низ, ПравоеПрисоединение.Право));
					КонецЕсли;
					ИтоговыйТаблДок.ВывестиГоризонтальныйРазделительСтраниц();
					
					Если МаксимальноеКоличествоОбластейМногострочнойЧасти(МногострочныеЧасти) > 0 Тогда
						ОбнулитьИтоговыеПоказателиНаТекущемЛисте(ИтоговыйТаблДок);
					КонецЕсли;
					Если КолВоЛистов <> 1 Тогда
						ОбнулитьФиксированныеЧастиНаЛистах(ИтоговыйТаблДок);
					КонецЕсли;
					
					Если ВидПечати = "ПоказатьБланк" Тогда
						ИтоговыйТаблДок.Показать(СокрП(ЗаголовокФормы) + " (" + СокрП(ИмяЛиста) + ")");
					ИначеЕсли ВидПечати = "ПечататьСразу" Тогда
						ИтоговыйТаблДок.Напечатать();
					Иначе
						СписокПечатныхФорм.Добавить(ИтоговыйТаблДок);
					КонецЕсли;
					
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ИтоговыйТаблДок.Вывести(ОбластьОграничители);
			Если ПравоеПрисоединение <> Неопределено Тогда
				ИтоговыйТаблДок.ВставитьОбласть(ПравоеПрисоединение, ИтоговыйТаблДок.Область(ПравоеПрисоединение.Верх, ПравоеПрисоединение.Лево, ПравоеПрисоединение.Низ, ПравоеПрисоединение.Право));
			КонецЕсли;
			ИтоговыйТаблДок.ВывестиГоризонтальныйРазделительСтраниц();
			
			Если МаксимальноеКоличествоОбластейМногострочнойЧасти(МногострочныеЧасти) > 0 Тогда
				ОбнулитьИтоговыеПоказателиНаТекущемЛисте(ИтоговыйТаблДок);
			КонецЕсли;

			Если КолВоЛистов <> 1 Тогда
				ОбнулитьФиксированныеЧастиНаЛистах(ИтоговыйТаблДок);
			КонецЕсли;

			Если ВидПечати = "ПоказатьБланк" Тогда
				ИтоговыйТаблДок.Показать(СокрП(ЗаголовокФормы) + " (" + СокрП(ИмяЛиста) + ")");
			ИначеЕсли ВидПечати = "ПечататьСразу" Тогда
				ИтоговыйТаблДок.Напечатать();
			Иначе
				СписокПечатныхФорм.Добавить(ИтоговыйТаблДок);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
		
	Возврат СписокПечатныхФорм;
	
КонецФункции

Функция ВывестиНаПечатьЛистРазделаБезМногострочныхЧастей(ЗаголовокФормы, СтруктураПараметровЛиста, ТабличноеПоле)
	Перем ИмяЛиста;           
	Перем ОриентацияПриПечати;         
	Перем ВидПечати;          
	Перем Верх;
	Перем Низ;
	Перем Секции;

	СтруктураПараметровЛиста.Свойство("НаименованиеЛиста", ИмяЛиста);
	СтруктураПараметровЛиста.Свойство("ОриентацияЛиста",   ОриентацияПриПечати);
	СтруктураПараметровЛиста.Свойство("ВидПечати",         ВидПечати);
	СтруктураПараметровЛиста.Свойство("Верх",              Верх);
	СтруктураПараметровЛиста.Свойство("Низ",               Низ);
	СтруктураПараметровЛиста.Свойство("Секции",            Секции);

	ПечатнаяФорма = Новый ТабличныйДокумент();
	
	ПечатнаяФорма.ОтображатьЗаголовки = Ложь;
	ПечатнаяФорма.ОтображатьСетку     = Ложь;
	ПечатнаяФорма.ЧерноБелыйПросмотр  = Истина;
	ПечатнаяФорма.ЧерноБелаяПечать    = Истина;
	ПечатнаяФорма.Автомасштаб         = Истина;
	ПечатнаяФорма.ОриентацияСтраницы  = ?(ОриентацияПриПечати = "Портрет", ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);
		
	ЗаполнитьЗначенияСвойств(ПечатнаяФорма, ТабличноеПоле, "ПолеСлева, ПолеСверху, ПолеСправа, ПолеСнизу");

	// Создаем список выводимых на печать областей таблицы.
	СписокВыводимыхНаПечатьОбластей = Новый СписокЗначений();
	
	Если Секции = Неопределено Тогда
		
		// Перебираем все области таблицы и добавляем в список 
		// только те области, которые являются секциями таблицы.
		Для каждого Область Из ТабличноеПоле.Области Цикл
			
			Если НЕ Тип(Область) = Тип("РисунокТабличногоДокумента")
				И Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
				// Добавляем в список имя области и ее верхнюю координату.
				Если Область.Верх < Верх ИЛИ Область.Низ > Низ Тогда
					Продолжить;
				КонецЕсли;
				
				СписокВыводимыхНаПечатьОбластей.Добавить(Область.Верх, Область.Имя);
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Секция Из Секции Цикл
			
			ОбластьСекции = ТабличноеПоле.Области.Найти(Секция);
			
			Если ОбластьСекции = Неопределено
			 ИЛИ ОбластьСекции.Верх < Верх
			 ИЛИ ОбластьСекции.Низ > Низ Тогда
				
				Продолжить
				
			КонецЕсли;
						
			СписокВыводимыхНаПечатьОбластей.Добавить(ОбластьСекции.Верх, ОбластьСекции.Имя);
			
		КонецЦикла
		
	КонецЕсли;
	
	// Сортируем список в порядке расположения областей в таблице (по верхней координате).
	СписокВыводимыхНаПечатьОбластей.СортироватьПоЗначению();

	ВывестиОбласти(СписокВыводимыхНаПечатьОбластей, ТабличноеПоле, ПечатнаяФорма);
		
	Если ВидПечати = "ПоказатьБланк" Тогда
		ПечатнаяФорма.Показать(СокрП(ЗаголовокФормы) + " (" + СокрП(ИмяЛиста) + ")");
	ИначеЕсли ВидПечати = "ПечататьСразу" Тогда
		ПечатнаяФорма.Напечатать();
	КонецЕсли;
	
	Возврат ПечатнаяФорма;
	
КонецФункции

Функция ПолучитьНизМногострочнойЧасти(ТаблПоле, ИмяОбласти)
	ГруппыСтрок = ПолучитьКартуИменованныхГруппСтрок(ТаблПоле);
	Низ = ТаблПоле.Области.Найти(ИмяОбласти).Низ + 1;
	Пока Не ЕстьСоответствующаяОбластьГруппСтрок(Низ, ГруппыСтрок) Цикл
		Низ = Низ + 1;
	КонецЦикла;
	Возврат Низ - 1;
КонецФункции

Функция ПолучитьКартуИменованныхГруппСтрок(ТаблПоле)
	
	Карта = Новый ТаблицаЗначений;
	Карта.Колонки.Добавить("Верх");
	Карта.Колонки.Добавить("Низ");
	
	Для Каждого Обл Из ТаблПоле.Области Цикл
		Если НЕ Тип(Обл) = Тип("РисунокТабличногоДокумента") И Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки Тогда
			НовСтр = Карта.Добавить();
			НовСтр.Верх = Обл.Верх;
			НовСтр.Низ = Обл.Низ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Карта;
	
КонецФункции

Функция ЕстьСоответствующаяОбластьГруппСтрок(СледСтрока, ГруппыСтрок)
	Для Каждого ГруппаСтрок Из ГруппыСтрок Цикл
		Если ГруппаСтрок.Верх <= СледСтрока И ГруппаСтрок.Низ >= СледСтрока Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ПолучитьОбластиМногострочнойЧасти(ТаблПоле, ИмяОбласти)
	
	ОбластиМногострочнойЧасти = Новый СписокЗначений;
	Если ИмяОбласти = Неопределено Тогда
		Возврат ОбластиМногострочнойЧасти;
	КонецЕсли;
	ГруппыСтрок = ПолучитьКартуИменованныхГруппСтрок(ТаблПоле);
	Обл = ТаблПоле.ПолучитьОбласть(ИмяОбласти);
	
	Шаг = ПолучитьШагСтрокиДляТабличногоПоля(Обл);
	
	Для Сч = 1 По Обл.ВысотаТаблицы / Шаг Цикл
		ОблВрем = Обл.ПолучитьОбласть((Сч - 1) * Шаг + 1, 0, Сч * Шаг, 0);
		ОбластиМногострочнойЧасти.Добавить(ОблВрем, ТаблПоле.Области.Найти(ИмяОбласти).Верх + (Сч - 1) * Шаг);
	КонецЦикла;
	СледСтрока = ТаблПоле.Области.Найти(ИмяОбласти).Низ + 1;
	Пока Не ЕстьСоответствующаяОбластьГруппСтрок(СледСтрока, ГруппыСтрок) Цикл
		ОблВрем = ТаблПоле.ПолучитьОбласть(СледСтрока,0,СледСтрока + Шаг - 1,0);
		ОбластиМногострочнойЧасти.Добавить(ОблВрем, СледСтрока);
		СледСтрока = СледСтрока + Шаг;
	КонецЦикла;
	Возврат ОбластиМногострочнойЧасти;
	
КонецФункции

Функция ПолучитьШагСтрокиДляТабличногоПоля(ТабличноеПоле)
	
	Для Инд = 0 По 9 Цикл
		ОблОпределениеВысоты = ТабличноеПоле.Области.Найти("ОпределениеВысотыСтрокиМногострочнойЧасти" + Формат(Инд, ""));
		Если ОблОпределениеВысоты <> Неопределено Тогда
			Возврат ТабличноеПоле.ПолучитьОбласть("ОпределениеВысотыСтрокиМногострочнойЧасти" + Формат(Инд, "")).ВысотаТаблицы;
		КонецЕсли;
	КонецЦикла;
	Возврат 1;
	
КонецФункции

Функция ПолучитьПустуюСтрокуМногострочнойЧасти(МногострочныеЧасти, НомСтр)
	ПерваяСтрока = МногострочныеЧасти.Значение.Получить(НомСтр).Значение;
	ИтоговыйТабличныйДокумент = Новый ТабличныйДокумент;
	ИтоговыйТабличныйДокумент.Вывести(ПерваяСтрока);
	Для Каждого Область Из ИтоговыйТабличныйДокумент.Области Цикл
		Если (Тип(Область) = Тип("РисунокТабличногоДокумента") ИЛИ Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник) И Область.СодержитЗначение Тогда //И НЕ Область.Защита Тогда
			Область.Значение = Неопределено;
		КонецЕсли;
	КонецЦикла;
	Возврат ИтоговыйТабличныйДокумент;
КонецФункции

Функция МаксимальноеКоличествоОбластейМногострочнойЧасти(МногострочныеЧасти)
	Максимум = 0;
	Для Каждого Эл Из МногострочныеЧасти Цикл
		Максимум = Макс(Максимум, Эл.Значение.Количество());
	КонецЦикла;
	Возврат Максимум;
КонецФункции

Функция ЭтоОднаИзМногострочныхЧастей(ЭлСпКоорд, МногострочныеЧасти, ШагСтроки = 1)
	Коорд = ЭлСпКоорд.Значение;
	Для Каждого Эл Из МногострочныеЧасти Цикл
		Для Каждого ЭлСп Из Эл.Значение Цикл
			Если Число(ЭлСп.Представление) + ШагСтроки - 1 = Коорд Тогда
				Возврат Эл.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Процедура ОбнулитьИтоговыеПоказателиНаТекущемЛисте(ТаблДок)
	
	Для НомерИтоговыхПоказателей = 0 По 10 Цикл
		ОбластьИтоговыеПоказатели = ТаблДок.Области.Найти("ИтоговыеПоказатели" + Формат(НомерИтоговыхПоказателей, ""));
		Если ОбластьИтоговыеПоказатели <> Неопределено Тогда
			Для Стр = ОбластьИтоговыеПоказатели.Верх По ОбластьИтоговыеПоказатели.Низ Цикл
				Для Кол = ОбластьИтоговыеПоказатели.Лево По ОбластьИтоговыеПоказатели.Право Цикл
					ТекОбл = ТаблДок.Область(Стр, Кол, Стр, Кол);
					Если (Тип(ТекОбл) = Тип("РисунокТабличногоДокумента") ИЛИ ТекОбл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник) И ТекОбл.СодержитЗначение = Истина Тогда
						ТекОбл.Значение = Неопределено;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбнулитьФиксированныеЧастиНаЛистах(ТаблДок)
	
	Для НомерИтоговыхПоказателей = 0 По 10 Цикл
		ОбластьИтоговыеПоказатели = ТаблДок.Области.Найти("ФиксируетсяНаПервомЛисте" + Формат(НомерИтоговыхПоказателей, ""));
		Если ОбластьИтоговыеПоказатели <> Неопределено Тогда
			Для Стр = ОбластьИтоговыеПоказатели.Верх По ОбластьИтоговыеПоказатели.Низ Цикл
				Для Кол = ОбластьИтоговыеПоказатели.Лево По ОбластьИтоговыеПоказатели.Право Цикл
					ТекОбл = ТаблДок.Область(Стр, Кол, Стр, Кол);
					Если (Тип(ТекОбл) = Тип("РисунокТабличногоДокумента") ИЛИ ТекОбл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник) И ТекОбл.СодержитЗначение = Истина Тогда
						ТекОбл.Значение = Неопределено;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ВывестиНаПечатьЛистОбщая(ЗаголовокФормы,
								   СтруктураПараметровЛиста,
								   ТабличноеПоле,
								   СписокПечатаемыхЛистов) Экспорт
	
	Перем ИмяЛиста;
	Перем ОриентацияПриПечати;
	Перем ВидПечати;
	Перем Секции;
	Перем НомерСтраницы;
		
	СтруктураПараметровЛиста.Свойство("НаименованиеЛиста", ИмяЛиста);
	СтруктураПараметровЛиста.Свойство("ОриентацияЛиста",   ОриентацияПриПечати);
	СтруктураПараметровЛиста.Свойство("ВидПечати",         ВидПечати);
		
	СтруктураПараметровЛиста.Вставить("ВидПечати", "Пакетная печать");		

	СтруктураПараметровЛиста.Вставить("ИмяРаздела", ИмяЛиста);	
		
	КартаСтраницРаздела = ПолучитьКартуЛистовРаздела(ТабличноеПоле);
	
	НомЛиста = 0;
	
	Для Каждого СтраницаРаздела Из КартаСтраницРаздела Цикл
		
		НомЛиста = НомЛиста + 1;
		
		СтруктураПараметровЛиста.Вставить("Верх", СтраницаРаздела.Верх);
		СтруктураПараметровЛиста.Вставить("Низ", СтраницаРаздела.Низ);
		
		МассивМногострочныхЧастей = Неопределено;
		
		Если СтруктураПараметровЛиста.Свойство("Секции", Секции) Тогда
			
			МассивМногострочныхЧастей = Новый Массив;
			
			Для Каждого Секция Из Секции Цикл
				
				ОбластьСекции = ТабличноеПоле.Области.Найти(Секция);
				
				Если ОбластьСекции = Неопределено
					ИЛИ ОбластьСекции.Верх < СтраницаРаздела.Верх
					ИЛИ ОбластьСекции.Низ > СтраницаРаздела.Низ
					ИЛИ СтрНайти(ВРег(ОбластьСекции.Имя), "МНОГОСТРОЧНАЯЧАСТЬ") = 0 Тогда
					
					Продолжить
					
				КонецЕсли;
				
				МассивМногострочныхЧастей.Добавить(ОбластьСекции.Имя);
				
			КонецЦикла;
			
			Если МассивМногострочныхЧастей.Количество() = 0 Тогда
				
				СтруктураПараметровЛиста.Вставить("МногострочнаяЧасть", Неопределено);
				
			Иначе
				
				СтруктураПараметровЛиста.Вставить("МногострочнаяЧасть", МассивМногострочныхЧастей);
				
			КонецЕсли;
			
		Иначе	
			
			СтруктураПараметровЛиста.Вставить("МногострочнаяЧасть",
				ПолучитьКартуМногострочныхСекцийЛиста(ТабличноеПоле, СтраницаРаздела.Верх, СтраницаРаздела.Низ));
				
		КонецЕсли;		
				
		ПечатныеЛисты = ВывестиНаПечатьЛистРаздела(ЗаголовокФормы, СтруктураПараметровЛиста, ТабличноеПоле);
				
		Для Каждого ПечатныйЛист Из ПечатныеЛисты Цикл
			
			Если СписокПечатаемыхЛистов.Количество() > 0
			   И ВРег(СокрЛП(СписокПечатаемыхЛистов[0].Представление))
			   = ВРег(СокрЛП("СсылкаНаРегламентированныйОтчет")) Тогда
			   
			   СтруктураПараметровЛиста.Свойство("НомерСтраницы", НомерСтраницы);
			   			   			   
			   УникальныйИдентификатор = Новый УникальныйИдентификатор;
			   
			   НаборЗаписей = РегистрыСведений.ПечатныеБланкиРегламентированныхОтчетов.СоздатьНаборЗаписей();
			   			   			   
			   НаборЗаписей.Отбор.РегламентированныйОтчет.Установить(СписокПечатаемыхЛистов[0].Значение);
			   НаборЗаписей.Отбор.УникальныйИдентификатор.Установить(УникальныйИдентификатор);
			   
			   ЗаписьРегистраСведений = НаборЗаписей.Добавить();
			   
			   ЗаписьРегистраСведений.РегламентированныйОтчет = СписокПечатаемыхЛистов[0].Значение;
			   ЗаписьРегистраСведений.УникальныйИдентификатор = УникальныйИдентификатор;
			   			    			
			   ЗаписьРегистраСведений.ПечатныйБланк = Новый ХранилищеЗначения(ПечатныйЛист.Значение);
			   ЗаписьРегистраСведений.ИмяСтраницы = ИмяЛиста + ". Стр. " +
			   		(НомерСтраницы - 1 - (КартаСтраницРаздела.Количество() - НомЛиста));
			   ЗаписьРегистраСведений.НомерСтраницы =
			   		НомерСтраницы - 1 - (КартаСтраницРаздела.Количество() - НомЛиста);
			   
			   ЗаписьРегистраСведений.ДатаЗаписи = ТекущаяДатаСеанса();
			   			   
			   НаборЗаписей.Записать();
			   			   				   
			   СписокПечатаемыхЛистов.Добавить(УникальныйИдентификатор);
			
		   Иначе
			   
			   СписокПечатаемыхЛистов.Добавить(ПечатныйЛист.Значение, ИмяЛиста);
			
		   КонецЕсли
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьКартуЛистовРаздела(ТаблПоле)
	
	Карта = Новый ТаблицаЗначений;
	Карта.Колонки.Добавить("Верх");
	Карта.Колонки.Добавить("Низ");
	КолСтрок = ТаблПоле.ВысотаТаблицы;
	НачСтрока = 1;
	Для Сч = 1 По КолСтрок Цикл
		Если ТаблПоле.Область(Сч, 0, Сч, 0).КонецСтраницы Тогда
			НовСтр = Карта.Добавить();
			НовСтр.Верх = НачСтрока;
			НовСтр.Низ = Сч;
			НачСтрока = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	Если (Карта.Количество() = 0) ИЛИ (Карта.Получить(Карта.Количество() - 1).Низ <> КолСтрок) Тогда
		НовСтр = Карта.Добавить();
		НовСтр.Верх = ?(Карта.Количество() = 1, 1, Карта.Получить(Карта.Количество() - 2).Низ + 1);
		НовСтр.Низ = КолСтрок;
	КонецЕсли;
	Возврат Карта;
	
КонецФункции

Функция	ПолучитьКартуМногострочныхСекцийЛиста(ТаблДок, Верх, Низ)
	МассивМногострочныхЧастей = Новый Массив;
	Для Каждого Обл Из ТаблДок.Области Цикл
		Если НЕ Тип(Обл) = Тип("РисунокТабличногоДокумента") И Обл.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Строки И Обл.Верх >= Верх И Обл.Низ <= Низ И СтрНайти(ВРЕГ(Обл.Имя), "МНОГОСТРОЧНАЯЧАСТЬ") <> 0 Тогда
			МассивМногострочныхЧастей.Добавить(Обл.Имя);
		КонецЕсли;
	КонецЦикла;
	Если МассивМногострочныхЧастей.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивМногострочныхЧастей;
	КонецЕсли;
КонецФункции

Функция ПечататьРаздел(Форма, СтрокаРаздела, ЧтоИскать = Неопределено) Экспорт
	
	Если ЧтоИскать <> Неопределено Тогда
		Возврат 1;
	КонецЕсли;
	
	// Если в настройках взведен флаг печати, то добавляем раздел в список печатаемых и выходим.
	Если СтрокаРаздела.ВыводНаПечать <> 0 Тогда
		Форма.СтруктураРеквизитовФормы.мПечатаемыеРазделы.Добавить(СтрокаРаздела.ИмяСтраницы);
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЭтоКодПоказателяП(КодПок)
	
	Если СтрДлина(КодПок) < 13 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Пок = СокрЛП(КодПок);
	
	Если Сред(Пок, 1, 1) = "П" Тогда
		
		Для Сч = 2 По 13 Цикл
			
			КодСимв = КодСимвола(Пок, Сч);
			
			Если НЕ ((КодСимв >= КодСимвола("0")) И (КодСимв <= КодСимвола("9"))) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Процедура ВывестиПоказатель(Текст, ЗначениеЯчейки, ИмяЯчейки, ПризнакФормата, ФорматВыгрузки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначениеЯчейки) И ПризнакФормата <> "Д" Тогда
		Текст.ДобавитьСтроку(ИмяЯчейки + ":")
	Иначе
		Если ПризнакФормата = "Е" Тогда
			ТекстЯчейкиКакЧисло = Число(СокрЛ(ЗначениеЯчейки));
			Если ТекстЯчейкиКакЧисло = 0 Тогда
				Текст.ДобавитьСтроку(ИмяЯчейки + ":")
			Иначе
				Текст.ДобавитьСтроку(ИмяЯчейки + ":" + СокрЛ(Формат(ЗначениеЯчейки,ФорматВыгрузки)));
			КонецЕсли;
		ИначеЕсли ПризнакФормата = "Д" Тогда 
			Если НЕ ЗначениеЗаполнено(Дата(ЗначениеЯчейки)) = 1 Тогда
				Текст.ДобавитьСтроку(ИмяЯчейки + ":");
			Иначе
				Текст.ДобавитьСтроку(ИмяЯчейки + ":" + СокрЛ(Формат(ЗначениеЯчейки,"ДФ=dd.MM.yyyy; ДЛФ=D")));
			КонецЕсли;	
		Иначе
			Если ТипЗнч(ЗначениеЯчейки) = Тип("Число") Тогда
				Знч = Формат(ЗначениеЯчейки, "ЧРД=.; ЧГ=0");
			Иначе
				Знч = ЗначениеЯчейки;
			КонецЕсли;
			Если ЗначениеЯчейки = "0" Тогда
				Текст.ДобавитьСтроку(ИмяЯчейки + ":")
			Иначе	
				Текст.ДобавитьСтроку(ИмяЯчейки + ":" + ВРЕГ(СокрЛП(Знч)));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция СтрокаПоКодуПоказателя(КодПоказателя)
	Возврат Сред(КодПоказателя, 9, 3);
КонецФункции

Функция ГрафаПоКодуПоказателя(КодПоказателя)
	КодГрафы = Строка(Число(Сред(КодПоказателя, 12, 2)));
	Возврат ?(КодГрафы = "0", "", КодГрафы);
КонецФункции

Процедура ПриЗакрытииРегламентированногоОтчета(Форма) Экспорт
		
	Если Форма.СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено И Форма.СтруктураРеквизитовФормы.мСохраненныйДок <> РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Форма.СтруктураРеквизитовФормы.мСохраненныйДок)) И Форма.СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект().Заблокирован() Тогда
		Форма.СтруктураРеквизитовФормы.мСохраненныйДок.ПолучитьОбъект().Разблокировать();
	КонецЕсли;
	
	Если Форма.СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено
	   И Форма.СтруктураРеквизитовФормы.мСохраненныйДок <> РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(ТипЗнч(Форма.СтруктураРеквизитовФормы.мСохраненныйДок)) Тогда
	
		РазблокироватьДанныеДляРедактирования(Форма.СтруктураРеквизитовФормы.мСохраненныйДок, Форма.УникальныйИдентификатор);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьРегионы(Регионы) Экспорт
	
	Регионы.Очистить();
	
	МакетРегионы = Обработки.ОбщиеОбъектыРеглОтчетности.ПолучитьМакет("Регионы");
	
	Для НомерСтроки = 1 По МакетРегионы.ВысотаТаблицы Цикл
		
		НовСтр = Регионы.Добавить();
		НовСтр.Наим = СокрЛП(МакетРегионы.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		НовСтр.Код = СокрЛП(МакетРегионы.Область(НомерСтроки, 2, НомерСтроки, 2).Текст);
		
	КонецЦикла;
		
КонецПроцедуры

Функция ПолучитьИмяИАдресноеСокращение(Знач СтрокаЭлемента, АдресноеСокращение) Экспорт

	Буфер = СокрП(СтрокаЭлемента);
	ПозицияПослПробела = СтрНайти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		Возврат СтрокаЭлемента;
	КонецЕсли;
	
	Пока  СтрЧислоВхождений(Буфер, " ") > 1 Цикл
		Буфер = Лев(Буфер, ПозицияПослПробела - 1) + "_" + Сред(Буфер, ПозицияПослПробела + 1);
		ПозицияПослПробела = СтрНайти(Буфер, " ");
	КонецЦикла;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АдресныеОбъекты.Сокращение
	|ИЗ
	|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
	|ГДЕ
	|	АдресныеОбъекты.Сокращение = &Сокращение";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Сокращение", Сред(СтрокаЭлемента, ПозицияПослПробела + 1));
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат СтрокаЭлемента;
	КонецЕсли;
	
	Если ПустаяСтрока(СокрЛП(Лев(СтрокаЭлемента, ПозицияПослПробела - 1))) Тогда
		Возврат СтрокаЭлемента;
	Иначе
		АдресноеСокращение = Сред(СтрокаЭлемента, ПозицияПослПробела + 1);
		Возврат Лев(СтрокаЭлемента, ПозицияПослПробела - 1);
	КонецЕсли;
	
КонецФункции

Процедура ПослеВставкиДополнительнойСтраницыНаСервере(Форма, ИмяВставляемойСтраницы, ПерейтиНаВставленныйЛист = Истина) Экспорт
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеВставкиДополнительнойСтраницы(Форма, ИмяВставляемойСтраницы, ПерейтиНаВставленныйЛист);

КонецПроцедуры

Процедура УдалитьДополнительнуюСтраницуНаСервере(Форма, ИмяТекущейСтраницыПанели = Неопределено) Экспорт
	Перем ТаблицаСтраницРаздела;
        	
	Если Не Форма.мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;

	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	// Если одна страница в разделе, то ее удалять нельзя.
	Если ТаблицаСтраницРаздела.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;

	ИмяТекТабличногоПоля     = "ТабличныйДокумент";
	ТекТабличноеПоле         = Форма[ИмяТекТабличногоПоля];

	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));

	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		
		ИндексТекСтрока = ТаблицаСтраницРаздела.Индекс(СтрТаблицаСтраницы);
		ТаблицаСтраницРаздела.Удалить(СтрТаблицаСтраницы);
		
		// Очищаем редактируемые ячейки удаляемой страницы.
		Форма.ОчиститьТабличноеПолеНаСервере(ИмяТекущейСтраницыПанели);
				
		КолвоДопСтраниц = ТаблицаСтраницРаздела.Количество();

		Если КолвоДопСтраниц > 0 Тогда
			СтрТаблицаСтраницыЗамена = ТаблицаСтраницРаздела[Мин(ИндексТекСтрока, КолвоДопСтраниц - 1)];

			// Для страниц многостраничного раздела, содержащих многострочную часть,
			// восстанавливаем структуру дополнительных строк.
			//
			// Предварительно проверим, содержит ли страница многострочные части.

			КолвоМногострочныхБлоков = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "МногострочностьВРазделе").Количество();
			
			СохранятьМногострКакТЗ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "СохранятьМногострКакТЗ");

			Если КолвоМногострочныхБлоков > 0 Тогда
				
				ДанныеДопСтрокРаздела = СтрТаблицаСтраницыЗамена.ДанныеДопСтрок;
				
				Если (ТипЗнч(ДанныеДопСтрокРаздела) = Тип("СписокЗначений"))
					И (ДанныеДопСтрокРаздела.Количество() > 0)
					И (ДанныеДопСтрокРаздела[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела") Тогда
					
					ДанныеДопСтрокРаздела = ДанныеДопСтрокРаздела[0].Значение;
					
				Иначе
					
					ДанныеДопСтрокРаздела = Неопределено;
					
				КонецЕсли;
				
			Иначе
				ДанныеДопСтрокРаздела = Неопределено;
			КонецЕсли;

			Если ДанныеДопСтрокРаздела <> Неопределено Тогда

				Если (КолвоМногострочныхБлоков > 0) И (НЕ СохранятьМногострКакТЗ) Тогда

					Для Каждого ГруппаСтрок Из ДанныеДопСтрокРаздела Цикл
						ИмяГруппыДопСтрок = ГруппаСтрок.Ключ;
						ДанныеГруппыСтрок = ГруппаСтрок.Значение;
						
						ПромТаблицаГруппыСтрок = Форма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
						
						КопироватьДанныеФормы(ДанныеГруппыСтрок, ПромТаблицаГруппыСтрок);

						// Заменяем таблицу значений с данными текущей страницы.
						КопироватьДанныеФормы(ПромТаблицаГруппыСтрок, Форма[ИмяГруппыДопСтрок]);
						
						// Выводим в табличный документ строки многострочной группы.
						Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаГруппыСтрок);
						
					КонецЦикла;

				ИначеЕсли (КолвоМногострочныхБлоков > 0) И (СохранятьМногострКакТЗ) Тогда

					ИмяГруппыДопСтрок = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
					
					ПромТаблицаДопСтрокРаздела = Форма["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
						
					КопироватьДанныеФормы(ДанныеДопСтрокРаздела, ПромТаблицаДопСтрокРаздела);
					
					// Заменяем таблицу значений с данными текущей страницы.
					КопироватьДанныеФормы(ПромТаблицаДопСтрокРаздела, Форма[ИмяГруппыДопСтрок]);
					
					// Выводим строки многострочной группы замещающей страницы.
					Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаДопСтрокРаздела);

				КонецЕсли;
				
			КонецЕсли;

			ПредставлениеДанных = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "ПредставлениеДанных");
			// Восстановим данные замещаемой страницы.
			СтруктураДанныхСтраницыЗамена = СтрТаблицаСтраницыЗамена.Данные[0].Значение;

			Для Каждого Элемент Из СтруктураДанныхСтраницыЗамена Цикл
				ИмяПоказателя      = Элемент.Ключ;
				ЗначениеПоказателя = Элемент.Значение;

				Если ПредставлениеДанных Тогда
					
					Если Форма.ОбновитьПеременныеМодуляНаСервере(ИмяПоказателя, ЗначениеПоказателя) Тогда
						Продолжить;
					КонецЕсли;

				КонецЕсли;

				Попытка
					ТекТабличноеПоле.Области[ИмяПоказателя].Значение = ЗначениеПоказателя;
				Исключение
				КонецПопытки;

			КонецЦикла;
			
			СтрТаблицаСтраницыЗамена.АктивнаяСтраница = Истина;
			
		КонецЕсли;
        				
		Форма.РасчетНаСервере(ИмяТекущейСтраницыПанели);
		
		Форма.Модифицированность = Истина;

	КонецЕсли;
   	
КонецПроцедуры

Процедура ВставитьДополнительнуюСтраницуНаСервере(Форма, ИмяТекущейСтраницыПанели = Неопределено, СохранятьДанныеТекущейСтраницы = Истина) Экспорт

	Перем ТаблицаСтраницРаздела;
   	
	Если Не Форма.мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	Иначе
		МаксКолвоЭкз=РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "МаксКолвоЭкз", 0);
		Если МаксКолвоЭкз<>0 И Форма[Форма.мСтруктураМногостраничныхРазделов[ИмяТекущейСтраницыПанели]].Количество() >= МаксКолвоЭкз Тогда
			
			ЗаголовокСтраницы = ИмяТекущейСтраницыПанели;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В разделе ""%1"" максимальное количество экземпляров страниц равно %2.'"), ЗаголовокСтраницы, МаксКолвоЭкз);
			
			Сообщение.Сообщить();
                
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если СохранятьДанныеТекущейСтраницы Тогда
		// Сначала сохраним данные текущей страницы.
		// Если на листе есть многострочность, то удалим ее.
		РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(Форма, ИмяТекущейСтраницыПанели, Истина);
	КонецЕсли;
	
	ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
	
	Если ТаблицаСтраницРаздела.Количество() = 0 Тогда
		СтрТаблицаСтраницы = ТаблицаСтраницРаздела.Добавить();
		СтрТаблицаСтраницы.АктивнаяСтраница = Истина;
	КонецЕсли;

	// Найдем активную страницу.
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура ("АктивнаяСтраница", Истина));

	Если СтрТаблицаСтраницы.Количество() > 0 Тогда

		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		
		// Убираем активность у текущей страницы.
		СтрТаблицаСтраницы.АктивнаяСтраница = Ложь;
        						                                   
	КонецЕсли;
	
	// Добавляем новую страницу.
	СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
	
	// Присваиваем представление по умолчанию.
	СтрНоваяСтраница.Представление      = "Новая страница";
	СтрНоваяСтраница.АвтоматическоеПредставление      = Истина;
	
	// Ставим признак активной страницы.
	СтрНоваяСтраница.АктивнаяСтраница   = Истина;
	
	КолМногострочныхЧастей = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "МногострочностьВРазделе").Количество();
	
	Если КолМногострочныхЧастей = 0 Тогда
		Форма.ОчиститьТабличноеПолеНаСервере(ИмяТекущейСтраницыПанели);
	КонецЕсли;
	
	Если КолМногострочныхЧастей = 0 Тогда
		Форма.РасчетНаСервере(ИмяТекущейСтраницыПанели);
	КонецЕсли;
	
	Форма.Модифицированность = Истина;
    		
КонецПроцедуры

Функция ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование  КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Организация
	|	И Организации.Ссылка <> &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	СписокОП = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		СписокОП.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат СписокОП;

КонецФункции

Функция ПолучитьСписокВыбораИзОбщихСписков(ИмяСписка) Экспорт
	
	МакетСоставаПоказателей = Обработки.ОбщиеОбъектыРеглОтчетности.ПолучитьМакет("ОбщиеСпискиВыбора");
	Область = МакетСоставаПоказателей.Области[ИмяСписка];
	
	ВерхОбласти = Область.Верх;
	НизОбласти = Область.Низ;
	
	ТаблицаСписка = Новый ТаблицаЗначений;
	ТаблицаСписка.Колонки.Добавить("Код", , , МакетСоставаПоказателей.Область(ВерхОбласти, 1).ШиринаКолонки);
	ТаблицаСписка.Колонки.Добавить("Название", , , МакетСоставаПоказателей.Область(ВерхОбласти, 2).ШиринаКолонки);
	ТаблицаСписка.Колонки.Добавить("РезультатПроверки", , , 0);
	
	Для Инд = ВерхОбласти По НизОбласти Цикл
		НовСтрока = ТаблицаСписка.Добавить();
		НовСтрока.Код               = СокрП(МакетСоставаПоказателей.Область(Инд, 1).Текст);
		НовСтрока.Название          = СокрП(МакетСоставаПоказателей.Область(Инд, 2).Текст);
		НовСтрока.РезультатПроверки = СокрП(МакетСоставаПоказателей.Область(Инд, 3).Текст);
	КонецЦикла;
	
	Возврат ТаблицаСписка;
	
КонецФункции

Процедура УстановитьПримечаниеНаТитульныхЛистахГруппыАлкогольныхДеклараций(Форма) Экспорт
	
	мТитульный = Форма.ТабличныйДокумент;

	СохрДопИнфо1 = мТитульный.Области.ДопИнфо1.Значение;
	
	ТекстПрим = "";
	ПредставляетсяЗнач = Число(Форма.Представляется);
	Если ПредставляетсяЗнач = 1 Тогда
		ТекстПрим = "с учетом обособленных подразделений";
	ИначеЕсли ПредставляетсяЗнач = 2 Тогда
		ТекстПрим = "без учета обособленных подразделений";
	ИначеЕсли ПредставляетсяЗнач = 3 Тогда
		ТекстПрим = "за подразделение из того же региона";
	ИначеЕсли ПредставляетсяЗнач = 4 Тогда
		ТекстПрим = "за подразделение из другого региона";
	КонецЕсли;

	Если ЗначениеЗаполнено(мТитульный.Области.ТипОрг1.Значение) Тогда
		
		мТитульный.Области.ДопИнфо1.Значение = ТекстПрим;
		Форма.Элементы.Представляется.Видимость = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(мТитульный.Области.ТипОрг2.Значение)
	      Или НЕ ЗначениеЗаполнено(мТитульный.Области.ТипОрг1.Значение) Тогда

		мТитульный.Области.ДопИнфо1.Значение = "";
		Форма.Элементы.Представляется.Видимость = Ложь;
		
	КонецЕсли;
	
	Если НЕ СохрДопИнфо1 = мТитульный.Области.ДопИнфо1.Значение Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруТаблицыРО(ТаблицаИсточник) Экспорт

	Результат = Новый ТаблицаЗначений;
	Для каждого Стр Из ТаблицаИсточник.Колонки Цикл
		Результат.Колонки.Добавить(Стр.Имя, Стр.ТипЗначения);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ПринтерДоступен() Экспорт
	
	ТаблДок = Новый ТабличныйДокумент;
	Возврат ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТаблДок, ТаблДок, Ложь);
	
КонецФункции

Процедура ВосстановитьСведенияОбОрганизацииИзТитульногоЛистаСтарогоОбразцаФормыРСВ1(ПоказателиОтчета, СтруктураДанныхТитульный) Экспорт
	
	ПоказателиТаблПоле = ПоказателиОтчета["ПолеТабличногоДокументаТитульный"];
	
	Для Каждого Показатель Из ПоказателиТаблПоле Цикл
		
		ИмяПоказателя = Показатель.Ключ;
		
		Если ИмяПоказателя = "НомРег1" Тогда
			СтруктураДанныхТитульный.Вставить("НомРег");
			Для Ном = 1 По 14 Цикл
				СтруктураДанныхТитульный.НомРег = СокрЛП(СтруктураДанныхТитульный.НомРег) + ПоказателиТаблПоле["НомРег" + Ном];
				СтруктураДанныхТитульный.Удалить("НомРег" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "НомТФОМС1" Тогда
			СтруктураДанныхТитульный.Вставить("НомТФОМС");
			Для Ном = 1 По 15 Цикл
				СтруктураДанныхТитульный.НомТФОМС = СокрЛП(СтруктураДанныхТитульный.НомТФОМС) + ПоказателиТаблПоле["НомТФОМС" + Ном];
				СтруктураДанныхТитульный.Удалить("НомТФОМС" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ИНН1" Тогда
			СтруктураДанныхТитульный.Вставить("ИНН");
			Для Ном = 1 По 12 Цикл
				СтруктураДанныхТитульный.ИНН = СокрЛП(СтруктураДанныхТитульный.ИНН) + ПоказателиТаблПоле["ИНН" + Ном];
				СтруктураДанныхТитульный.Удалить("ИНН" + Ном);
			КонецЦикла;
			Если Лев(СтруктураДанныхТитульный.ИНН, 2) = "00" Тогда
				СтруктураДанныхТитульный.ИНН = Сред(СтруктураДанныхТитульный.ИНН, 3);
			КонецЕсли;
		ИначеЕсли ИмяПоказателя = "КПП1" Тогда
			СтруктураДанныхТитульный.Вставить("КПП");
			Для Ном = 1 По 9 Цикл
				СтруктураДанныхТитульный.КПП = СокрЛП(СтруктураДанныхТитульный.КПП) + ПоказателиТаблПоле["КПП" + Ном];
				СтруктураДанныхТитульный.Удалить("КПП" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОГРН1" Тогда
			СтруктураДанныхТитульный.Вставить("ОГРН");
			Для Ном = 1 По 15 Цикл
				СтруктураДанныхТитульный.ОГРН = СокрЛП(СтруктураДанныхТитульный.ОГРН) + ПоказателиТаблПоле["ОГРН" + Ном];
				СтруктураДанныхТитульный.Удалить("ОГРН" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОГРНИП1" Тогда
			СтруктураДанныхТитульный.Вставить("ОГРНИП");
			Для Ном = 1 По 15 Цикл
				СтруктураДанныхТитульный.ОГРНИП = СокрЛП(СтруктураДанныхТитульный.ОГРНИП) + ПоказателиТаблПоле["ОГРНИП" + Ном];
				СтруктураДанныхТитульный.Удалить("ОГРНИП" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ТелОрганизации1" Тогда
			СтруктураДанныхТитульный.Вставить("ТелОрганизации");
			Для Ном = 1 По 15 Цикл
				Если ПоказателиТаблПоле.Свойство("ТелОрганизации" + Ном) Тогда
					СтруктураДанныхТитульный.ТелОрганизации = СокрЛП(СтруктураДанныхТитульный.ТелОрганизации) + ПоказателиТаблПоле["ТелОрганизации" + Ном];
					СтруктураДанныхТитульный.Удалить("ТелОрганизации" + Ном);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОКАТО1" Тогда
			СтруктураДанныхТитульный.Вставить("ОКАТО");
			Для Ном = 1 По 11 Цикл
				СтруктураДанныхТитульный.ОКАТО = СокрЛП(СтруктураДанныхТитульный.ОКАТО) + ПоказателиТаблПоле["ОКАТО" + Ном];
				СтруктураДанныхТитульный.Удалить("ОКАТО" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОКВЭД1" Тогда
			СтруктураДанныхТитульный.Вставить("ОКВЭД");
			Для Ном = 1 По 8 Цикл
				СтруктураДанныхТитульный.ОКВЭД = СокрЛП(СтруктураДанныхТитульный.ОКВЭД) + ПоказателиТаблПоле["ОКВЭД" + Ном];
				СтруктураДанныхТитульный.Удалить("ОКВЭД" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОКПО1" Тогда
			СтруктураДанныхТитульный.Вставить("ОКПО");
			Для Ном = 1 По 10 Цикл
				СтруктураДанныхТитульный.ОКПО = СокрЛП(СтруктураДанныхТитульный.ОКПО) + ПоказателиТаблПоле["ОКПО" + Ном];
				СтруктураДанныхТитульный.Удалить("ОКПО" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОКОПФ1" Тогда
			СтруктураДанныхТитульный.Вставить("ОКОПФ");
			Для Ном = 1 По 2 Цикл
				СтруктураДанныхТитульный.ОКОПФ = СокрЛП(СтруктураДанныхТитульный.ОКОПФ) + ПоказателиТаблПоле["ОКОПФ" + Ном];
				СтруктураДанныхТитульный.Удалить("ОКОПФ" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОКФС1" Тогда
			СтруктураДанныхТитульный.Вставить("ОКФС");
			Для Ном = 1 По 2 Цикл
				СтруктураДанныхТитульный.ОКФС = СокрЛП(СтруктураДанныхТитульный.ОКФС) + ПоказателиТаблПоле["ОКФС" + Ном];
				СтруктураДанныхТитульный.Удалить("ОКФС" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "НомерКорректировки1" Тогда
			СтруктураДанныхТитульный.Вставить("НомерКорректировки");
			Для Ном = 1 По 3 Цикл
				СтруктураДанныхТитульный.НомерКорректировки = СокрЛП(СтруктураДанныхТитульный.НомерКорректировки) + ПоказателиТаблПоле["НомерКорректировки" + Ном];
				СтруктураДанныхТитульный.Удалить("НомерКорректировки" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "Период1" Тогда
			СтруктураДанныхТитульный.Вставить("Период");
			Для Ном = 1 По 2 Цикл
				СтруктураДанныхТитульный.Период = СокрЛП(СтруктураДанныхТитульный.Период) + ПоказателиТаблПоле["Период" + Ном];
				СтруктураДанныхТитульный.Удалить("Период" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "ОтчетГод1" Тогда
			СтруктураДанныхТитульный.Вставить("ОтчетГод");
			Для Ном = 1 По 4 Цикл
				СтруктураДанныхТитульный.ОтчетГод = СокрЛП(СтруктураДанныхТитульный.ОтчетГод) + ПоказателиТаблПоле["ОтчетГод" + Ном];
				СтруктураДанныхТитульный.Удалить("ОтчетГод" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "КолЗастрахованных1" Тогда
			СтруктураДанныхТитульный.Вставить("КолЗастрахованных");
			Для Ном = 1 По 6 Цикл
				СтруктураДанныхТитульный.КолЗастрахованных = СокрЛП(СтруктураДанныхТитульный.КолЗастрахованных) + ПоказателиТаблПоле["КолЗастрахованных" + Ном];
				СтруктураДанныхТитульный.Удалить("КолЗастрахованных" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "СрСписЧисл1" Тогда
			СтруктураДанныхТитульный.Вставить("СрСписЧисл");
			Для Ном = 1 По 6 Цикл
				Если ПоказателиТаблПоле.Свойство("СрСписЧисл" + Ном) Тогда
					СтруктураДанныхТитульный.СрСписЧисл = СокрЛП(СтруктураДанныхТитульный.СрСписЧисл) + ПоказателиТаблПоле["СрСписЧисл" + Ном];
					СтруктураДанныхТитульный.Удалить("СрСписЧисл" + Ном);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "Тариф1" Тогда
			СтруктураДанныхТитульный.Вставить("Тариф");
			Для Ном = 1 По 2 Цикл
				СтруктураДанныхТитульный.Тариф = СокрЛП(СтруктураДанныхТитульный.Тариф) + ПоказателиТаблПоле["Тариф" + Ном];
				СтруктураДанныхТитульный.Удалить("Тариф" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "Прил1" Тогда
			СтруктураДанныхТитульный.Вставить("Прил");
			Для Ном = 1 По 3 Цикл
				СтруктураДанныхТитульный.Прил = СокрЛП(СтруктураДанныхТитульный.Прил) + ПоказателиТаблПоле["Прил" + Ном];
				СтруктураДанныхТитульный.Удалить("Прил" + Ном);
			КонецЦикла;
		ИначеЕсли ИмяПоказателя = "СоставленаНа1" Тогда
			СтруктураДанныхТитульный.Вставить("СоставленаНа");
			Для Ном = 1 По 3 Цикл
				СтруктураДанныхТитульный.СоставленаНа = СокрЛП(СтруктураДанныхТитульный.СоставленаНа) + ПоказателиТаблПоле["СоставленаНа" + Ном];
				СтруктураДанныхТитульный.Удалить("СоставленаНа" + Ном);
			КонецЦикла;
			// В форме с 1 кв. 2014 г. предусмотрено 6 ячеек ("на ХХХХХХ страницах")
			// вместо 3 ячеек ("на ХХХ страницах"), предусмотренных в ранних формах.
			Попытка
				Для Ном = 4 По 6 Цикл
					СтруктураДанныхТитульный.СоставленаНа = СокрЛП(СтруктураДанныхТитульный.СоставленаНа) + ПоказателиТаблПоле["СоставленаНа" + Ном];
					СтруктураДанныхТитульный.Удалить("СоставленаНа" + Ном);
				КонецЦикла;
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура КонвертироватьДанныеРаздела12СтарогоОбразцаФормыРСВ1(Раздел12) Экспорт
	
	Для Каждого СтраницаРаздела12 Из Раздел12 Цикл
		
		Если ТипЗнч(СтраницаРаздела12.Данные) = Тип("Структура") Тогда
			
			СтраницаРаздела12 = СтраницаРаздела12.Данные;
			
		ИначеЕсли ТипЗнч(СтраницаРаздела12.Данные) = Тип("СписокЗначений") Тогда
			
			СтраницаРаздела12 = СтраницаРаздела12.Данные[0].Значение;
			
		КонецЕсли;
		
		Если СтраницаРаздела12.Свойство("П000200001001_1") Тогда
			
			СтраницаРаздела12.Вставить("П000200001001", СокрЛП(СтраницаРаздела12.П000200001001_1
											  	  			 + СтраницаРаздела12.П000200001001_2));
			Для Ном = 1 По 2 Цикл
				СтраницаРаздела12.Удалить("П000200001001_" + Ном);
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЦикла;
		
КонецПроцедуры

Процедура КонвертироватьДанныеРаздела2СтарогоОбразцаФормыРСВ1(Раздел2) Экспорт
	
	Для Каждого СтраницаРаздела2 Из Раздел2 Цикл
		
		Если ТипЗнч(СтраницаРаздела2.Данные) = Тип("Структура") Тогда
			
			СтраницаРаздела2 = СтраницаРаздела2.Данные;
			
		ИначеЕсли ТипЗнч(СтраницаРаздела2.Данные) = Тип("СписокЗначений") Тогда
			
			СтраницаРаздела2 = СтраницаРаздела2.Данные[0].Значение;
			
		КонецЕсли;
		
		Если СтраницаРаздела2.Свойство("П000200001002") Тогда
			
			СтраницаРаздела2.Вставить(
				"П000200001001", СокрЛП(СтраницаРаздела2.П000200001001 + СтраницаРаздела2.П000200001002));
			СтраницаРаздела2.Удалить("П000200001002");
			
		КонецЕсли;
		
		// В форме с 1 кв. 2014 г. имя показателя изменено,
		// т.к. появился "Раздел21" (вместо "Раздел2" в форме 2013 г.)
		Если СтраницаРаздела2.Свойство("П000210001002") Тогда
			
			СтраницаРаздела2.Вставить(
				"П000210001001", СокрЛП(СтраницаРаздела2.П000210001001 + СтраницаРаздела2.П000210001002));
			СтраницаРаздела2.Удалить("П000210001002");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполняет структуру данных раздела регламентированного отчета
// значениями из данных дополнительных строк.
//
// Параметры:
//  СтруктураДанных - Структура - структура данных раздела рег. отчета.
//  ДанныеДопСтрок  - ДанныеФормыКоллекция или Массив элементов ДанныеФормыКоллекция - данные
//                    дополнительных строк раздела рег. отчета.
//
Процедура ЗаполнитьСтруктуруДанныхРазделаЗначениямиИзДопСтрок(СтруктураДанных, ДанныеДопСтрок) Экспорт
	
	Если ТипЗнч(ДанныеДопСтрок) <> Тип("Массив") Тогда
		
		МассивДанныхДопСтрок = Новый Массив;
		МассивДанныхДопСтрок.Добавить(ДанныеДопСтрок);
		
	Иначе
		
		МассивДанныхДопСтрок = ДанныеДопСтрок;
		
	КонецЕсли;
	
	Для Каждого ДопСтроки Из МассивДанныхДопСтрок Цикл
		
		Если НЕ ТипЗнч(ДопСтроки) = Тип("ТаблицаЗначений") Тогда
			
			ТЗ = ДанныеФормыВЗначение(ДопСтроки, Тип("ТаблицаЗначений"));
			
		Иначе
			
			ТЗ = ДопСтроки;
			
		КонецЕсли;
		
		Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
			
			Для ИндексТЗ = 0 По ТЗ.Количество() - 1 Цикл
				
				Для Каждого КолонкаТЗ Из ТЗ.Колонки Цикл
					
					СтруктураДанных.Вставить(
						КолонкаТЗ.Имя + "_" + Формат(ИндексТЗ + 1, "ЧГ="), ТЗ[ИндексТЗ][КолонкаТЗ.Имя]);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает результат сравнения значений из данных дополнительных строк
// со значениями структуры данных раздела регламентированного отчета.
//
// Параметры:
//  СтруктураДанных - Структура - структура данных раздела рег. отчета.
//  ДанныеДопСтрок  - ДанныеФормыКоллекция или Массив элементов ДанныеФормыКоллекция - данные
//                    дополнительных строк раздела рег. отчета.
//
// Возвращаемое значение:
//  Истина - значения из данных доп. строк равны соотв. значениям структуры данных раздела;
//   Ложь  - хотя бы одно значение из данных доп. строк не равно соотв. значению структуры данных раздела.
//
Функция ЗначенияИзДопСтрокСоответствуютСтруктуреДанныхРаздела(СтруктураДанных, ДанныеДопСтрок) Экспорт
	
	Если ТипЗнч(ДанныеДопСтрок) <> Тип("Массив") Тогда
		
		МассивДанныхДопСтрок = Новый Массив;
		МассивДанныхДопСтрок.Добавить(ДанныеДопСтрок);
		
	Иначе
		
		МассивДанныхДопСтрок = ДанныеДопСтрок;
		
	КонецЕсли;
	
	Для Каждого ДопСтроки Из МассивДанныхДопСтрок Цикл
		
		ТЗ = ДанныеФормыВЗначение(ДопСтроки, Тип("ТаблицаЗначений"));
		
		Если ТипЗнч(ТЗ) = Тип("ТаблицаЗначений") Тогда
			
			Для ИндексТЗ = 0 По ТЗ.Количество() - 1 Цикл
				
				Для Каждого КолонкаТЗ Из ТЗ.Колонки Цикл
					
					ТекЗначение = Неопределено;
					
					Если СтруктураДанных.Свойство(КолонкаТЗ.Имя + "_" + Формат(ИндексТЗ + 1, "ЧГ="), ТекЗначение) Тогда
						
						Если ТекЗначение = ТЗ[ИндексТЗ][КолонкаТЗ.Имя] Тогда
							
							Продолжить;
							
						Иначе
							
							Возврат Ложь;
							
						КонецЕсли;
						
					Иначе
						
						Возврат Ложь;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ПлательщикТорговогоСбораЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	ПризнакПлательщикаТС = Ложь;
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьПризнакПлательщикаТорговогоСбораЗаПериод(
		Организация, НачалоПериода, КонецПериода, ПризнакПлательщикаТС);
	
	Возврат ПризнакПлательщикаТС;
	
КонецФункции

Функция ОбъектНалогообложенияУСНЗаПериод(Организация, НачалоПериода, КонецПериода) Экспорт
	
	ОбъектНалУСН = Неопределено;
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьОбъектНалогообложенияУСНЗаПериод(
		Организация, НачалоПериода, КонецПериода, ОбъектНалУСН);
	
	Возврат ОбъектНалУСН;
	
КонецФункции

// Функция возвращает признак - является ли индивидуальный предприниматель работодателем для наемных сотрудников.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - ссылка на элемент справочника "Организации".
//  ДатаНачалаПериодаОтчета - Дата - дата начала периода отчета.
//  ДатаКонцаПериодаОтчета - Дата - дата конца периода отчета.
//
// Возвращаемое значение:
//  Истина - ИП является работодателем;
//  Ложь   - ИП не является работодателем.
//
Функция ИПИспользуетТрудНаемныхРаботников(Организация,
										  ДатаНачалаПериодаОтчета = Неопределено,
										  ДатаКонцаПериодаОтчета  = Неопределено) Экспорт
	
	ИПИспользуетТрудНаемныхРаботников = Ложь;
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьПризнакИспользованияИПТрудаНаемныхРаботников(
		Организация, ИПИспользуетТрудНаемныхРаботников, ДатаНачалаПериодаОтчета, ДатаКонцаПериодаОтчета);
		
	Возврат ИПИспользуетТрудНаемныхРаботников;
	
КонецФункции

// Устанавливает индекс картинки в регистре сведений "Журнал отчетов статусы"
// (актуализирует значение индекса картинки в случае присоединения/удаления файлов).
//
// Параметры:
//  ВладелецФайлов - ДокументСсылка, СправочникСсылка - ссылка на объект
//                   в регистре сведений "Журнал отчетов статусы";
//  Действие       - Строка - "ПрисоединениеФайла" или "УдалениеФайла".
//
Процедура УстановитьИндексКартинкиОтчета(ВладелецФайлов, Действие = "")
	
	Если ЗначениеЗаполнено(ВладелецФайлов) И ЗначениеЗаполнено(Действие) Тогда
		
		ВыборкаЖОС = РегистрыСведений.ЖурналОтчетовСтатусы.Выбрать(
		Новый Структура("Ссылка", ВладелецФайлов));
		
		Если ВыборкаЖОС.Следующий() Тогда
			
			ЗаписьЖОС = ВыборкаЖОС.ПолучитьМенеджерЗаписи();
			
			Если Действие = "ПрисоединениеФайла" Тогда
				
				ЗаписьЖОС.ИндексКартинки = ?(ЗаписьЖОС.ПометкаУдаления, 1, 3);
				
			ИначеЕсли Действие = "УдалениеФайла" Тогда
				
				ЗаписьЖОС.ИндексКартинки = ?(ЗаписьЖОС.ПометкаУдаления, 0, 2);
				
			КонецЕсли;
			
			ЗаписьЖОС.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции механизма автоматического заполнения.

Процедура ПолучитьСведенияОПоказателяхУведомления(Форма, ПараметрыОтчета = Неопределено) Экспорт
	
	Попытка
		СтруктураРеквизитов = Форма.СтруктураРеквизитов;
	Исключение
		Возврат;
	КонецПопытки;
	
	Форма_ИмяФормы = СтрЗаменить(Форма.ИмяФормы, "Внешний", "");
	АвтозаполняемыеПоказателиОтчета = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОПоказателяхОтчета(Сред(Лев(Форма_ИмяФормы, СтрНайти(Форма_ИмяФормы, ".Форма.") - 1), 7), Сред(Форма_ИмяФормы, СтрНайти(Форма_ИмяФормы, ".Форма.") + 7), ПараметрыОтчета);
	
	Если АвтозаполняемыеПоказателиОтчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого АвтозаполняемыйПоказательОтчета Из АвтозаполняемыеПоказателиОтчета Цикл
		Если АвтозаполняемыйПоказательОтчета.Значение[0] Тогда
			СтруктураРеквизитов.ОтображатьКнопкуЗаполнить = Истина;
			Если СтруктураРеквизитов.ОтображатьКнопкуРасшифровать Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если АвтозаполняемыйПоказательОтчета.Значение[1] Тогда
			СтруктураРеквизитов.ОтображатьКнопкуРасшифровать = Истина;
			Если СтруктураРеквизитов.ОтображатьКнопкуЗаполнить Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьТаблицыВариантовЗаполненияУведомления(Форма, АвтозаполняемыеПоказателиОтчета);
КонецПроцедуры

Процедура ОбновитьТаблицыВариантовЗаполненияУведомления(Форма, АвтозаполняемыеПоказателиОтчета)
	
	Для Каждого АвтозаполняемыйПоказатель Из АвтозаполняемыеПоказателиОтчета Цикл
		
		Если АвтозаполняемыйПоказатель.Значение[0] Тогда
			
			НайденноеЗначение = Новый Массив;
			
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
				Форма, "мТаблицаСоставПоказателей") Тогда
				
				ТаблицаСоставПоказателей = Форма.мТаблицаСоставПоказателей;
				
			ИначеЕсли РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
				Форма.СтруктураРеквизитовФормы, "АдресВоВремХранилищеТаблицаСоставПоказателей") Тогда
				
				ТаблицаСоставПоказателей = ПолучитьИзВременногоХранилища(
					Форма.СтруктураРеквизитовФормы.АдресВоВремХранилищеТаблицаСоставПоказателей);
				
			КонецЕсли;
			
			НайденноеЗначение = ТаблицаСоставПоказателей.НайтиСтроки(
				Новый Структура("КодПоказателяПоСоставу", АвтозаполняемыйПоказатель.Ключ));
			
			Если НайденноеЗначение.Количество() > 0 Тогда
				
				Для Каждого Элемент Из НайденноеЗначение Цикл
					
					Для Каждого ТаблВариантовЗаполн Из Форма["ТаблицаВариантыЗаполнения" + Элемент.ИмяПоляТаблДокумента] Цикл
						
						ТаблицаВариантыЗаполнения = ТаблВариантовЗаполн.ТаблицаВариантовЗаполнения;
						
						НайденныеПоказатели = ТаблицаВариантыЗаполнения.НайтиСтроки(
						Новый Структура("КодПоказателя", АвтозаполняемыйПоказатель.Ключ));
						
						Если НайденныеПоказатели.Количество() = 0 Тогда
							
							СтрТабл = ТаблицаВариантыЗаполнения.Добавить();
							СтрТабл.КодПоказателя = АвтозаполняемыйПоказатель.Ключ;
							СтрТабл.ВариантЗаполнения = 3;
							
						ИначеЕсли НЕ (НайденныеПоказатели[0].ВариантЗаполнения = 1
							ИЛИ НайденныеПоказатели[0].ВариантЗаполнения = 2
							ИЛИ НайденныеПоказатели[0].ВариантЗаполнения = 4) Тогда
							
							НайденныйПоказатель = НайденныеПоказатели[0];
							
							НайденныйПоказатель.ВариантЗаполнения = 3;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьСоставПоказателей(Форма, ИмяМакета) Экспорт 
	
	МакетСоставаПоказателей = Отчеты[Форма.Объект.ИмяОтчета].ПолучитьМакет(ИмяМакета);
	
	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
		
		ТекОбласть    = МакетСоставаПоказателей.Области[Инд];
		
		ИмяСтраницы   = ТекОбласть.Имя;
		
		Форма["ТаблицаВариантыЗаполнения" + ИмяСтраницы].Добавить();
		
		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			
			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;
			
			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;
			
			КодПоказателяПоФорме = СокрЛП(МакетСоставаПоказателей.Область(Ном, 2).Текст);
			ПризнМногострочность = СокрЛП(МакетСоставаПоказателей.Область(Ном, 3).Текст);
			ТипДанныхРеквизита   = СокрЛП(МакетСоставаПоказателей.Область(Ном, 4).Текст);
			стрВариантЗаполнения = РегламентированнаяОтчетность.ПолучитьВариантЗаполненияПоказателяРегОтчета(МакетСоставаПоказателей, Ном);
			КодПоказателяПоСтруктуре = СокрЛП(МакетСоставаПоказателей.Область(Ном, 9).Текст);
			
			чВариантЗаполнения   = ? (ПустаяСтрока(стрВариантЗаполнения), 0, Число(стрВариантЗаполнения));
			
			НоваяСтрока = Форма.мТаблицаСоставПоказателей.Добавить();
			НоваяСтрока.ИмяПоляТаблДокумента   = ИмяСтраницы;
			НоваяСтрока.КодПоказателяПоСоставу = КодПоказателя;
			НоваяСтрока.КодПоказателяПоФорме   = КодПоказателяПоФорме;
			НоваяСтрока.ПризнМногострочности   = ПризнМногострочность;
			НоваяСтрока.ТипДанныхПоказателя    = ТипДанныхРеквизита;
			НоваяСтрока.КодПоказателяПоСтруктуре = КодПоказателяпоСтруктуре;
			
			Если чВариантЗаполнения <> 0 Тогда
				НоваяСтрока = Форма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Добавить();
				НоваяСтрока.КодПоказателя      = ? (Не ПустаяСтрока(КодПоказателяПоФорме), КодПоказателяПоФорме, КодПоказателя);
				НоваяСтрока.ВариантЗаполнения  = чВариантЗаполнения;
				НоваяСтрока.КодПоказателяПоСтруктуре  = КодПоказателяПоСтруктуре;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Форма["ТаблицаВариантыЗаполнения" + ИмяСтраницы][0].ТаблицаВариантовЗаполнения.Количество() > 0 Тогда
			Форма.мСтруктураВариантыЗаполнения.Вставить(ИмяСтраницы, ИмяСтраницы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхОтчета(Форма, ПараметрыОтчета = Неопределено) Экспорт
	
	Форма_ИмяФормы = СтрЗаменить(Форма.ИмяФормы, "Внешний", "");
	АвтозаполняемыеПоказателиОтчета = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОПоказателяхОтчета(Сред(Лев(Форма_ИмяФормы, СтрНайти(Форма_ИмяФормы, ".Форма.") - 1), 7), Сред(Форма_ИмяФормы, СтрНайти(Форма_ИмяФормы, ".Форма.") + 7), ПараметрыОтчета);
	
	Если ТипЗнч(ПараметрыОтчета) = Тип("Структура") Тогда
		Если ПараметрыОтчета.Свойство("АвтозаполняемыеПоказатели") Тогда
			ПараметрыОтчета.Вставить("АвтозаполняемыеПоказатели", АвтозаполняемыеПоказателиОтчета);
		КонецЕсли;
	КонецЕсли;
	
	Если АвтозаполняемыеПоказателиОтчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого АвтозаполняемыйПоказательОтчета Из АвтозаполняемыеПоказателиОтчета Цикл
		
		Если АвтозаполняемыйПоказательОтчета.Значение[0] Тогда
			
			Форма.СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить = Истина;
			
			Если Форма.СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать Тогда
				Прервать;
			КонецЕсли;
											
		КонецЕсли;	
		
		Если АвтозаполняемыйПоказательОтчета.Значение[1] Тогда
			
			Форма.СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать = Истина;
			
			Если Форма.СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить Тогда
				Прервать;
			КонецЕсли;
								
		КонецЕсли;	
			
	КонецЦикла;
	
	ОбновитьТаблицыВариантовЗаполнения(Форма, АвтозаполняемыеПоказателиОтчета);
			
КонецПроцедуры

Процедура ОбновитьТаблицыВариантовЗаполнения(Форма, АвтозаполняемыеПоказателиОтчета) Экспорт
	
	Для Каждого АвтозаполняемыйПоказатель Из АвтозаполняемыеПоказателиОтчета Цикл
		
		Если АвтозаполняемыйПоказатель.Значение[0] Тогда
			
			НайденноеЗначение = Новый Массив;
			
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
				Форма, "мТаблицаСоставПоказателей") Тогда
				
				ТаблицаСоставПоказателей = Форма.мТаблицаСоставПоказателей;
				
			ИначеЕсли РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(
				Форма.СтруктураРеквизитовФормы, "АдресВоВремХранилищеТаблицаСоставПоказателей") Тогда
				
				ТаблицаСоставПоказателей = ПолучитьИзВременногоХранилища(
					Форма.СтруктураРеквизитовФормы.АдресВоВремХранилищеТаблицаСоставПоказателей);
				
			КонецЕсли;
			
			НайденноеЗначение = ТаблицаСоставПоказателей.НайтиСтроки(
				Новый Структура("КодПоказателяПоСоставу", АвтозаполняемыйПоказатель.Ключ));
			
			Если НайденноеЗначение.Количество() > 0 Тогда
				
				Для Каждого Элемент Из НайденноеЗначение Цикл
					
					Для Каждого ТаблВариантовЗаполн Из Форма["ТаблицаВариантыЗаполнения" + Элемент.ИмяПоляТаблДокумента] Цикл
						
						ТаблицаВариантыЗаполнения = ТаблВариантовЗаполн.ТаблицаВариантовЗаполнения;
						
						НайденныеПоказатели = ТаблицаВариантыЗаполнения.НайтиСтроки(
						Новый Структура("КодПоказателя", АвтозаполняемыйПоказатель.Ключ));
						
						Если НайденныеПоказатели.Количество() = 0 Тогда
							
							СтрТабл = ТаблицаВариантыЗаполнения.Добавить();
							СтрТабл.КодПоказателя = АвтозаполняемыйПоказатель.Ключ;
							СтрТабл.ВариантЗаполнения = ?(АвтозаполняемыйПоказатель.Значение[2], 7, 3);
							
						ИначеЕсли НЕ (НайденныеПоказатели[0].ВариантЗаполнения = 1
							ИЛИ НайденныеПоказатели[0].ВариантЗаполнения = 2
							ИЛИ НайденныеПоказатели[0].ВариантЗаполнения = 4) Тогда
							
							НайденныйПоказатель = НайденныеПоказатели[0];
							
							НайденныйПоказатель.ВариантЗаполнения = ?(АвтозаполняемыйПоказатель.Значение[2], 7, 3);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры обновления информационной базы.

Процедура ВыполнитьОбновлениеИнформационнойБазы(ПараметрыОбновления = Неопределено) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

// При обновлении конфигурации с редакции 2.0 на редакцию 3.0 необходимо заполнить значениями реквизиты "ПредставлениеВида",
// "ПредставлениеПериода" документа "РегламентированныйОтчет" и реквизит "ПредставлениеПериода" документа
// "ВыгрузкаРегламентированныхОтчетов".
//	
Процедура ЗаполнитьПредставлениеПериодаИВидаРеглОтчета() Экспорт

	 Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	РегламентированныйОтчет.Ссылка
	 |ИЗ
	 |	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	 |ГДЕ
	 |	(РегламентированныйОтчет.ПредставлениеВида = """"
	 |			ИЛИ РегламентированныйОтчет.ПредставлениеПериода = """")");

	 ТаблицаРеглОтч = Запрос.Выполнить().Выгрузить();

	 Если ТаблицаРеглОтч.Количество() > 0 Тогда

		 НачатьТранзакцию();
		 
		 Попытка
			 
			 Для Каждого Элемент Из ТаблицаРеглОтч Цикл
				 
				 Док = Элемент.Ссылка.ПолучитьОбъект();
				 
				 Док.Заблокировать();
				 
				 Док.ПредставлениеВида    = ПредставлениеВидаДокумента(Док.Вид);
				 Док.ПредставлениеПериода = ПредставлениеПериода(Док.ДатаНачала, КонецДня(Док.ДатаОкончания));
				 
				 ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Док, , Истина);
				 
				 Док.Разблокировать();
				 
			 КонецЦикла;
			 
			 ЗафиксироватьТранзакцию();
			 
		 Исключение
			 
			 ОтменитьТранзакцию();
			 
		 КонецПопытки;

	 КонецЕсли;

	 Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 |	ВыгрузкаРегламентированныхОтчетов.Ссылка
	 |ИЗ
	 |	Документ.ВыгрузкаРегламентированныхОтчетов КАК ВыгрузкаРегламентированныхОтчетов
	 |ГДЕ
	 |	ВыгрузкаРегламентированныхОтчетов.ПредставлениеПериода = """"");

	 ТаблицаРеглОтч = Запрос.Выполнить().Выгрузить();

	 Если ТаблицаРеглОтч.Количество() > 0 Тогда

		 НачатьТранзакцию();
		 
		 Попытка
			 
			 Для Каждого Элемент Из ТаблицаРеглОтч Цикл
				 
				 Док = Элемент.Ссылка.ПолучитьОбъект();
				 
				 Док.Заблокировать();
				 
				 Док.ПредставлениеПериода = ПредставлениеПериодаДокументаВыгрузкаРегламентированныхОтчетов(Док.Ссылка);
				 
				 ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Док, , Истина);
				 
				 Док.Разблокировать();
				 
			 КонецЦикла;
			 
			 ЗафиксироватьТранзакцию();
			 
		 Исключение
			 
			 ОтменитьТранзакцию();
			 
		 КонецПопытки

	 КонецЕсли;

КонецПроцедуры

// Обработчик обновления БРО 1.0.1.29
//
Процедура ЗаменитьСсылкиНаРегламентированныеОтчеты() Экспорт
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
КонецПроцедуры

Процедура ОтключитьВнешнийМодульДокументооборотаСФНС() Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

// Обработчик обновления БРО 1.0.1.58
//
Процедура ПереносДанныхЭДОПриОбновлении10158() Экспорт
	
	ТекстСообщения = НСтр("ru = 'Обновление данных информационной базы по ЭДО с КО'");
	ЗаписатьИнформацию(ТекстСообщения);
	
	СоответствиеКонвертированныхОбъектов = Новый Соответствие;
	
	// Документы
	КонвертироватьДокументыЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП10158(СоответствиеКонвертированныхОбъектов);
		
	// Регистры сведений
	ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИПКонвертация10158(СоответствиеКонвертированныхОбъектов);

	
	ЗаполнитьЦиклыОбмена10158(СоответствиеКонвертированныхОбъектов);
	ЗаполнитьСтатусыОтправки10158(СоответствиеКонвертированныхОбъектов);
	ЗаполнитьСодержимоеТранспортныхКонтейнеров10158(СоответствиеКонвертированныхОбъектов);
	ЗаполнитьТранспортноеСообщение10158(СоответствиеКонвертированныхОбъектов);
	
	ЗаполнитьВидыОтправляемыхДокументов10158();
	ЗаполнитьЗаявлениеАбонентаСпецоператораСвязи10158();
	ЗаполнитьРегламентированныйОтчет10158();
		
КонецПроцедуры

// Обработчик обновления БРО.
//
// Вызывается после синхронизации с обычным приложением предопределенных значений группы ОтчетностьПоАлкоголю справочника.
//
Процедура ОбновитьОтправкиПослеЗаменыПредопределенныхЗначенийДляФСРАР() Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

// Обработчик обновления БРО 1.0.14.1
//
Процедура ОбновитьРеквизитВидОбменаСКонтролирующимиОрганамиСправочникаОрганизации() Экспорт

	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные функции для обработчика обновления БРО 1.0.1.58.

Процедура ЗаполнитьЗаявлениеАбонентаСпецоператораСвязи10158()
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Процедура ЗаполнитьРегламентированныйОтчет10158()
	
	Выборка = Документы.РегламентированныйОтчет.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.ПолучитьОбъект();
		
		Объект.КПП	= Объект.УдалитьКПП;
		
		Попытка
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибку(ТекстСообщения);
		КонецПопытки;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидыОтправляемыхДокументов10158()
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Процедура КонвертироватьДокументыЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП10158(СоответствиеКонвертированныхОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Ссылка
				   |ИЗ
				   |	Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП КАК ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП";
	Если НЕ Запрос.Выполнить().Пустой() Тогда 
		Возврат; // Объект не пустой, значит конвертация уже производилась.
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Ссылка,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.ВерсияДанных,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.ПометкаУдаления,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Номер,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Дата,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Проведен,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Организация,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.ПараметрЗапроса,
				   |	УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.ВидПараметраЗапроса
				   |ИЗ
				   |	Документ.УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП КАК УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаПоДокументам = Результат.Выбрать();
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		СтруктураДанныхДокумента = ВписатьДанныеВыборкиПоДокументуВСтруктуры(ВыборкаПоДокументам, Результат.Колонки);
		
		КонвертироватьДанные10158(СтруктураДанныхДокумента, СоответствиеКонвертированныхОбъектов);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИПКонвертация10158(СоответствиеКонвертированныхОбъектов)
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Функция ВписатьДанныеВыборкиПоДокументуВСтруктуры(Выборка, Колонки)
	
	Структура = Новый Структура;
	
	Для Каждого Колонка Из Колонки Цикл
		Структура.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Процедура ЗаполнитьТранспортноеСообщение10158(СоответствиеКонвертированныхОбъектов)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТранспортноеСообщение.Тип КАК Тип,
				   |	ТранспортноеСообщение.Ссылка
	               |ИЗ
	               |	Документ.ТранспортноеСообщение КАК ТранспортноеСообщение
	               |ГДЕ
	               |	ТранспортноеСообщение.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыТранспортныхСообщений.УдалитьЗапросНаВыпискуЕРГЮЛ_ЕГРИП)
	               |			ИЛИ ТранспортноеСообщение.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыТранспортныхСообщений.УдалитьРезультатОбработкиЗапросаНаВыпискуЕРГЮЛ_ЕГРИП)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТранспортноеСообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Выборка.Тип) Тогда
			ТранспортноеСообщениеОбъект.Тип = КонвертироватьДанные10158(Выборка.Тип, СоответствиеКонвертированныхОбъектов);
		КонецЕсли;
		
		Попытка
			ТранспортноеСообщениеОбъект.ОбменДанными.Загрузка = Истина;
			ТранспортноеСообщениеОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписатьОшибку(ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСодержимоеТранспортныхКонтейнеров10158(СоответствиеКонвертированныхОбъектов)
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Процедура ЗаполнитьСтатусыОтправки10158(СоответствиеКонвертированныхОбъектов)
	
	// ДЕНЬГИ
	Возврат;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Процедура ЗаполнитьЦиклыОбмена10158(СоответствиеКонвертированныхОбъектов)
	
	// ДЕНЬГИ
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
	Возврат;
	
КонецПроцедуры

Функция КонвертироватьДанные10158(КонвертируемыеДанные, СоответствиеКонвертированныхОбъектов = Неопределено, СсылкаНаПриемник = Неопределено)
	
	// ДЕНЬГИ
	Возврат КонвертируемыеДанные;
	// удален вызов других подсистем
	// Конец ДЕНЬГИ	
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Протоколирование хода обновления.

// Возвращает строковую константу для формирования сообщений журнала регистрации.
//
// Возвращаемое значение:
//   Строка
//
Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Обновление информационной базы'");
	
КонецФункции	

Процедура ЗаписатьИнформацию(Знач Текст) 
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация,,, Текст);
	
КонецПроцедуры

Процедура ЗаписатьОшибку(Знач Текст) 
	
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,,, Текст);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с механизмом проверки контрольных соотношений.
//

Функция СоздатьСписокРасшифровкиПоказателей() Экспорт 
	
	СписокРасшифровкиПоказателей = Новый ТаблицаЗначений;
	СписокРасшифровкиПоказателей.Колонки.Добавить("Номер"); // ссылка на формулу
	СписокРасшифровкиПоказателей.Колонки.Добавить("ИмяПоказателя");
	СписокРасшифровкиПоказателей.Колонки.Добавить("ПредставлениеПоказателя");
	СписокРасшифровкиПоказателей.Колонки.Добавить("ЗначениеПоказателя");
	СписокРасшифровкиПоказателей.Колонки.Добавить("ФормулаПоказателя");
	СписокРасшифровкиПоказателей.Колонки.Добавить("СсылкаНаДокументРО"); // ссылка на декларацию
	СписокРасшифровкиПоказателей.Колонки.Добавить("ИмяСтраницы");
	СписокРасшифровкиПоказателей.Колонки.Добавить("Страница"); // Номер страницы для многостраничных разделов, для остальных "".
	СписокРасшифровкиПоказателей.Колонки.Добавить("ДополнительныеВозможности"); // Для вывода сообщений в расшифровках, например, если показатель отсутствует.
	
	Возврат СписокРасшифровкиПоказателей;
	
КонецФункции

Процедура ЗарегистрироватьПоказательДляРасшифровки(СписокРасшифровкиПоказателей, ИмяПоказателя, ПредставлениеПоказателя,
	ЗначениеПоказателя, ФормулаПоказателя, СсылкаНаДокументРО, ИмяСтраницы, ДополнительныеВозможности,
	НомерСтраницыДляМногостраничныхРазделов, СчетчикФормулДляРасшифровок) Экспорт
	
	НовСтр = СписокРасшифровкиПоказателей.Добавить();
	НовСтр.Номер = СчетчикФормулДляРасшифровок;
	НовСтр.ИмяПоказателя = ИмяПоказателя;
	НовСтр.ПредставлениеПоказателя = ПредставлениеПоказателя;
	НовСтр.ЗначениеПоказателя = ЗначениеПоказателя;
	НовСтр.ФормулаПоказателя = ФормулаПоказателя;
	НовСтр.СсылкаНаДокументРО = СсылкаНаДокументРО;
	НовСтр.ИмяСтраницы = ИмяСтраницы;
	НовСтр.Страница = ?(НомерСтраницыДляМногостраничныхРазделов = Неопределено, "", НомерСтраницыДляМногостраничныхРазделов);
	НовСтр.ДополнительныеВозможности = ДополнительныеВозможности;

КонецПроцедуры

Функция СоздатьСписокРасшифровкиформулы() Экспорт 
	
	СписокРасшифровкиформулы = Новый ТаблицаЗначений;
	СписокРасшифровкиформулы.Колонки.Добавить("Номер");
	СписокРасшифровкиформулы.Колонки.Добавить("ТекстовоеПредставлениеФормулы");
	
	Возврат СписокРасшифровкиформулы;
	
КонецФункции

Процедура ЗарегистрироватьФормулуДляРасшифровки(СписокРасшифровкиФормулы, ТекстовоеПредставлениеФормулы, 
	ТребуемыйНомерДляСоставныхФормул, СчетчикФормулДляРасшифровок) Экспорт
	
	НовСтр = СписокРасшифровкиФормулы.Добавить();
	НовСтр.ТекстовоеПредставлениеФормулы = ТекстовоеПредставлениеФормулы;
	НовСтр.Номер = ?(ТребуемыйНомерДляСоставныхФормул = Неопределено, СчетчикФормулДляРасшифровок, ТребуемыйНомерДляСоставныхФормул);
	
КонецПроцедуры

Функция ПолучитьДокументПНП(ТекущийДокумент, ОтчетныйПериод = Неопределено, НарастающийИтог = Ложь) Экспорт 
	
	Шаг = 0;
	
	Если ОтчетныйПериод = Неопределено Тогда
		
		ПериодичностьОтчета = ТекущийДокумент.Периодичность;
		
		Если ПериодичностьОтчета = Перечисления.Периодичность.ПустаяСсылка()
		   И ТекущийДокумент.ИсточникОтчета = "РегламентированныйОтчетНалогНаИгорныйБизнес" Тогда
			Шаг = -1;
		ИначеЕсли ПериодичностьОтчета = Перечисления.Периодичность.ПустаяСсылка()
			    И СтрЧислоВхождений(ТекущийДокумент.ИсточникОтчета, "РегламентированныйОтчетАлкоПриложение") > 0 Тогда
			ПериодичностьОтчета = Перечисления.Периодичность.Квартал;
		КонецЕсли;
		
		Если ПериодичностьОтчета = Перечисления.Периодичность.Год Тогда
			Шаг = -12;
		ИначеЕсли ПериодичностьОтчета = Перечисления.Периодичность.Квартал Тогда
			Шаг = -3;
		ИначеЕсли ПериодичностьОтчета = Перечисления.Периодичность.Месяц Тогда
			Шаг = -1;
		ИначеЕсли ПериодичностьОтчета = Перечисления.Периодичность.Полугодие Тогда
			Шаг = -6;
		КонецЕсли;
		
		НачалоПериодаДокумента = ?(НарастающийИтог, НачалоГода(ТекущийДокумент.ДатаНачала),
			НачалоМесяца(ДобавитьМесяц(ТекущийДокумент.ДатаНачала, Шаг)));
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПериодаДокумента,
			НачалоДня(КонецМесяца(ДобавитьМесяц(ТекущийДокумент.ДатаОкончания, Шаг))));
		
	ИначеЕсли ОтчетныйПериод = -109 Тогда // 9 мес. предыдущего отчетного периода.
		НачалоПНП = НачалоГода(ДобавитьМесяц(ТекущийДокумент.ДатаНачала, -12));
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПНП, НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоПНП, 8))));
	ИначеЕсли ОтчетныйПериод = -112 Тогда // 12 мес. (год) предыдущего отчетного периода.
		НачалоПНП = НачалоГода(ДобавитьМесяц(ТекущийДокумент.ДатаНачала, -12));
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПНП, НачалоДня(КонецГода(НачалоПНП)));
	ИначеЕсли ОтчетныйПериод = 1 Тогда // 1 квартал.
		НачалоПНП = НачалоГода(ТекущийДокумент.ДатаНачала);
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПНП, НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоПНП, 2))));
	ИначеЕсли ОтчетныйПериод = 2 Тогда // 2 квартал.
		НачалоПНП = ДобавитьМесяц(НачалоГода(ТекущийДокумент.ДатаНачала), 3);
		ПериодДокумента = Новый Структура("Начало, Окончание", ?(НарастающийИтог, НачалоГода(ТекущийДокумент.ДатаНачала), НачалоПНП), 
			НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоПНП, 2))));
	ИначеЕсли ОтчетныйПериод = 3 Тогда // 3 квартал.
		НачалоПНП = ДобавитьМесяц(НачалоГода(ТекущийДокумент.ДатаНачала), 6);
		ПериодДокумента = Новый Структура("Начало, Окончание", ?(НарастающийИтог, НачалоГода(ТекущийДокумент.ДатаНачала), НачалоПНП), 
			НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоПНП, 2))));
	ИначеЕсли ОтчетныйПериод = 4 Тогда // 4 квартал.
		НачалоПНП = ДобавитьМесяц(НачалоГода(ТекущийДокумент.ДатаНачала), 9);
		ПериодДокумента = Новый Структура("Начало, Окончание",  ?(НарастающийИтог, НачалоГода(ТекущийДокумент.ДатаНачала), НачалоПНП), 
			НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоПНП, 2))));
	КонецЕсли;
	
	ИмяФормыОтчета = РегламентированнаяОтчетностьВызовСервера.ИмяФормыРеглОтчетаДействующейВОтчетномПериоде(ТекущийДокумент.ИсточникОтчета, ПериодДокумента.Окончание);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникОтчета", ТекущийДокумент.ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодДокумента.Начало);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодДокумента.Окончание);
	Запрос.УстановитьПараметр("ИмяФормыОтчета", "%" + ИмяФормыОтчета + "%");
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегламентированныйОтчет.Вид КАК Вид,
	|	РегламентированныйОтчет.КодНалоговогоОргана,
	|	РегламентированныйОтчет.Ссылка,
	|	РегламентированныйОтчет.ВыбраннаяФорма,
	|	РегламентированныйОтчет.ДатаНачала,
	|	РегламентированныйОтчет.ДатаОкончания
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ
	|	РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
	|	И РегламентированныйОтчет.Организация = &Организация
	|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
	|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
	|	И РегламентированныйОтчет.ВыбраннаяФорма ПОДОБНО &ИмяФормыОтчета
	|	И НЕ РегламентированныйОтчет.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вид УБЫВ";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

// Функция возвращает структуру с данными регламентированного отчета.
//
// Возвращаемое значение: структура с данными регл. отчета.
//
// Параметры:
//  СсылкаНаСохрРегОтчет - ссылка на сохраненный регламентированный отчет, данные которого нужно получить.
//
Функция ПолучитьДанныеСохрРегОтчета(СсылкаНаСохрРегОтчет) Экспорт
	
	Перем ДанныеМногостраничныхРазделов;
	Перем ДанныеМногострочныхРазделов;
	Перем ПоказателиРеглОтчета;
	
	ДанныеСохрРегОтчета = Новый Структура;
	
	ДанныеРазделовРеглОтчета = Новый Структура;
	
	СписокСохранения = СсылкаНаСохрРегОтчет.ДанныеОтчета.Получить();
	
	Если СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиРеглОтчета) Тогда
		
		Для Каждого ЭлементСтруктуры Из ПоказателиРеглОтчета Цикл
			
			ДанныеРазделовРеглОтчета.Вставить(СтрЗаменить(ЭлементСтруктуры.Ключ, "ПолеТабличногоДокумента", ""), ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокСохранения.Свойство("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногостраничныхРазделов Цикл
			
			ДанныеРазделовРеглОтчета.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СписокСохранения.Свойство("ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			Для Каждого РазделРеглОтчета Из ПоказателиРеглОтчета Цикл
				
				Для Каждого ПоказательРеглОтчета Из РазделРеглОтчета.Значение Цикл
					
					Если Лев(ПоказательРеглОтчета.Ключ, 11) = ЭлементСтруктуры.Ключ Тогда
						
						ДанныеРазделовРеглОтчета.Вставить(СтрЗаменить(РазделРеглОтчета.Ключ, "ПолеТабличногоДокумента", "") + "_ДанныеДопСтрок",
							ЭлементСтруктуры.Значение);
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеСохрРегОтчета.Вставить("ДанныеРазделовРеглОтчета", ДанныеРазделовРеглОтчета);
	
	Возврат ДанныеСохрРегОтчета;
	
КонецФункции

Процедура ПроверитьКонтрольныеСоотношенияДлительнаяОперация(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", 0);
	СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", 0);
	СтруктураРезультата.Вставить("СтруктураОшибок", Новый Структура);
	
	ОбъектОтчета = РегламентированнаяОтчетностьВызовСервера.ОбъектОтчета(ПараметрыПроцедуры.ИмяФормы);
	
	Если ОбъектОтчета = Неопределено Тогда
		ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	Результат = ОбъектОтчета.ПроверитьКонтрольныеСоотношенияДлительнаяОперация(ПараметрыПроцедуры);
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции механизма поддержки внешних регламентированных отчетов.

Функция ЗакэшироватьСтруктуруОписанияОтчета(РеглОтч)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	РегламентированныеОтчеты.ВнешнийОтчетИспользовать,
	                      |	РегламентированныеОтчеты.ИсточникОтчета,
	                      |	ВЫБОР
	                      |		КОГДА РегламентированныеОтчеты.ВнешнийОтчетИспользовать
	                      |			ТОГДА РегламентированныеОтчеты.ВнешнийОтчетХранилище
	                      |		ИНАЧЕ NULL
	                      |	КОНЕЦ КАК ВнешнийОтчетХранилище
	                      |ИЗ
	                      |	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
	                      |ГДЕ
	                      |	РегламентированныеОтчеты.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", РеглОтч);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ПризнакИспользованияВнешнегоОтчета = Выборка.ВнешнийОтчетИспользовать;
	СтруктураПараметровОтчета = Новый Структура("Признак", ПризнакИспользованияВнешнегоОтчета);
	Если ПризнакИспользованияВнешнегоОтчета Тогда
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Выборка.ВнешнийОтчетХранилище.Получить());
		ИмяОбработки = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище, , Ложь,
				ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
		СтруктураПараметровОтчета.Вставить("Файл", ИмяОбработки);
	КонецЕсли;
	
	СоответствиеПараметров = Новый Соответствие;
	Если ТипЗнч(ПараметрыСеанса.ПараметрыВнешнихРегламентированныхОтчетов) = Тип("ФиксированноеСоответствие") И ПараметрыСеанса.ПараметрыВнешнихРегламентированныхОтчетов.Количество() > 0 Тогда 
		Для Каждого ЭлементСоответствия Из ПараметрыСеанса.ПараметрыВнешнихРегламентированныхОтчетов Цикл 
			СоответствиеПараметров.Вставить(ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение);
		КонецЦикла;
	КонецЕсли;
	
	СоответствиеПараметров[Выборка.ИсточникОтчета] = Новый ФиксированнаяСтруктура(СтруктураПараметровОтчета);
	ПараметрыСеанса.ПараметрыВнешнихРегламентированныхОтчетов = Новый ФиксированноеСоответствие(СоответствиеПараметров);
	
	Возврат СтруктураПараметровОтчета;
	
КонецФункции

// Возвращает двоичные данные с файлом - внешним отчетом с учетом кэша (реквизит ВнешнийОтчетХранилище), 
// для переданного в качестве параметра элемента справочника РегламентированныеОтчеты.
// Параметры:
//		РеглОтч - ссылка на элемент справочника РегламентированныеОтчеты.
// Возвращаемое значение:
//		Содержимое реквизита ВнешнийОтчетХранилище элемента справочника с учетом кэша.
Функция ФайлОтчетаСУчетомКэша(РеглОтч, НеЗапоминатьВКэше = Ложь)
	Перем ПараметрыОтчета;
	
	ПараметрыОтчета = ПараметрыСеанса.ПараметрыВнешнихРегламентированныхОтчетов.Получить(РеглОтч.ИсточникОтчета);
	Если ПараметрыОтчета <> Неопределено Тогда
		Возврат ПараметрыОтчета.Файл;
	Иначе
		Если НеЗапоминатьВКэше Тогда
			АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(РеглОтч.ВнешнийОтчетХранилище.Получить());
			ВременныйФайл = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище, , Ложь,
				ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
			Возврат ВременныйФайл;
		Иначе
			Возврат ЗакэшироватьСтруктуруОписанияОтчета(РеглОтч).Файл;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Возвращает признак использования внешнего отчета с учетом кэша (реквизит ВнешнийОтчетИспользовать), 
// для переданного в качестве параметра элемента справочника РегламентированныеОтчеты.
// Параметры:
//		РеглОтч - ссылка на элемент справочника РегламентированныеОтчеты.
// Возвращаемое значение:
//		Признак использования внешнего отчета для заданного элемента справочника с учетом кэша.
Функция ПризнакИспользованияВнешнегоОтчетаСУчетомКэша(РеглОтч, НеЗапоминатьВКэше = Ложь)
	
	// ДЕНЬГИ
	// удален вызов другой подсистемы
	Если НеЗапоминатьВКэше Тогда
		Возврат РеглОтч.ВнешнийОтчетИспользовать;
	Иначе
		Возврат ЗакэшироватьСтруктуруОписанияОтчета(РеглОтч).Признак;
	КонецЕсли;
	// Конец ДЕНЬГИ
	
КонецФункции

Функция КодТерриториальногоОбразования(Организация, ДатаПодписиОтчета, ДатаПериодаОтчета) Экспорт
	
	Результат = "";
	
	Если ДатаПодписиОтчета >= '2014-01-01'
	   И Год(ДатаПериодаОтчета) >= 2013 Тогда
	   
		РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ДатаПодписиОтчета, "ОКТМО").Свойство("ОКТМО", Результат);
		
	Иначе
		
		РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ДатаПодписиОтчета, "ОКАТО").Свойство("ОКАТО", Результат);
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьДанныеРасшифровкиСтатистическогоОтчета(Форма, СписокСохранения) Экспорт 
	Если Форма.СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки <> Неопределено 
		И Форма.СтруктураРеквизитовФормы.мСохранятьРасшифровку = Истина Тогда
			ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(Форма.СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
			СписокСохранения.Вставить("Расшифровка", ТаблицаРасшифровки);
	КонецЕсли;
КонецПроцедуры

Процедура ВосстановитьДанныеРасшифровкиСтатистическогоОтчета(Форма, СписокСохранения) Экспорт
	
	ТаблицаРасшифровки = Неопределено;
	
	СписокСохранения.Свойство("Расшифровка", ТаблицаРасшифровки);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		
		Если ТаблицаРасшифровки.Колонки.Найти("НомСтроки") <> Неопределено Тогда
			
			ИмяПоказателя     = ТаблицаРасшифровки.Колонки.Найти("ИмяПоказателя");
			ИмяПоказателя.Имя = "НаименованиеПоказателя";
			
			ИмяЯчейки     = ТаблицаРасшифровки.Колонки.Найти("ИмяЯчейки");
			ИмяЯчейки.Имя = "ИмяПоказателя";
			
			Раздел     = ТаблицаРасшифровки.Колонки.Найти("Раздел");
			Раздел.Имя = "ИмяРаздела";
			
			ИмяСлагаемого     = ТаблицаРасшифровки.Колонки.Найти("ИмяСлагаемого");
			ИмяСлагаемого.Имя = "НаименованиеСлагаемого";
			
			ТаблицаРасшифровки.Колонки.Добавить("ДополнительныеПараметры");
			
			Для Каждого Элемент Из ТаблицаРасшифровки Цикл
				
				Если ЗначениеЗаполнено(Элемент.КодСчета) Тогда
					Элемент.НаименованиеСлагаемого = Элемент.НаименованиеСлагаемого + Элемент.КодСчета.Код;
				КонецЕсли;
				
				ДопПараметры = Новый Структура;
				
				Если ЗначениеЗаполнено(Элемент.Субконто1) Тогда
					ДопПараметры.Вставить("Субконто1", Новый Структура("ВидСубконто,ЗначениеСубконто", Элемент.КодСчета.ВидыСубконто[0].ВидСубконто, Элемент.Субконто1));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Элемент.Субконто2) Тогда
					ДопПараметры.Вставить("Субконто2", Новый Структура("ВидСубконто,ЗначениеСубконто", Элемент.КодСчета.ВидыСубконто[1].ВидСубконто, Элемент.Субконто2));
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Элемент.Субконто3) Тогда
					ДопПараметры.Вставить("Субконто3", Новый Структура("ВидСубконто,ЗначениеСубконто", Элемент.КодСчета.ВидыСубконто[2].ВидСубконто, Элемент.Субконто3));
				КонецЕсли;
				
				Элемент.ДополнительныеПараметры = ДопПараметры;
				
			КонецЦикла;
									
			ТаблицаРасшифровки = ТаблицаРасшифровки.Скопировать(, "ИмяПоказателя, НаименованиеПоказателя, ЗнакОперации, НаименованиеСлагаемого, Сумма, ИмяРаздела, ДополнительныеПараметры");
			
		КонецЕсли;
		
		Форма.СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Форма.УникальныйИдентификатор);
		
		Форма.Элементы.Расшифровать.Доступность = Истина;
		
	Иначе 
		
		Форма.Элементы.Расшифровать.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеАвтозаполненияСтатистическогоОтчета(Форма) Экспорт
	СтруктураДанных = ПолучитьИзВременногоХранилища(Форма.АдресХранилища);
	
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Контейнер = Неопределено;
	СтруктураДанных.Свойство("Контейнер", Контейнер);
	
	Если ТипЗнч(Контейнер) <> Тип("Структура") Тогда
		Контейнер = СтруктураДанных;
		Форма.Элементы.Расшифровать.Доступность = Ложь;
	Иначе 
		ТаблицаРасшифровки = Неопределено;
		Если СтруктураДанных.Свойство("ТаблицаРасшифровки", ТаблицаРасшифровки) И ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
			Форма.СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки = ПоместитьВоВременноеХранилище(ТаблицаРасшифровки, Форма.УникальныйИдентификатор);
			Форма.Элементы.Расшифровать.Доступность = Истина;
		Иначе
			Форма.Элементы.Расшифровать.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Контейнер;
КонецФункции

Функция ВидКонтактнойИнформации(НаимВидаКИ) Экспорт
	
	ВидКИ = Неопределено;
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьВидКонтактнойИнформации(ВидКИ, НаимВидаКИ);
	
	Если ВидКИ = Неопределено Тогда
		
		ВидКИ = Справочники.ВидыКонтактнойИнформации[НаимВидаКИ];
		
	КонецЕсли;	
	
	Возврат ВидКИ;
	
КонецФункции

Функция ПолучитьДокументМДКС(ТекущийДокумент, ИсточникОтчета, ОтчетныйПериод = Неопределено, НарастающийИтог = Ложь) Экспорт 
	
	СписокРегламентированныхОтчетов = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСписокРегламентированныхОтчетов();
	Если СписокРегламентированныхОтчетов.НайтиПоЗначению(ИсточникОтчета) = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Шаг = 0;
	
	Если ИсточникОтчета = "РегламентированныйОтчет3НДФЛ" Тогда
		ОтчетныйПериод = 112;
	КонецЕсли;
	
	Если ОтчетныйПериод = Неопределено Тогда 
		
		Если ИсточникОтчета = "РегламентированныйОтчетБухОтчетность" Тогда
			НарастающийИтог = Истина;
		ИначеЕсли ИсточникОтчета = "РегламентированныйОтчетРСВ1" Тогда
			НарастающийИтог = Истина;
		ИначеЕсли ИсточникОтчета = "РегламентированныйОтчет4ФСС" Тогда
			НарастающийИтог = Истина;
		КонецЕсли;
		
		НачалоПериодаДокумента = ?(НарастающийИтог, НачалоГода(ТекущийДокумент.ДатаНачала), НачалоМесяца(ДобавитьМесяц(ТекущийДокумент.ДатаНачала, Шаг)));
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПериодаДокумента,
			НачалоДня(КонецМесяца(ДобавитьМесяц(ТекущийДокумент.ДатаОкончания, Шаг))));
			
	ИначеЕсли ОтчетныйПериод = -109 Тогда // 9 мес. предыдущего отчетного периода.
		НачалоПНП = НачалоГода(ДобавитьМесяц(ТекущийДокумент.ДатаНачала, -12));
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПНП, НачалоДня(КонецМесяца(ДобавитьМесяц(НачалоПНП, 8))));
	ИначеЕсли ОтчетныйПериод = 112 Тогда // 12 мес. (год).
		НачалоПериода = НачалоГода(ТекущийДокумент.ДатаНачала);
		ПериодДокумента = Новый Структура("Начало, Окончание", НачалоПериода, НачалоДня(КонецГода(НачалоПериода)));
	КонецЕсли;
		
	ИмяФормыОтчета = РегламентированнаяОтчетностьВызовСервера.ИмяФормыРеглОтчетаДействующейВОтчетномПериоде(ИсточникОтчета, ПериодДокумента.Окончание);
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсточникОтчета", ИсточникОтчета);
	Запрос.УстановитьПараметр("Организация", ТекущийДокумент.Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодДокумента.Начало);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодДокумента.Окончание);
	Запрос.УстановитьПараметр("ИмяФормыОтчета", "%" + ИмяФормыОтчета + "%");
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегламентированныйОтчет.Вид КАК Вид,
	|	РегламентированныйОтчет.КодНалоговогоОргана,
	|	РегламентированныйОтчет.Ссылка,
	|	РегламентированныйОтчет.ВыбраннаяФорма,
	|	РегламентированныйОтчет.ДатаНачала,
	|	РегламентированныйОтчет.ДатаОкончания
	|ИЗ
	|	Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|ГДЕ
	|	РегламентированныйОтчет.ИсточникОтчета = &ИсточникОтчета
	|	И РегламентированныйОтчет.Организация = &Организация
	|	И РегламентированныйОтчет.ДатаНачала = &ДатаНачала
	|	И РегламентированныйОтчет.ДатаОкончания = &ДатаОкончания
	|	И РегламентированныйОтчет.ВыбраннаяФорма ПОДОБНО &ИмяФормыОтчета
	|	И НЕ РегламентированныйОтчет.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вид УБЫВ";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Если ТекущийДокумент.ИсточникОтчета = "РегламентированныйОтчетРасчетПоСтраховымВзносам"
		И ИсточникОтчета = "РегламентированныйОтчет6НДФЛ" Тогда
		Если НЕ Выборка.Количество() = 1 Тогда
			// КС РСВ 2.2 не должно срабатывать для организаций с обособленными
			// подразделениями не выделенными на отдельный баланс
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Процедура ПолучитьТаблицуПараметровИБ(ТаблицаПараметров) Экспорт
	
	// ДЕНЬГИ
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		Возврат;
	КонецЕсли;
	МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
	МодульРаботаВМоделиСервиса.ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, "ИспользоватьСервисФормированияМЧБсPDF417");
	МодульРаботаВМоделиСервиса.ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, "ИспользоватьСервисФормированияМЧБсPDF417ТолькоВРежимеВебКлиента");
	МодульРаботаВМоделиСервиса.ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, "АдресСервисаФормированияМЧБсPDF417");
	МодульРаботаВМоделиСервиса.ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, "ИмяПользователяСервисаФормированияМЧБсPDF417");
	МодульРаботаВМоделиСервиса.ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, "ПарольПользователяСервисаФормированияМЧБсPDF417");
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Функция ВыборкаСегментовРазделаДекларации(ДекларацияНДС, ИмяРаздела, Префикс)
	
	// ДЕНЬГИ
	Возврат Неопределено;
	// Конец ДЕНЬГИ	
	
КонецФункции

Процедура ЗаписатьДанныеВРегистрДополнительныхФайлов(ПараметрыЗаписи) Экспорт
	
	ЗаписьРегистраСведений = РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.СоздатьМенеджерЗаписи();
	
	ЗаписьРегистраСведений.РегламентированныйОтчет = ПараметрыЗаписи.РегламентированныйОтчет;
	ЗаписьРегистраСведений.ВидДополнительногоФайла = ПараметрыЗаписи.ВидДополнительногоФайла;
	
	ЗаписьРегистраСведений.СодержимоеФайла = Новый ХранилищеЗначения(ПараметрыЗаписи.Данные);
	
	ЗаписьРегистраСведений.ИмяФайла           = ПараметрыЗаписи.ВидДополнительногоФайла;
	ЗаписьРегистраСведений.Размер             = 1;
	ЗаписьРегистраСведений.ДатаИзмененияФайла = ТекущаяДатаСеанса();
	ЗаписьРегистраСведений.ДатаДобавления     = ЗаписьРегистраСведений.ДатаИзмененияФайла;
	
	ЗаписьРегистраСведений.Записать();
	
КонецПроцедуры

Функция ДанныеРегистраДополнительныхФайлов(ПараметрыЧтения) Экспорт
	
	// ДЕНЬГИ
	Возврат Неопределено;
	// Конец ДЕНЬГИ	
	
КонецФункции

// Обработчик подписки на событие "ВыполнитьДействияПриКопированииОрганизацииБРО".
//
Процедура ВыполнитьДействияПриКопированииОрганизацииБРО(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.Организации")
	   И НЕ Источник.Метаданные().Реквизиты.Найти("РегистрацияВНалоговомОргане") = Неопределено
	   И НЕ Метаданные.НайтиПоПолномуИмени("Справочник.РегистрацииВНалоговомОргане") = Неопределено Тогда
	   
		Источник.РегистрацияВНалоговомОргане = Справочники["РегистрацииВНалоговомОргане"].ПустаяСсылка();
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает фиксированное соответствие, содержащее некоторые параметры клиента:
//  ПараметрЗапуска                    - Строка,
//  СтрокаСоединенияИнформационнойБазы - Строка - строка соединения, полученная на клиенте.
//
// Возвращает пустое фиксированное соответствие, если ТекущийРежимЗапуска() = Неопределено.
//
Функция ПараметрыКлиентаНаСервере() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКлиента = ПараметрыСеанса.ПараметрыКлиентаНаСервере;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПараметрыКлиента.Количество() = 0
	   И ТекущийРежимЗапуска() <> Неопределено Тогда
		
		ВызватьИсключение НСтр("ru = 'Не заполнены параметры клиента на сервере.'");
	КонецЕсли;
	
	Возврат ПараметрыКлиента;
	
КонецФункции

Функция ВыборкаРегламентированныхОтчетов(Организация, ДатаНачала, ДатаОкончания, ВидыОтчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегламентированныеОтчеты.Ссылка КАК РегламентированныйОтчет,
	               |	РегламентированныеОтчеты.ИсточникОтчета КАК ИсточникОтчета,
	               |	РегламентированныеОтчеты.ВыбраннаяФорма КАК ВыбраннаяФорма,
	               |	РегламентированныеОтчеты.Период КАК ПериодДокумента,
	               |	РегламентированныеОтчеты.КодНалоговогоОргана КАК КодНалоговогоОргана,
	               |	РегламентированныеОтчеты.Вид КАК Вид,
	               |	РегламентированныеОтчеты.МоментВремени КАК МоментВремени,
	               |	РегламентированныеОтчеты.Дата КАК ДатаОтчета,
	               |	РегламентированныеОтчеты.ДатаНачала КАК ОтчетныйПериод,
	               |	РегламентированныеОтчеты.Периодичность КАК Периодичность,
	               |	РегламентированныеОтчеты.ДатаНачала КАК ДатаНачала,
	               |	РегламентированныеОтчеты.ДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	Документ.РегламентированныйОтчет КАК РегламентированныеОтчеты
	               |ГДЕ
	               |	НЕ РегламентированныеОтчеты.ПометкаУдаления
	               |	И РегламентированныеОтчеты.Организация = &Организация
	               |	И РегламентированныеОтчеты.ДатаНачала >= &ДатаНачала
	               |	И РегламентированныеОтчеты.ДатаОкончания <= &ДатаОкончания
	               |	И РегламентированныеОтчеты.ИсточникОтчета В(&ВидыОтчетов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МоментВремени";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ВидыОтчетов", ВидыОтчетов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция РазложитьФИО(Знач ФИОСтр) Экспорт
	
	ФИОСтр = СокрЛП(ФИОСтр);
	
	ФИО = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	
	ПервыйПробел = СтрНайти(ФИОСтр, " ");
	
	Если ПервыйПробел = 0 Тогда
		
		ФИО.Фамилия = ФИОСтр;
		
		Возврат ФИО;
		
	КонецЕсли;
	
	ФИО.Фамилия = СокрЛП(Лев(ФИОСтр, ПервыйПробел - 1));
	
	ФИОСтр = СокрЛП(Сред(ФИОСтр, ПервыйПробел + 1));
	
	ВторойПробел = СтрНайти(ФИОСтр, " ");
	
	Если ВторойПробел = 0 Тогда
		
		ФИО.Имя = ФИОСтр;
		
		Возврат ФИО;
		
	КонецЕсли;
	
	ФИО.Имя = СокрЛП(Лев(ФИОСтр, ВторойПробел - 1));
	
	ФИО.Отчество = СокрЛП(Сред(ФиоСтр, ВторойПробел + 1));
	
	// ДЕНЬГИ код исключен
	
	Возврат ФИО;
	
КонецФункции

Функция ЛьготыПоКадастровымНомерам(ОрганизацияВладелец, ДатаСреза) Экспорт
	
	ТаблицаЗемельныхУчастков = Новый ТаблицаЗначений;
	ТаблицаЗемельныхУчастков.Колонки.Добавить("КадастровыйНомер");
	ТаблицаЗемельныхУчастков.Колонки.Добавить("ПроцентУменьшенияСуммыНалога");
	ТаблицаЗемельныхУчастков.Колонки.Добавить("СниженнаяНалоговаяСтавка");
	
	РегламентированнаяОтчетностьПереопределяемый.ПолучитьЛьготыПоКадастровымНомерам(ТаблицаЗемельныхУчастков, ОрганизацияВладелец, ДатаСреза);
	
	Возврат ТаблицаЗемельныхУчастков;
	
КонецФункции

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
	
КонецПроцедуры

Функция СформироватьСтруктуруОбязательныхРеквизитовУведомления() Экспорт
	СтруктураРеквизитовФормы = Новый Структура;
	
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуЗаполнить", Ложь);
	СтруктураРеквизитовФормы.Вставить("ОтображатьКнопкуРасшифровать", Ложь);
	СтруктураРеквизитовФормы.Вставить("ЦветАвтоЗаполнение", Новый Цвет(230, 240, 220));
	СтруктураРеквизитовФормы.Вставить("ЦветАвтоРасчет", Новый Цвет(192, 220, 192));
	СтруктураРеквизитовФормы.Вставить("ЦветВручную", Новый Цвет(255, 255, 192));
	
	Возврат СтруктураРеквизитовФормы;
КонецФункции

// Возвращает строку с актуальной формой на дату, либо последней формой в списке, если дата не указана
//  ВидУведомления                    - Перечисление.ВидыУведомленийОСпецрежимахНалогообложения,
//  Дата                              - На какую дату требуется форма, если не указано - не сегодня
//
Функция ПолучитьАктуальнуюФормуУведомления(ВидУведомления, Дата = Неопределено) Экспорт 
	// ДЕНЬГИ
	Возврат "";
	// Конец ДЕНЬГИ	
КонецФункции

Процедура ПолучитьПоказателиОдностраничногоУведомления(Форма, ИмяМакета) Экспорт 
	Попытка
		СтруктураРеквизитов = Форма.СтруктураРеквизитов;
	Исключение
		Возврат;
	КонецПопытки;
	
	АвтозаполняемыеПоказателиОтчета = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСведенияОПоказателяхОтчета(Сред(Лев(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".Форма.") - 1), 7), Сред(Форма.ИмяФормы, СтрНайти(Форма.ИмяФормы, ".Форма.") + 7));
	
	Если АвтозаполняемыеПоказателиОтчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого АвтозаполняемыйПоказательОтчета Из АвтозаполняемыеПоказателиОтчета Цикл
		Если АвтозаполняемыйПоказательОтчета.Значение[0] Тогда
			СтруктураРеквизитов.ОтображатьКнопкуЗаполнить = Истина;
			Если СтруктураРеквизитов.ОтображатьКнопкуРасшифровать Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если АвтозаполняемыйПоказательОтчета.Значение[1] Тогда
			СтруктураРеквизитов.ОтображатьКнопкуРасшифровать = Истина;
			Если СтруктураРеквизитов.ОтображатьКнопкуЗаполнить Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	АвтозаполняемыеПараметры = Форма.АвтозаполняемыеПараметры;
	АвтозаполняемыеПараметры.Очистить();
	
	МакетСоставаПоказателей = Отчеты[Форма.Объект.ИмяОтчета].ПолучитьМакет(ИмяМакета);
	
	Для Инд = 0 По МакетСоставаПоказателей.Области.Количество() - 1 Цикл
		ТекОбласть = МакетСоставаПоказателей.Области[Инд];
		Для Ном = ТекОбласть.Верх По ТекОбласть.Низ Цикл
			КодПоказателя = СокрП(МакетСоставаПоказателей.Область(Ном, 1).Текст);
			
			Если КодПоказателя = "===" Тогда         // признак конечной строки
				Прервать;
			КонецЕсли;
			
			Если Лев(КодПоказателя, 2) = "//" Тогда  // пропускаем комментарии
				Продолжить;
			КонецЕсли;
			
			Если АвтозаполняемыеПоказателиОтчета.Свойство(КодПоказателя) Тогда 
				АвтозаполняемыеПараметры.Добавить(КодПоказателя);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура Раскрасить(Форма, ТабДок) Экспорт
	Для Каждого Элемент Из Форма.АвтозаполняемыеПараметры Цикл
		Обл = ТабДок.Области.Найти(Элемент);
		Если Обл <> Неопределено Тогда 
			Обл.ЦветФона = Форма.СтруктураРеквизитов.ЦветАвтоЗаполнение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ИнициализироватьПоказателиПоВекторам(Показатели, ВекторСтрок, ВекторПериодов)
	
	Строки = СтрРазделить(ВекторСтрок, ",");
	Периоды = СтрРазделить(ВекторПериодов, ",");
	
	Для Каждого Строка Из Строки Цикл
		Если Не ЗначениеЗаполнено(Строка) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Период Из Периоды Цикл
			Если Не ЗначениеЗаполнено(Период) Тогда
				Продолжить;
			КонецЕсли;
			
			Показатели.Вставить(СокрЛП(Строка) + СокрЛП(Период), 0);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Определяет возможность восстановления данных регламентированного отчета, сохраненного в 2.0.
//
// Возвращаемое значение:
//   Истина - возможно восстановить данные сохраненного в 2.0 регламентированного отчета;
//   Ложь   - в случае несовместимости регламентированного отчета.
//
// Параметры:
//   ОбъектРегОтчет          - ссылка на проверяемый регламентированный отчет, сохраненный в 2.0;
//   ДополнительныеПараметры - структура, по ключу "ТекстСообщения" возвращается текст для
//                             информирования пользователя (необязательный параметр).
//
Функция ВозможноВосстановитьДанныеРеглОтчетаСозданногоВОбычномПриложении(ОбъектРегОтчет, ДополнительныеПараметры = Неопределено) Экспорт
	
	// ДЕНЬГИ
	Возврат Ложь;
	// Конец ДЕНЬГИ
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "") Экспорт 
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

// Получает значение ОКВЭД-1 и ОКВЭД-2 из справочника организаций.
//
// Параметры:
//  ДатаПодписи - Дата - дата подписи регл. отчета.
//  СтруктураРеквизитовФормы - Структура - структура реквизитов формы регл. отчета.
//
Процедура ПолучитьЗначениеОКВЭД(ДатаПодписи, СтруктураРеквизитовФормы) Экспорт
	
	СтрокаСведений = "ОКВЭД, ОКВЭД2";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ДатаПодписи, СтрокаСведений);
	
	СтруктураРеквизитовФормы.Вставить("ОКВЭД",  СокрЛП(СведенияОбОрганизации.ОКВЭД));
	СтруктураРеквизитовФормы.Вставить("ОКВЭД2", СокрЛП(СведенияОбОрганизации.ОКВЭД2));
		
КонецПроцедуры

// Получает значения видов экономической деятельности (редакция 1, редакция 2) из справочника организаций.
//
// Параметры:
//  ДатаПодписи - Дата - дата подписи регл. отчета.
//  СтруктураРеквизитовФормы - Структура - структура реквизитов формы регл. отчета.
//
Процедура ПолучитьЗначениеВидаЭкономическойДеятельности(ДатаПодписи, СтруктураРеквизитовФормы) Экспорт
	
	СтрокаСведений = "ОснВидДеят, ОснВидДеят2";
	СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(СтруктураРеквизитовФормы.Организация, ДатаПодписи, СтрокаСведений);
	
	СтруктураРеквизитовФормы.Вставить("ОснВидДеят",  СокрЛП(СведенияОбОрганизации.ОснВидДеят));
	СтруктураРеквизитовФормы.Вставить("ОснВидДеят2", СокрЛП(СведенияОбОрганизации.ОснВидДеят2));
		
КонецПроцедуры

// Возвращает дату регистрации организации.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, дату регистрации которой требуется вернуть.
//
// Возвращаемое значение:
//  Дата - дата регистрации организации (пустое значение типа "Дата", если дату регистрации определить не удалось).
//
Функция ДатаРегистрацииОрганизации(Организация) Экспорт
	
	Сведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, , "ДатаРегистрации");
	
	//@skip-warning
	Если ЗначениеЗаполнено(Сведения) И Сведения.Свойство("ДатаРегистрации")
		И ТипЗнч(Сведения["ДатаРегистрации"]) = Тип("Дата") Тогда
		//@skip-warning
		Возврат Сведения["ДатаРегистрации"];
	Иначе
		Возврат РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	КонецЕсли;
	
КонецФункции

// Возвращает общую часть гиперссылки на монитор изменений законодательства
//
// Параметры:
//   ИсточникОтчета - Строка - имя отчета
//
// Возвращаемое значение:
//   Строка
//
Функция ОбщаяЧастьСсылкиНаИзмененияЗаконодательства(ИсточникОтчета) Экспорт
	
	Перем УИДКонфигурации;
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ИсточникОтчета", ИсточникОтчета);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегламентированныеОтчеты.УИДОтчета КАК УИДОтчета
		|ИЗ
		|	Справочник.РегламентированныеОтчеты КАК РегламентированныеОтчеты
		|ГДЕ
		|	РегламентированныеОтчеты.ИсточникОтчета = &ИсточникОтчета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РегламентированнаяОтчетностьПереопределяемый.ПолучитьУИДКонфигурации(УИДКонфигурации);
		ОбщаяЧастьСсылкиНаИзмененияЗаконодательства = СтрШаблон(
			"http://v8.1c.ru/lawmonitor/lawchanges.jsp?&regReportForm=%1&regReportOnly=true&userConfiguration=%2",
			Выборка.УИДОтчета, УИДКонфигурации);
	Иначе
		ОбщаяЧастьСсылкиНаИзмененияЗаконодательства = "";
	КонецЕсли;
	
	Возврат ОбщаяЧастьСсылкиНаИзмененияЗаконодательства;
	
КонецФункции

Функция ПредставлениеСсылкиИзмененияЗаконодательства() Экспорт
	
	Возврат НСтр("ru = 'Изменения законодательства'");
	
КонецФункции

Функция АдресВXML(КонтактнаяИнформация, ВидАдреса) Экспорт
	
	Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдреса);
	
	Результат = КонтактнаяИнформация.НайтиСтроки(Данные);
	
	Если Результат.Количество() > 0 Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Результат[0].ЗначенияПолей, Результат[0].Представление, ВидАдреса);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Возращает код тарифа или размер тарифа страховых взносов в процентах по коду категории и отчетному году.
//
// Параметры:
//  КодКатегории - Строка - код из приложения № 8 - Приказ ФНС России от 10.10.2016 N ММВ-7-11/551@
//                          "Об утверждении формы расчета по страховым взносам, порядка его заполнения,
//                          а также формата представления расчета по страховым взносам в электронной форме".
//  ОтчетныйГод - Число - четырехзначное число, соответствующее отчетному году.
//  ВернутьРазмерТарифа - Булево - если "Истина", то возвращается размер тарифа в процентах, иначе - код тарифа.
//
// Возвращаемое значение:
//  Строка, Число, Неопределено - код тарифа("Строка"), размер тарифа ("Число"),"Неопределено" - в случаях,
//                                если: соответствие коду категории не найдено, ошибка, функционал не определен.
//
Функция КодИлиРазмерТарифаПоКодуКатегории(КодКатегории, ОтчетныйГод, ВернутьРазмерТарифа = Ложь) Экспорт
	
	КодИлиРазмерТарифа = Неопределено;
	
	Попытка
		
		РегламентированнаяОтчетностьПереопределяемый.ПолучитьКодИлиРазмерТарифаПоКодуКатегории(
			КодКатегории, ОтчетныйГод, КодИлиРазмерТарифа, ВернутьРазмерТарифа);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
			?(ВернутьРазмерТарифа,
				НСтр("ru = 'Получение размера тарифа СВ в процентах по коду категории'"),
				НСтр("ru = 'Получение кода тарифа СВ по коду категории'")),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат КодИлиРазмерТарифа;
	
КонецФункции

// Возращает размер дополнительного тарифа страховых взносов в процентах по его коду и отчетному году.
//
// Параметры:
//  КодТарифа - Строка - код из приложения № 5 (с 21-го по 27-й) - Приказ ФНС России от 10.10.2016 N ММВ-7-11/551@
//                       "Об утверждении формы расчета по страховым взносам, порядка его заполнения,
//                       а также формата представления расчета по страховым взносам в электронной форме".
//  ОтчетныйГод - Число - четырехзначное число, соответствующее отчетному году.
//
// Возвращаемое значение:
//  Число, Неопределено - размер тарифа ("Число"),"Неопределено" - в случае, если соответствие коду тарифа не найдено.
//
Функция РазмерДополнительногоТарифаПоКоду(КодТарифа, ОтчетныйГод) Экспорт
	
	Если ОтчетныйГод < 2017 Тогда
		Возврат 0;
	КонецЕсли;
	
	СоответствиеЗначенияТарифаИКода = Новый Соответствие;
	СоответствиеЗначенияТарифаИКода.Вставить("21", 9.00);
	СоответствиеЗначенияТарифаИКода.Вставить("22", 6.00);
	СоответствиеЗначенияТарифаИКода.Вставить("23", 8.00);
	СоответствиеЗначенияТарифаИКода.Вставить("24", 7.00);
	СоответствиеЗначенияТарифаИКода.Вставить("25", 6.00);
	СоответствиеЗначенияТарифаИКода.Вставить("26", 4.00);
	СоответствиеЗначенияТарифаИКода.Вставить("27", 2.00);
	
	Возврат СоответствиеЗначенияТарифаИКода[КодТарифа];
	
КонецФункции

Процедура УдалитьСигнатуруBOM(ФайлВыгрузки) Экспорт
	
	Если ТипЗнч(ФайлВыгрузки) <> Тип("ДвоичныеДанные") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВыгрузки64 = Base64Строка(ФайлВыгрузки);
	Если Лев(ТекстВыгрузки64, 4) = "77u/" Тогда
		ТекстВыгрузки64 = Сред(ТекстВыгрузки64, 5);
		ФайлВыгрузки = Base64Значение(ТекстВыгрузки64);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеАктуальногоФорматаИзСервисаРосстата

Функция ПолучитьТекущуюТаблицуФорматов() Экспорт 
	Попытка
		ТекущиеНастройки = ХранилищеСистемныхНастроек.Загрузить("РегистрСведений.ШаблоныЭВФОтчетовСтатистики", "ПоследниеРезультаты");
		
		Если ТипЗнч(ТекущиеНастройки) = Тип("Структура") 
			И ТекущиеНастройки.Свойство("Таблица")
			И ТипЗнч(ТекущиеНастройки.Таблица) = Тип("ТаблицаЗначений") 
			И ТекущиеНастройки.Свойство("ДатаВремя")
			И ТипЗнч(ТекущиеНастройки.ДатаВремя) = Тип("Дата") Тогда
			
			Дельта = ТекущаяДатаСеанса() - ТекущиеНастройки.ДатаВремя;
			
			Если (Дельта < 1800) И (Дельта > 0) Тогда 
				Возврат ТекущиеНастройки.Таблица;
			КонецЕсли;
		КонецЕсли;
		
		ШаблоныЭВФОтчетовСтатистики = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.ШаблоныЭВФОтчетовСтатистики");
		Если ШаблоныЭВФОтчетовСтатистики = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли;
		
		СвойстваМодуля = Неопределено;
		Таблица = ШаблоныЭВФОтчетовСтатистики.СписокШаблоновСервисаВебСбора(СвойстваМодуля, Истина);
		Возврат Таблица;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Процедура ОбновитьШаблоныЧерезВебСервисНаСервере(Контекст, ИмяМакета) Экспорт
	Попытка
		Если СтрНачинаетсяС(Контекст.ИмяФормы, "Внешний") Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыЗапуска = ДлительныеОперации.ПараметрыВыполненияВФоне(Контекст.УникальныйИдентификатор);
		ПараметрыЗапуска.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение актуальной версии макета через веб-сервис Росстата'");
		ПараметрыЗапуска.ДополнительныйРезультат = Ложь;
		ПараметрыЗапуска.ОжидатьЗавершение = 0;
		
		ПараметрыВыполнения = Новый Структура("АттрибутыВыгрузки", РегламентированнаяОтчетность.СформироватьСтруктуруДопАтрибутов(Контекст.ИмяФормы, ИмяМакета));
		ДлительныеОперации.ВыполнитьВФоне("РегламентированнаяОтчетность.ОбновитьШаблоныЧерезВебСервисНаСервереВФоне", ПараметрыВыполнения, ПараметрыЗапуска);
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ОбновитьШаблоныЧерезВебСервисНаСервереВФоне(ПараметрыКоманды, АдресРезультата = Неопределено) Экспорт
	Попытка
		ШаблоныЭВФОтчетовСтатистики = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.ШаблоныЭВФОтчетовСтатистики");
		АттрибутыВыгрузки = ПараметрыКоманды.АттрибутыВыгрузки;
		ОКУД = "";
		КодШаблона = "";
		ВерсияШаблона = "";
		АттрибутыВыгрузки.Свойство("OKUD", ОКУД);
		АттрибутыВыгрузки.Свойство("code", КодШаблона);
		АттрибутыВыгрузки.Свойство("version", ВерсияШаблона);
		Если Не ЗначениеЗаполнено(КодШаблона) Или Не ЗначениеЗаполнено(ОКУД) Или Не ЗначениеЗаполнено(ВерсияШаблона) Тогда 
			Возврат;
		КонецЕсли;
		
		ТаблицаФорматов = ПолучитьТекущуюТаблицуФорматов();
		ОтобранныеСтроки = ТаблицаФорматов.НайтиСтроки(Новый Структура("Код, ОКУД", КодШаблона, ОКУД));
		Если ОтобранныеСтроки.Количество() <> 1 Тогда 
			Возврат;
		КонецЕсли;
		
		Если ОтобранныеСтроки[0].Версия = ВерсияШаблона Тогда 
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РАЗНОСТЬДАТ(&ТекущаяДата, ШаблоныЭВФОтчетовСтатистики.ДатаДобавления, СЕКУНДА) КАК РазностьДат
		|ИЗ
		|	РегистрСведений.ШаблоныЭВФОтчетовСтатистики КАК ШаблоныЭВФОтчетовСтатистики
		|ГДЕ
		|	ШаблоныЭВФОтчетовСтатистики.ОКУД = &ОКУД
		|	И ШаблоныЭВФОтчетовСтатистики.КодШаблона = &КодШаблона";
		Запрос.УстановитьПараметр("ОКУД", ОКУД);
		Запрос.УстановитьПараметр("КодШаблона", КодШаблона);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() = 1 И Таблица[0].РазностьДат < 3600 И Таблица[0].РазностьДат > -3600 Тогда 
			Возврат;
		КонецЕсли;
		
		ТФК = ТаблицаФорматов.СкопироватьКолонки();
		НовСтр = ТФК.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ОтобранныеСтроки[0]);
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Неопределено);
		ШаблоныЭВФОтчетовСтатистики.ЗагрузитьШаблоныЧерезСервисВебСбора(Новый Структура("СвойстваШаблонов, ТихийРежим", ТФК, Истина), АдресВременногоХранилища, "");
		ШаблоныЭВФОтчетовСтатистики.ЗагрузитьШаблоны(АдресВременногоХранилища, 0, Истина);
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура ИзменитьВерсиюФорматаСПроверкойСовместимостиШаблонов(Форма, ИмяМакетаАттрибутов, ИмяМакетаШаблона, ПараметрыВыгрузки) Экспорт
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ	
КонецПроцедуры

Функция ПолучитьДанныеШаблона(Форма, ИмяМакетаАттрибутов, ИмяМакетаШаблона, ПараметрыВыгрузки, НоваяВерсия) Экспорт
	// ДЕНЬГИ
	Возврат Неопределено;
	// Конец ДЕНЬГИ	
КонецФункции

Процедура ОбновитьШаблоныСпискомЧерезВебСервисНаСервереВФоне(ПараметрыКоманды, АдресРезультата = Неопределено) Экспорт
	
	ПоместитьВоВременноеХранилище(Ложь, АдресРезультата);
	
	Попытка
		
		ШаблоныЭВФОтчетовСтатистики = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.ШаблоныЭВФОтчетовСтатистики");
		
		СписокШаблонов = ПараметрыКоманды.СписокШаблонов;
		Если НЕ ЗначениеЗаполнено(СписокШаблонов)Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаФорматов = ПолучитьТекущуюТаблицуФорматов();
		Если НЕ ЗначениеЗаполнено(ТаблицаФорматов)Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаОтобранных = ТаблицаФорматов.СкопироватьКолонки();
		Для Каждого СтрокаТаблицыФорматов Из ТаблицаФорматов Цикл
			Если НЕ СтрНачинаетсяС(СокрЛ(СтрокаТаблицыФорматов.ИмяФормы), "(")
				  И СписокШаблонов.НайтиПоЗначению(СтрокаТаблицыФорматов.ОКУД) <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаОтобранных.Добавить(), СтрокаТаблицыФорматов);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаОтобранных.Сортировать("ОКУД Возр, Код Возр, ДатаОбновления Убыв");
		
		КоличествоСтрокВТаблице = ТаблицаОтобранных.Количество();
		Для НомСтроки = 1 По КоличествоСтрокВТаблице Цикл
			Инд = КоличествоСтрокВТаблице - НомСтроки;
			СтрокаТаблицы = ТаблицаОтобранных[Инд];
			Если Инд > 0 Тогда
				Если СтрокаТаблицы.Код  = ТаблицаОтобранных[Инд - 1].Код
				   И СтрокаТаблицы.ОКУД = ТаблицаОтобранных[Инд - 1].ОКУД Тогда
					ТаблицаОтобранных.Удалить(СтрокаТаблицы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ТаблицаОтобранных)Тогда
			Возврат;
		КонецЕсли;
		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Неопределено);
		ШаблоныЭВФОтчетовСтатистики.ЗагрузитьШаблоныЧерезСервисВебСбора(
			Новый Структура("СвойстваШаблонов, ТихийРежим", ТаблицаОтобранных, Истина), АдресВременногоХранилища, "");
		ШаблоныЭВФОтчетовСтатистики.ЗагрузитьШаблоны(АдресВременногоХранилища, 0, Истина);
		
		ПоместитьВоВременноеХранилище(Истина, АдресРезультата);
		
	Исключение
		
		ОписаниеОшибки = ИнформацияОбОшибке().Описание;
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Получение списка XML-шаблонов через веб-сервис Росстата'"),
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Функция ПолучитьИнформациюДляПеремещенияОМетаданных(Ссылка) Экспорт
	
	Информация = Новый Структура;
	
	МетаданныеОбъекта = Ссылка.Метаданные();
	
	Информация.Вставить("ПолноеИмя",    МетаданныеОбъекта.ПолноеИмя());
	
	ЭтоСправочник = Метаданные.Справочники.Содержит(МетаданныеОбъекта);
	ЭтоПВХ        = Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеОбъекта);
	
	Если ЭтоСправочник ИЛИ ЭтоПВХ Тогда
		
		Информация.Вставить("ЕстьГруппы",
					МетаданныеОбъекта.Иерархический И 
							?(ЭтоПВХ, Истина, МетаданныеОбъекта.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов));
		
		Информация.Вставить("ДляГрупп",     Истина);
		Информация.Вставить("ДляЭлементов", Истина);
		Информация.Вставить("ЕстьРодитель",  МетаданныеОбъекта.Иерархический);
		Информация.Вставить("ГруппыСверху", ?(НЕ Информация.ЕстьРодитель, Ложь, МетаданныеОбъекта.ГруппыСверху));
		Информация.Вставить("ЕстьВладелец", ?(ЭтоПВХ, Ложь, (МетаданныеОбъекта.Владельцы.Количество() <> 0)));
		
	Иначе
		
		Информация.Вставить("ЕстьГруппы",   Ложь);
		Информация.Вставить("ДляГрупп",     Ложь);
		Информация.Вставить("ДляЭлементов", Истина);
		Информация.Вставить("ЕстьРодитель", Ложь);
		Информация.Вставить("ЕстьВладелец", Ложь);
		Информация.Вставить("ГруппыСверху", Ложь);
		
	КонецЕсли;
	
	Возврат Информация;
	
КонецФункции

#Область ПроцедурыПроверкиУниверсальногоОтчета

Процедура ПроверитьКонтрольныеСоотношенияВОтчетеВФоне(ПараметрыДляПроверки, АдресХранилища) Экспорт 
	Результат = ПроверитьКонтрольныеСоотношенияВОтчете(ПараметрыДляПроверки.Параметры);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
КонецПроцедуры

Функция ПроверитьКонтрольныеСоотношенияВОтчете(ПараметрыДляПроверки) Экспорт 
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("КоличествоНайденныхОшибок",    0);
	СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", 0);
	СтруктураРезультата.Вставить("СтруктураОшибок", Неопределено);
	
	ОбщееЧислоОшибок    = 0; // Счетчик учета ошибок.
	ОбщееЧислоБезОшибок = 0; // Счетчик учета проверенных соотношений, не являющиеся ошибками.
	
	СтруктураОшибок = Новый Структура;
	
	Для каждого КонтрольноеСоотношение Из ПараметрыДляПроверки.ТаблицаКонтрольныхСоотношений Цикл
		
		Условие                = СокрЛП(КонтрольноеСоотношение.Условие);
		Формула                = СокрЛП(КонтрольноеСоотношение.Формула);
		УсловиеПериод          = СокрЛП(КонтрольноеСоотношение.УсловиеПериод);
		Описание               = СокрЛП(КонтрольноеСоотношение.Описание);
		ОбязательностьКонтроля = КонтрольноеСоотношение.ОбязательностьКонтроля;
		РазрядностьОкругления  = КонтрольноеСоотношение.РазрядностьОкругления;
		ДопустимоеОтклонение   = КонтрольноеСоотношение.ДопустимоеОтклонение;
		
		СоотношениеВыполнено = РезультатПроверкиКонтрольногоСоотношения(ПараметрыДляПроверки, Формула, Условие, УсловиеПериод, РазрядностьОкругления, ДопустимоеОтклонение);
		
		Если НЕ СоотношениеВыполнено Тогда
			ОбщееЧислоОшибок = ОбщееЧислоОшибок + 1;
			ЭтоОшибка = Истина;
		Иначе
			ОбщееЧислоБезОшибок = ОбщееЧислоБезОшибок + 1;
			ЭтоОшибка = Ложь;
		КонецЕсли;
		
		Описание = СтрЗаменить(ВРег(Лев(Описание, 1)) + Сред(Описание, 2), "  ", " ");
		Расшифровка = СтрЗаменить(СтрЗаменить(?(ЗначениеЗаполнено(Условие), "Если" + Символы.ПС + Условие + "," + Символы.ПС + "тогда:" + Символы.ПС, "") + Формула, "|", " "),"  ", " ");
		
		СтруктураОшибок.Вставить("Описание" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), ""));
		СтруктураОшибок.Вставить("Нарушение" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), ""));
		СтруктураОшибок.Вставить("Расшифровка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), Расшифровка));
		СтруктураОшибок.Вставить("ЭтоОшибка" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), ЭтоОшибка);
		СтруктураОшибок.Вставить("ТекстовоеПредставлениеФормулы" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), Описание));
		Если ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
			СтруктураОшибок.Вставить("Комментарий" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), "Ошибка в выражении! Соотношение не используется."));
		Иначе
			СтруктураОшибок.Вставить("Комментарий" + Формат(ОбщееЧислоОшибок + ОбщееЧислоБезОшибок, "ЧГ=0"), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1'"), ?(ОбязательностьКонтроля, "", "Контролировать не обязательно")));
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ОбщееЧислоОшибок + ОбщееЧислоБезОшибок > 0 Тогда
		СтруктураРезультата.Вставить("КоличествоНайденныхОшибок", ОбщееЧислоОшибок);
		СтруктураРезультата.Вставить("КоличествоНайденныхБезОшибок", ОбщееЧислоБезОшибок);
		СтруктураРезультата.Вставить("СтруктураОшибок", СтруктураОшибок);
	КонецЕсли;
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ВидыОбрабатываемыхНеравенств()
	СтрокаНеравенств = "|>=|;|<=|;|>|;|<|";
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаНеравенств, ";", Истина);
КонецФункции

Функция КоличествоВхожденийНеравенств(Формула, ВидыНеравенств)
	Результат = 0;
	Для Каждого Элемент Из ВидыНеравенств Цикл 
		Результат = Результат + СтрЧислоВхождений(Формула, Элемент);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура РазложитьФормулуНаДвеПодформулы(Формула, Подформула1, Подформула2, ВидыНеравенств)
	Подформула1 = "";
	Подформула2 = "";
	ИнформацияОВхождениях = Новый Соответствие;
	Для Каждого Неравенство Из ВидыНеравенств Цикл
		ЧислоВхождений = СтрЧислоВхождений(Формула, Неравенство);
		Если ЧислоВхождений = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		МассивНомеровВхождений = Новый Массив;
		НомерВхождения = 0;
		Пока Истина Цикл
			НомерВхождения = НомерВхождения + 1;
			Инд = СтрНайти(Формула, Неравенство, , , НомерВхождения);
			Если Инд = 0 Тогда 
				Прервать;
			КонецЕсли;
			МассивНомеровВхождений.Добавить(Инд);
		КонецЦикла;
		
		ИнформацияОВхождениях[Неравенство] = Новый Структура("Количество,МассивНомеровВхождений", ЧислоВхождений,МассивНомеровВхождений);
	КонецЦикла;
	
	В1 = "";
	В2 = "";
	Поз1 = 0;
	Поз2 = 0;
	Для Каждого КЗ Из ИнформацияОВхождениях Цикл 
		Для Каждого НВ Из КЗ.Значение.МассивНомеровВхождений Цикл 
			Если В1 = "" Тогда
				В1 = КЗ.Ключ;
				Поз1 = НВ;
			ИначеЕсли В2 = "" Тогда 
				В2 = КЗ.Ключ;
				Поз2 = НВ;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Поз1 > Поз2 Тогда 
		Т = Поз1;
		Поз1 = Поз2;
		Поз2 = Т;
		Т = В1;
		В1 = В2;
		В2 = Т;
	КонецЕсли;
	
	Подформула1 = Лев(Формула, Поз2 - 1);
	Подформула2 = Сред(Формула, Поз1 + СтрДлина(В1));
КонецПроцедуры

Функция ФормулаСодержитЛогическиеВыражения(Формула)
	Ф = ВРег(Формула);
	Возврат (СтрЧислоВхождений(Ф,"AND") > 0) Или (СтрЧислоВхождений(Ф,"OR") > 0) Или (СтрЧислоВхождений(Ф,"XOR") > 0);
КонецФункции

Функция РазложитьФормулуНаПодформулы(Формула, ВидыНеравенств)
	// Возврат преобразованной формулы для выражений вида A<=B<=C и им подобным
	// Их будем интерпретировать как (A<=B) И (B<=C)
	Если ФормулаСодержитЛогическиеВыражения(Формула) Тогда
		Возврат Формула;
	КонецЕсли;
	
	Результат = Новый Массив;
	Результат.Добавить(Формула);
	
	Подформула1 = "";
	Подформула2 = "";
	
	ПромежуточныйРезультат = Новый Массив;
	Пока Истина Цикл 
		Для Каждого Элт Из Результат Цикл 
			Если КоличествоВхожденийНеравенств(Элт, ВидыНеравенств) <= 1 Тогда 
				ПромежуточныйРезультат.Добавить(Элт);
			Иначе
				РазложитьФормулуНаДвеПодформулы(Формула, Подформула1, Подформула2, ВидыНеравенств);
				ПромежуточныйРезультат.Добавить(Подформула1);
				ПромежуточныйРезультат.Добавить(Подформула2);
			КонецЕсли;
		КонецЦикла;
		
		Если ПромежуточныйРезультат.Количество() <= Результат.Количество() Тогда 
			Прервать;
		КонецЕсли;
		
		Результат = ПромежуточныйРезультат;
		ПромежуточныйРезультат = Новый Массив;
	КонецЦикла;
	
	Если Результат.Количество() = 1 Тогда 
		Возврат Формула;
	КонецЕсли;
	
	РезСтр = "("+Результат[0]+")";
	Для Инд = 1 По Результат.ВГраница() Цикл 
		РезСтр = РезСтр + "AND("+Результат[Инд]+")";
	КонецЦикла;
	Возврат РезСтр;
КонецФункции

Функция РезультатПроверкиКонтрольногоСоотношения(ПараметрыДляПроверки, Формула, Условие, УсловиеПериод, РазрядностьОкругления, ДопустимоеОтклонение) Экспорт 
	
	ВидыНеравенств = ВидыОбрабатываемыхНеравенств();
	ПараметрыДляПроверки.КвоОшибокКС = 0;
	РезУсловиеПериод = РезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, УсловиеПериод, РазрядностьОкругления, ДопустимоеОтклонение);
	
	Если ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если РезУсловиеПериод Тогда
		
		ПреобразованноеУсловие = РазложитьФормулуНаПодформулы(Условие, ВидыНеравенств);
		ПараметрыДляПроверки.КвоОшибокКС = 0;
		РезУсловие = РезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, ПреобразованноеУсловие, РазрядностьОкругления, ДопустимоеОтклонение);
		
		Если ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
			Возврат Истина;
		КонецЕсли;
		
		Попытка
			Если ЗначениеЗаполнено(Условие) Тогда 
				ВектРезУсловие = ВекторныйРезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, ПреобразованноеУсловие, РазрядностьОкругления, ДопустимоеОтклонение);
			КонецЕсли;
		Исключение
			ВектРезУсловие = Неопределено;
		КонецПопытки;
		
		Если ТипЗнч(ВектРезУсловие) <> Тип("Массив")
			Или (ВектРезУсловие.Количество() = 1 И ВектРезУсловие[0].Количество() = 1)
			Или ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
			
			ВектРезУсловие = Неопределено;
		КонецЕсли;
		
		ПреобразованнаяФормула = РазложитьФормулуНаПодформулы(Формула, ВидыНеравенств);
		Если Не ВектРезУсловие = Неопределено Тогда 
			ПараметрыДляПроверки.КвоОшибокКС = 0;
			Попытка
				ВектРезФормула = ВекторныйРезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, ПреобразованнаяФормула, РазрядностьОкругления, ДопустимоеОтклонение, ВектРезУсловие);
				Если ТипЗнч(ВектРезФормула) <> Тип("Массив")
					Или ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
					
					ВектРезФормула = Неопределено;
				КонецЕсли;
			Исключение
				ВектРезФормула = Неопределено;
			КонецПопытки;
			
			Если ВектРезФормула <> Неопределено
				И ПараметрыДляПроверки.КвоОшибокКС = 0
				И ВектРезФормула.Количество() = ВектРезУсловие.Количество()
				И ВектРезФормула[0].Количество() = ВектРезУсловие[0].Количество() Тогда 
				
				Результат = Истина;
				Для Инд1 = 0 По ВектРезФормула.ВГраница() Цикл
					Для Инд2 = 0 По ВектРезФормула[0].ВГраница() Цикл
						Если ВектРезУсловие[Инд1][Инд2] Тогда 
							Результат = Результат И ВектРезФормула[Инд1][Инд2];
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		Если РезУсловие Тогда
			
			Попытка
				ПараметрыДляПроверки.КвоОшибокКС = 0;
				ВектРезФормула = ВекторныйРезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, Формула, РазрядностьОкругления, ДопустимоеОтклонение);
				Если ВектРезФормула <> Неопределено
					И ПараметрыДляПроверки.КвоОшибокКС = 0 Тогда 
					
					Результат = Истина;
					Для Инд1 = 0 По ВектРезФормула.ВГраница() Цикл
						Для Инд2 = 0 По ВектРезФормула[0].ВГраница() Цикл
							Результат = Результат И ВектРезФормула[Инд1][Инд2];
						КонецЦикла;
					КонецЦикла;
					
					Возврат Результат;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			ПараметрыДляПроверки.КвоОшибокКС = 0;
			РезФормула = РезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, ПреобразованнаяФормула, РазрядностьОкругления, ДопустимоеОтклонение);
			
			Если ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
				Возврат Истина;
			Иначе
				Возврат РезФормула;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМатрицу(КоличествоСтрок,КоличествоСтолбцов)
	Результат = Новый Массив(КоличествоСтолбцов);
	Для Инд =0 По КоличествоСтолбцов - 1 Цикл 
		Результат[Инд] = Новый Массив(КоличествоСтрок);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ВекторныйРезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, ТекстовоеПредставлениеВыражения, РазрядностьОкругления = 2, Допустимоетклонение = 0, МатрицаУсловий = Неопределено) Экспорт 
	
	ТекстовоеВыражение = СтрЗаменить(СтрЗаменить(СтрЗаменить(СокрЛП(ТекстовоеПредставлениеВыражения), " ", ""), Символы.НПП, ""), Символы.Таб, "");
	ТекстовоеВыражение = ВРег(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекстовоеВыражение, Символы.ПС, ""), Символы.ВК, ""), Символ(7), ""));
	
	ТаблицаЭлементов = Новый ТаблицаЗначений; // таблица содержит координаты ячеек таблицы и дополнительные параметры
	ТаблицаЭлементов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("СтрЗаменитель", Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("ТекущийПериод", Новый ОписаниеТипов("Булево"));
	ТаблицаЭлементов.Колонки.Добавить("ОператорСуммы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0))); // номер оператора суммирования
	ТаблицаЭлементов.Колонки.Добавить("Раздел",        Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Строки",        Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Графы",         Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Специфика1",    Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Специфика2",    Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Специфика3",    Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСтрок",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивГраф",    Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСпец1",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСпец2",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСпец3",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("ИндексЛогПодв", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0))); // индекс логического подвыражения
	ТаблицаЭлементов.Колонки.Добавить("СпособВывода",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0))); // способ вывода значений элемента
	ТаблицаЭлементов.Колонки.Добавить("ТаблЗначЭлем",  Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ВыделитьЭлементыИзСтрокиВыражения(ПараметрыДляПроверки, ТекстовоеВыражение, ТаблицаЭлементов);
	
	Если СтрНайти(ТекстовоеВыражение, "SUM") > 0 Тогда // есть оператор суммирования
		РегламентированнаяОтчетность.ОпределитьОбластьДействияОператораСуммы(ТекстовоеВыражение, ТаблицаЭлементов, ПараметрыДляПроверки.КвоОшибокКС);
	КонецЕсли;
	
	ПолучитьЗначенияОбластейЭлементов(ПараметрыДляПроверки, ТаблицаЭлементов, РазрядностьОкругления, ПараметрыДляПроверки.КвоОшибокКС);
	
	Если ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	РегламентированнаяОтчетность.ВыполнитьЗаменуФункцийЯзыкаКС(ТекстовоеВыражение);
	
	Если СтрНайти(ТекстовоеВыражение, "AND") > 0 ИЛИ СтрНайти(ТекстовоеВыражение, "OR") > 0 Тогда // есть логические предикаты
		ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "AND", ") И (");
		ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "OR", ") ИЛИ (");
		ТекстовоеВыражение = "(" + ТекстовоеВыражение + ")";
	КонецЕсли;
	
	ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "TRUE",  "Истина ");
	ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "FALSE", "Ложь ");
	
	Если СтрНайти(ТекстовоеВыражение, "&NP") > 0 Тогда // есть условие на период
		ВычислитьИЗаменитьУсловиеНаПериод(ПараметрыДляПроверки, ТекстовоеВыражение);
	КонецЕсли;
	
	ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "|", "");
	
	// Если нет логических предикатов в выражении - массив содержит всю строку выражения
	МассивПодвыражений = РегламентированнаяОтчетность.МассивЛогическихПодвыраженийВыделитьИНазначитьИндексВТаблице(ТекстовоеВыражение, ТаблицаЭлементов);
	ТекстовоеВыражениеИсходное = ТекстовоеВыражение;
	ИтоговыеМатрицы = Новый Массив(МассивПодвыражений.Количество());
	Для Инд = 0 По МассивПодвыражений.ВГраница() Цикл
		//@skip-warning
		СтрРезультатВычисления = ?(ВекторныйРезультатВычисленияЛогическогоПодвыражения(ПараметрыДляПроверки, 
				ИтоговыеМатрицы[Инд], 
				МассивПодвыражений[Инд], 
				ТаблицаЭлементов, 
				Инд, 
				ПараметрыДляПроверки.КвоОшибокКС), 
				"Истина", 
				"Ложь");
	КонецЦикла;
	
	Для Инд = 0 По МассивПодвыражений.ВГраница() Цикл
		Если ТипЗнч(ИтоговыеМатрицы[Инд]) <> Тип("Массив")
			Или ИтоговыеМатрицы[Инд].Количество() = 0
			Или ИтоговыеМатрицы[Инд].Количество() <> ИтоговыеМатрицы[0].Количество()
			Или ИтоговыеМатрицы[Инд][0].Количество() <> ИтоговыеМатрицы[0][0].Количество() Тогда 
			
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	МатрицаРезультата = ПолучитьМатрицу(ИтоговыеМатрицы[0][0].Количество(), ИтоговыеМатрицы[0].Количество());
	ПроверятьПоУсловию = Ложь;
	Если ТипЗнч(МатрицаУсловий) = Тип("Массив")
		И МатрицаУсловий.ВГраница() = МатрицаРезультата.ВГраница()
		И МатрицаУсловий[0].ВГраница() = МатрицаРезультата[0].ВГраница() Тогда 
		ПроверятьПоУсловию = Истина;
	КонецЕсли;
	
	Для Инд1 = 0 По МатрицаРезультата.ВГраница() Цикл
		Для Инд2 = 0 По МатрицаРезультата[0].ВГраница() Цикл
			ТекстовоеВыражение = ТекстовоеВыражениеИсходное;
			Для Инд = 0 По МассивПодвыражений.ВГраница() Цикл
				ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "~" + Формат(Инд, "ЧН=; ЧГ=") + "~", ИтоговыеМатрицы[Инд][Инд1][Инд2]);
			КонецЦикла;
			
			Если ПроверятьПоУсловию Тогда
				Если МатрицаУсловий[Инд1][Инд2] Тогда
					МатрицаРезультата[Инд1][Инд2] = Вычислить(ТекстовоеВыражение);
				Иначе
					МатрицаРезультата[Инд1][Инд2] = Истина;
				КонецЕсли;
			Иначе 
				МатрицаРезультата[Инд1][Инд2] = Вычислить(ТекстовоеВыражение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МатрицаРезультата;

КонецФункции

Функция ВекторныйРезультатВычисленияЛогическогоПодвыражения(ПараметрыДляПроверки, МатрицаРезультата, ШаблонВыражения, ТаблицаЭлементов, ИндексПодвыражения = 0, СчетчикОшибок = 0)
	
	Если НЕ ЗначениеЗаполнено(ШаблонВыражения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭлементыВыражения = ТаблицаЭлементов.НайтиСтроки(Новый Структура("ИндексЛогПодв", ИндексПодвыражения));
	Если ЭлементыВыражения.Количество() = 0 Тогда
		Возврат Вычислить(ШаблонВыражения);
	КонецЕсли;
	
	ИспользуетсяПредыдущийПериод = Ложь;
	
	ТекСтроки = "";
	ТекГрафы  = "";
	КоличествоСтрок = 1;
	КоличествоГраф  = 1;
	ОТЧ = Новый ОписаниеТипов("Число");
	
	Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл // первый цикл по свободным элементам
		Если ЭлементВыражения.ОператорСуммы = 0 Тогда // элемент выражения не входит в оператор суммы
			
			Если ЭлементВыражения.МассивСтрок.Количество() > 1 И ЭлементВыражения.МассивГраф.Количество() > 1 Тогда
				Если ТекГрафы  = "" Тогда
					ТекГрафы  = ЭлементВыражения.Графы;
				КонецЕсли;
				Если ТекСтроки = "" Тогда
					ТекСтроки = ЭлементВыражения.Строки;
				КонецЕсли;
				Если (КоличествоСтрок > 1 И ТекСтроки <> ЭлементВыражения.Строки)
					ИЛИ (КоличествоГраф > 1  И ТекГрафы  <> ЭлементВыражения.Графы) Тогда
					СчетчикОшибок = СчетчикОшибок + 1;
					Возврат Истина;
				КонецЕсли;
				ЭлементВыражения.СпособВывода = 3; // разворачивать элемент по строкам и столбцам
				КоличествоСтрок = ЭлементВыражения.МассивСтрок.Количество();
				КоличествоГраф  = ЭлементВыражения.МассивГраф.Количество();
			ИначеЕсли ЭлементВыражения.МассивГраф.Количество() > 1 Тогда
				Если ТекГрафы  = "" Тогда
					ТекГрафы  = ЭлементВыражения.Графы;
				КонецЕсли;
				Если КоличествоГраф > 1 И ТекГрафы <> ЭлементВыражения.Графы Тогда
					СчетчикОшибок = СчетчикОшибок + 1;
					Возврат Истина;
				КонецЕсли;
				ЭлементВыражения.СпособВывода = 2; // разворачивать элемент по графам
				КоличествоГраф  = ЭлементВыражения.МассивГраф.Количество();
			ИначеЕсли ЭлементВыражения.МассивСтрок.Количество() > 1 Тогда
				Если ТекСтроки = "" Тогда
					ТекСтроки = ЭлементВыражения.Строки;
				КонецЕсли;
				Если КоличествоСтрок > 1 И ТекСтроки <> ЭлементВыражения.Строки Тогда
					СчетчикОшибок = СчетчикОшибок + 1;
					Возврат Истина;
				КонецЕсли;
				ЭлементВыражения.СпособВывода = 1; // разворачивать элемент по строкам
				КоличествоСтрок = ЭлементВыражения.МассивСтрок.Количество();
			ИначеЕсли ЭлементВыражения.МассивСтрок.Количество() = 1 Тогда 
				ЧислоСтр = ОТЧ.ПривестиЗначение(ЭлементВыражения.МассивСтрок[0]);
				Если ЧислоСтр = 0 Или ЭлементВыражения.ТаблЗначЭлем.НайтиСтроки(Новый Структура("КодСтроки", ЧислоСтр)).Количество() <= 1 Тогда 
					ЭлементВыражения.СпособВывода = 0;
				Иначе
					ЭлементВыражения.СпособВывода = 5;
				КонецЕсли;
			Иначе 
				ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
			КонецЕсли
			
		КонецЕсли;
		Если НЕ ЭлементВыражения.ТекущийПериод Тогда
			ИспользуетсяПредыдущийПериод = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользуетсяПредыдущийПериод Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл // второй цикл по элементам, входящим в операторы суммы
		Если ЭлементВыражения.ОператорСуммы > 0 Тогда // элемент выражения входит в оператор суммы
			
			Если КоличествоСтрок > 1 И КоличествоГраф > 1 Тогда
				Если ТекГрафы = ЭлементВыражения.Графы И ТекСтроки = ЭлементВыражения.Строки Тогда
					ЭлементВыражения.СпособВывода = 3; // разворачивать элемент по строкам и графам
				ИначеЕсли ТекГрафы = ЭлементВыражения.Графы Тогда
					ЭлементВыражения.СпособВывода = 2; // разворачивать элемент по графам
				ИначеЕсли ТекСтроки = ЭлементВыражения.Строки Тогда
					ЭлементВыражения.СпособВывода = 1; // разворачивать элемент по строкам
				Иначе
					ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
				КонецЕсли;
			ИначеЕсли КоличествоГраф > 1 Тогда
				Если ТекГрафы = ЭлементВыражения.Графы Тогда
					ЭлементВыражения.СпособВывода = 2; // разворачивать элемент по графам
				Иначе
					ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
				КонецЕсли;
			ИначеЕсли КоличествоСтрок > 1 Тогда
				Если ТекСтроки = ЭлементВыражения.Строки Тогда
					ЭлементВыражения.СпособВывода = 1; // разворачивать элемент по строкам
				Иначе
					ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
				КонецЕсли;
			Иначе
				ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
			КонецЕсли
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементВыражения.СпособВывода = 5 Тогда
		Строки = ЭлементВыражения.ТаблЗначЭлем.НайтиСтроки(Новый Структура("КодСтроки", ОТЧ.ПривестиЗначение(ЭлементВыражения.МассивСтрок[0])));
		КоличествоСтрок = Строки.Количество();
		МатрицаРезультата = ПолучитьМатрицу(КоличествоГраф, КоличествоСтрок);
		Для ИндСтроки = 1 По КоличествоСтрок Цикл
			Для ИндГрафы = 1 По КоличествоГраф Цикл
				
				ВычисляемоеВыражение = ШаблонВыражения;
				Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл
					СтрЗначениеПоказателя = Формат(РегламентированнаяОтчетность.ЗначениеПоказателяИзТаблицы(ЭлементВыражения, ИндСтроки, ИндГрафы), "ЧРД=.; ЧН=; ЧГ=");
					ВычисляемоеВыражение = СтрЗаменить(ВычисляемоеВыражение, ЭлементВыражения.СтрЗаменитель, СтрЗначениеПоказателя);
				КонецЦикла;
				МатрицаРезультата[ИндСтроки - 1][ИндГрафы-1] = ВычисляемоеВыражение;
			КонецЦикла;
		КонецЦикла;
		
		Возврат Истина;
	КонецЕсли;
	
	Если КоличествоГраф = 1 И КоличествоСтрок = 1 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	МатрицаРезультата = ПолучитьМатрицу(КоличествоГраф, КоличествоСтрок);
	
	Для ИндСтроки = 1 По КоличествоСтрок Цикл
		Для ИндГрафы = 1 По КоличествоГраф Цикл
			
			ВычисляемоеВыражение = ШаблонВыражения;
			Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл
				СтрЗначениеПоказателя = Формат(РегламентированнаяОтчетность.ЗначениеПоказателяИзТаблицы(ЭлементВыражения, ИндСтроки, ИндГрафы), "ЧРД=.; ЧН=; ЧГ=");
				ВычисляемоеВыражение = СтрЗаменить(ВычисляемоеВыражение, ЭлементВыражения.СтрЗаменитель, СтрЗначениеПоказателя);
			КонецЦикла;
			МатрицаРезультата[ИндСтроки - 1][ИндГрафы-1] = ВычисляемоеВыражение;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция РезультатВычисленияВыраженияИзСтроки(ПараметрыДляПроверки, ТекстовоеПредставлениеВыражения, РазрядностьОкругления = 2, ДопустимоеОтклонение = 0) Экспорт 
	
	ТекстовоеВыражение = СтрЗаменить(СтрЗаменить(СтрЗаменить(СокрЛП(ТекстовоеПредставлениеВыражения), " ", ""), Символы.НПП, ""), Символы.Таб, "");
	ТекстовоеВыражение = ВРег(СтрЗаменить(СтрЗаменить(СтрЗаменить(ТекстовоеВыражение, Символы.ПС, ""), Символы.ВК, ""), Символ(7), ""));
	
	ТаблицаЭлементов = Новый ТаблицаЗначений; // таблица содержит координаты ячеек таблицы и дополнительные параметры
	ТаблицаЭлементов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("СтрЗаменитель", Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("ТекущийПериод", Новый ОписаниеТипов("Булево"));
	ТаблицаЭлементов.Колонки.Добавить("ОператорСуммы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0))); // номер оператора суммирования
	ТаблицаЭлементов.Колонки.Добавить("Раздел",        Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Строки",        Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Графы",         Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Специфика1",    Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Специфика2",    Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("Специфика3",    Новый ОписаниеТипов("Строка"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСтрок",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивГраф",    Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСпец1",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСпец2",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("МассивСпец3",   Новый ОписаниеТипов("Массив"));
	ТаблицаЭлементов.Колонки.Добавить("ИндексЛогПодв", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0))); // индекс логического подвыражения
	ТаблицаЭлементов.Колонки.Добавить("СпособВывода",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0))); // способ вывода значений элемента
	ТаблицаЭлементов.Колонки.Добавить("ТаблЗначЭлем",  Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ВыделитьЭлементыИзСтрокиВыражения(ПараметрыДляПроверки, ТекстовоеВыражение, ТаблицаЭлементов);
	
	Если СтрНайти(ТекстовоеВыражение, "SUM") > 0 Тогда // есть оператор суммирования
		ОпределитьОбластьДействияОператораСуммы(ТекстовоеВыражение, ТаблицаЭлементов, ПараметрыДляПроверки.КвоОшибокКС);
	КонецЕсли;
	
	ПолучитьЗначенияОбластейЭлементов(ПараметрыДляПроверки, ТаблицаЭлементов, РазрядностьОкругления, ПараметрыДляПроверки.КвоОшибокКС);
	
	Если ПараметрыДляПроверки.КвоОшибокКС > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	ВыполнитьЗаменуФункцийЯзыкаКС(ТекстовоеВыражение);
	
	Если СтрНайти(ТекстовоеВыражение, "AND") > 0 ИЛИ СтрНайти(ТекстовоеВыражение, "OR") > 0 Тогда // есть логические предикаты
		ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "AND", ") И (");
		ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "OR", ") ИЛИ (");
		ТекстовоеВыражение = "(" + ТекстовоеВыражение + ")";
	КонецЕсли;
	
	ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "TRUE",  "Истина ");
	ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "FALSE", "Ложь ");
	
	Если СтрНайти(ТекстовоеВыражение, "&NP") > 0 Тогда // есть условие на период
		ВычислитьИЗаменитьУсловиеНаПериод(ПараметрыДляПроверки, ТекстовоеВыражение);
	КонецЕсли;
	
	ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "|", "");
	
	// Если нет логических предикатов в выражении - массив содержит всю строку выражения
	МассивПодвыражений = МассивЛогическихПодвыраженийВыделитьИНазначитьИндексВТаблице(ТекстовоеВыражение, ТаблицаЭлементов);
	Для Инд = 0 По МассивПодвыражений.ВГраница() Цикл
		СтрРезультатВычисления = ?(РезультатВычисленияЛогическогоПодвыражения(ПараметрыДляПроверки, МассивПодвыражений[Инд], ТаблицаЭлементов, Инд, ПараметрыДляПроверки.КвоОшибокКС), "Истина", "Ложь");
		ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, "~" + Формат(Инд, "ЧН=; ЧГ=") + "~", СтрРезультатВычисления);
	КонецЦикла;
	
	Возврат Вычислить(ТекстовоеВыражение);
	
КонецФункции

Процедура ВыделитьЭлементыИзСтрокиВыражения(ПараметрыДляПроверки, ТекстовоеВыражение, ТаблицаЭлементов);
	
	ОгрЛ = "{";
	ОгрП = "}";
	
	ТекущийПериод = Истина;
	НачалоЭлемента = Ложь;
	
	ВремВыражение  = "";
	ТекущийЭлемент = "";
	
	Для Инд = 1 По СтрДлина(ТекстовоеВыражение) Цикл
		
		СтрСимв = Сред(ТекстовоеВыражение, Инд, 1);
		
		Если СтрСимв = ОгрЛ Тогда
			
			Если НачалоЭлемента Тогда // второй разделитель - предыдущий период
				ТекущийПериод = Ложь;
			КонецЕсли;
			
			НачалоЭлемента = Истина;
			ТекущийЭлемент = "";
			Продолжить;
			
		ИначеЕсли СтрСимв = ОгрП Тогда
			
			Если НачалоЭлемента Тогда // добавим элемент в таблицу
				
				СтрокаЭлемента = ТаблицаЭлементов.Добавить();
				СтрокаЭлемента.Представление = ТекущийЭлемент;
				СтрокаЭлемента.СтрЗаменитель = "%" + Формат(ТаблицаЭлементов.Количество(), "ЧГ=") + "%";
				СтрокаЭлемента.ТекущийПериод = ТекущийПериод;
				СтрокаЭлемента.ОператорСуммы = 0;
				
				ЗаполнитьЗначенияСвойств(СтрокаЭлемента, СтруктураСоставляющихЭлемента(ТекущийЭлемент));
				
				СтрокаЭлемента.МассивСтрок  = МассивЗначенийИзСтрСпискаИДиапазонов(СтрокаЭлемента.Строки, , , ПараметрыДляПроверки.КвоОшибокКС);
				СтрокаЭлемента.МассивГраф   = МассивЗначенийИзСтрСпискаИДиапазонов(СтрокаЭлемента.Графы , , , ПараметрыДляПроверки.КвоОшибокКС);
				СтрокаЭлемента.МассивСпец1  = МассивЗначенийИзСтрСпискаИДиапазонов(СтрокаЭлемента.Специфика1, , Ложь, ПараметрыДляПроверки.КвоОшибокКС);
				СтрокаЭлемента.МассивСпец2  = МассивЗначенийИзСтрСпискаИДиапазонов(СтрокаЭлемента.Специфика2, , Ложь, ПараметрыДляПроверки.КвоОшибокКС);
				СтрокаЭлемента.МассивСпец3  = МассивЗначенийИзСтрСпискаИДиапазонов(СтрокаЭлемента.Специфика3, , Ложь, ПараметрыДляПроверки.КвоОшибокКС);
				
				ВремВыражение = ВремВыражение + СтрокаЭлемента.СтрЗаменитель;
				
			КонецЕсли;
			
			ТекущийПериод = Истина;
			НачалоЭлемента = Ложь;
			Продолжить;
			
		КонецЕсли;
		
		Если НачалоЭлемента Тогда
			ТекущийЭлемент = ТекущийЭлемент + СтрСимв;
			Продолжить;
		КонецЕсли;
		
		ВремВыражение = ВремВыражение + СтрСимв;
		
	КонецЦикла;
	
	ТекстовоеВыражение = ВремВыражение;
	
КонецПроцедуры

Процедура ОпределитьОбластьДействияОператораСуммы(ТекстовоеВыражение, ТаблицаЭлементов, СчетчикОшибок = 0) Экспорт 
	
	ОП = "SUM";
	
	ОбработанноеВыражение = "";
	
	НомерОператораСуммы = 0;
	ВремВыражение = ТекстовоеВыражение;
	
	Поз = СтрНайти(ВремВыражение, ОП);
	Пока Поз > 0 Цикл
		
		НомерОператораСуммы = НомерОператораСуммы + 1;
		
		ОбработанноеВыражение = ОбработанноеВыражение + Лев(ВремВыражение, Поз - 1);
		
		ВремВыражение = Сред(ВремВыражение, Поз + СтрДлина(ОП));
		
		Если Лев(ВремВыражение, 1) = "%" Тогда // элемент
			СтрЗаменитель = Лев(ВремВыражение, СтрНайти(Сред(ВремВыражение, 2), "%") + 1);
			СтрокиЭлементов = ТаблицаЭлементов.НайтиСтроки(Новый Структура("СтрЗаменитель", СтрЗаменитель));
			Если СтрокиЭлементов.Количество() > 0 Тогда
				СтрокиЭлементов[0].ОператорСуммы = НомерОператораСуммы;
			Иначе
				СчетчикОшибок = СчетчикОшибок + 1;
			КонецЕсли;
		Иначе // выражение или функция
			КвоОткрытыхСкобок = 0;
			ВключенСчетчикСкобок = Ложь;
			Для Инд = 1 По СтрДлина(ВремВыражение) Цикл
				СтрСим = Сред(ВремВыражение, Инд, 1);
				Если СтрСим = "(" Тогда // начинаем считать скобки
					ВключенСчетчикСкобок = Истина;
					КвоОткрытыхСкобок = КвоОткрытыхСкобок + 1;
				ИначеЕсли СтрСим = ")" Тогда
					Если НЕ ВключенСчетчикСкобок Тогда
						СчетчикОшибок = СчетчикОшибок + 1;
						Прервать;
					КонецЕсли;
					КвоОткрытыхСкобок = КвоОткрытыхСкобок - 1;
				КонецЕсли;
				Если ВключенСчетчикСкобок И КвоОткрытыхСкобок = 0 Тогда
					Для каждого СтрокаЭлемента Из ТаблицаЭлементов Цикл
						ОбластьДействияОператораСуммы = Лев(ВремВыражение, Инд);
						Если СтрНайти(ОбластьДействияОператораСуммы, СтрокаЭлемента.СтрЗаменитель) > 0 Тогда
							СтрокаЭлемента.ОператорСуммы = НомерОператораСуммы;
						КонецЕсли;
					КонецЦикла;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Поз = СтрНайти(ВремВыражение, ОП);
		
		Если Поз = 0 Тогда
			ОбработанноеВыражение = ОбработанноеВыражение + ВремВыражение;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстовоеВыражение = ОбработанноеВыражение;
	
КонецПроцедуры

Процедура ПолучитьЗначенияОбластейЭлементов(ПараметрыДляПроверки, ТаблицаЭлементов, РазрядностьОкругления, СчетчикОшибок = 0)
	
	Для каждого СтрокаЭлемента Из ТаблицаЭлементов Цикл
		
		ИдЭлементаФормыРаздела = ИдентификаторЭлементаСпискаФормПоПредставлению(ПараметрыДляПроверки, "Раздел" + СтрокаЭлемента.Раздел);
		Если ИдЭлементаФормыРаздела = Неопределено Тогда
			СчетчикОшибок = СчетчикОшибок + 1;
			Возврат;
		КонецЕсли;
		Если СтрокаЭлемента.МассивСтрок.Количество() = 0 ИЛИ СтрокаЭлемента.МассивГраф.Количество() = 0 Тогда
			СчетчикОшибок = СчетчикОшибок + 1;
			Возврат;
		КонецЕсли;
		
		ТаблДокФормыРаздела = ПараметрыДляПроверки.СтруктураРеквизитовФормы.СписокФормРазделов.НайтиПоИдентификатору(ИдЭлементаФормыРаздела).Значение;
		СписокПараметровГраф = Неопределено;
		ПараметрыДляПроверки.ПараметрыГрафРазделов.Свойство("Раздел" + СтрокаЭлемента.Раздел, СписокПараметровГраф);
		Если СписокПараметровГраф = Неопределено Тогда
			СчетчикОшибок = СчетчикОшибок + 1;
			Возврат;
		КонецЕсли;
		
		МассивГраф = Новый Массив;
		СтруктураСпецифик = Новый Структура("s1, s2, s3", "", "" , "");
		Для каждого ЭлементСпискаПараметровГраф Из СписокПараметровГраф Цикл
			НаборПараметров = ЭлементСпискаПараметровГраф.Значение;
			Если СтрНайти(ВРег(НаборПараметров["type"]), "Z") > 0 Тогда
				МассивГраф.Добавить(НаборПараметров["code"]);
			ИначеЕсли СтрНайти(ВРег(НаборПараметров["type"]), "S") > 0 Тогда
				Если НРег(НаборПараметров["fld"]) = "s1" Тогда
					СтруктураСпецифик["s1"] = НаборПараметров["code"];
				ИначеЕсли НРег(НаборПараметров["fld"]) = "s2" Тогда
					СтруктураСпецифик["s2"] = НаборПараметров["code"];
				ИначеЕсли НРег(НаборПараметров["fld"]) = "s3" Тогда
					СтруктураСпецифик["s3"] = НаборПараметров["code"];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаЭлемента.МассивСтрок[0] = "*" Тогда
			СтрокаЭлемента.МассивСтрок.Очистить();
			Для НомСтрокиТабл = 6 По ТаблДокФормыРаздела.ВысотаТаблицы Цикл
				ИмяЯчейки = ТаблДокФормыРаздела.Область(НомСтрокиТабл, 3, НомСтрокиТабл, 3).Имя;
				Если Лев(ИмяЯчейки, 2) <> "ПО" И Лев(ИмяЯчейки, 2) <> "ПМ" Тогда
					Продолжить;
				КонецЕсли;
				НомерСтроки = 0;
				ИмяПоказателя = ИмяПоказателяБезИндексаИСоставляющиеАдреса(ИмяЯчейки, , , Истина, , НомерСтроки);
				СтрНомерСтроки = Формат(НомерСтроки, "ЧН=; ЧГ=");
				Если СтрокаЭлемента.МассивСтрок.Найти(СтрНомерСтроки) = Неопределено Тогда
					СтрокаЭлемента.МассивСтрок.Добавить(СтрНомерСтроки);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СтрокаЭлемента.МассивГраф[0] = "*" Тогда
			СтрокаЭлемента.МассивГраф = МассивГраф;
		КонецЕсли;
		МаксИнд = СтрокаЭлемента.МассивГраф.ВГраница();
		Для Инд = 0 По МаксИнд Цикл
			ОбрИнд = МаксИнд - Инд;
			Если МассивГраф.Найти(СтрокаЭлемента.МассивГраф[ОбрИнд]) = Неопределено Тогда
				СтрокаЭлемента.МассивГраф.Удалить(ОбрИнд);
			КонецЕсли;
		КонецЦикла;
		Если СтрокаЭлемента.МассивГраф.Количество() = 0 Тогда
			СчетчикОшибок = СчетчикОшибок + 1;
			Возврат;
		КонецЕсли;
		
		ЗначенияОбластей = Новый ТаблицаЗначений;
		ЗначенияОбластей.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5,0)));
		ЗначенияОбластей.Колонки.Добавить("ИндСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
		Для каждого НомерГрафы Из СтрокаЭлемента.МассивГраф Цикл
			Если НомерГрафы = "*" Тогда
				Прервать;
			КонецЕсли;
			ЗначенияОбластей.Колонки.Добавить("Графа" + НомерГрафы);
		КонецЦикла;
		ЗначенияОбластей.Колонки.Добавить("Сумма");
		
		КодРаздела = ЧислоИзСтроки(СтрокаЭлемента.Раздел);
		
		ЕстьКлючевыеПоля = НЕ ПустаяСтрока(СтруктураСпецифик["s1"] + СтруктураСпецифик["s2"] + СтруктураСпецифик["s3"]);
		МассивКлючевыхПолей = Новый Массив;
		Если ЕстьКлючевыеПоля Тогда
			Для каждого ЭлементСтруктуры Из СтруктураСпецифик Цикл
				Если ЗначениеЗаполнено(ЭлементСтруктуры.Значение) Тогда
					МассивКлючевыхПолей.Добавить(ЭлементСтруктуры.Ключ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СдвигГраницы = 0;
		МаксИнд = СтрокаЭлемента.МассивСтрок.ВГраница();
		Для Инд = 0 По МаксИнд Цикл
			ИндСтр = СдвигГраницы + Инд;
			СтрКодСтроки = СтрокаЭлемента.МассивСтрок[ИндСтр];
			Если СтрКодСтроки = "*" Тогда
				Прервать;
			КонецЕсли;
			
			КодСтроки = ЧислоИзСтроки(СтрКодСтроки);
			
			Многострочность = Ложь;
			ИмяОбласти = ИмяПоказателяЯчейки(КодРаздела, КодСтроки, СтрокаЭлемента.МассивГраф[0]);
			ИмяМнОбласти = ИмяПоказателяЯчейки(КодРаздела, КодСтроки, СтрокаЭлемента.МассивГраф[0], Истина);
			Если ТаблДокФормыРаздела.Области.Найти(ИмяОбласти) <> Неопределено Тогда
				Многострочность = Ложь;
			ИначеЕсли ТаблДокФормыРаздела.Области.Найти(ИмяМнОбласти + "_1") <> Неопределено Тогда
				ИмяОбласти = ИмяМнОбласти;
				Многострочность = Истина;
			Иначе
				СтрокаЭлемента.МассивСтрок.Удалить(ИндСтр);
				СдвигГраницы = СдвигГраницы - 1;
				Продолжить;
			КонецЕсли;
			
			ИндексСтроки = 1;
			Пока ИндексСтроки = 1 ИЛИ ТаблДокФормыРаздела.Области.Найти(ИмяОбласти + "_" + Формат(ИндексСтроки, "ЧГ=")) <> Неопределено Цикл
				
				Если ЕстьКлючевыеПоля Тогда
					УдовлетворяетУсловиям = Истина;
					Для каждого ИмяКлючевогоПоля Из МассивКлючевыхПолей Цикл
						Если ИмяКлючевогоПоля = "s3" Тогда
							МассивСпецифик = СтрокаЭлемента.МассивСпец3;
						ИначеЕсли ИмяКлючевогоПоля = "s2" Тогда
							МассивСпецифик = СтрокаЭлемента.МассивСпец2;
						Иначе
							МассивСпецифик = СтрокаЭлемента.МассивСпец1;
						КонецЕсли;
						КодГрафыСпец = СтруктураСпецифик[ИмяКлючевогоПоля];
						ИмяПоказателя = ИмяПоказателяЯчейки(КодРаздела, КодСтроки, КодГрафыСпец, Многострочность);
						ЗначениеСпецифики = ТаблДокФормыРаздела.Области[ИмяПоказателя + ?(Многострочность, "_" + Формат(ИндексСтроки, "ЧГ="), "")].Значение;
						Результат = РезультатПроверкиЗначенияСпецифики(ЗначениеСпецифики, МассивСпецифик);
						Если НЕ Результат И Многострочность Тогда
							УдовлетворяетУсловиям = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если НЕ УдовлетворяетУсловиям Тогда
						ИндексСтроки = ИндексСтроки + 1;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				СтрокаЗначений = ЗначенияОбластей.Добавить();
				СтрокаЗначений.КодСтроки = КодСтроки;
				СтрокаЗначений.ИндСтроки = ?(Многострочность, ИндексСтроки, 0);
				СуммаПоГрафам = 0;
				Для ИндГрф = 0 По СтрокаЭлемента.МассивГраф.ВГраница() Цикл
					КодГрафы = СтрокаЭлемента.МассивГраф[ИндГрф];
					Если КодГрафы = "*" Тогда
						Прервать;
					КонецЕсли;
					ИмяПоказателя = ИмяПоказателяЯчейки(КодРаздела, КодСтроки, КодГрафы, Многострочность);
					ЗначениеПоказателя = ТаблДокФормыРаздела.Области[ИмяПоказателя + ?(Многострочность, "_" + Формат(ИндексСтроки, "ЧГ="), "")].Значение;
					Если НЕ ТипЗнч(ЗначениеПоказателя) = Тип("Число") Тогда
						ЗначениеПоказателя = ЧислоИзСтроки(ЗначениеПоказателя);
					КонецЕсли;
					ЗначениеПоказателя = Окр(ЗначениеПоказателя, РазрядностьОкругления);
					СуммаПоГрафам = СуммаПоГрафам + ЗначениеПоказателя;
					СтрокаЗначений["Графа" + КодГрафы] = ЗначениеПоказателя;
				КонецЦикла;
				СтрокаЗначений.Сумма = СуммаПоГрафам;
				
				ИндексСтроки = ИндексСтроки + 1;
				
			КонецЦикла;
		КонецЦикла;
		
		СтрокаЗначений = ЗначенияОбластей.Добавить();
		СтрокаЗначений.КодСтроки = 0;
		СтрокаЗначений.ИндСтроки = 0;
		Для ИндГрф = 0 По СтрокаЭлемента.МассивГраф.ВГраница() Цикл
			КодГрафы = СтрокаЭлемента.МассивГраф[ИндГрф];
			Если КодГрафы = "*" Тогда
				Прервать;
			КонецЕсли;
			СтрокаЗначений["Графа" + КодГрафы] = ЗначенияОбластей.Итог("Графа" + КодГрафы);
		КонецЦикла;
		СтрокаЗначений["Сумма"] = ЗначенияОбластей.Итог("Сумма");
		
		СтрокаЭлемента.ТаблЗначЭлем = ЗначенияОбластей;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаменуФункцийЯзыкаКС(ТекстовоеВыражение) Экспорт 
	
	СоответствиеФункций = СоответствиеФункцийРеализациям();
	
	Для каждого ЭлементСоответствия Из СоответствиеФункций Цикл
		
		ТекстовоеВыражение = СтрЗаменить(ТекстовоеВыражение, ВРег(ЭлементСоответствия.Ключ), ЭлементСоответствия.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВычислитьИЗаменитьУсловиеНаПериод(ПараметрыДляПроверки, ТекстовоеВыражение)
	
	ОпрПериода = "&NP";
	
	ОбработанноеВыражение = "";
	
	ВремВыражение = ТекстовоеВыражение;
	
	Поз = СтрНайти(ВремВыражение, ОпрПериода);
	Пока Поз > 0 Цикл
		
		ОбработанноеВыражение = ОбработанноеВыражение + Лев(ВремВыражение, Поз - 1);
		
		ВремВыражение = Сред(ВремВыражение, Поз + СтрДлина(ОпрПериода));
		
		ПозКодаПериода = 0;
		ЛогОператор = "";
		Если      Лев(ВремВыражение, 2) = ">="
			ИЛИ Лев(ВремВыражение, 2) = "<="
			ИЛИ Лев(ВремВыражение, 2) = "<>" Тогда
			ПозКодаПериода = 3;
			ЛогОператор = Лев(ВремВыражение, 2);
		ИначеЕсли Лев(ВремВыражение, 1) = ">"
			ИЛИ Лев(ВремВыражение, 1) = "<"
			ИЛИ Лев(ВремВыражение, 1) = "="  Тогда
			ПозКодаПериода = 2;
			ЛогОператор = Лев(ВремВыражение, 1);
		ИначеЕсли Лев(ВремВыражение, 2) = "IN" Тогда
			ПозКодаПериода = 3;
			ЛогОператор = Лев(ВремВыражение, 2);
		Иначе
			КодНомераПериода = ПорядковыйНомерПериодаВГоду(ПараметрыДляПроверки.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, ПараметрыДляПроверки.СтруктураАтрибутовОтчета["idp"]);
			ОбработанноеВыражение = ОбработанноеВыражение + Формат(КодНомераПериода, "ЧГ=");
			Перейти ~ПоискСледующегоУсловияНаПериод;
		КонецЕсли;
		
		КодыПериодов = "";
		ПозПродолжения = 1;
		ФлагОтбора = 0;
		Для Инд = ПозКодаПериода По СтрДлина(ВремВыражение) Цикл
			ПозПродолжения = Инд + 1;
			Сим = Сред(ВремВыражение, Инд, 1);
			Если Сим = "(" Тогда
				ФлагОтбора = 1;
				Продолжить;
			ИначеЕсли Сим = ")" И ФлагОтбора = 1 Тогда
				Прервать;
			КонецЕсли;
			Если СтрНайти(",0123456789", Сим) > 0 Тогда
				Если ФлагОтбора = 0 Тогда
					ФлагОтбора = 2;
				КонецЕсли;
				КодыПериодов = КодыПериодов + Сим;
			ИначеЕсли ФлагОтбора > 0 Тогда
				ПозПродолжения = Инд;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОбработанноеВыражение = ОбработанноеВыражение + ?(РезультатУсловияНаПериод(ПараметрыДляПроверки, ЛогОператор, КодыПериодов), "Истина ", "Ложь ");
		
		ВремВыражение = Сред(ВремВыражение, ПозПродолжения);
		
		~ПоискСледующегоУсловияНаПериод:
		Поз = СтрНайти(ВремВыражение, ОпрПериода);
		
		Если Поз = 0 Тогда
			ОбработанноеВыражение = ОбработанноеВыражение + ВремВыражение;
		КонецЕсли;
		
	КонецЦикла;
	
	ТекстовоеВыражение = ОбработанноеВыражение;
	
Конецпроцедуры

Функция МассивЛогическихПодвыраженийВыделитьИНазначитьИндексВТаблице(ТекстовоеВыражение, ТаблицаЭлементов) Экспорт 
	
	РазделительИ = " И ";
	РазделительИЛИ = " ИЛИ ";
	
	ОбработанноеВыражение = "";
	
	МассивПодвыражений = Новый Массив;
	ВремВыражение = ТекстовоеВыражение;
	
	ПозИ = СтрНайти(ВремВыражение, РазделительИ);
	ПозИЛИ = СтрНайти(ВремВыражение, РазделительИЛИ);
	Если ПозИ + ПозИЛИ = 0 Тогда
		МассивПодвыражений.Добавить(ТекстовоеВыражение);
		ТекстовоеВыражение = "~0~";
		Возврат МассивПодвыражений;
	КонецЕсли;
	
	Поз = ?(ПозИ > 0 И ПозИЛИ > 0, Мин(ПозИ, ПозИЛИ), ПозИ + ПозИЛИ);
	Пока Поз > 0 Цикл
		
		МассивПодвыражений.Добавить(ПодвыражениеИзСтроки(Лев(ВремВыражение, Поз - 1)));
		ОбработанноеВыражение = ОбработанноеВыражение + "~" + Формат(МассивПодвыражений.ВГраница(), "ЧН=; ЧГ=") + "~";
		Если Поз = ПозИ Тогда
			ВремВыражение = Сред(ВремВыражение, Поз + СтрДлина(РазделительИ));
			ОбработанноеВыражение = ОбработанноеВыражение + РазделительИ;
		Иначе
			ВремВыражение = Сред(ВремВыражение, Поз + СтрДлина(РазделительИЛИ));
			ОбработанноеВыражение = ОбработанноеВыражение + РазделительИЛИ;
		КонецЕсли;
		
		ПозИ = СтрНайти(ВремВыражение, РазделительИ);
		ПозИЛИ = СтрНайти(ВремВыражение, РазделительИЛИ);
		Поз = ?(ПозИ > 0 И ПозИЛИ > 0, Мин(ПозИ, ПозИЛИ), ПозИ + ПозИЛИ);
		
		Если Поз = 0 Тогда
			МассивПодвыражений.Добавить(ПодвыражениеИзСтроки(ВремВыражение, , Ложь));
			ОбработанноеВыражение = ОбработанноеВыражение + "~" + Формат(МассивПодвыражений.ВГраница(), "ЧН=; ЧГ=") + "~";
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаЭлемент Из ТаблицаЭлементов Цикл
		Для Инд = 0 По МассивПодвыражений.ВГраница() Цикл
			Если СтрНайти(МассивПодвыражений[Инд], СтрокаЭлемент.СтрЗаменитель) > 0 Тогда
				СтрокаЭлемент.ИндексЛогПодв = Инд;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТекстовоеВыражение = ОбработанноеВыражение;
	
	Возврат МассивПодвыражений;
	
КонецФункции

Функция РезультатВычисленияЛогическогоПодвыражения(ПараметрыДляПроверки, ШаблонВыражения, ТаблицаЭлементов, ИндексПодвыражения = 0, СчетчикОшибок = 0)
	
	Если НЕ ЗначениеЗаполнено(ШаблонВыражения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭлементыВыражения = ТаблицаЭлементов.НайтиСтроки(Новый Структура("ИндексЛогПодв", ИндексПодвыражения));
	Если ЭлементыВыражения.Количество() = 0 Тогда
		Возврат Вычислить(ШаблонВыражения);
	КонецЕсли;
	
	ИспользуетсяПредыдущийПериод = Ложь;
	
	ТекСтроки = "";
	ТекГрафы  = "";
	КоличествоСтрок = 1;
	КоличествоГраф  = 1;
	
	Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл // первый цикл по свободным элементам
		Если ЭлементВыражения.ОператорСуммы = 0 Тогда // элемент выражения не входит в оператор суммы
			
			Если ЭлементВыражения.МассивСтрок.Количество() > 1 И ЭлементВыражения.МассивГраф.Количество() > 1 Тогда
				Если ТекГрафы  = "" Тогда
					ТекГрафы  = ЭлементВыражения.Графы;
				КонецЕсли;
				Если ТекСтроки = "" Тогда
					ТекСтроки = ЭлементВыражения.Строки;
				КонецЕсли;
				Если (КоличествоСтрок > 1 И ТекСтроки <> ЭлементВыражения.Строки)
					ИЛИ (КоличествоГраф > 1  И ТекГрафы  <> ЭлементВыражения.Графы) Тогда
					СчетчикОшибок = СчетчикОшибок + 1;
					Возврат Истина;
				КонецЕсли;
				ЭлементВыражения.СпособВывода = 3; // разворачивать элемент по строкам и столбцам
				КоличествоСтрок = ЭлементВыражения.МассивСтрок.Количество();
				КоличествоГраф  = ЭлементВыражения.МассивГраф.Количество();
			ИначеЕсли ЭлементВыражения.МассивГраф.Количество() > 1 Тогда
				Если ТекГрафы  = "" Тогда
					ТекГрафы  = ЭлементВыражения.Графы;
				КонецЕсли;
				Если КоличествоГраф > 1 И ТекГрафы <> ЭлементВыражения.Графы Тогда
					СчетчикОшибок = СчетчикОшибок + 1;
					Возврат Истина;
				КонецЕсли;
				ЭлементВыражения.СпособВывода = 2; // разворачивать элемент по графам
				КоличествоГраф  = ЭлементВыражения.МассивГраф.Количество();
			ИначеЕсли ЭлементВыражения.МассивСтрок.Количество() > 1 Тогда
				Если ТекСтроки = "" Тогда
					ТекСтроки = ЭлементВыражения.Строки;
				КонецЕсли;
				Если КоличествоСтрок > 1 И ТекСтроки <> ЭлементВыражения.Строки Тогда
					СчетчикОшибок = СчетчикОшибок + 1;
					Возврат Истина;
				КонецЕсли;
				ЭлементВыражения.СпособВывода = 1; // разворачивать элемент по строкам
				КоличествоСтрок = ЭлементВыражения.МассивСтрок.Количество();
			Иначе
				ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
			КонецЕсли
			
		КонецЕсли;
		Если НЕ ЭлементВыражения.ТекущийПериод Тогда
			ИспользуетсяПредыдущийПериод = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользуетсяПредыдущийПериод Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл // второй цикл по элементам, входящим в операторы суммы
		Если ЭлементВыражения.ОператорСуммы > 0 Тогда // элемент выражения входит в оператор суммы
			
			Если КоличествоСтрок > 1 И КоличествоГраф > 1 Тогда
				Если ТекГрафы = ЭлементВыражения.Графы И ТекСтроки = ЭлементВыражения.Строки Тогда
					ЭлементВыражения.СпособВывода = 3; // разворачивать элемент по строкам и графам
				ИначеЕсли ТекГрафы = ЭлементВыражения.Графы Тогда
					ЭлементВыражения.СпособВывода = 2; // разворачивать элемент по графам
				ИначеЕсли ТекСтроки = ЭлементВыражения.Строки Тогда
					ЭлементВыражения.СпособВывода = 1; // разворачивать элемент по строкам
				Иначе
					ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
				КонецЕсли;
			ИначеЕсли КоличествоГраф > 1 Тогда
				Если ТекГрафы = ЭлементВыражения.Графы Тогда
					ЭлементВыражения.СпособВывода = 2; // разворачивать элемент по графам
				Иначе
					ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
				КонецЕсли;
			ИначеЕсли КоличествоСтрок > 1 Тогда
				Если ТекСтроки = ЭлементВыражения.Строки Тогда
					ЭлементВыражения.СпособВывода = 1; // разворачивать элемент по строкам
				Иначе
					ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
				КонецЕсли;
			Иначе
				ЭлементВыражения.СпособВывода = 0; // не разворачивать - содержит единственное значение
			КонецЕсли
			
		КонецЕсли;
	КонецЦикла;
	
	Для ИндСтроки = 1 По КоличествоСтрок Цикл
		Для ИндГрафы = 1 По КоличествоГраф Цикл
			
			ВычисляемоеВыражение = ШаблонВыражения;
			Для каждого ЭлементВыражения Из ЭлементыВыражения Цикл
				СтрЗначениеПоказателя = Формат(ЗначениеПоказателяИзТаблицы(ЭлементВыражения, ИндСтроки, ИндГрафы), "ЧРД=.; ЧН=; ЧГ=");
				ВычисляемоеВыражение = СтрЗаменить(ВычисляемоеВыражение, ЭлементВыражения.СтрЗаменитель, СтрЗначениеПоказателя);
			КонецЦикла;
			
			РезультатВычисления = РезультатВычисленияЭлементарногоВыражения(ВычисляемоеВыражение, СчетчикОшибок);
			
			Если НЕ РезультатВычисления Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СтруктураСоставляющихЭлемента(Элемент) Экспорт 
	
	СтруктураРезультата = Новый Структура;
	
	ОгрЛ = "[";
	ОгрП = "]";
	
	НомерПоля   = 0;
	НачалоПоля  = Ложь;
	ТекущееПоле = "";
	
	Для Инд = 1 По СтрДлина(Элемент) Цикл
		
		СтрСимв = Сред(Элемент, Инд, 1);
		
		Если СтрСимв = ОгрЛ ИЛИ СтрСимв = ОгрП Тогда
			
			Если НачалоПоля Тогда
				
				НомерПоля = НомерПоля + 1;
				
				Если НомерПоля = 1 Тогда
					СтруктураРезультата.Вставить("Раздел",     ТекущееПоле);
				ИначеЕсли НомерПоля = 2 Тогда
					СтруктураРезультата.Вставить("Строки",     ТекущееПоле);
				ИначеЕсли НомерПоля = 3 Тогда
					СтруктураРезультата.Вставить("Графы",      ТекущееПоле);
				ИначеЕсли НомерПоля = 4 Тогда
					СтруктураРезультата.Вставить("Специфика1", ТекущееПоле);
				ИначеЕсли НомерПоля = 5 Тогда
					СтруктураРезультата.Вставить("Специфика2", ТекущееПоле);
				ИначеЕсли НомерПоля = 6 Тогда
					СтруктураРезультата.Вставить("Специфика3", ТекущееПоле);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрСимв = ОгрЛ Тогда
				ТекущееПоле = "";
				НачалоПоля = Истина;
			Иначе
				НачалоПоля = Ложь;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если НачалоПоля Тогда
			ТекущееПоле = ТекущееПоле + СтрСимв;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция МассивЗначенийИзСтрСпискаИДиапазонов(Стр, СтрРазделитель = ",", ИскатьДиапазон = Истина, СчетчикОшибок = 0) Экспорт 
	
	МассивРезультата = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Стр) Тогда
		Возврат МассивРезультата;
	КонецЕсли;
	
	МассивЗначений = РегламентированнаяОтчетностьКлиентСервер.РазобратьСтрокуВМассивПоРазделителю(Стр, СтрРазделитель);
	
	Для каждого Значение Из МассивЗначений Цикл
		ПозРаздДиапазона = 0;
		Если ИскатьДиапазон Тогда
			ПозРаздДиапазона = СтрНайти(Значение, "-");
		КонецЕсли;
		Если ПозРаздДиапазона > 1 Тогда
			НачДиапазона = ЧислоИзСтроки(Лев(Значение, ПозРаздДиапазона - 1), СчетчикОшибок);
			КонДиапазона = ЧислоИзСтроки(Сред(Значение, ПозРаздДиапазона + 1), СчетчикОшибок);
			Если НачДиапазона < КонДиапазона Тогда
				КоличествоЗначений = 0;
				Для Зн = НачДиапазона По КонДиапазона Цикл
					МассивРезультата.Добавить(Формат(Зн, "ЧН=; ЧГ="));
					КоличествоЗначений = КоличествоЗначений + 1;
					Если КоличествоЗначений > 10000 Тогда
						МассивРезультата.Добавить("*");
						СчетчикОшибок = СчетчикОшибок + 1;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				МассивРезультата.Добавить(Формат(НачДиапазона, "ЧН=; ЧГ="));
			КонецЕсли;
		Иначе
			МассивРезультата.Добавить(СокрЛП(Значение));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивРезультата;
	
КонецФункции

Функция ИдентификаторЭлементаСпискаФормПоПредставлению(ПараметрыДляПроверки, ПредставлениеЭлемента);
	
	Если НЕ ЗначениеЗаполнено(ПредставлениеЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Для каждого ЭлементФормаРаздела Из ПараметрыДляПроверки.СтруктураРеквизитовФормы.СписокФормРазделов Цикл
		
		Если СокрЛП(ЭлементФормаРаздела.Представление) = СокрЛП(ПредставлениеЭлемента) Тогда
			
			Возврат ЭлементФормаРаздела.ПолучитьИдентификатор();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция РезультатУсловияНаПериод(ПараметрыДляПроверки, ЛогОператор, КодыПериодов)
	
	Если ПустаяСтрока(КодыПериодов) Тогда
		Возврат Истина;
	КонецЕсли;
	
	КодНомераПериода = ПорядковыйНомерПериодаВГоду(ПараметрыДляПроверки.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета, ПараметрыДляПроверки.СтруктураАтрибутовОтчета["idp"]);
	
	Если ЛогОператор = "IN" Тогда
		МассивКодовПериодов = РегламентированнаяОтчетностьКлиентСервер.РазобратьСтрокуВМассивПоРазделителю(КодыПериодов, ",");
		Для каждого СтрКодПериода Из МассивКодовПериодов Цикл
			Если КодНомераПериода = НомерПериодаИзСправочника(ПараметрыДляПроверки, СтрКодПериода) Тогда
				Возврат Истина;
			КонецЕсли;;
		КонецЦикла;
	Иначе
		Попытка
			Возврат Вычислить(Формат(КодНомераПериода, "ЧН=;ЧГ=") + ЛогОператор + Формат(НомерПериодаИзСправочника(ПараметрыДляПроверки, КодыПериодов), "ЧН=;ЧГ="));
		Исключение
			Возврат Ложь;
		КонецПопытки
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЧислоИзСтроки(Стр, СчетчикОшибок = 0) Экспорт 
	
	Если ЗначениеЗаполнено(Стр) Тогда
		
		Попытка
			Зн = Число(СокрЛП(СтрЗаменить(Стр, Символы.НПП, "")));
		Исключение
			Зн = 0;
			СчетчикОшибок = СчетчикОшибок + 1;
		КонецПопытки;
		
		Возврат Зн;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПодвыражениеИзСтроки(Стр, СтрОстаток = "", ВыделитьСлева = Истина) Экспорт 
	
	СкНач = ?(ВыделитьСлева, ")", "(");
	СкКон = ?(ВыделитьСлева, "(", ")");
	
	СчСк = 0;
	НачатСчет = Ложь;
	
	Для Инд = 1 По СтрДлина(Стр) Цикл
		НомСимв = ?(ВыделитьСлева, СтрДлина(Стр) - Инд + 1, Инд);
		СтрСим = Сред(Стр, НомСимв, 1);
		
		Если СтрСим = СкНач Тогда
			НачатСчет = Истина;
			СчСк = СчСк + 1;
		ИначеЕсли НачатСчет И СтрСим = СкКон Тогда
			СчСк = СчСк - 1;
		КонецЕсли;
		
		Если НачатСчет И СчСк = 0  Тогда
			СтрОстаток = ?(ВыделитьСлева, Лев(Стр, НомСимв - 1), Сред(Стр, НомСимв + 1));
			Возврат ?(ВыделитьСлева, Сред(Стр, НомСимв), Лев(Стр, НомСимв));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Стр;
	
КонецФункции

Функция ИмяПоказателяБезИндексаИСоставляющиеАдреса(ИмяПоказателя, ИндексПоказателя = 0, Многострочный = Ложь, ПолучитьСоставляющие = Ложь, НомерРаздела = 0, НомерСтроки = 0, КодКолонки = "");
	
	ИмяПоказателяБезИндекса = ИмяПоказателя;
	
	ИндексПоказателя = 0;
	Многострочный = Ложь;
	НомерРаздела = 0;
	НомерСтроки = 0;
	КодКолонки = "";
	
	Если Лев(ИмяПоказателя, 2) = "ПМ" ИЛИ Сред(ИмяПоказателя, 3, 2) = "ПМ" ИЛИ Сред(ИмяПоказателя, 4, 2) = "ПМ" Тогда
		Многострочный = Истина;
		ПозРазделителя = СтрНайти(ИмяПоказателя, "_");
		Если ПозРазделителя > 0 Тогда
			ИмяПоказателяБезИндекса = Лев(ИмяПоказателя, ПозРазделителя - 1);
			ИндексПоказателя = Число("0" + Сред(ИмяПоказателя, ПозРазделителя + 1));
		КонецЕсли;
	КонецЕсли;
	
	Если ПолучитьСоставляющие Тогда
		АдреснаяЧасть = "";
		Если Многострочный Тогда
			АдреснаяЧасть = Сред(ИмяПоказателяБезИндекса, СтрНайти(ИмяПоказателяБезИндекса, "ПМ") + 2);
		ИначеЕсли Лев(ИмяПоказателяБезИндекса, 2) = "ПО" ИЛИ Сред(ИмяПоказателя, 3, 2) = "ПО" Тогда
			АдреснаяЧасть = Сред(ИмяПоказателяБезИндекса, СтрНайти(ИмяПоказателяБезИндекса, "ПО") + 2);
		КонецЕсли;
		Если НЕ ПустаяСтрока(АдреснаяЧасть) Тогда
			Если Лев(АдреснаяЧасть, 1) = "s" Тогда
				ПозНомСтроки = СтрНайти(АдреснаяЧасть, "r");
				Если ПозНомСтроки > 0 Тогда
					НомерРаздела  = Число("0" + Сред(АдреснаяЧасть, 2, ПозНомСтроки - 2));
					АдреснаяЧасть = Сред(АдреснаяЧасть, ПозНомСтроки);
					ПозКодКолонки = СтрНайти(АдреснаяЧасть, "c");
					Если ПозКодКолонки > 0 Тогда
						НомерСтроки   = Число("0" + Сред(АдреснаяЧасть, 2, ПозКодКолонки - 2));
						КодКолонки    = Сред(АдреснаяЧасть, ПозНомСтроки + 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИмяПоказателяБезИндекса;
	
КонецФункции

Функция ИмяПоказателяЯчейки(КодРаздела, КодСтроки, КодКолонки, Многострочный = Ложь) Экспорт 
	
	Префикс = ?(Многострочный, "ПМ", "ПО");
	
	АдреснаяЧастьПоказателя = "s" + Формат(КодРаздела, "ЧЦ=5; ЧН=; ЧГ=")
	+ "r" + Формат(КодСтроки, "ЧЦ=5; ЧН=; ЧГ=")
	+ "c" + КодКолонки;
	
	Возврат Префикс + АдреснаяЧастьПоказателя;
	
КонецФункции

Функция РезультатПроверкиЗначенияСпецифики(Значение, МассивЗначенийСпецифик) Экспорт 
	
	Если МассивЗначенийСпецифик.Количество() = 0 Тогда
		Возврат Истина;
	ИначеЕсли МассивЗначенийСпецифик.Найти("*") <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Для каждого ЗначениеСпецифики Из МассивЗначенийСпецифик Цикл
			Если Значение = ЧислоИзСтроки(ЗначениеСпецифики) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат МассивЗначенийСпецифик.Найти(СокрЛП(Значение)) <> Неопределено;
	
КонецФункции

Функция ЗначениеПоказателяИзТаблицы(ЭлементВыражения, ИндСтроки, ИндГрафы) Экспорт 
	
	Если ЭлементВыражения.МассивГраф.Количество() = 0 ИЛИ ЭлементВыражения.МассивСтрок.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	ТаблицаЗначенийЭлементов = ЭлементВыражения.ТаблЗначЭлем;
	
	СтрокиТаблицы = ТаблицаЗначенийЭлементов.НайтиСтроки(Новый Структура("КодСтроки", 0)); // ищем итоговую строку
	Если СтрокиТаблицы.Количество() = 0 Тогда
		Возврат 0;
	ИначеЕсли ТаблицаЗначенийЭлементов.Количество() = 1 Тогда
		Возврат 0;
	КонецЕсли;
	
	СтрокаСуммы = СтрокиТаблицы[0];
	
	Если ЭлементВыражения.СпособВывода = 1 Тогда
		НомСтроки = ЧислоИзСтроки(ЭлементВыражения.МассивСтрок[ИндСтроки - 1]);
		СтрокиТаблицы = ТаблицаЗначенийЭлементов.НайтиСтроки(Новый Структура("КодСтроки", НомСтроки));
		СуммаПоСтрокам = 0;
		Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СуммаПоСтрокам = СуммаПоСтрокам + СтрокаТаблицы.Сумма;
		КонецЦикла;
		Возврат СуммаПоСтрокам;
	ИначеЕсли ЭлементВыражения.СпособВывода = 2 Тогда
		НомГрафы  = ЭлементВыражения.МассивГраф[ИндГрафы - 1];
		Возврат СтрокаСуммы["Графа" + НомГрафы];
	ИначеЕсли ЭлементВыражения.СпособВывода = 3 Тогда
		НомГрафы  = ЭлементВыражения.МассивГраф[ИндГрафы - 1];
		НомСтроки = ЧислоИзСтроки(ЭлементВыражения.МассивСтрок[ИндСтроки - 1]);
		СтрокиТаблицы = ТаблицаЗначенийЭлементов.НайтиСтроки(Новый Структура("КодСтроки", НомСтроки));
		СуммаПоГрафе = 0;
		Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			СуммаПоГрафе = СуммаПоГрафе + СтрокаТаблицы["Графа" + НомГрафы];
		КонецЦикла;
		Возврат СуммаПоГрафе;
	ИначеЕсли ЭлементВыражения.СпособВывода = 5 Тогда
		НомГрафы  = ЭлементВыражения.МассивГраф[ИндГрафы - 1];
		НомСтроки = ЧислоИзСтроки(ЭлементВыражения.МассивСтрок[0]);
		СтрокиТаблицы = ТаблицаЗначенийЭлементов.НайтиСтроки(Новый Структура("КодСтроки,ИндСтроки", НомСтроки, ИндСтроки));
		Если СтрокиТаблицы.Количество() = 1 Тогда 
			Возврат СтрокиТаблицы[0]["Графа"+НомГрафы];
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаСуммы.Сумма;
	
КонецФункции

Функция СоответствиеФункцийРеализациям() Экспорт 
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("abs",      "АбсЗначение");
	Соответствие.Вставить("coalesce", "ПервоеЗаполненное");
	Соответствие.Вставить("floor",    "НаибольшееЦелое");
	Соответствие.Вставить("isnull",   "ЕслиПусто");
	Соответствие.Вставить("nullif",   "НеопределеноЕсли");
	Соответствие.Вставить("round",    "ОкрЗначение");
	
	// "Поиск неиспользуемых процедур и функций" не будет регистрировать ошибку
	Рез = Новый Структура();
	Рез.Вставить("элемент", АбсЗначение(0));
	Рез.Вставить("элемент", ПервоеЗаполненное(0, 0));
	Рез.Вставить("элемент", НаибольшееЦелое(0));
	Рез.Вставить("элемент", ЕслиПусто(0, 0));
	Рез.Вставить("элемент", НеопределеноЕсли(0, 0));
	Рез.Вставить("элемент", ОкрЗначение(0, 0, 0));
	
	Возврат Соответствие;
	
	
КонецФункции

Функция РезультатВычисленияЭлементарногоВыражения(ВычисляемоеВыражение, СчетчикОшибок) Экспорт 
	
	ПреобразоватьВыражение(ВычисляемоеВыражение);
	
	Попытка
		РезультатВычисления = Вычислить(ВычисляемоеВыражение);
	Исключение
		РезультатВычисления = Истина;
		СчетчикОшибок = СчетчикОшибок + 1;
	КонецПопытки;
	
	Возврат РезультатВычисления;
	
КонецФункции

Функция НомерПериодаИзСправочника(ПараметрыДляПроверки, СтрКодПериода)
	
	КодПериода = ЧислоИзСтроки(Прав("00" + СтрКодПериода, 2));
	
	СправочникиПериодов = ПараметрыДляПроверки.ТаблицаСправочников.НайтиСтроки(Новый Структура("Идентификатор", "s_mes"));
	Если СправочникиПериодов.Количество() = 0 Тогда
		СправочникиПериодов = ПараметрыДляПроверки.ТаблицаСправочников.НайтиСтроки(Новый Структура("Идентификатор", "s_time"));
		Если СправочникиПериодов.Количество() = 0 Тогда
			Возврат КодПериода;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаЭлементовСправочника = СправочникиПериодов[0].ТаблицаЭлементовСправочника;
	Для каждого ЭлементСправочника Из ТаблицаЭлементовСправочника Цикл
		Если КодПериода = ЧислоИзСтроки(Прав("00" + ЭлементСправочника.Код, 2)) Тогда
			Возврат ТаблицаЭлементовСправочника.Индекс(ЭлементСправочника) + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрДлина(СтрКодПериода) > 2 Тогда
		Возврат КодПериода;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция АбсЗначение(Выражение) Экспорт 
	
	Возврат ?(Выражение >= 0, Выражение, -Выражение);
	
КонецФункции

Функция ПервоеЗаполненное(В1 = Неопределено, В2 = Неопределено, В3 = Неопределено, В4 = Неопределено, В5 = Неопределено,
	В6 = Неопределено, В7 = Неопределено, В8 = Неопределено, В9 = Неопределено, В10 = Неопределено) Экспорт 
	
	Если      ЗначениеЗаполнено(В1) Тогда
		Возврат В1;
	ИначеЕсли ЗначениеЗаполнено(В2) Тогда
		Возврат В2;
	ИначеЕсли ЗначениеЗаполнено(В3) Тогда
		Возврат В3;
	ИначеЕсли ЗначениеЗаполнено(В4) Тогда
		Возврат В4;
	ИначеЕсли ЗначениеЗаполнено(В5) Тогда
		Возврат В5;
	ИначеЕсли ЗначениеЗаполнено(В6) Тогда
		Возврат В6;
	ИначеЕсли ЗначениеЗаполнено(В7) Тогда
		Возврат В7;
	ИначеЕсли ЗначениеЗаполнено(В8) Тогда
		Возврат В8;
	ИначеЕсли ЗначениеЗаполнено(В9) Тогда
		Возврат В9;
	ИначеЕсли ЗначениеЗаполнено(В10) Тогда
		Возврат В10;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция НаибольшееЦелое(Выражение) Экспорт 
	
	Возврат Цел(Выражение - ?(Выражение - Цел(Выражение) < 0, 1, 0));
	
КонецФункции

Функция ЕслиПусто(Выражение, ЗамещающееЗначение) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Выражение) Тогда
		Возврат ЗамещающееЗначение;
	КонецЕсли;
	
	Возврат Выражение;
	
КонецФункции

Функция НеопределеноЕсли(Выражение1, Выражение2) Экспорт 
	
	Если Выражение1 = Выражение2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Выражение1;
	
КонецФункции

Функция ОкрЗначение(Выражение, Точность, ТипОперации = 0) Экспорт 
	
	Если ТипОперации = 0 Тогда
		Возврат Окр(Выражение, Точность);
	КонецЕсли;
	
	Возврат Цел(Выражение);
	
КонецФункции

Процедура ПреобразоватьВыражение(Выражение) Экспорт 
	
	МассивЛогОп = Новый Массив;
	МассивЛогОп.Добавить(">=");
	МассивЛогОп.Добавить("<=");
	МассивЛогОп.Добавить("<>");
	МассивЛогОп.Добавить(">");
	МассивЛогОп.Добавить("<");
	МассивЛогОп.Добавить("=");
	
	ПреобразованноеВыражение = "";
	
	ВремВыражение = Выражение;
	ДлинаОп = 0;
	ПозОпер = ПозНайденногоИзМассива(ВремВыражение, МассивЛогОп, ДлинаОп);
	Пока ПозОпер > 0 Цикл
		Если ВремВыражение <> Выражение Тогда
			ПреобразованноеВыражение = ПреобразованноеВыражение + Лев(ВремВыражение, ПозОпер - 1);
			ПреобразованноеВыражение = ПреобразованноеВыражение + " И " + Лев(ВремВыражение, ПозОпер + ДлинаОп - 1);
		Иначе
			ПреобразованноеВыражение = ПреобразованноеВыражение + Лев(ВремВыражение, ПозОпер + ДлинаОп - 1);
		КонецЕсли;
		
		ВремВыражение = Сред(ВремВыражение, ПозОпер + ДлинаОп);
		
		ПозОпер = ПозНайденногоИзМассива(ВремВыражение, МассивЛогОп, ДлинаОп);
		Если ПозОпер = 0 Тогда
			ПреобразованноеВыражение = ПреобразованноеВыражение + ВремВыражение;
		КонецЕсли;
	КонецЦикла;
	
	Если ВремВыражение <> Выражение Тогда
		Выражение = ПреобразованноеВыражение;
	КонецЕсли
	
КонецПроцедуры

Функция ПозНайденногоИзМассива(Стр, МассивПодстрок, ДлинаНайденнойПодстроки = 0) Экспорт 
	
	Для НомПоз = 1 По СтрДлина(Стр) Цикл
		Для каждого ПодстрокаПоиска Из МассивПодстрок Цикл
			ДлинаПодстроки = СтрДлина(ПодстрокаПоиска);
			Если ДлинаПодстроки <= (СтрДлина(Стр) - НомПоз + 1) И ПодстрокаПоиска = Сред(Стр, НомПоз, ДлинаПодстроки) Тогда
				ДлинаНайденнойПодстроки = ДлинаПодстроки;
				Возврат НомПоз;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область НоваяФормаРегламентированнойОтчетности

#Область ЗаписьОбъектовВРегистрЖурналОтчетовСтатусы

#КонецОбласти

#КонецОбласти

#Область ПроцессыОбработкиДокументов

Процедура ПриИнициализации(Форма, Объект) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
	
		Если ЗначениеЗаполнено(Объект) Тогда
	
			ПриЧтенииНаСервере(Форма, Объект);
	
		Иначе
	
			ПриСозданииНаСервере(Форма, Объект);
	
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
	
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
	
		МодульПроцессыОбработкиДокументов.ПередЗаписьюНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
	
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
	
		МодульПроцессыОбработкиДокументов.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗадачу(Форма, Контекст, Источник) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
	
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
	
		МодульПроцессыОбработкиДокументов.ВыполнитьЗадачу(Форма, Контекст, Источник);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура УправлениеДоступностьюРеквизитов(Форма, БлокируемыеЭлементы, ТолькоПросмотр) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		
		Если НЕ Форма.Элементы.Найти("ГруппаКнопокЗаписатьЗакрыть") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ГруппаКнопокЗаписатьЗакрыть");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ГруппаКнопок1") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ГруппаКнопок1");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ГруппаКнопокСохранитьИЗаписать") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ГруппаКнопокСохранитьИЗаписать");
		КонецЕсли;
	
		Если НЕ Форма.Элементы.Найти("ФормаЗаписатьИЗакрыть") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ФормаЗаписатьИЗакрыть");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("Сохранить") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("Сохранить");
		КонецЕсли;
	
		Если НЕ Форма.Элементы.Найти("Заполнить") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("Заполнить");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ЗаполнитьВсе") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ЗаполнитьВсе");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ЗаполнитьТекущий") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ЗаполнитьТекущий");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПодменюОчистить") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ПодменюОчистить");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ОчиститьОтчет") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ОчиститьОтчет");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ОчиститьТекущуюСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ОчиститьТекущуюСтраницу");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ОчиститьТекущийРаздел") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ОчиститьТекущийРаздел");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("Загрузить") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("Загрузить");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("Импортировать") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("Импортировать");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ФормаЗагрузитьИзФайла") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ФормаЗагрузитьИзФайла");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ФормаОбрезатьПустыеСимволы") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ФормаОбрезатьПустыеСимволы");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("Обновить") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("Обновить");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ФормаЗаполнитьДаннымиУведомленияКИК") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ФормаЗаполнитьДаннымиУведомленияКИК");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ТабличныйДокумент") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ТабличныйДокумент");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчета") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ПолеТабличногоДокументаФормаОтчета");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ТабличныйДокументКонтекстноеМенюГруппаСтроки") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ТабличныйДокументКонтекстноеМенюГруппаСтроки");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ТабличныйДокументКонтекстноеМенюДобавитьСтроку") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ТабличныйДокументКонтекстноеМенюДобавитьСтроку");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ТабличныйДокументКонтекстноеМенюУдалитьСтроку") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ТабличныйДокументКонтекстноеМенюУдалитьСтроку");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюГруппаСтроки") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюГруппаСтроки");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтроку") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтроку");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюУдалитьСтроку") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюУдалитьСтроку");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ТабличныйДокументКонтекстноеМенюДобавитьСтрокуКопированием") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ТабличныйДокументКонтекстноеМенюДобавитьСтрокуКопированием");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтрокуКопированием") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ПолеТабличногоДокументаФормаОтчетаКонтекстноеМенюДобавитьСтрокуКопированием");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("РазделыОтчетаКонтекстноеМенюКнопкаДобавитьСтраницу");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("РазделыОтчетаКонтекстноеМенюКнопкаУдалитьСтраницу");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("РазделыОтчетаКонтекстноеМенюДобавитьСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("РазделыОтчетаКонтекстноеМенюДобавитьСтраницу");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("РазделыОтчетаКонтекстноеМенюУдалитьСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("РазделыОтчетаКонтекстноеМенюУдалитьСтраницу");
		КонецЕсли;
	
		Если НЕ Форма.Элементы.Найти("ДобавитьСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("ДобавитьСтраницу");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("УдалитьСтраницу") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("УдалитьСтраницу");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("СобратьДанные") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("СобратьДанные");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("Комментарий") = Неопределено Тогда
			БлокируемыеЭлементы.Добавить("Комментарий");
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ТабличныйДокумент") = Неопределено Тогда
			Форма.Элементы["ТабличныйДокумент"].ЧерноБелыйПросмотр = ТолькоПросмотр;
		КонецЕсли;
		
		Если НЕ Форма.Элементы.Найти("ПолеТабличногоДокументаФормаОтчета") = Неопределено Тогда
			Форма.Элементы["ПолеТабличногоДокументаФормаОтчета"].ЧерноБелыйПросмотр = ТолькоПросмотр;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЧтенииНаСервере(Форма, Объект)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
	
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
	
		МодульПроцессыОбработкиДокументов.ПриЧтенииНаСервере(Форма, Объект, , Форма.КоманднаяПанель);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Объект)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
	
		МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументов");
	
		МодульПроцессыОбработкиДокументов.ПриСозданииНаСервере(Форма, Объект, , Форма.КоманднаяПанель);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


// ДЕНЬГИ


// Удаленные методы
// ЗаменитьСсылкиРазделенныйСпрУдалитьРеглОтчетыНаНеРазделенныйСпрРеглОтчеты
// ЗаменитьРеквизитВидОтчета
// УстановитьПризнакНаличияФайловПрисоединенныхКУведомлению

// Конец ДЕНЬГИ