///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2021, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Проверяет необходимость выполнять провеку состояния обмена
//
//Параметры:
//	Нет
//
Процедура ПроверитьОбработчикОповещенияОбИзмененииСостояния() Экспорт
	
	ОтключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбмена");
	
	Если ПроверятьСостояние() Тогда
		ПодключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбмена", 3, Истина);
	ИначеЕсли ТребуетсяПроверитьСостояниеСервиса() Тогда 
		ПодключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбменаНаСервере", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработчикПроверкиСостоянияОбмена() Экспорт
	
	ПроцессыОбменаКлиент.ОбновитьКлиентскиеПараметрыПриложения();
	
	МоментИзменения  = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.МоментИзменения", Дата(1,1,1));
	МоментОповещения = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.МоментОповещения", Дата(1,1,2));
	Если МоментИзменения <> МоментОповещения Тогда
		ДеньгиКлиент.ЗаписатьПараметрПриложения("Деньги.Обмен.МоментОповещения", МоментИзменения);
		Оповестить(ПроцессыОбменаКлиент.КлючОповещенияОбИзмененииСостоянияОбмена());
	КонецЕсли;
	
	Если Не ПроверятьСостояние() Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	Если СвойстваФЗ = Неопределено Или СвойстваФЗ.Статус <> "Выполняется" Тогда
		Период = 60;
	Иначе
		Период = 5;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикПроверкиСостоянияОбмена", Период, Истина);
	
КонецПроцедуры

Процедура ОбработчикПроверкиСостоянияОбменаНаСервере() Экспорт
	
	ПроцессыОбменаВызовСервера.ПроверитьСостояниеОбменаНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПроверятьСостояние()
	
	Режим = ДеньгиКлиент.ПараметрПриложения("Деньги.Режим");
	Если Режим <> "КлиентОблака" И Режим <> "ЦентрМобильных" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоединениеНастроено = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.СоединениеНастроено", Ложь);
	ПроверятьСостояние  = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ПроверятьСостояние", Ложь);
	АвтообменИспользуется = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.АвтообменИспользуется", Ложь);
	СвойстваФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	ЗаданиеВыполняется = СвойстваФЗ <> Неопределено И СвойстваФЗ.Статус = "Выполняется";
	
	Возврат ЗаданиеВыполняется 
			Или СоединениеНастроено И ПроверятьСостояние И АвтообменИспользуется;
	
КонецФункции

Функция ТребуетсяПроверитьСостояниеСервиса()
	
	Режим = ДеньгиКлиент.ПараметрПриложения("Деньги.Режим");
	СоединениеНастроено = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.СоединениеНастроено", Ложь);
	Если Режим <> "КлиентОблака" Или СоединениеНастроено <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СвойстваФЗ = ДеньгиКлиент.ПараметрПриложения("Деньги.Обмен.ФоновоеЗадание", Неопределено);
	Если СвойстваФЗ <> Неопределено И СвойстваФЗ.Статус = "Выполняется" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти