
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноСоздаватьДокументыУплаты = Ложь; // ДЕНЬГИ 
	
	Организация = Параметры.Организация;
	Период      = КонецГода(Параметры.Период);
	Правило     = Параметры.Правило;
	
	Если Не ЗначениеЗаполнено(Правило) Тогда
		ЗаполнитьПравило();
	КонецЕсли;
	
	// Проверка заполнения реквизитов организации, необходимых для уплаты.
	ТекстДействия = НСтр("ru = 'уплатить задолженность по НДФЛ'");
	СообщениеТребуютсяРеквизиты = ПроверкаРеквизитовОрганизации.СтрокаСообщенияНеЗаполненыРеквизитыДляОтчетности(
		Организация, ТекстДействия);
	РеквизитыОрганизацииЗаполнены = ПроверитьРеквизитыОрганизации(Организация, Период).РеквизитыЗаполнены;
	
	ПоказыватьКомандыОплаты = Ложь; // ДЕНЬГИ ПомощникиПоУплатеНалоговИВзносов.ПоказыватьКомандыОплаты();
	
	ЗаполнитьЗадолженность();
	НайтиИОтобразитьСвязанныеПлатежи();
	УстановитьВидимостьКнопокОплаты();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеВыписки" Тогда
		
		ОбработкаЗаписиПлатежногоДокумента();
		
	ИначеЕсли ИмяСобытия = "Запись_ПлатежныйДокумент_УплатаНалогов" Тогда
		
		ПараметрОрганизация = Неопределено;
		Налог = Неопределено;
		УказанНалог = Параметр.Свойство("Налог", Налог) И ЗначениеЗаполнено(Налог);
		УказанаОрганизация = Параметр.Свойство("Организация", ПараметрОрганизация);
		
		Если ТипЗнч(Параметр) = Тип("Структура")
			И УказанаОрганизация И ПараметрОрганизация = Организация
			И УказанНалог И ЭтоУплатаНДФЛ(Налог) Тогда
			
			ОбработкаЗаписиПлатежногоДокумента();
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_Организации" И Организация = Источник Тогда
		
		РеквизитыОрганизацииЗаполнены = ПроверитьРеквизитыОрганизации(Организация, Период).РеквизитыЗаполнены;
		УправлениеФормой(ЭтотОбъект);
		
	ИначеЕсли ИмяСобытия = "УдалитьДокументУплаты" Тогда
		
		УдалитьДокументУплаты(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РезультатПроверкиРеквизитовОрганизации = ПроверитьРеквизитыОрганизации(Организация, Период);
	Если Не РезультатПроверкиРеквизитовОрганизации.РеквизитыЗаполнены Тогда
		ТекстОписанияОбъектаПроверки = НСтр("ru = 'уплаты задолженности по НДФЛ'");
		ПроверкаРеквизитовОрганизации.СообщитьОбОшибкеЗаполненияРеквизитовДляОтчетности(
			Организация,
			РезультатПроверкиРеквизитовОрганизации.НезаполненныеРеквизиты,
			"СообщениеТребуютсяРеквизиты",
			Отказ,
			ТекстОписанияОбъектаПроверки)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачисленоНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	ИндексПериода = Число(СтрЗаменить(ИмяЭлемента, "Начислено", ""));
	СтрокаПериода = РасчетыПоНалогу.Получить(ИндексПериода);
	
	ОткрытьРасшифровкуПлатежейВБюджет(СтрокаПериода.НалоговыйПериод, "НачисленияПлатежиНДФЛ");
	
КонецПроцедуры

&НаКлиенте
Процедура УплаченоНажатие(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	ИндексПериода = Число(СтрЗаменить(ИмяЭлемента, "Уплачено", ""));
	СтрокаПериода = РасчетыПоНалогу.Получить(ИндексПериода);
	
	ОткрытьРасшифровкуПлатежейВБюджет(СтрокаПериода.НалоговыйПериод, "ПлатежиНДФЛ");
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеТребуютсяРеквизитыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Контекст = Новый Структура;
	Контекст.Вставить("Период", Период);
	Контекст.Вставить("ИмяРеглОтчета", "РегламентированныйОтчет3НДФЛ");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Организация);
	ПараметрыФормы.Вставить("Назначение", "ДляОтчетности");
	ПараметрыФормы.Вставить("Контекст", Контекст);
	
	ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПлатежОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// ДЕНЬГИ код исключен
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОплатитьСБанковскогоСчета(Команда)
	
	Оплатить(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.БанковскийПеревод"))
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьНаличнымиПоКвитанции(Команда)
	
	Оплатить(ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.НаличнымиПоКвитанции"))
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	// Заголовок
	ЧастиЗаголовка = Новый Массив;
	Если Форма.НДФЛДолг > 0 Тогда
		ЧастиЗаголовка.Добавить(НСтр("ru = 'Задолженность по НДФЛ'"));
	ИначеЕсли Форма.НДФЛПереплата > 0 Тогда
		ЧастиЗаголовка.Добавить(НСтр("ru = 'Переплата по НДФЛ'"));
	Иначе
		ЧастиЗаголовка.Добавить(НСтр("ru = 'Расчеты по НДФЛ'"));
	КонецЕсли;
	
	ЧастиЗаголовка.Добавить(СтрШаблон(НСтр("ru = 'до %1 года'"), Формат(Год(форма.Период) + 1, "ЧГ=0")));
	
	Форма.Заголовок = СтрСоединить(ЧастиЗаголовка, " ");
	ЕстьЗадолженность = Форма.НДФЛДолг > 0;
	
	Элементы.ДекорацияЗаголовокОстатки.Видимость = ЕстьЗадолженность;
	Элементы.ГруппаОплатаЗадолженности.Видимость = ЕстьЗадолженность;
	
	Если Форма.ПоказыватьКомандыОплаты И ЕстьЗадолженность Тогда
		Элементы.ГруппаКомандыОплаты.Видимость = Истина;
		УправлениеКомандамиОплаты(Форма);
	Иначе
		Элементы.ГруппаКомандыОплаты.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СообщениеТребуютсяРеквизиты.Видимость =
		(ЗначениеЗаполнено(Форма.Организация) И Не Форма.РеквизитыОрганизацииЗаполнены);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеКомандамиОплаты(Форма)
	
	Элементы = Форма.Элементы;
	
	ДоступностьКоманд = Форма.МожноСоздаватьДокументыУплаты И Не ЗадолженностьОплаченаПолностью(Форма);
	
	// Доступность
	Элементы.ОплатитьСБанковскогоСчета.Доступность    = ДоступностьКоманд;
	Элементы.ОплатитьНаличнымиПоКвитанции.Доступность = ДоступностьКоманд;
	
	УстановитьВидПоУмолчаниюОформлением(Форма, Элементы.ОплатитьСБанковскогоСчета,    ДоступностьКоманд);
	УстановитьВидПоУмолчаниюОформлением(Форма, Элементы.ОплатитьНаличнымиПоКвитанции, ДоступностьКоманд);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопокОплаты()
	
	СпособОплаты = Неопределено; // ДЕНЬГИ
	
	НадоВыбратьСпособОплаты = Не ЗначениеЗаполнено(СпособОплаты);
	
	Элементы.ОплатитьСБанковскогоСчета.Видимость =  Ложь; // ДЕНЬГИ
	
	Элементы.ОплатитьНаличнымиПоКвитанции.Видимость =  Ложь; // ДЕНЬГИ
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗадолженностьОплаченаПолностью(Форма)
	
	ЗадолженностьКУплате = НалогКУплате(Форма).Всего;
	
	Возврат ЗадолженностьКУплате <= 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидПоУмолчаниюОформлением(Форма, Элемент, ЭтоКнопкаПоУмолчанию)
	
	Элемент.Шрифт = Новый Шрифт(Элемент.Шрифт, , , ЭтоКнопкаПоУмолчанию);
	
	Если ЭтоКнопкаПоУмолчанию Тогда
		Элемент.ЦветФона = ЦветСтиля("ВыборСтандартногоПериодаФонКнопки");
	Иначе
		Элемент.ЦветФона = Новый Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЦветСтиля(ИмяЦветаСтиля)
	
#Если Клиент Тогда
	Возврат ОбщегоНазначенияКлиент.ЦветСтиля(ИмяЦветаСтиля);
#Иначе
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
#КонецЕсли
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеЗадолженности

&НаСервере
Процедура ЗаполнитьЗадолженность()
	
	ГраницаОтчетностиПрошлыхПериодов = ВыделенныйМодульБРО.ГраницаОтчетностиПрошлыхПериодов(Организация); // ДЕНЬГИ 
	
	// Расчеты получим за все периоды, включая год формы.
	ТаблицаРасчетов = УчетНДФЛПредпринимателя.РасчетыПоНалогуЗаПредыдущиеПериоды(Организация, КонецГода(Период) + 1);
	РасчетыПоНалогу.Загрузить(ТаблицаРасчетов);
	
	РазместитьТаблицуЗадолженностиНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура РазместитьТаблицуЗадолженностиНаФорме()
	
	КоличествоПредопределенныхСтрок = КоличествоПредопределенныхСтрокПериодов();
	
	Для Каждого СтрокаРасчетов Из РасчетыПоНалогу Цикл
		
		ИндексПериода = РасчетыПоНалогу.Индекс(СтрокаРасчетов);
		
		// Добавим элементы новой строки для периода задолженности, если еще не отрисованы.
		Если ИндексПериода > (КоличествоПредопределенныхСтрок - 1) Тогда
			ДобавитьЭлементыСтрокиЗадолженности(ИндексПериода);
		КонецЕсли;
		
		ГруппаПериода = Элементы.ГруппаПериодыЗадолженности.ПодчиненныеЭлементы.Найти("ГруппаПериод" + ИндексПериода);
		ГруппаПериода.Видимость = Истина;
		
		// Представление периода
		Если Год(СтрокаРасчетов.НалоговыйПериод) = Год(ГраницаОтчетностиПрошлыхПериодов) Тогда
			НазваниеПериода = СтрШаблон(НСтр("ru = 'За периоды до %1 года'"), Формат(Год(СтрокаРасчетов.НалоговыйПериод) + 1, "ЧГ=0"));
		Иначе
			НазваниеПериода = СтрШаблон(НСтр("ru = 'За %1 год'"), Формат(Год(СтрокаРасчетов.НалоговыйПериод), "ЧГ=0"));
		КонецЕсли;
		Элементы["ПредставлениеПериода" + ИндексПериода].Заголовок = НазваниеПериода;
		
		// Начислено
		ДекорацияНачислено = Элементы["Начислено" + ИндексПериода];
		ДекорацияНачислено.Заголовок = Деньги3НДФЛВызовСервера.ФорматСумм(СтрокаРасчетов.Начислено, , "0,00");
		ДекорацияНачислено.Гиперссылка = Истина;
		
		// Уплачено
		ДекорацияУплачено = Элементы["Уплачено" + ИндексПериода];
		ДекорацияУплачено.Заголовок = Деньги3НДФЛВызовСервера.ФорматСумм(СтрокаРасчетов.Уплачено, , "0,00");
		ДекорацияУплачено.Гиперссылка = Истина;
		
		// Переплата
		ДекорацияПереплата = Элементы["Переплата" + ИндексПериода];
		ДекорацияПереплата.Заголовок = Деньги3НДФЛВызовСервера.ФорматСумм(СтрокаРасчетов.Переплата);
		ДекорацияПереплата.Гиперссылка = Ложь;
		
		// Задолженность
		ФорматНулевойЗадолженности = ?(СтрокаРасчетов.Переплата = 0, "0,00", "");
		
		ДекорацияЗадолженность = Элементы["Задолженность" + ИндексПериода];
		ДекорацияЗадолженность.Заголовок = Деньги3НДФЛВызовСервера.ФорматСумм(
			СтрокаРасчетов.Задолженность, ,
			ФорматНулевойЗадолженности);
		ДекорацияЗадолженность.Гиперссылка = Ложь;
		ДекорацияЗадолженность.ЦветТекста  = ?(СтрокаРасчетов.Задолженность > 0, ЦветаСтиля.ЦветОтрицательногоЧисла, Новый Цвет());
		
	КонецЦикла;
	
	Для ИндексГруппы = РасчетыПоНалогу.Количество() По Элементы.ГруппаПериодыЗадолженности.ПодчиненныеЭлементы.Количество() - 1 Цикл
		Элементы["ГруппаПериод" + ИндексГруппы].Видимость = Ложь;
	КонецЦикла;
	
	// Итоги
	
	ИтоговыйОстатокРасчетов = РасчетыПоНалогу.Итог("Переплата") - РасчетыПоНалогу.Итог("Задолженность");
	
	НДФЛДолг      = ?(ИтоговыйОстатокРасчетов < 0, - ИтоговыйОстатокРасчетов, 0);
	НДФЛПереплата = ?(ИтоговыйОстатокРасчетов > 0, ИтоговыйОстатокРасчетов, 0);
	
	Элементы.ПереплатаИтог.Заголовок     = Деньги3НДФЛВызовСервера.ФорматСумм(НДФЛПереплата);
	Элементы.ЗадолженностьИтог.Заголовок = Деньги3НДФЛВызовСервера.ФорматСумм(НДФЛДолг);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементыСтрокиЗадолженности(ИндексПериода)
	
	ГруппаЭталон = Элементы.ГруппаПериод0;
	НоваяГруппа = Элементы.Добавить("ГруппаПериод" + ИндексПериода, Тип("ГруппаФормы"), Элементы.ГруппаПериодыЗадолженности);
	
	ЗаполнитьЗначенияСвойств(НоваяГруппа, ГруппаЭталон, , "Имя, ПодчиненныеЭлементы, ПутьКДаннымЗаголовка");
	
	Для Каждого ИсходныйЭлемент Из ГруппаЭталон.ПодчиненныеЭлементы Цикл
		
		ИмяНовогоЭлемента = СтрЗаменить(ИсходныйЭлемент.Имя, "0", Строка(ИндексПериода));
		НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента, ТипЗнч(ИсходныйЭлемент), НоваяГруппа);
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ИсходныйЭлемент, , "Имя");
		
		ДействиеЭлемента = ИсходныйЭлемент.ПолучитьДействие("Нажатие");
		Если ЗначениеЗаполнено(ДействиеЭлемента) Тогда
			НовыйЭлемент.УстановитьДействие("Нажатие", ДействиеЭлемента);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция КоличествоПредопределенныхСтрокПериодов()
	
	КоличествоСтрок = 0;
	
	Пока Истина Цикл
		Если Элементы.Найти("ГруппаПериод" + КоличествоСтрок) <> Неопределено Тогда
			КоличествоСтрок = КоличествоСтрок + 1;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоСтрок;
	
КонецФункции

#КонецОбласти

#Область ОтображениеДокументовУплаты

&НаСервере
Процедура ОбработкаЗаписиПлатежногоДокумента()
	
	ЗаполнитьЗадолженность();
	НайтиИОтобразитьСвязанныеПлатежи();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура НайтиИОтобразитьСвязанныеПлатежи()
	
	Если НДФЛДолг <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Платежи.Очистить();
	
	// ДЕНЬГИ код исключен
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыПлатежей()
	
	ТаблицаПлатежей = Обработки.ПомощникЗаполнения3НДФЛ.ДокументыУплаты(
		Организация, КонецГода(Период), Правило);
	
	Если ТаблицаПлатежей <> Неопределено Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаПлатежей Цикл
			ЗаполнитьЗначенияСвойств(Платежи.Добавить(), СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УдалениеДокументовОплаты

&НаКлиенте
Функция ОповещениеУдаленияПлатежногоДокумента()
	
	Возврат Новый ОписаниеОповещения("УдалитьДокументУплатыНаКлиентеЗавершение", ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура УдалитьДокументУплатыНаКлиентеЗавершение(ДокументУплатыДляУдаления, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ДокументУплатыДляУдаления) Тогда
		УдалитьДокументУплаты(ДокументУплатыДляУдаления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДокументУплаты(ДокументУплатыДляУдаления)
	
	ДокументУплатыОбъект = ДокументУплатыДляУдаления.ПолучитьОбъект();
	ДокументУплатыОбъект.УстановитьПометкуУдаления(Истина);
	
	ЗаполнитьЗадолженность();
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеКоманд

&НаКлиенте
Процедура Оплатить(СпособОплаты)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОплаты = ОплатитьНаСервере(СпособОплаты);
	Если ДокументыОплаты <> Неопределено И ДокументыОплаты.Количество() > 0 Тогда
		ТипСозданныхДокументов = ТипЗнч(ДокументыОплаты[0]);
		ОповеститьОбИзменении(ТипСозданныхДокументов);
		// ДЕНЬГИ код исключен
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОплатитьНаСервере(СпособОплаты)
	
	СуммаПлатежа = СуммаКУплате(НДФЛДолг, Платежи);
	
	ПараметрыВыполнения = Обработки.ПомощникЗаполнения3НДФЛ.НовыйПараметрыФормированияДокументовОплаты();
	ПараметрыВыполнения.Период = Период;
	ПараметрыВыполнения.Организация = Организация;
	ПараметрыВыполнения.Правило = Правило;
	ПараметрыВыполнения.СпособОплаты = СпособОплаты;
	ПараметрыВыполнения.НалогКУплате = СуммаПлатежа;
	
	НачалоПериода = НачалоГода(Период);
	КонецПериода = КонецГода(Период);
	
	// По умолчанию считаем более частотным случай возникновения остатка за предыдущий год
	
	ПараметрыВыполнения.НалогИсчисленныйВсего = УчетНДФЛПредпринимателя.НачисленныйНалогЗаПериод(
		Организация,
		НачалоПериода,
		КонецПериода);
	
	ПараметрыВыполнения.АвансовыеПлатежи = Обработки.ПомощникЗаполнения3НДФЛ.АвансовыеПлатежиПоНДФЛЗаПериод(
		Организация,
		НачалоПериода,
		КонецПериода);
	
	СозданныеДокументы = Обработки.ПомощникЗаполнения3НДФЛ.СформироватьДокументыОплатыНалога(ПараметрыВыполнения);
	
	НайтиИОтобразитьСвязанныеПлатежи();
	
	Возврат СозданныеДокументы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НалогКУплате(Форма)
	
	Результат = Новый Структура("Всего");
	Результат.Всего = СуммаКУплате(Форма.НДФЛДолг, Форма.Платежи);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаКУплате(Сумма, КоллекцияПлатежей)
	
	Возврат Макс(Сумма - СуммаПодготовленныхПлатежей(КоллекцияПлатежей), 0);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаПодготовленныхПлатежей(КоллекцияПлатежей)
	
	Сумма = 0;
	
	СтрокиОтбора = КоллекцияПлатежей.НайтиСтроки(Новый Структура("Оплачено", Ложь));
	Для Каждого Платеж Из СтрокиОтбора Цикл
		Сумма = Сумма + Платеж.Сумма;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

#КонецОбласти

#Область ПроверкаРеквизитовДляОтчетности

&НаСервереБезКонтекста
Функция ПроверитьРеквизитыОрганизации(Организация, Период)
	
	НезаполненныеРеквизиты = Неопределено;
	
	РеквизитыОрганизацииЗаполнены = ПроверкаРеквизитовОрганизации.РеквизитыДляОтчетностиЗаполнены(
		"РегламентированныйОтчет3НДФЛ",
		Организация,
		Период,
		НезаполненныеРеквизиты);
	
	Результат = Новый Структура;
	Результат.Вставить("РеквизитыЗаполнены", РеквизитыОрганизацииЗаполнены);
	Результат.Вставить("НезаполненныеРеквизиты", НезаполненныеРеквизиты);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ЗаполнитьПравило()
	
	Порядок = Обработки.ПомощникЗаполнения3НДФЛ.ПорядокПредоставленияОтчетаУплатыНалогаЗаПериод(Организация, Период);
	ПорядокУплаты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Порядок, "Уплата");
	
	Если ПорядокУплаты <> Неопределено Тогда
		Правило = ПорядокУплаты.Правило;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасшифровкуПлатежейВБюджет(ПериодРасчета, ВидОтчета)
	
	// ДЕНЬГИ код исключен
	Возврат;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоУплатаНДФЛ(Налог)
	
	Возврат Обработки.ПомощникЗаполнения3НДФЛ.ЭтоУплатаНДФЛ(Налог);
	
КонецФункции

#КонецОбласти
