#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Даты.ПлановаяОперация КАК ПлановаяОперация
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыПлановыхОпераций КАК ОборотыПлановыхОпераций
	|		ПО (Даты.ПлановаяОперация = ОборотыПлановыхОпераций.Регистратор)
	|ГДЕ
	|	Даты.ПлановаяОперация = Даты.ВладелецРасписания
	|	И ОборотыПлановыхОпераций.Регистратор.Ссылка есть NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ПлановаяОперация) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДокОбъект = Выборка.ПлановаяОперация.ПолучитьОбъект();
			Если ДокОбъект <> Неопределено Тогда
				ДокОбъект.Записать(?(ДокОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			КонецЕсли;
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Плановые операции", 
						УровеньЖурналаРегистрации.Ошибка, , Выборка.ПлановаяОперация, 
						СтрШаблон(НСтр("ru='Не удалось перезаписать плановую операцию %1 (%2)
						|	%3'"), Выборка.ПлановаяОперация, ТипЗнч(Выборка.ПлановаяОперация), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Даты.ВладелецРасписания КАК ВладелецРасписания
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК Даты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОборотыПлановыхОпераций КАК ОборотыПлановыхОпераций
	|		ПО (Даты.ВладелецРасписания = ОборотыПлановыхОпераций.Регистратор)
	|ГДЕ
	|	Даты.ПлановаяОперация <> Даты.ВладелецРасписания
	|	И ОборотыПлановыхОпераций.Регистратор есть NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.ВладелецРасписания) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ДокОбъект = Выборка.ВладелецРасписания.ПолучитьОбъект();
			Если ДокОбъект <> Неопределено Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Плановые операции", 
						УровеньЖурналаРегистрации.Ошибка, , Выборка.ВладелецРасписания, 
						СтрШаблон(НСтр("ru='Не удлаось перезаписать шаблон %1 (%2)
						|	%3'"), Выборка.ВладелецРасписания, ТипЗнч(Выборка.ВладелецРасписания), ПодробноеПредставлениеОшибки(Ошибка)));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

