#Область ОписаниеПеременных

&НаКлиенте
Перем ОбработкаКС Экспорт;

&НаСервере
Перем ОбъектЭтогоОтчета;

&НаКлиенте
Перем ФормаВыгрузкиРеглОтчета;

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ДЕНЬГИ
	АвтоЗаголовок = Ложь;
	Элементы.ПроверитьВИнтернете.Видимость = Ложь;
	Элементы.ОтправитьВКонтролирующийОрган.Видимость = Ложь;
	Элементы.ПодменюОтправка.Видимость = Ложь;
	Элементы.ГруппаПанельОтправки.Видимость = Ложь;
	// Конец ДЕНЬГИ
	
	// Обход ошибки платформы Параметр сеанса отсутствует или удален
	ТабличныйДокумент.Очистить();
	
	// Заполняем обязательными ключами реквизит формы "СтруктураРеквизитовФормы"
	СтруктураРеквизитовФормы = Отчеты.РегламентированныйОтчет3НДФЛ.СтруктураРеквизитовФормы(
		Параметры.Организация, Параметры.мДатаКонцаПериодаОтчета, Параметры.мВыбраннаяФорма, Параметры);
	Если СтруктураРеквизитовФормы = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Не определена СтруктураРеквизитовФормы для налогового периода ""%1""'"), Параметры.мДатаКонцаПериодаОтчета);
	КонецЕсли;
	
	ТаблицаГруппыА = ЭтотОбъект[СтруктураРеквизитовФормы.мИдГруппыА].Выгрузить();
	
	СписокКолонок = ЭтотОбъект["СписокКолонок" + СтруктураРеквизитовФормы.мИдГруппыА];
	Для Каждого Колонка Из ТаблицаГруппыА.Колонки Цикл
		
		СписокКолонок.Добавить(Колонка.Имя);
		
	КонецЦикла;
	
	ТаблицаГруппыБ = ЭтотОбъект[СтруктураРеквизитовФормы.мИдГруппыБ].Выгрузить();
	
	СписокКолонок = ЭтотОбъект["СписокКолонок" + СтруктураРеквизитовФормы.мИдГруппыБ];
	Для Каждого Колонка Из ТаблицаГруппыБ.Колонки Цикл
		
		СписокКолонок.Добавить(Колонка.Имя);
		
	КонецЦикла;
	
	ТаблицаРасчетаДоходаОтПродажиНедвижимости = ЭтотОбъект[СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости].Выгрузить();
	
	СписокКолонок = ЭтотОбъект["СписокКолонок" + СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости];
	Для Каждого Колонка Из ТаблицаРасчетаДоходаОтПродажиНедвижимости.Колонки Цикл
		
		СписокКолонок.Добавить(Колонка.Имя);
		
	КонецЦикла;
	
	// Установка значения прочих реквизитов
	мСтатусНалогоплательщика = 0;
	
	// количество строк многострочных разделов по "бумажной" форме отчета
	// (минимальное количество строк, которое должно присутствовать всегда)
	КолИсхСтрокИдГруппыА = 1;
	КолИсхСтрокИдГруппыБ = 1;
	КолИсхСтрокИдРасчетаДоходаОтПродажиНедвижимости = 1;
	
	КолКолонокИдГруппыА = 10;
	КолКолонокИдГруппыБ = 14;
	КолКолонокИдРасчетаДоходаОтПродажиНедвижимости = 5;
	
	// Структуры для работы с показателями уникальныз страниц отчета 
	//	(не многострочных и не многостраничных)
	СтруктураДанныхТитульный = Новый Структура;
	СтруктураДанныхЛистД2 = Новый Структура;
	СтруктураДанныхЛистЕ1 = Новый Структура;
	СтруктураДанныхЛистГ = Новый Структура;
	СтруктураДанныхЛистИ = Новый Структура;
	СтруктураДанныхЛистИПродолжение = Новый Структура;
	
	// Ключи с именами реквизитов формы, соответствующих таблицам многострочных разделов
	мСтруктураМногострочныхРазделов = Отчеты.РегламентированныйОтчет3НДФЛ.СтруктураМногострочныхРазделов(СтруктураРеквизитовФормы.мВыбраннаяФорма);
	
	// Структура содержит данные дополнительных страниц:
	//	Ключ - имя раздела, значение - имя таблицы, каждая строка которой соответствует странице раздела
	мСтруктураМногостраничныхРазделов = Отчеты.РегламентированныйОтчет3НДФЛ.СтруктураМногостраничныхРазделов(СтруктураРеквизитовФормы.мВыбраннаяФорма);
	
	// Добавляем первые страницы в многостраничные разделы
	ИнициализацияМногостраничныхРазделов();
	
	// Структура с описанием обязательного количества строк в многострочных разделах формы
	мСтруктураИсхКолвоСтрокРазделов = Новый Структура;
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыА, КолИсхСтрокИдГруппыА);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыБ, КолИсхСтрокИдГруппыБ);
	мСтруктураИсхКолвоСтрокРазделов.Вставить(СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости, КолИсхСтрокИдРасчетаДоходаОтПродажиНедвижимости);
	
	// Структура с описанием количества колонок в многострочных разделах формы
	мСтруктураКолвоКолонокРазделов = Новый Структура;
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыА, КолКолонокИдГруппыА);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдГруппыБ, КолКолонокИдГруппыБ);
	мСтруктураКолвоКолонокРазделов.Вставить(СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости, КолКолонокИдРасчетаДоходаОтПродажиНедвижимости);
	
	// Установка цветов для оформления ячеек отчета
	ЦветЗаполняетсяТолькоВручную     = Новый Цвет(255, 255, 225);
	ЦветЗаполняетсяАвтоКорректир     = Новый Цвет(255, 240, 200);
	ЦветЗаполняетсяАвтоБезКорректир  = Новый Цвет(230, 240, 220);
	СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика = Новый Цвет(192, 220, 192); // ЗЕЛЕНЫЙ
	ЦветЗаполняетсяОднозначноВручную = Новый Цвет(255, 255, 192); // ЖЕЛТЫЙ
	ЦветЗаполняетсяАвтоматически     = Новый Цвет(255, 255, 255); // Белый, Ввод запрещен
	
	// структура цветов раскраски автозаполняемых ячеек
	мСтруктураЦветовРаскраски = Новый Структура;
	мСтруктураЦветовРаскраски.Вставить("_1", ЦветЗаполняетсяТолькоВручную);
	мСтруктураЦветовРаскраски.Вставить("_2", ЦветЗаполняетсяАвтоКорректир);
	мСтруктураЦветовРаскраски.Вставить("_3", ЦветЗаполняетсяАвтоБезКорректир);
	мСтруктураЦветовРаскраски.Вставить("_4", СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика);
	мСтруктураЦветовРаскраски.Вставить("_0", ЦветЗаполняетсяОднозначноВручную);
	мСтруктураЦветовРаскраски.Вставить("_5", ЦветЗаполняетсяАвтоматически);
	
	мСтруктураВариантыЗаполнения       = Новый Структура;
	мСтруктураВариантыЗаполненияЭталон = Новый Структура;
	
	// Способы округления показателей отчета
	ПорядкиОкругленияОтчетности = Новый Структура;
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1",       Перечисления.ПорядкиОкругленияОтчетности.Окр1);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000",    Перечисления.ПорядкиОкругленияОтчетности.Окр1000);
	ПорядкиОкругленияОтчетности.Вставить("ПеречислениеПорядкиОкругленияОтчетностиОкр1000000", Перечисления.ПорядкиОкругленияОтчетности.Окр1000000);
	
	СоответствиеЕдиницыИзмеренияДелителю = Новый Структура;
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1", 1);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000", 1000);
	СоответствиеЕдиницыИзмеренияДелителю.Вставить("Окр1000000", 1000000);
	
	// Установка начального раздела декларации
	СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный";
	
	ИмяМакетаТекущегоРаздел = ИмяМакета(ИмяФормы, СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(ИмяМакетаТекущегоРаздел));
	
	Инициализация(Параметры.БезОткрытияФормы);
	
	Если ЗначениеЗаполнено(Параметры.мСохраненныйДок) Тогда
		ДанныеОтчета = Параметры.мСохраненныйДок.ДанныеОтчета.Получить();
		ОтчетСозданИзПомощника = ДанныеОтчета.Свойство("ДанныеПомощникаЗаполнения")
			И ДанныеОтчета.ДанныеПомощникаЗаполнения.Количество() > 0
			И Метаданные.Обработки.Найти("ПомощникЗаполнения3НДФЛ_2016") <> Неопределено;
	Иначе
		ОтчетСозданИзПомощника = Ложь;
	КонецЕсли;
	Элементы.ГруппаОтчетИзПомощника.Видимость = ОтчетСозданИзПомощника;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = СтрШаблон(НСтр("ru = 'Декларация 3-НДФЛ %1 (%2)'"),
		СтруктураРеквизитовФормы.СтрПериодОтчета,
		СтруктураРеквизитовФормы.НаимОрганизации);
	
	СтруктураРеквизитовФормы.ТекстДляЗаголовочнойЧасти = Заголовок;
	
	ПодключитьОбработчикОжидания("Подключаемый_ВыполнитьПроверкуПередОткрытием", 0.1, Истина);
	
	Если ЗапущеноФормированиеОтчета Тогда
			// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
			ПараметрыОбработчикаОжидания = Новый Структура;
			ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
			ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
			ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
			ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
			
			ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
			
			ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтотОбъект);
	Иначе
		ОбновитьДеревоРазделовПослеавтоЗаполнения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	РегламентированнаяОтчетностьКлиент.ПередЗакрытиемРегламентированногоОтчета(
		ЭтотОбъект, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтчетСформированВПомощникеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПомощникЗаполнения3НДФЛ_2016" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыПомощника = Новый Структура;
		ПараметрыПомощника.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
		ПараметрыПомощника.Вставить("Период", СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
		ПараметрыПомощника.Вставить("ВыбраннаяФорма", СтруктураРеквизитовФормы.мВыбраннаяФорма);
		ПараметрыПомощника.Вставить("КонтекстныйВызов", Истина);
		
		ИмяФормыПомощника = "Обработка.ПомощникЗаполнения3НДФЛ_2016.Форма.Форма";
		ОткрытьФорму(ИмяФормыПомощника, ПараметрыПомощника, ЭтотОбъект);
		
		Модифицированность = Ложь;
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОтчетСформированВПомощникеНажатие(Элемент)
	
	Элементы.ГруппаОтчетИзПомощника.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПанельОтправкиВКонтролирующиеОрганы

&НаКлиенте
Процедура ГиперссылкаПротоколНажатие(Элемент)
	
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьПротоколИзПанелиОтправки(ЭтотОбъект, "ФНС");
	Протокол = Неопределено;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОтправкиНажатие(Элемент)
	
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьСостояниеОтправкиИзПанелиОтправки(ЭтотОбъект, "ФНС");
	Протокол = Неопределено;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура КритическиеОшибкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьКритическиеОшибкиИзПанелиОтправки(ЭтотОбъект, "ФНС");
	// Конец ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНаименованиеЭтапаНажатие(Элемент)
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийНавигацииПоРазделам

&НаКлиенте
Процедура РазделыОтчетаПриАктивизацииСтроки(Элемент)
	
	Раздел = Элемент.ТекущиеДанные;
	Если Раздел <> Неопределено И Элемент.ТекущаяСтрока <> СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета Тогда
		РазделОтчетаПриИзменении(Раздел, Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличногоДокумента

&НаКлиенте
Процедура ОбработкаВыбораВПолеТабличногоДокумента(Элемент, Область, СтандартнаяОбработка)
	
	ИмяЯчейки = Область.Имя;
	
	Если РегламентированнаяОтчетностьКлиент.ВыбраннаяОбластьРегламентированногоОтчетаНеВерна(ЭтотОбъект, Область, СтандартнаяОбработка) Тогда
		Если СтрНачинаетсяС(Область.Имя, "ДобавитьСтраницу") Тогда
			ДобавитьСтраницу("");
		ИначеЕсли СтрНачинаетсяС(Область.Имя, "УдалитьСтраницу") И Область.Гиперссылка Тогда
			УдалитьСтраницу("");
		ИначеЕсли СтрНачинаетсяС(Область.Имя, "ДобавитьСтроку") Тогда
			ДобавитьСтроку("");
		ИначеЕсли СтрНачинаетсяС(Область.Имя, "УдалитьСтроку") И Область.Гиперссылка Тогда
			УдалитьСтроку("");
		ИначеЕсли СтрНачинаетсяС(Область.Имя, "СобратьДанные") И Область.Гиперссылка Тогда
			СобратьДанные("");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ИмяЯчейки = "КодИМНС" Тогда // Титульный лист
		
		// ДЕНЬГИ
		//СтандартнаяОбработка = Ложь;
		//Модифицированность   = Истина;
		//ОбработкаВыбораИФНС();
		// Конец ДЕНЬГИ
		Возврат;
		
	ИначеЕсли Лев(ИмяЯчейки, 13) = "П000400001010" Тогда //Лист Б: Код ОКСМ
		
		СтандартнаяОбработка = Ложь;
		
		ФормаВыбора = ПолучитьФорму("Справочник.СтраныМира.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтотОбъект);
		ФормаВыбора.Заголовок = НСтр("ru = 'Выбор кода страны'");
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияВыбораВПолеТабличногоДокумента("ОткрытьФормуВыбораСтраныМираЗавершение", Элемент, Область);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.Открыть();
		
	ИначеЕсли (Лев(ИмяЯчейки,13) = "П000400001030") Тогда //Лист Б: Код валюты
		
		СтандартнаяОбработка = Ложь;
		
		ФормаВыбора = ПолучитьФорму("Справочник.Валюты.ФормаВыбора", Новый Структура("РежимВыбора", Истина), ЭтотОбъект);
		ФормаВыбора.Заголовок = НСтр("ru = 'Выбор кода валюты'");
		ФормаВыбора.ОписаниеОповещенияОЗакрытии = ОписаниеОповещенияВыбораВПолеТабличногоДокумента("ОткрытьФормуВыбораКодаВалютыЗавершение", Элемент, Область);
		ФормаВыбора.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбора.Открыть();
		
	ИначеЕсли ИмяЯчейки = "П000700001051" Тогда // Лист Д1: Номер объекта
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВводСтроки(
			ОписаниеОповещенияВыбораВПолеТабличногоДокумента("ОткрытьФормуВводаСведенийОбОбъектеЗавершение", Элемент, Область),
			Область.Текст,
			НСтр("ru = 'Номер объекта'"),
			,
			Истина);
		
	ИначеЕсли ИмяЯчейки = "П000700001052" Тогда // Лист Д1: Сведения о местонахождении объекта
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВводСтроки(
			ОписаниеОповещенияВыбораВПолеТабличногоДокумента("ОткрытьФормуВводаСведенийОбОбъектеЗавершение", Элемент, Область),
			Область.Текст,
			НСтр("ru = 'Сведения о местонахождении объекта'"),
			,
			Истина);
		
	ИначеЕсли Лев(ИмяЯчейки, 13) = "П001900001010" Тогда // Расчет дохода от продажи объектов недвижимого имущества: Кадастровый номер отчужденного объекта недвижимого имущества
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВводСтроки(
			ОписаниеОповещенияВыбораВПолеТабличногоДокумента("ОткрытьФормуВводаСведенийОбОбъектеЗавершение", Элемент, Область),
			Область.Текст,
			НСтр("ru = 'Кадастровый номер отчужденного объекта недвижимого имущества'"),
			,
			Истина);
		
	Иначе
		
		ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтотОбъект, ИмяЯчейки);
		
		Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений <> Неопределено Тогда
			
			ЭтоСумма = Ложь;
			
			ВвестиПоказатель(
				Элемент,
				Область,
				ПараметрВводаПоля.Показатель,
				ЭтоСумма,
				ПараметрВводаПоля.ТекстПриВыборе,
				ПараметрВводаПоля.ТаблицаЗначений,
				СтандартнаяОбработка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеОповещенияВыбораВПолеТабличногоДокумента(ИмяПроцедуры, Элемент, Область)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРаздела", Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	ДополнительныеПараметры.Вставить("ИмяЯчейки", Область.Имя);
	ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ДополнительныеПараметры.Вставить("Область", Область);
	
	Возврат Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область)
	
	Модифицированность = Истина;
	
	ПараметрВводаПоля = СвойстваПоказателей.НайтиСтроки(Новый Структура("Показатель", Область.Имя));
	
	Если ПараметрВводаПоля.Количество() > 0 Тогда
		
		ПараметрВводаПоля = ПараметрВводаПоля[0];
		
		Если ПараметрВводаПоля.Тип = "КБК" И ЗначениеЗаполнено(Область.Значение) Тогда
			Область.Значение = СтрЗаменить(Область.Значение," ","");
		КонецЕсли;
			
		Если СтрДлина(СокрЛП(Область.Значение)) <> 0 И ПараметрВводаПоля.Длина <> 0 И СтрДлина(СокрЛП(Область.Значение)) <> ПараметрВводаПоля.Длина Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Длина значения показателя должна быть равна %1!'"), ПараметрВводаПоля.Длина);
			
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ИмяПоказателя = Область.Имя;
	
	//Изменение "по месту нахождения (учета) (код)" на Титульном листе
	Если СтрНайти(ИмяПоказателя, "ПоМесту") > 0 Тогда
		
		НовыйПоМесту = РегламентированнаяОтчетностьКлиентСервер.ВернутьЗначениеПараметраСЛиста(ЭтотОбъект, "Титульный", "ПоМесту");
		
		СтруктураРеквизитовФормы.мПоМесту = НовыйПоМесту;
		ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область);
	ИначеЕсли ИмяПоказателя = "ДатаПодписи" Тогда
		
		ДатаПодписи = Область.Значение;
		
	ИначеЕсли ИмяПоказателя = "НомерКорректировки" Тогда
		
		НомерКорректировки = Область.Значение;
		СтруктураРеквизитовФормы.ВидДокумента = ?(НомерКорректировки > 0, 1, 0);
		
	Иначе
		ИмяРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ПозицияРазделителя = 14;
	Разделитель = "_";
	
	Если Сред(Элемент.ТекущаяОбласть.Имя, ПозицияРазделителя, 1) = Разделитель Тогда
		ИмяОбластиВторойСтроки = Лев(Элемент.ТекущаяОбласть.Имя, ПозицияРазделителя - 1) + Разделитель + "2";
		Элементы.УдалитьСтроку.Доступность = РазделМногострочный(ЭтотОбъект, СтруктураРеквизитовФормы.НаимТекущегоРаздела)
			И (ТабличныйДокумент.Области.Найти(ИмяОбластиВторойСтроки) <> Неопределено);
	Иначе
		Элементы.УдалитьСтроку.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередЗагрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);
	
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОтчет(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьСведенияОбОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанные(Команда)
	
	Если Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Тогда
		
		СобратьДанныеВРаздел1();
		
	ИначеЕсли Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
		
		СобратьДанныеВРаздел2();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтраницу(Команда)
	
	ВставитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтраницуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Удалить текущую страницу?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	
	Перем МаксимальноеКоличествоСтрокГруппы, СтруктураГруппы;
	
	ИмяГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	// Исходное количество строк группы
	МаксимальноеКоличествоСтрокГруппы = МаксимальноеКоличествоСтрокНаСтранице(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	Если мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы) Тогда
		СтруктураГруппы = ЭтотОбъект[СтруктураГруппы];
	КонецЕсли;
	
	// Определяем последнюю строку многострочной группы
	Если СтруктураГруппы <> Неопределено Тогда
		Если СтруктураГруппы.Количество() = МаксимальноеКоличествоСтрокГруппы Тогда
			ТекстВопроса = СтрШаблон(
				НСтр("ru = 'Количество строк на странице не может превышать %1. Добавить новую страницу?'"),
				МаксимальноеКоличествоСтрокГруппы);
			ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСтрокуЗавершение", ЭтотОбъект, Новый Структура("Команда", Команда));
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			#Если ВебКлиент Тогда
				ДобавитьСтрокуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
			#Иначе
				ДобавитьСтрокуНаКлиенте(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
			#КонецЕсли
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция МаксимальноеКоличествоСтрокНаСтранице(ИмяСтраницы)
	
	МаксимальноеКоличествоСтрок = 0;
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		Если Раздел.ИмяСтраницы = ИмяСтраницы Тогда
			Если Раздел.МногострочностьВРазделе.Количество() <> 0 Тогда
				МаксимальноеКоличествоСтрок = Раздел.МногострочностьВРазделе[0].МаксимальноеКоличествоСтрокНаСтранице;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат МаксимальноеКоличествоСтрок;
	
КонецФункции

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекТабличноеПоле = ЭтотОбъект["ТабличныйДокумент"];
	
	ТекущаяОбласть = ТекТабличноеПоле.ТекущаяОбласть;
	ИмяГруппы      = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(ЭтотОбъект, ТекущаяОбласть);
	
	Если ИмяГруппы = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Не выбрана удаляемая строка многострочного раздела.'");
		
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьСтрокуЗавершение", ЭтотОбъект);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить выбранную строку?%1'"), Символы.ПС);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОтчет(Команда)
	
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(ЭтотОбъект, "ОчиститьВесьОтчет");
	
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницу(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьТекущуюСтраницуЗавершение", ЭтотОбъект);
	РегламентированнаяОтчетностьКлиент.МеханизмыОчисткиРегламентированныхОтчетов(
		ЭтотОбъект, "ОчиститьТекущийЭкземплярМногостраничногоРаздела"
		+ Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	ОткрытьФормуВыбораСтраниц("ВыбратьДляНастройки");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСДвухмернымШтрихкодомPDF417(Команда) Экспорт
	
	РегламентированнаяОтчетностьКлиент.ВывестиМашиночитаемуюФорму(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьБланк(Команда) Экспорт
	
	Отказ = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Команда", Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПоказатьБланкЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередПечатьюРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда)
	
	// ДЕНЬГИ
	Отказ = Ложь;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура Расшифровать(Команда)
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",							СтруктураРеквизитовФормы.Организация);
	ПараметрыОтчета.Вставить("мДатаНачалаПериодаОтчета",			СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета);
	ПараметрыОтчета.Вставить("мДатаКонцаПериодаОтчета",				СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	ПараметрыОтчета.Вставить("АдресВременногоХранилищаРасшифровки", СтруктураРеквизитовФормы.АдресВременногоХранилищаРасшифровки);
	
	ИДИменПоказателей = Новый Массив();
	ИДИменПоказателей.Добавить(Элементы.ТабличныйДокумент.ТекущаяОбласть.Имя);
	
	РегламентированнаяОтчетностьКлиент.ОткрытьРасшифровкуОтчета(Сред(Лев(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") - 1), 7), Сред(ЭтотОбъект.ИмяФормы, СтрНайти(ЭтотОбъект.ИмяФормы, ".Форма.") + 7), ИДИменПоказателей, ПараметрыОтчета)
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезПредставителя(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЧерезПредставителяЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернете(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВИнтернетеЗавершение", ЭтотОбъект);

	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтправку(Команда)
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОбновитьОтправкуИзПанелиОтправки(ЭтотОбъект, "ФНС");
	Возврат;
	// Конец ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНеотправленноеИзвещение(Команда)
	// ДЕНЬГИ
	//ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОтправитьНеотправленноеИзвещениеИзПанелиОтправки(ЭтотОбъект, "ФНС");
	Возврат;
	// Конец ДЕНЬГИ
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрган(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой", ЭтотОбъект);
	Отказ = Ложь;
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОтправкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	СохранитьНаКлиенте(, Новый ОписаниеОповещения("ЗаписатьИЗакрытьПродолжение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы(Команда)
	
	// ДЕНЬГИ
	Возврат;
	// Конец ДЕНЬГИ 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияОтчета

&НаСервере
Процедура Инициализация(БезОткрытияФормы = Ложь) Экспорт
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	СтруктураРеквизитовФормы.мБезОткрытияФормы = БезОткрытияФормы;
	
	// Заполняем показатели отчета из макета "Состав показателей"
	ЗаполнитьНачальныеНастройки();
	
	// Настройки показа и вывода на печать каждой страницы отчета
	ФормироватьСтруктуруСтраницОтчета();
	
	// Настройки свойств каждого раздела: многострочности, многостраничности, количества строк и страниц, параметров автозаполнения и т.д.
	ФормироватьСтруктуруСвойствСтраниц();
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	УстановитьМаскиВПоляхВвода(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	ТабличныйДокумент.Области.НомерКорректировки.Значение = 0;
	СтруктураРеквизитовФормы.ВидДокумента = 0;
	
	Если НЕ БезОткрытияФормы Тогда
		
		СформироватьСпискиВыбора();
		
	КонецЕсли;
	
	// Заполняем многострочные разделы нужным количеством строк
	НачальныеОперацииСМногострочнымиБлоками();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено
		И Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
		// Новый документ
		Модифицированность = Истина;
		КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
		ЗаполнитьДатуПодписи(ЭтотОбъект);
		ЗаполнитьСведенияОбОрганизации();
	ИначеЕсли ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
		// Копирование документа
		Модифицированность = Истина;
		ВосстановитьСохраненныеДанные();
		ЗаполнитьДатуПодписи(ЭтотОбъект);
		СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено;
	Иначе
		// Открытие существующего документа
		ВосстановитьСохраненныеДанные();
		Если Не БезОткрытияФормы И СтруктураРеквизитовФормы.мСохраненныйДок <> Неопределено Тогда
			ЗаблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, , УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтотОбъект);
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуЗаполнить Тогда
		Элементы.Заполнить.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураРеквизитовФормы.ОтображатьКнопкуРасшифровать Тогда
		Элементы.Расшифровать.Видимость = Ложь;
		Элементы.ТабличныйДокументКонтекстноеМенюРасшифровать.Видимость = Ложь;
	КонецЕсли;
	
	ПоказатьПериод();
	
	// формируем список элементов подменю, связанное с кнопкой <Печать>
	Если НЕ БезОткрытияФормы Тогда
		РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтотОбъект);
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.Организация <> Неопределено Тогда
		
		// ДЕНЬГИ
		//СведенияОбОрганизации = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
		//	СтруктураРеквизитовФормы.Организация, ДатаПодписи, "НаимЮЛПол, НаимЮЛСокр, ОКТМО");
		//Если СведенияОбОрганизации <> Неопределено Тогда
		//	СтруктураРеквизитовФормы.НаимОрганизации = СведенияОбОрганизации.НаимЮЛСокр;
		//	СтруктураРеквизитовФормы.НаимОрг = СведенияОбОрганизации.НаимЮЛПол;
		//	СтруктураРеквизитовФормы.ОКТМО = СведенияОбОрганизации.ОКТМО;
		//КонецЕсли;
		СтруктураРеквизитовФормы.НаимОрганизации = СтруктураРеквизитовФормы.Организация.Наименование;
		// Конец ДЕНЬГИ
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	// ДЕНЬГИ
	// 	РегламентированнаяОтчетность.ДобавитьКнопкуПрисоединенныеФайлы(ЭтаФорма);
	Элементы.Заполнить.Видимость = Ложь;
	Элементы.Расшифровать.Видимость = Ложь;
	// Конец ДЕНЬГИ
	
	РегламентированнаяОтчетностьКлиентСервер.ПриИнициализацииФормыРегламентированногоОтчета(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСохраненныйДок) Тогда
		ЗаполнитьСводныеТаблицы(ЭтотОбъект);
	Иначе
		Если Не ЗначениеЗаполнено(СтруктураРеквизитовФормы.мСкопированаФорма) Тогда
			// Заполняем итоговые разделы нового пустого отчета
			ПодготовитьДанныеРаздела2(ЭтотОбъект);
			СобратьДанныеВРаздел1Сервер();
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.СформироватьФормуОтчетаАвтоматически Тогда
		
		ЗапущеноФормированиеОтчета = НЕ ЗаполнитьАвтоНаСервере();
		
	КонецЕсли;
	
	Если НЕ БезОткрытияФормы Тогда
		ОтобразитьПоясненияКПериодуОтчета(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в таблицы многостраничных отчетов строки, соответствующие 1-й странице
&НаСервере
Процедура ИнициализацияМногостраничныхРазделов()
	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		НоваяТаблицаДанных = Отчеты.РегламентированныйОтчет3НДФЛ.НоваяТаблицаДанныхМногостраничногоРаздела();
		ЭтотОбъект[Раздел.Значение].Загрузить(НоваяТаблицаДанных);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет начальные настройки параметров отчета.
// По данным макета "СоствПоказателей" формирует:
//   - состав показателей отчета;
//   - варианты заполнения показателей отчета;
//   - дерево выводимых на печать листов отчета.
//
&НаСервере
Процедура ЗаполнитьНачальныеНастройки()
	
	СоставПоказателей = Отчеты.РегламентированныйОтчет3НДФЛ.СоставПоказателей(СтруктураРеквизитовФормы.мСоставПоказателей);
	
	мТаблицаСоставПоказателей.Загрузить(СоставПоказателей.СоставПоказателей);
	
	Для Каждого ВариантыЗаполнения Из СоставПоказателей.ДанныеВариантовАвтоЗаполнения Цикл
		Для каждого Варианты Из ВариантыЗаполнения.Значение Цикл
			НоваяСтрока = ЭтотОбъект["ТаблицаВариантыЗаполнения" + ВариантыЗаполнения.Ключ].Добавить();
			НоваяСтрока.ТаблицаВариантовЗаполнения.Загрузить(Варианты);
		КонецЦикла;
	КонецЦикла;
	
	мСтруктураВариантыЗаполнения = СоставПоказателей.СтруктураВариантовЗаполнения;
	мСтруктураВариантыЗаполненияЭталон = СоставПоказателей.СтруктураВариантовЗаполнения;
	
КонецПроцедуры

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки показа страниц, вывода на печать и выгрузки в ИМНС.
//
&НаСервере
Процедура ФормироватьСтруктуруСтраницОтчета() 
	
	ЗначениеВРеквизитФормы(
		Отчеты.РегламентированныйОтчет3НДФЛ.ДеревоСтраницОтчета(СтруктураРеквизитовФормы.мВыбраннаяФорма),
		"мДеревоСтраницОтчета");
	
КонецПроцедуры

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки многострочности, многостраничности, количества строк и страниц, параметров автозаполнения.
//
&НаСервере
Процедура ФормироватьСтруктуруСвойствСтраниц() Экспорт
	
	ЗначениеВРеквизитФормы(
		Отчеты.РегламентированныйОтчет3НДФЛ.СвойстваРазделовДекларации(СтруктураРеквизитовФормы.мВыбраннаяФорма),
		"мСвойстваРазделовДекларации");
	
КонецПроцедуры

// Заполняет списки выбора для отдельных показателей отчета
&НаСервере
Процедура СформироватьСпискиВыбора()
	
	КоллекцияСписковВыбора = Отчеты.РегламентированныйОтчет3НДФЛ.СпискиВыбора(ОтчетОбъект().ПолучитьМакет("Списки2018Кв1"));
	
	СвойстваПоказателей.Очистить();
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПоМесту", 3, , "Код категории налогоплательщика", КоллекцияСписковВыбора["КодКатегорииНалогоплательщика"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "СтатусНалогоплательщика", 1, , "Статус налогоплательщика", КоллекцияСписковВыбора["СтатусНалогоплательщика"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "КодВидаДокумента", 2, , "Выбор вида документа, удостоверяющего личность", КоллекцияСписковВыбора["КодВидаДокумента"]);
	
	// Титульный
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "ПрПодп", 0, , "Выбор подписанта", КоллекцияСписковВыбора["ВидПодписанта"]);
	
	// Итоги
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000100001010", 1, , "Выбор кода строки 010", КоллекцияСписковВыбора["КодСтроки010"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000100001020", 20, "КБК", "Выбор КБК", КоллекцияСписковВыбора["КБК"]);
	
	// Раздел2
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000200001001", 0, , "Выбор налоговой ставки", КоллекцияСписковВыбора["СтавкаНалога"]);
	ЭтотОбъект.мСтавкиНалога.Загрузить(КоллекцияСписковВыбора["СтавкаНалога"]);
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000200001002", 0, , "Выбор вида доходов", КоллекцияСписковВыбора["ВидыДоходовРаздел2"]);
	
	// Лист А
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000300001010", 0, , "Выбор налоговой ставки", КоллекцияСписковВыбора["СтавкаНалога"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000300001020", 0, , "Выбор вида дохода", КоллекцияСписковВыбора["КодыВидовДоходов"]);
	
	// Лист Б
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000400001001", 0, , "Выбор налоговой ставки", КоллекцияСписковВыбора["СтавкаНалога"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000400001031", 2, , "Выбор вида дохода", КоллекцияСписковВыбора["КодыВидовДоходовЛистаБ"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000400001073", 1, , "Выбор порядка определения прибыли", КоллекцияСписковВыбора["ПорядокОпределенияПрибылиУбыткаКИК"]);
	
	// Лист В
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000500001010", 1, , "Выбор вида деятельности", КоллекцияСписковВыбора["ВидДеятельности"]);
	
	// Лист Е2
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П001000001021", 1, , "Выбор вида договора", КоллекцияСписковВыбора["ВидыДоговоровНПС"]);
	
	// Лист Ж
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П001100001001", 1, , "Выбор места нахождения источника доходов", КоллекцияСписковВыбора["ИсточникДоходов"]);
	
	// Лист Д1
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001010", 1, , "Выбор кода наименования объекта",    КоллекцияСписковВыбора["КодНаименованияОбъекта"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001020", 1, , "Выбор вида собственности на объект", КоллекцияСписковВыбора["ВидСобственности"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001030", 2, , "Выбор признака налогоплательщика",   КоллекцияСписковВыбора["ПризнакНалогоплательщикаПоИмуществу"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001040", 1, , "Вычет заявлен в соответствии с п. 10 статьи 220 НК РФ", КоллекцияСписковВыбора["ВычетСтатьи220"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000700001050", 1, , "Код номера объекта", КоллекцияСписковВыбора["КодыНомеровНедвижимости"]);
	
	// Лист З
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П001200001100", 1, , "Выбор вида операции", КоллекцияСписковВыбора["ВидыОперацийЛистЗ"]);
	
КонецПроцедуры

// Добавляет нужное количество строк в таблицы,
// с помощью которых многострочные разделы редактируются в табличном документе
&НаСервере
Процедура НачальныеОперацииСМногострочнымиБлоками()
	
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// создаем исходную структуру многострочных разделов
	Для Каждого ЭлементСтруктуры Из мСтруктураМногострочныхРазделов Цикл
		ИмяГруппы = ЭлементСтруктуры.Ключ;
		СтруктураГруппы = ЭтотОбъект[ЭлементСтруктуры.Значение];
		
		мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
		
		Для НСтр = 1 По ИсходноеКоличествоСтрокГруппы Цикл
			
			СтруктураГруппы.Добавить();
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДеревоРазделов

&НаСервере
Процедура СформироватьДеревоРазделовОтчетаНаСервере() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДеревоРазделовОтчетаНаКлиенте() Экспорт
	
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
КонецПроцедуры

// Формирует дерево для навигации по разделам и страницам отчета
&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДеревоРазделовОтчета(Форма)
	
	Форма["РазделыОтчета"].ПолучитьЭлементы().Очистить();
	
	Для Каждого ЭлементДереваСтраницОтчета Из Форма["мДеревоСтраницОтчета"].ПолучитьЭлементы() Цикл
		
		Если ЭлементДереваСтраницОтчета.ПоказатьСтраницу = 1 Тогда
			
			ЭлементРазделовОтчета = Форма["РазделыОтчета"].ПолучитьЭлементы().Добавить();
			ЭлементРазделовОтчета.КолонкаРазделыОтчета         = ЭлементДереваСтраницОтчета.Представление;
			ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = ЭлементДереваСтраницОтчета.ИмяСтраницы;
			ЭлементРазделовОтчета.ИндексКартинки               = 1;
			ЭлементРазделовОтчета.РазделМногостраничный        = Ложь;
			Если ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = "ЛистА" 
				ИЛИ ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = "ЛистБ"
				ИЛИ ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим = "РасчетДоходаОтПродажиНедвижимости"
				Тогда
				ЭлементРазделовОтчета.РазделМногострочный          = Истина;
			Иначе
				ЭлементРазделовОтчета.РазделМногострочный          = Ложь;
			КонецЕсли;
		
			НайденноеЗначение = Неопределено;
			
			Если Форма["мСтруктураМногостраничныхРазделов"].Свойство(ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим, НайденноеЗначение) Тогда
				
				Если НЕ НайденноеЗначение = Неопределено Тогда
					
					НайденноеЗначение = Форма[НайденноеЗначение];
					
					ЭлементРазделовОтчета.ИндексКартинки        = 0;
					ЭлементРазделовОтчета.РазделМногостраничный = Истина;
					
					Для НомерСтраницы = 1 По НайденноеЗначение.Количество() Цикл
						
						СтраницаРазделаОтчета = ЭлементРазделовОтчета.ПолучитьЭлементы().Добавить();
						
						СтраницаРазделаОтчета.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
						СтраницаРазделаОтчета.КолонкаРазделыОтчетаСокрНаим      = ЭлементРазделовОтчета.КолонкаРазделыОтчетаСокрНаим;
						СтраницаРазделаОтчета.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
						СтраницаРазделаОтчета.ИндексКартинки                    = 1;
						СтраницаРазделаОтчета.РазделМногостраничный             = ЭлементРазделовОтчета.РазделМногостраничный;
						СтраницаРазделаОтчета.РазделМногострочный               = ЭлементРазделовОтчета.РазделМногострочный;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ТабличныйДокумент

&НаСервереБезКонтекста
Функция ИмяМакета(ИмяФормы, ИмяРаздела)
	
	Возврат Сред(ИмяФормы, СтрНайти(ИмяФормы, "ФормаОтчета")) + "_" + ИмяРаздела;
	
КонецФункции

&НаСервере
Процедура УстановитьМаскиВПоляхВвода(ИмяТекРаздела)
	
	ТипДата = Новый ОписаниеТипов("Дата");
	ТипЧисло = Новый ОписаниеТипов("Число");
	
	Число15_2 = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	
	Для каждого Область Из ТабличныйДокумент.Области Цикл
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение И Не ЗначениеЗаполнено(Область.Формат) Тогда
			Если Область.ТипЗначения = ТипЧисло Тогда
				Область.ТипЗначения = Число15_2;
			ИначеЕсли Область.ТипЗначения = ТипДата Тогда
				Область.Формат = "ДФ=dd.MM.yyyy";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Раздел1
	Если ИмяТекРаздела = "Раздел1" Тогда
		
		ТабличныйДокумент.Области.П000100001010.Формат = "9";
		ТабличныйДокумент.Области.П000100001030.Маска = "99999999999";
		ТабличныйДокумент.Области.П000100001020.Маска = "999999999999999999999";
		
		//Расчет по ставке
	ИначеЕсли ИмяТекРаздела = "Раздел2" Тогда
		
		ТабличныйДокумент.Области.П000200001001.Формат = "ЧЦ=2; ЧДЦ=0";
		
		//Лист А
	ИначеЕсли ИмяТекРаздела = "ЛистА" Тогда
		
		Для Сч = 1 По ЭтотОбъект.П000300001.Количество() Цикл
			
			ТабличныйДокумент.Области["П000300001020_" + Сч].Формат = "ЧЦ=2; ЧДЦ=0";
			ТабличныйДокумент.Области["П000300001030_" + Сч].Маска = "999999999999";
			ТабличныйДокумент.Области["П000300001040_" + Сч].Маска = "999999999";
			ТабличныйДокумент.Области["П000300001050_" + Сч].Маска = "99999999999";
			
		КонецЦикла;
		
		// Лист Б
	ИначеЕсли ИмяТекРаздела = "ЛистБ" Тогда
		
		ТабличныйДокумент.Области.П000400001001.Формат = "ЧЦ=2; ЧДЦ=0";
		
		Для Сч = 1 По ЭтотОбъект.П000400001.Количество() Цикл
			ТабличныйДокумент.Области["П000400001010_" + Сч].Маска = "999";
			ТабличныйДокумент.Области["П000400001030_" + Сч].Маска = "999";
		КонецЦикла;
		
	ИначеЕсли ИмяТекРаздела = "ЛистЕ2" Тогда
		
		ТабличныйДокумент.Области["П001000001010" + Сч].Маска = "999999999999";
		ТабличныйДокумент.Области["П001000001020" + Сч].Маска = "999999999";
		
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает формат, цвет, доступность и прочие свойства областей табличного документа на 
//	основании таблицы "мТаблицаСоставПоказателей". Таблица "мТаблицаСоставПоказателей" 
//	собирается по макету "СоставПоказателей..." при инициализации отчета
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФорматВыводаВПоляхВвода(Форма, НаимРаздела) Экспорт
	Перем СтруктураГруппы;
	
	Если Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 0";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 3";
	ИначеЕсли Форма.СтруктураРеквизитовФормы.ЕдиницаИзмерения = Форма.ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		Форма.СтруктураРеквизитовФормы.мСтрокаФормата = "; ЧДЦ = " + Форма.СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения + "; ЧРД=,; ЧН=-; ЧС = 6";
	КонецЕсли;
	
	Для Каждого СтрПоказатели Из Форма.мТаблицаСоставПоказателей Цикл
		
		Если НЕ НаимРаздела = СтрПоказатели.ИмяПоляТаблДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		КодПоказателя				= СокрП(СтрПоказатели.КодПоказателяПоСоставу);
		ПризнМногострочность		= СокрП(СтрПоказатели.ПризнМногострочности);
		КодПоказателяПоСтруктуре	= СокрП(СтрПоказатели.КодПоказателяПоСтруктуре);
		КодПоказателяПоФорме		= СокрП(СтрПоказатели.КодПоказателяПоФорме);
		ТипДанныхПоказателя			= СокрП(СтрПоказатели.ТипДанныхПоказателя);
		ИмяПоказателя				= ?(ПустаяСтрока(СтрПоказатели.КодПоказателяПоФорме), КодПоказателя, КодПоказателяПоФорме);
		
		Если ПустаяСтрока(КодПоказателя) ИЛИ КодПоказателя = "===" ИЛИ КодПоказателя = "###" ИЛИ Лев(КодПоказателя, 2) = "//" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипДанныхПоказателя = "Е" И ПустаяСтрока(КодПоказателяПоСтруктуре) Тогда
			ТекТабличноеПоле = Форма.ТабличныйДокумент;
			Если ПризнМногострочность <> "/" Тогда
				ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя];
				ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
				ЧислоЕЗнак = Форма.СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ;
				
				Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
					ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
				КонецЕсли;
				ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
				ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
			Иначе
				// определяем кол-во строк многострочного раздела и применяем процедуру форматирования к данной графе по всем строкам
				НСтр = 1;
				Пока ТекТабличноеПоле.Области.Найти(ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")) <> Неопределено Цикл
					ФорматируемаяОбласть = ТекТабличноеПоле.Области[ИмяПоказателя + "_" + Формат(НСтр, "ЧГ=0")];
					ДопустимыйЗнакПоказателя = ФорматируемаяОбласть.ТипЗначения.КвалификаторыЧисла.ДопустимыйЗнак;
					ЧислоЕЗнак = Форма.СтруктураРеквизитовФормы.мОписаниеТиповЧислоЕ;
					Если ДопустимыйЗнакПоказателя = ДопустимыйЗнак.Неотрицательный Тогда
						ЧислоЕЗнак = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(ЧислоЕЗнак.КвалификаторыЧисла.Разрядность,ЧислоЕЗнак.КвалификаторыЧисла.РазрядностьДробнойЧасти, ДопустимыйЗнакПоказателя));
					КонецЕсли;
					ФорматируемаяОбласть.ТипЗначения = ЧислоЕЗнак;
					ФорматируемаяОбласть.Формат = "ЧЦ = " + ЧислоЕЗнак.КвалификаторыЧисла.Разрядность + Форма.СтруктураРеквизитовФормы.мСтрокаФормата;
					НСтр = НСтр + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказателиЗначениямиПоУмолчаниюНаСервере(ИмяРаздела)
	
	ЗаполнитьПоказателиЗначениямиПоУмолчанию(ЭтотОбъект, ИмяРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьПоказателиЗначениямиПоУмолчанию(Форма, ИмяРаздела)
	
	Если ИмяРаздела = "Титульный" Тогда
		
		Форма.СтруктураДанныхТитульный.Период  = "34";
		Если Не ЗначениеЗаполнено(Форма.СтруктураДанныхТитульный.ПоМесту) Тогда
			Форма.СтруктураДанныхТитульный.ПоМесту = "720";
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = "ЛистВ" Тогда
		
		Если Форма.ТабличныйДокумент.Области.Найти("П000500001010") <> Неопределено И Форма.ТабличныйДокумент.Области["П000500001010"].Значение = 0 Тогда
			
			Форма.ТабличныйДокумент.Области["П000500001010"].Значение = 1;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001010", 1);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетСтраницыВТабличныйДокументНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, ЗаголовокРаздела = Ложь)
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь);
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета,,,ЗаголовокРаздела);
	
	СтруктураРеквизитовФормы.НаимТекущегоРаздела  = ИмяТекРаздела;
	СтруктураРеквизитовФормы.НомерТекущейСтраницы = НомерСтраницыРазделаОтчета;
	
	РасчетНаСервере(ИмяТекРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиМакетВТаблДокНаСервере(ИмяТекРаздела, НомерСтраницыРазделаОтчета, УдалениеСтраницы = Ложь, ИндексУдаляемойСтраницы = Неопределено, ЗаголовокРаздела = Ложь)
	
	ТабличныйДокумент.Очистить();
	
	ЭтоПоследняяСтраница = Истина;
	ЭтоПерваяСтраница = Истина;
	
	КоличествоПодобныхСтраниц = 0;
	
	Если РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтотОбъект, ИмяТекРаздела, "МногостраничностьВРазделе") = Истина 
		И РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтотОбъект, ИмяТекРаздела, "ПоказыватьИтогиТолькоНаПоследнейСтранице") = Истина Тогда
			
			КоличествоСтраницРаздела = ЭтотОбъект["ТаблицаСтраницы" + ИмяТекРаздела].Количество();
			Если УдалениеСтраницы И ИндексУдаляемойСтраницы + 1 = КоличествоСтраницРаздела Тогда
				ЭтоПоследняяСтраница = Истина;
			Иначе
				ЭтоПоследняяСтраница = КоличествоСтраницРаздела - НомерСтраницыРазделаОтчета = 0;
			КонецЕсли;
			
			ЭтоПерваяСтраница =  НомерСтраницыРазделаОтчета = 1;
			КоличествоПодобныхСтраниц = ЭтотОбъект["ТаблицаСтраницы" + ИмяТекРаздела].Количество() - ?(УдалениеСтраницы ,1,0);
			
	КонецЕсли;
	
	Если ЭтоПерваяСтраница И УдалениеСтраницы И КоличествоПодобныхСтраниц = 0 Тогда
		
		ЭтоПоследняяСтраница = Истина;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(ИмяМакета(ИмяФормы, ИмяТекРаздела + ?(ЭтоПоследняяСтраница,"","_Без_Итога"))));
	
	// Многостраничные разделы.
	//
	Если ИмяТекРаздела = "ЛистД1"
		ИЛИ ИмяТекРаздела = "ЛистВ" 
		ИЛИ ИмяТекРаздела = "ЛистЕ2"
		ИЛИ ИмяТекРаздела = "ЛистЖ"
		ИЛИ ИмяТекРаздела = "Раздел1"
		ИЛИ ИмяТекРаздела = "Раздел2"
		ИЛИ ИмяТекРаздела = "ЛистЗ"
		ИЛИ ИмяТекРаздела = "ЛистЗПродолжение"
		ИЛИ ИмяТекРаздела = "ЛистЗПродолжение2"
		ИЛИ ИмяТекРаздела = "ЛистЗПродолжение3"
		ИЛИ ИмяТекРаздела = "ЛистЗПродолжение4"
		Тогда
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[ИмяТекРаздела];
		
		// Управление видимостью гиперссылки "Удалить страницу"
		КоличествоСтраницРаздела = ЭтотОбъект[НаимТаблицыСтраницы].Количество() - ?(УдалениеСтраницы,1,0);
		Для каждого ТаблицаСтраницы Из ЭтотОбъект[НаимТаблицыСтраницы] Цикл
			Если КоличествоСтраницРаздела = 1 ИЛИ ЗаголовокРаздела Тогда
				Для Каждого Область Из ТабличныйДокумент.Области Цикл
					Если СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 Тогда
						Область.Текст = "";
						Область.Гиперссылка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных = Новый Структура;
		
		СписокДанных = ЭтотОбъект[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		// Сбрасываем активность всех страниц, активность новой выведенной страницы будет установлена ниже
		// Если выводится предыдущая страница перед удалением, то сбрасывать активность не нужно
		// Активная страница будет удалена, а активность перемещена на предыдущую страницу, которая уже выведена
		Если НЕ УдалениеСтраницы Тогда
			Для каждого ТаблицаСтраницы Из ЭтотОбъект[НаимТаблицыСтраницы] Цикл
				ТаблицаСтраницы.АктивнаяСтраница = Ложь;
			КонецЦикла;
		КонецЕсли;
		// Устанавливаем признак активной страницы только если это не удаление страницы
		// При удалении страницы все происходит по другому, сначала мы показываем предыдущую
		// не активную страницу, и только затем удаляем активную, поэтому в режиме удаления страницы
		// не устанавливаем активность на выведенной странице, активность будет перемещена 
		// на выведенную сейчас страницу после удаления активной страницы (которую удаляем)
		ЭтотОбъект[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = ?(ИндексУдаляемойСтраницы = 0 ,Истина ,НЕ УдалениеСтраницы);
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли; 
		КонецЦикла;
		
		// Многостраничные и многострочные разделы.
		//
	ИначеЕсли ИмяТекРаздела = "ЛистА" Или ИмяТекРаздела = "ЛистБ" Или ИмяТекРаздела = "РасчетДоходаОтПродажиНедвижимости" Тогда
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[ИмяТекРаздела];
		
		// Управление видимостью гиперссылки "Удалить страницу"
		КоличествоСтраницРаздела = ЭтотОбъект[НаимТаблицыСтраницы].Количество() - ?(УдалениеСтраницы,1,0);
		Для каждого ТаблицаСтраницы Из ЭтотОбъект[НаимТаблицыСтраницы] Цикл
			Если КоличествоСтраницРаздела = 1 ИЛИ ЗаголовокРаздела Тогда
				Для Каждого Область Из ТабличныйДокумент.Области Цикл
					Если СтрЧислоВхождений(Область.Имя, "УдалитьСтраницу") > 0 Тогда
						Область.Текст = "";
						Область.Гиперссылка = Ложь;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		СтруктураДанных = Новый Структура;
		
		НомерСтраницыРазделаОтчета = Мин(ЭтотОбъект[НаимТаблицыСтраницы].Количество(), НомерСтраницыРазделаОтчета);
		
		СписокДанных = ЭтотОбъект[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].Данные;
		
		// Сбрасываем активность всех страниц, активность новой выведенной страницы будет установлена ниже
		// Если выводится предыдущая страница перед удалением, то сбрасывать активность не нужно
		// Активная страница будет удалена, а активность перемещена на предыдущую стрнаицу, которая уже выведена
		Если НЕ УдалениеСтраницы Тогда
			Для каждого ТаблицаСтраницы Из ЭтотОбъект[НаимТаблицыСтраницы] Цикл
				ТаблицаСтраницы.АктивнаяСтраница = Ложь;
			КонецЦикла;
		КонецЕсли;
	
		// Устанавливаем признак активной страницы только если это не удаление страницы
		// При удалении страницы все происходит по другому, сначала мы показываем предыдущую
		// не активную страницу, и только затем удаляем активную, поэтому в режиме удаления страницы
		// не устанавливаем активность на выведенной странице, активность будет перемещена 
		// на выведенную сейчас страницу после удаления активной страницы (которую удаляем)
		ЭтотОбъект[НаимТаблицыСтраницы][НомерСтраницыРазделаОтчета - 1].АктивнаяСтраница = ?(ИндексУдаляемойСтраницы = 0 ,Истина ,НЕ УдалениеСтраницы);
		
		Если СписокДанных.Количество() > 0 Тогда
			СтруктураДанных = СписокДанных[0].Значение;
		КонецЕсли;
		
		Для Каждого ЭлСтруктуры Из СтруктураДанных Цикл
			
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли; 
			
		КонецЦикла;
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ИмяТекРаздела, ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтотОбъект[ТаблицаСтраницРаздела];
		
		СтрСледующаяСтраница = ТаблицаСтраницРаздела[НомерСтраницыРазделаОтчета - 1];
		
		// Устанавливаем признак активной страницы только если это не удаление страницы
		СтрСледующаяСтраница.АктивнаяСтраница = ?(ИндексУдаляемойСтраницы = 0 ,Истина ,НЕ УдалениеСтраницы);
		
		ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(ЭтотОбъект, ИмяТекРаздела);
		
		РазделМногострочный = РазделМногострочный(ЭтотОбъект, ИмяТекРаздела);
		
		Если РазделМногострочный Тогда
			
			НовДанныеДопСтрокРаздела = СтрСледующаяСтраница.ДанныеДопСтрок;
			
			Если (ТипЗнч(НовДанныеДопСтрокРаздела) = Тип("СписокЗначений"))
				И (НовДанныеДопСтрокРаздела.Количество() > 0)
				И (НовДанныеДопСтрокРаздела[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела") Тогда
				
				НовДанныеДопСтрокРаздела = НовДанныеДопСтрокРаздела[0].Значение;
				
			Иначе
				
				НовДанныеДопСтрокРаздела = Неопределено;
				
			КонецЕсли;
			
			// Способ хранения многострочных частей
			СохранятьМногострКакТЗ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтотОбъект, ИмяТекРаздела, "СохранятьМногострКакТЗ");
			
		Иначе
			
			НовТаблицаДопСтрокРаздела = Неопределено; // Многострочности нет
			ИмяГруппыДопСтрок = Неопределено; // Имя группы строк неопределено
			
		КонецЕсли;
		
		Если НовДанныеДопСтрокРаздела <> Неопределено Тогда
			
			// В случае, если многострочных частей больше 1, то хранится структура, иначе, таблица значений с данными
			Если РазделМногострочный И (НЕ СохранятьМногострКакТЗ) Тогда
				
				Для Каждого ГруппаСтрок Из НовДанныеДопСтрокРаздела Цикл
					ИмяГруппыДопСтрок = ГруппаСтрок.Ключ;
					ДанныеГруппыСтрок = ГруппаСтрок.Значение;
					
					ПромТаблицаГруппыСтрок = ЭтотОбъект["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
					
					КопироватьДанныеФормы(ДанныеГруппыСтрок, ПромТаблицаГруппыСтрок);
					
					// Заменяем таблицу значений с данными текущей страницы.
					КопироватьДанныеФормы(ПромТаблицаГруппыСтрок, ЭтотОбъект[ИмяГруппыДопСтрок]);
					
					ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаГруппыСтрок);
					ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппыДопСтрок);
					
				КонецЦикла;
				
			ИначеЕсли РазделМногострочный И (СохранятьМногострКакТЗ) Тогда
				
				ИмяГруппыДопСтрок = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяТекРаздела);
				
				ПромТаблицаДопСтрокРаздела = ЭтотОбъект["Хранилище" + ИмяГруппыДопСтрок].Добавить().Таблица;
				
				КопироватьДанныеФормы(НовДанныеДопСтрокРаздела, ПромТаблицаДопСтрокРаздела);
				
				// Заменяем таблицу значений с данными текущей страницы.
				КопироватьДанныеФормы(ПромТаблицаДопСтрокРаздела, ЭтотОбъект[ИмяГруппыДопСтрок]);
				
				// Выводим в табличный документ данные группы дополнительных строк и обновляем структуру многострочного раздела
				ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппыДопСтрок, ПромТаблицаДопСтрокРаздела);
				ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппыДопСтрок);
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОтрисоватьЗначкиУдаленияСтрок(ТабличныйДокумент);
		
	Иначе
		
		Для Каждого ЭлСтруктуры Из ЭтотОбъект["СтруктураДанных" + ИмяТекРаздела] Цикл
			Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
				ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьМаскиВПоляхВвода(ИмяТекРаздела);
	
	ЗаполнитьПоказателиЗначениямиПоУмолчаниюНаСервере(ИмяТекРаздела);
	
	УстановитьФорматВыводаВПоляхВводаНаСервере(ИмяТекРаздела);
	
	УстановитьЦветФонаЯчейкиНаСервере(,, ИмяТекРаздела);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтрисоватьЗначкиУдаленияСтрок(ТабДок)
	
	МассивОбластейСДопСтроками = Новый Массив;
	
	Для Каждого ОбластьТД Из ТабДок.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			Если СтрЧислоВхождений(ОбластьТД.Имя, "_2") > 0 Тогда
				МассивОбластейСДопСтроками.Добавить(Лев(ОбластьТД.Имя, 26));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОбластьТД Из ТабДок.Области Цикл
		Если СтрЧислоВхождений(ОбластьТД.Имя, "УдалитьСтроку") > 0 Тогда
			Если МассивОбластейСДопСтроками.Найти(Лев(ОбластьТД.Имя, 26)) = Неопределено Тогда
				ОбластьТД.Гиперссылка = Ложь;
				ОбластьТД.Текст = "";
			Иначе
				ОбластьТД.Гиперссылка = Истина;
				ОбластьТД.Текст = "х";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦветФонаЯчейкиНаКлиенте(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	УстановитьЦветФонаЯчейки(ЭтотОбъект, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

// Процедура управляет цветом фона автозаполняемых ячеек при:
//  а) автозаполнении;
//  б) ручном выборе другого варианта заполнения;
//  в) добавлении/удалении и листании дополнительных страниц.
//
// Цвет фона устанавливается в зависимости от варианта заполнения ячейки.
//
// Параметры:
//  ИмяЯчейки                - строка, имя ячейки, для которой устанавливаем цвет фона;
//  ВариантЗаполнения        - число,  вариант заполнения ячейки;
//  ИмяТекущейСтраницыПанели - строка, имя страницы основной панели, на которой для всех автозаполняемых
//                             ячеек табличного документа следует установить цвет фона.
//
&НаСервере
Процедура УстановитьЦветФонаЯчейкиНаСервере(ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	УстановитьЦветФонаЯчейки(ЭтотОбъект, ИмяЯчейки, ВариантЗаполнения, ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

// Процедура управляет цветом фона автозаполняемых ячеек при:
//  а) автозаполнении;
//  б) ручном выборе другого варианта заполнения;
//  в) добавлении/удалении и листании дополнительных страниц.
//
// Цвет фона устанавливается в зависимости от варианта заполнения ячейки.
//
// Параметры:
//  ИмяЯчейки                - строка, имя ячейки, для которой устанавливаем цвет фона;
//  ВариантЗаполнения        - число,  вариант заполнения ячейки;
//  ИмяТекущейСтраницыПанели - строка, имя страницы основной панели, на которой для всех автозаполняемых
//                             ячеек табличного документа следует установить цвет фона.
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЦветФонаЯчейки(Форма, ИмяЯчейки = Неопределено, ВариантЗаполнения = Неопределено, ИмяТекущейСтраницыПанели = "") Экспорт
	
	Перем ЦветФона;
	Перем Комментарий;
	
	// Не нужно разукрашивать табличные поля, если открывается без открытия формы (например печать или просмотр)
	Если Форма.СтруктураРеквизитовФормы.мБезОткрытияФормы ИЛИ Форма.СтруктураРеквизитовФормы.мРежимПечати Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИмяЯчейки = Неопределено Тогда
		// устанавливаем цвет фона конкретной ячейки
		#Если НаКлиенте Тогда
			ИмяСтраницыПанели = РегламентированнаяОтчетностьКлиент.ОпределитьСтраницуПанелиПоКодуПоказателяНаКлиенте(Форма, ИмяЯчейки);
		#Иначе
			ИмяСтраницыПанели = РегламентированнаяОтчетностьВызовСервера.ОпределитьСтраницуПанелиПоКодуПоказателяНаСервере(Форма, ИмяЯчейки);
		#КонецЕсли
		Если ИмяСтраницыПанели = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяПоляТаблДокумента = "ТабличныйДокумент";
		
		Ключ = "_" + ВариантЗаполнения;
		Форма.мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);
		
		// КодПоказателяПоСтруктуре
		ЗначениеВКвадратах = РегламентированнаяОтчетностьКлиентСервер.ОбластьЯвляетсяЯчейкойСоставногоПоля(Форма, ИмяЯчейки);
		
		Если ВариантЗаполнения = 4 ИЛИ ВариантЗаполнения = 5 Тогда
			
			Если ЗначениеВКвадратах Тогда
				// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
				РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "УстановитьЗащиту");
			Иначе
				Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].Защита = Истина;
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеВКвадратах Тогда
				// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
				РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "СнятьЗащиту");
			Иначе
				Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].Защита = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		// установим цвет ячейки
		Если ЗначениеВКвадратах Тогда
			РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяЯчейки, "ПроставитьЦветРаскраски", ЦветФона);
		Иначе
			Форма[ИмяПоляТаблДокумента].Области[ИмяЯчейки].ЦветФона = ЦветФона;
		КонецЕсли;
		
	Иначе
		// устанавливаем цвет фона всех автозаполняемых ячеек активной страницы
		
		#Если НаКлиенте Тогда
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьКлиент.ПолучитьТаблицуВариантовЗаполненияНаКлиенте(Форма, ИмяТекущейСтраницыПанели);
		#Иначе
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(Форма, ИмяТекущейСтраницыПанели);
		#КонецЕсли
		
		Если ТаблицаВариантыЗаполнения = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого Строка Из ТаблицаВариантыЗаполнения Цикл
			ИмяПоказателя            =  Строка.КодПоказателя;
			ВариантЗаполнения        =  Строка.ВариантЗаполнения;
			Комментарий              =  Строка.Комментарий;
			КодПоказателяПоСтруктуре =  Строка.КодПоказателяПоСтруктуре;
			
			КолвоСтрокВМногострочнойЧасти = РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(Форма, ИмяПоказателя);

			ИмяГруппы = ИмяГруппы(ИмяПоказателя);
			ПоказательМногострочный = Ложь;
			Если Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы) Тогда
				Для Каждого СтруктураГруппы Из Форма[ИмяГруппы] Цикл
					ПоказательМногострочный = СтруктураГруппы.Свойство(ИмяПоказателя);
					Прервать;
				КонецЦикла;
			КонецЕсли;
			
			Если КолвоСтрокВМногострочнойЧасти > 0 И ПоказательМногострочный Тогда
				Многострочность = Истина;
				БазоваяЧасть = ИмяПоказателя;
				ОписанияБлоков = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяТекущейСтраницыПанели, "МногострочностьВРазделе");
				
				Если ТипЗнч(ОписанияБлоков) = Тип("Число") Тогда
					ВБлокеВсеПоказателиЗаполняются = Истина;
				ИначеЕсли ТипЗнч(ОписанияБлоков) = Тип("ДанныеФормыКоллекция") Тогда
					ИмяГруппы = ИмяГруппы(ИмяПоказателя);
					ВБлокеВсеПоказателиЗаполняются = НЕ ОписанияБлоков.НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0].НезаполняемыеПоказателиЕсть;
				КонецЕсли;
				
			Иначе
				Многострочность = Ложь;
				ВБлокеВсеПоказателиЗаполняются = Истина;
				КолвоСтрокВМногострочнойЧасти = 1;
			КонецЕсли;
			
			Для Инд = 1 по КолвоСтрокВМногострочнойЧасти Цикл
				
				Если Многострочность Тогда
					ИмяПоказателя = БазоваяЧасть + "_" + Формат(Инд, "ЧГ=0");
				КонецЕсли;
				
				Если Форма.ТабличныйДокумент.Области.Найти(ИмяПоказателя) <> Неопределено Тогда
					
					ТекОбластьЯчеек = Форма.ТабличныйДокумент.Области[ИмяПоказателя];
					Если (Не ПустаяСтрока(Комментарий)) ИЛИ (Не ПустаяСтрока(ТекОбластьЯчеек.Примечание.Текст)) Тогда
						ТекОбластьЯчеек.Примечание.Текст = Комментарий;
					КонецЕсли;
					
					Ключ = "_" + ВариантЗаполнения;
					Форма.мСтруктураЦветовРаскраски.Свойство(Ключ, ЦветФона);
					
					ЗначениеВКвадратах = ?(ПустаяСтрока(КодПоказателяПоСтруктуре), Ложь, Истина);
					
					Если ВариантЗаполнения = 4 ИЛИ ВариантЗаполнения = 5 Тогда
						
						Если ЗначениеВКвадратах Тогда
							// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
							РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяПоказателя, "УстановитьЗащиту");
						Иначе
							Форма.ТабличныйДокумент.Области[ИмяПоказателя].Защита = Истина;
						КонецЕсли;
						
					Иначе
						
						Если ЗначениеВКвадратах Тогда
							// если ЗНАЧЕНИЕ КВАДРАТИЧНОЕ
							РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяПоказателя, "СнятьЗащиту");
						Иначе
							Форма.ТабличныйДокумент.Области[ИмяПоказателя].Защита = Ложь;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеВКвадратах Тогда
						РегламентированнаяОтчетностьКлиентСервер.СвойстваГрупповыхЗначений(Форма, ИмяПоказателя, "ПроставитьЦветРаскраски", ЦветФона);
					Иначе
						Форма.ТабличныйДокумент.Области[ИмяПоказателя].ЦветФона = ЦветФона;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСодержимогоВПолеТабличногоДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ИмяПоказателя = ДополнительныеПараметры.ИмяПоказателя;
	ИмяРаздела = ДополнительныеПараметры.ИмяРаздела;
	НовыйПоМесту = ДополнительныеПараметры.НовыйПоМесту;
	Область = ДополнительныеПараметры.Область;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		//Пользователь отказался очистить отчет - возврат к старому значению
		ТабличныйДокумент.Области.ПоМесту.Значение = СтруктураРеквизитовФормы.мПоМесту;
		Возврат;
	Иначе 
		//Пользователь согласился очистить отчет
		СтруктураРеквизитовФормы.мПоМесту = НовыйПоМесту;	
		
		ОчиститьНаСервере();
		
		РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтотОбъект);
		СтруктураРеквизитовФормы.НомерТекущейСтраницы = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
		
	КонецЕсли;
	РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДатуПодписи(Форма)
	
	ДатаПодписи = ТекущаяДатаСеанса();
	
	Форма.ДатаПодписи = ДатаПодписи;
	Форма.СтруктураДанныхТитульный.ДатаПодписи = ДатаПодписи;
	УстановитьЗначениеПоля(Форма, "ДатаПодписи", ДатаПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетПослеИзмененияСодержания(ИмяПоказателя, ИмяРаздела, Область)
	
	Если (Лев(ИмяПоказателя,13) = "П000400001040") Тогда //Лист Б информация о дате получения дохода в валюте, нужно перечитать курс
		Курс = ПолучитьКурсВалютыНаДату(ТабличныйДокумент.Области["П000400001030" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"))].Значение, Область.Значение);
		ИмяПоказателяКурса = "П000400001050" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"));
		ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
		СохранитьЗначениеПоказателяВСтруктуре(ЭтотОбъект, ИмяРаздела, ИмяПоказателяКурса, Курс);
	КонецЕсли;
	
	Если (Лев(ИмяПоказателя,13) = "П000400001080") Тогда //Лист Б информация о дате уплаты налога в валюте, нужно перечитать курс
		Курс = ПолучитьКурсВалютыНаДату(ТабличныйДокумент.Области["П000400001030" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"))].Значение, Область.Значение);
		ИмяПоказателяКурса = "П000400001090" + Сред(ИмяПоказателя, СтрНайти(ИмяПоказателя,"_"));
		ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
		СохранитьЗначениеПоказателяВСтруктуре(ЭтотОбъект, ИмяРаздела, ИмяПоказателяКурса, Курс);
	КонецЕсли;
	
	//действия, связанные с показателями, обладающими списками выбора,
	//на элементы которых наложены условия (макет "Списки...")

	Если ИмяПоказателя = "СтатусНалогоплательщика" Тогда
		ОбновитьПеременныеМодуляНаКлиенте("СтатусНалогоплательщика",Область.Значение);
	КонецЕсли;
	
	//расчет выполняется в структуре, обновляем каждое значение после ввода
	
	Если ИмяРаздела = "Титульный"
		И ИмяПоказателя = "Фамилия"
		Или ИмяПоказателя = "Имя"
		Или ИмяПоказателя = "Отчество"
		Или ИмяПоказателя = "ИНН"
		Тогда
		СохранитьЗначениеПоказателяВСтруктуреНаСервере(ИмяРаздела, ИмяПоказателя, Область.Значение);
	Иначе
		СохранитьЗначениеПоказателяВСтруктуре(ЭтотОбъект, ИмяРаздела, ИмяПоказателя, Область.Значение);
	КонецЕсли;

	Если НЕ ИмяРаздела = "Титульный" Тогда
		
		РасчетНаКлиенте(ИмяРаздела, ИмяПоказателя);
		
		СтруктураРеквизитовФормы.НужноРассчитатьОтчетНаСервере = Истина; //Сделаем пересчет на сервере всех разделов
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РазделыОтчета.ТекущиеДанные;
	
	КопияТекущиеДанные = ТекущиеДанные;
	
	ТекущиеДанные = ТекущиеДанные.ПолучитьРодителя();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСтраницТекущегоРаздела = ТекущиеДанные.ПолучитьЭлементы().Количество();
	
	Если КоличествоСтраницТекущегоРаздела = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтраницаРазделаПослеУдаления = Неопределено;
	Если КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета = КоличествоСтраницТекущегоРаздела Тогда
		ТекущаяСтраницаРазделаПослеУдаления = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(ТекущиеДанные.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", КопияТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета - 1);
		СтруктураРеквизитовФормы.НомерТекущейСтраницы = ТекущаяСтраницаРазделаПослеУдаления.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	НаимРаздела = КопияТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	
	//Для многостраничных разделов и разделов с итогами не на каждой странице, может понадобиться другой макет
	Если НаимРаздела = "Раздел1"
		Или НаимРаздела = "Раздел2"
		Или НаимРаздела = "ЛистА"
		Или НаимРаздела = "РасчетДоходаОтПродажиНедвижимости"
		Или НаимРаздела = "ЛистБ" 
		Или НаимРаздела = "ЛистВ" 
		Или НаимРаздела = "ЛистД1"
		Или НаимРаздела = "ЛистЕ2"
		Или НаимРаздела = "ЛистЖ"
		Тогда
		
		НомерВыводимойСтраницы = СтруктураРеквизитовФормы.НомерТекущейСтраницы;
		Если ТекущаяСтраницаРазделаПослеУдаления = Неопределено Тогда
			НомерВыводимойСтраницы = ?(СтруктураРеквизитовФормы.НомерТекущейСтраницы = КоличествоСтраницТекущегоРаздела, КоличествоСтраницТекущегоРаздела, СтруктураРеквизитовФормы.НомерТекущейСтраницы + 1);
		КонецЕсли;
	
		ВывестиМакетВТаблДокНаСервере(НаимРаздела, НомерВыводимойСтраницы, Истина, ТекущиеДанные.ПолучитьЭлементы().Индекс(КопияТекущиеДанные));
		РасчетНаКлиенте(НаимРаздела);
	КонецЕсли;
	
	ИндексУдаляемойСтраницы = ТекущиеДанные.ПолучитьЭлементы().Индекс(КопияТекущиеДанные);
	
	УдалитьДополнительнуюСтраницуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим, ИндексУдаляемойСтраницы);
	
	ТекущиеДанные.ПолучитьЭлементы().Удалить(ИндексУдаляемойСтраницы);
	
	НомерСтраницы = 1;
	
	Для Каждого СтраницаРаздела Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		
		СтраницаРаздела.КолонкаРазделыОтчета              = "Стр. " + НомерСтраницы;
		СтраницаРаздела.КолонкаНомерСтраницыРазделаОтчета = НомерСтраницы;
		
		НомерСтраницы = НомерСтраницы + 1;
		
	КонецЦикла;
	
	Если НЕ ТекущаяСтраницаРазделаПослеУдаления = Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = ТекущаяСтраницаРазделаПослеУдаления.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Команда = ДополнительныеПараметры.Команда;
	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДобавитьСтраницу(Команда);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		УдалитьДополнительнуюСтрокуНаСервере(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		
	#Иначе
		
		УдалитьДополнительнуюСтрокуНаКлиенте(Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	ИдГрупп.Вставить("мИдРасчетаДоходаОтПродажиНедвижимости", СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

&НаСервере
Функция ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИдГруппы) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	ИдГрупп.Вставить("мИдРасчетаДоходаОтПродажиНедвижимости", СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости);
	
	Возврат ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп);
	
КонецФункции

// Функция определяет поле табличного документа формы, содержащее 
// многострочный раздел.по имени ИдГруппы.
//
// Параметры:
//  ИдГруппы - строка, имя многострочного раздела.
//
// Возвращаемое значение:
//  Поле табличного документа.
//
&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьТабличноеПолеПоИдМногострочногоРаздела(ИдГруппы, ИдГрупп) Экспорт
	
	Перем ТекТабличноеПоле;
	
	Если ИдГруппы = ИдГрупп.мИдГруппыА Тогда
		ТекТабличноеПоле = "ЛистА";
	ИначеЕсли ИдГруппы = ИдГрупп.мИдГруппыБ Тогда
		ТекТабличноеПоле = "ЛистБ";
	ИначеЕсли ИдГруппы = ИдГрупп.мИдРасчетаДоходаОтПродажиНедвижимости Тогда
		ТекТабличноеПоле = "РасчетДоходаОтПродажиНедвижимости";
	КонецЕсли;
	
	Возврат ТекТабличноеПоле;
	
КонецФункции

&НаСервере
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	ИдГрупп.Вставить("мИдРасчетаДоходаОтПродажиНедвижимости", СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

&НаКлиенте
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ИмяЛиста = Неопределено) Экспорт
	
	ИдГрупп = Новый Структура;
	ИдГрупп.Вставить("мИдГруппыА", СтруктураРеквизитовФормы.мИдГруппыА);
	ИдГрупп.Вставить("мИдГруппыБ", СтруктураРеквизитовФормы.мИдГруппыБ);
	ИдГрупп.Вставить("мИдРасчетаДоходаОтПродажиНедвижимости", СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости);
	
	Возврат ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста, , ИдГрупп);
	
КонецФункции

// Функция определяет многострочный раздел табличного документа
// на активной странице основной панели формы.
//
// Параметры:
//  Нет;
//
// Возвращаемое значение:
//  строка, имя многострочного раздела.
//
&НаКлиентеНаСервереБезКонтекста
Функция ОпределитьИдМногострочногоРазделаПоАктивнойСтранице(ИмяЛиста = Неопределено, ТекущаяСтраница, ИдГрупп)
	Перем ИмяГруппы;
	
	Если ИмяЛиста = Неопределено Тогда
		ИмяТекущейСтраницыПанели = ТекущаяСтраница.Имя;
	Иначе
		ИмяТекущейСтраницыПанели = ИмяЛиста;
	КонецЕсли;
	
	Если ИмяТекущейСтраницыПанели = "ЛистА" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппыА;
	ИначеЕсли ИмяТекущейСтраницыПанели = "ЛистБ" Тогда
		ИмяГруппы = ИдГрупп.мИдГруппыБ;
	ИначеЕсли ИмяТекущейСтраницыПанели = "РасчетДоходаОтПродажиНедвижимости" Тогда
		ИмяГруппы = ИдГрупп.мИдРасчетаДоходаОтПродажиНедвижимости;
	КонецЕсли;
	
	Возврат ИмяГруппы;
	
КонецФункции

&НаСервере
Процедура ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы) Экспорт
	
	ВывестиРазделВТабличныйДокумент(ЭтотОбъект, ИмяГруппы, СтруктураГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы) Экспорт
	
	ВывестиРазделВТабличныйДокумент(ЭтотОбъект, ИмяГруппы, СтруктураГруппы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВывестиРазделВТабличныйДокумент(Форма, ИмяГруппы, СтруктураГруппы)
	Перем ИсходноеКоличествоСтрокГруппы;
	
	#Если НаКлиенте Тогда
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаКлиенте(ИмяГруппы);
	#Иначе
		ТекущаяСтраница = Форма.ОпределитьТабличноеПолеПоИдМногострочногоРазделаНаСервере(ИмяГруппы);
	#КонецЕсли
		
	// определим исходное колво строк многострочного раздела,
	// соответствующее бумажной форме отчета
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	// реальное кол-во строк (колво заполненных строк)
	ТекущееКоличествоСтрокГруппы = СтруктураГруппы.Количество();
		
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
		
	ПерерисоватьСтроки = (НЕ ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы);
		
	Раздел = Форма[ТекТабличноеПолеИмя];
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// При восстановлении сохраненных данных отчета сравниваем исходное кол-во
	// отображаемых в форме строк многострочного раздела с реальным количеством
	// созданных строк в сохраненном отчете.
	Если ТекущееКоличествоСтрокГруппы > ИсходноеКоличествоСтрокГруппы Тогда
		
		// При превышении реального кол-ва строк над исходным кол-вом (по шаблону),
		// автоматически добавляем необходимое колво строк.
		Форма.ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки);

		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
		ОтрисоватьЗначкиУдаленияСтрок(ТекТабличноеПоле);
		
	КонецЕсли;
	
	// выводим значения строк
	Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
		НомерСтрокиВТаблице      = СтруктураГруппы.Индекс(СтрокаТаблицы);
		НомерСтрокиВФормеТаблицы = НомерСтрокиВТаблице + 1;
		НомерСтрокиВФормеТаблицыСтр = Формат(НомерСтрокиВФормеТаблицы, "ЧГ=0");
		
		СписокКолонок = Форма["СписокКолонок" + ИмяГруппы];
		Для Каждого Колонка Из СписокКолонок Цикл
			
			КолонкаТаблицыИмя = Колонка.Значение;
			
			Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
				
				ЗначениеЯчейки = СтрокаТаблицы[КолонкаТаблицыИмя];
				ИмяЯчейки = СтрШаблон("%1_%2", КолонкаТаблицыИмя, НомерСтрокиВФормеТаблицыСтр);
				
				ОбластьЯчейкиТаблицы = ТекТабличноеПоле.Области.Найти(ИмяЯчейки);
				Если ОбластьЯчейкиТаблицы <> Неопределено Тогда
					Если ОбластьЯчейкиТаблицы.СодержитЗначение = Истина Тогда
						ОбластьЯчейкиТаблицы.Значение = ЗначениеЯчейки;
					Иначе
						ОбластьЯчейкиТаблицы.Текст = ЗначениеЯчейки;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьФорматВыводаВПоляхВводаНаСервере(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтотОбъект, НаимРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФорматВыводаВПоляхВводаНаКлиенте(НаимРаздела)
	
	УстановитьФорматВыводаВПоляхВвода(ЭтотОбъект, НаимРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличноеПолеНаКлиенте(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтотОбъект, ВыбТабличноеПолеИмя);
	
	Если ВыбТабличноеПолеИмя = "ЛистА"
		Или ВыбТабличноеПолеИмя = "ЛистБ"
		Или ВыбТабличноеПолеИмя = "РасчетДоходаОтПродажиНедвижимости" Тогда
		ОтрисоватьЗначкиУдаленияСтрок(ЭтотОбъект.ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличноеПолеНаСервере(ВыбТабличноеПолеИмя) Экспорт
	
	ОчиститьТабличноеПоле(ЭтотОбъект, ВыбТабличноеПолеИмя);
	
	Если ВыбТабличноеПолеИмя = "ЛистА"
		Или ВыбТабличноеПолеИмя = "ЛистБ"
		Или ВыбТабличноеПолеИмя = "РасчетДоходаОтПродажиНедвижимости" Тогда
		ОтрисоватьЗначкиУдаленияСтрок(ЭтотОбъект.ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает содержимое редактируемых и вычисляемых ячеек
// поля табличного документа, переданного параметром ВыбТабличноеПоле.
//
// Параметры:
//  ВыбТабличноеПоле - поле табличного документа.
//
&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя)
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьТабличноеПоле(Форма, ВыбТабличноеПолеИмя);
	
КонецПроцедуры

&НаСервере
Процедура ОчисткаРегламентированногоОтчетаНаСервере(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			
			ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы);
			
			УдалятьсяВсеДопЭкземпляры = Истина;
			
		Иначе
			
			ОчиститьТабличноеПолеНаСервере(ИмяСтраницы);
			
		КонецЕсли;
		
		СформироватьДеревоРазделовОтчетаНаСервере();
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;

	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеСпец(ИмяСтраницы);
		
	КонецЕсли;
	
	Если ИмяСтраницы = "Титульный" Тогда
		Если Элементы.Найти("ДатаПодписи") = Неопределено Тогда
			Область = ТабличныйДокумент.Области.Найти("ДатаПодписи");
			Если НЕ Область = Неопределено Тогда
				Если ТипЗнч(Область.Значение) = Тип("Строка") Тогда
					ДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
				ИначеЕсли ТипЗнч(Область.Значение) = Тип("Дата") Тогда
					Если ЗначениеЗаполнено(Область.Значение) Тогда
						ДатаПодписи = Лев(СтрЗаменить(Формат(Область.Значение, "ДФ = ""дд.ММ.гггг 'г.'"""), ".", ""), 8);
					Иначе
						ДатаПодписи = "        ";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтотОбъект, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаРегламентированногоОтчетаНаКлиенте(ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста, РежимОчистки, Многостраничность, КолВоСтраницВРазделе) Экспорт
	
	УдалятьсяВсеДопЭкземпляры = Ложь;
	
	Если СтрНайти(РежимОчистки, "ОчиститьТекущийРаздел") > 0 Тогда
		
		Если (Многостраничность) И (КолВоСтраницВРазделе > 1) Тогда
			
			РегламентированнаяОтчетностьКлиентСервер.ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтотОбъект, ИмяСтраницы);
			
			УдалятьсяВсеДопЭкземпляры = Истина;
			
		Иначе
			
			ОчиститьТабличноеПолеНаКлиенте(ИмяСтраницы);
			
		КонецЕсли;
		
	ИначеЕсли СтрНайти(РежимОчистки, "ОчиститьТекущийЭкземплярМногостраничногоРаздела") > 0 Тогда
		
		ОчиститьТабличноеПолеСпец(ИмяСтраницы);
		
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиентСервер.ПослеОчисткиРегламентированногоОтчета(ЭтотОбъект, ИмяСтраницы, ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста);
	
	СформироватьДеревоРазделовОтчетаНаКлиенте();
	
КонецПроцедуры

// СпециальныеОперацииПослеОчисткиЛистаНаСервере
// Процедура вызывается из модуля РО. При удалении листа любого раздела отчета.
// Вызов происходит в том случае, если в св-вах раздела установлен реквизит ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина
// если в св-вах такого реквизита нет, то после удаления листа запускается расчет этого листа.
//
// В подобных процедурах должны выполняться действия, которые следуют за удалением доп. страниц. пересчет номеров, закрашивание ячеек и т.д.
// Если в разделе в св-вах нет ключа СпециальныеОперацииПослеОчисткиЛиста = Ложь или нет для многостраничного раздела
// тогда не вызывается эта процедура.
//
// Параметры:
//  ИмяСтраницы    - имся страницы раздела декларации
//  УдалениДопЭкз  - Булево. Имеет смысл только для многостраничных разделов. Если Истина, то выбрана очистка всего раздела "насквозь" включая
//                 удаление всех доп страниц. Если Ложь - то очистка только текущего табличного поля.
//
&НаСервере
Процедура СпециальныеОперацииПослеОчисткиЛистаНаСервере(ИмяСтраницы) Экспорт
		
	РасчетНаСервере(ИмяСтраницы);
	
КонецПроцедуры

// СпециальныеОперацииПослеОчисткиЛистаНаКлиенте(
// Процедура вызывается из модуля РО. При удалении листа любого раздела отчета.
// Вызов происходит в том случае, если в св-вах раздела установлен реквизит ЗапускатьОтдельнуюОбработкуПослеОчисткиЛиста = Истина
// если в св-вах такого реквизита нет, то после удаления листа запускается расчет этого листа.
//
// В подобных процедурах должны выполняться действия, которые следуют за удалением доп. страниц. пересчет номеров, закрашивание ячеек и т.д.
// Если в разделе в св-вах нет ключа СпециальныеОперацииПослеОчисткиЛиста = Ложь или нет для многостраничного раздела
// тогда не вызывается эта процедура.
//
// Параметры:
//  ИмяСтраницы    - имся страницы раздела декларации
//  УдалениДопЭкз  - Булево. Имеет смысл только для многостраничных разделов. Если Истина, то выбрана очистка всего раздела "насквозь" включая
//                 удаление всех доп страниц. Если Ложь - то очистка только текущего табличного поля.
&НаКлиенте
Процедура СпециальныеОперацииПослеОчисткиЛистаНаКлиенте(ИмяСтраницы) Экспорт
		
	РасчетНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеПоля(Форма, Имя, Значение)
	
	Если Форма.ТабличныйДокумент.Области.Найти(Имя) <> Неопределено Тогда
		Форма.ТабличныйДокумент.Области[Имя].Значение = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьЯчейку(Ячейка) Экспорт
	
	РегламентированнаяОтчетностьКлиент.АктивизироватьЯчейку(ЭтотОбъект, Ячейка);
	
КонецПроцедуры

#КонецОбласти

#Область ДиалогиВыбораДляВводаЗначений

&НаКлиенте
Процедура ВвестиПоказатель(Элемент, Область, КодПоказателя, Знач ЭтоСумма, Знач ТекстВыбора, ТаблицаВыбора, СтандартнаяОбработка = Ложь, КолонкаПоиска = "Код") Экспорт
	
	Если ТаблицаВыбора = Неопределено ИЛИ СтруктураРеквизитовФормы.мАвтоВыборКодов Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	//если показатель входит в состав многострочной части, тогда имя области не будет совпадать с переданным кодом показателя
	//необходимо это учесть
	//считаем, что в многострочной части не может быть показателя, состоящего из нескольких ячеек
	Если Область.Имя = КодПоказателя ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтотОбъект, КодПоказателя) > 0 Тогда
		
		ИсходноеЗначение = ?(ТипЗнч(Область.Значение) = Тип("Строка"), СокрЛП(Область.Значение), Область.Значение);
	Иначе
		Разделитель = ?(Лев(Область.Имя, СтрДлина(КодПоказателя) + 1) = КодПоказателя + "_", "_", "");
		ИндексОбласти = 1;
		ИсходноеЗначение = "";
		Пока ЭтотОбъект[ТекущийЭлемент.Имя].Области.Найти(КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")) <> Неопределено Цикл
			ИсходноеЗначение = ИсходноеЗначение + Строка(ЭтотОбъект[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(ИндексОбласти, "ЧГ=")].Значение);
			ИндексОбласти = ИндексОбласти + 1;
		КонецЦикла;
		ИсходноеЗначение = СокрЛП(ИсходноеЗначение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок",          ТекстВыбора);
	ПараметрыФормы.Вставить("ТаблицаЗначений",    ТаблицаВыбора);
	ПараметрыФормы.Вставить("СтруктураДляПоиска", Новый Структура(КолонкаПоиска, ИсходноеЗначение));
	
	
	ДополнительныеПараметры = Новый Структура("ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент", ИндексОбласти, КодПоказателя, КолонкаПоиска, Область, Разделитель, Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиПоказательЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("Обработка.ОбщиеОбъектыРеглОтчетности.Форма.ФормаВыбораЗначенияИзТаблицы", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПоказательЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ИндексОбласти = ДополнительныеПараметры.ИндексОбласти;
	КодПоказателя = ДополнительныеПараметры.КодПоказателя;
	КолонкаПоиска = ДополнительныеПараметры.КолонкаПоиска;
	Область = ДополнительныеПараметры.Область;
	Разделитель = ДополнительныеПараметры.Разделитель;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Область.Имя = КодПоказателя ИЛИ РегламентированнаяОтчетностьКлиентСервер.ПоказательВходитВМногострочнуюЧасть(ЭтотОбъект, КодПоказателя) > 0 Тогда
		Область.Значение = РезультатВыбора[КолонкаПоиска];
	Иначе
		СтрокаРезультатВыбора = Строка(РезультатВыбора[КолонкаПоиска]);
		Для Инд = СтрДлина(СтрокаРезультатВыбора) + 1 По ИндексОбласти - 1 Цикл
			СтрокаРезультатВыбора = " " + РезультатВыбора[КолонкаПоиска];
		КонецЦикла;
		Для Инд = 1 По ИндексОбласти - 1 Цикл
			ЭтотОбъект[ТекущийЭлемент.Имя].Области[КодПоказателя + Разделитель + Формат(Инд, "ЧГ=")].Значение = СокрЛП(Сред(РезультатВыбора[КолонкаПоиска], Инд, 1));
		КонецЦикла;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ОбработкаИзмененияСодержимогоВПолеТабличногоДокумента(Элемент, Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКодаВалютыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяРаздела = ДополнительныеПараметры.ИмяРаздела;
	ИмяЯчейки = ДополнительныеПараметры.ИмяЯчейки;
	Область = ДополнительныеПараметры.Область;
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если Результат <> Неопределено Тогда
		
		КодЭлементаСправочника = КодЭлементаСправочника(Результат);
		
		Если Область.Значение <> КодЭлементаСправочника Тогда
			
			Область.Значение = КодЭлементаСправочника;
			
			Если ЗначениеЗаполнено(ТабличныйДокумент.Области["П000400001040" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение) Тогда
				
				Курс = ПолучитьКурсВалютыНаДату(Область.Значение, ТабличныйДокумент.Области["П000400001040" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение);
				
				ИмяПоказателяКурса = "П000400001050" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"));
				ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
				
			КонецЕсли; 

			Если ЗначениеЗаполнено(ТабличныйДокумент.Области["П000400001080" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение) Тогда
				
				Курс = ПолучитьКурсВалютыНаДату(Область.Значение, ТабличныйДокумент.Области["П000400001080" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"))].Значение);
				
				ИмяПоказателяКурса = "П000400001090" + Сред(ИмяЯчейки, СтрНайти(ИмяЯчейки,"_"));
				ТабличныйДокумент.Области[ИмяПоказателяКурса].Значение = Курс;
				
			КонецЕсли; 

			СохранитьДанныеРаздела("ЛистБ", Ложь, Ложь);
			РасчетНаКлиенте(ИмяРаздела, ИмяПоказателяКурса);
			
		КонецЕсли;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтотОбъект, ИмяЯчейки);
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений <> Неопределено Тогда
		КодПоказателя = ПараметрВводаПоля.Показатель;
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ПараметрВводаПоля.ТаблицаЗначений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраныМираЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяЯчейки = ДополнительныеПараметры.ИмяЯчейки;
	Область = ДополнительныеПараметры.Область;
	Элемент = ДополнительныеПараметры.Элемент;
		
	Если Результат <> Неопределено Тогда
		
		КодЭлементаСправочника = КодЭлементаСправочника(Результат);
		
		Если Область.Значение <> КодЭлементаСправочника Тогда
			
			Область.Значение = КодЭлементаСправочника;
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрВводаПоля = РегламентированнаяОтчетностьКлиентСервер.НайтиСвойстваПоказателя(ЭтотОбъект, ИмяЯчейки);
	Если ПараметрВводаПоля <> Неопределено И ПараметрВводаПоля.ТаблицаЗначений <> Неопределено Тогда
		КодПоказателя = ПараметрВводаПоля.Показатель;
		ВвестиПоказатель(Элемент, Область, КодПоказателя, Ложь, ПараметрВводаПоля.ТекстПриВыборе, ПараметрВводаПоля.ТаблицаЗначений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаСведенийОбОбъектеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Область.Значение <> Результат Тогда
		ДополнительныеПараметры.Область.Значение = Результат;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделОтчетаПриИзменении(Раздел, ЭлементРазделыОтчета)
	
	ЭтоЗаголовокРаздела = (Раздел.ПолучитьРодителя() = Неопределено);
	
	СтруктураРеквизитовФормы.ТекущаяСтрокаРазделовОтчета = ЭлементРазделыОтчета.ТекущаяСтрока;
	
	Элементы.ОчиститьТекущуюСтраницу.Доступность = Истина;
	
	Если СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере Тогда
		
		Если Раздел.РазделМногостраничный И НЕ ЗначениеЗаполнено(Раздел.КолонкаНомерСтраницыРазделаОтчета) Тогда
			Раздел.КолонкаНомерСтраницыРазделаОтчета = 1;
		КонецЕсли;
		
		ВывестиМакетСтраницыВТабличныйДокументНаСервере(Раздел.КолонкаРазделыОтчетаСокрНаим, Раздел.КолонкаНомерСтраницыРазделаОтчета, ЭтоЗаголовокРаздела);
		
	Иначе
		
		СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
		
	КонецЕсли;
	
	Элементы.ДобавитьСтраницу.Видимость = Раздел.РазделМногостраничный;
	Элементы.УдалитьСтраницу.Видимость = Раздел.РазделМногостраничный;
	Если Раздел.РазделМногостраничный Тогда
		
		ЭлементРазделыОтчета.Развернуть(ЭлементРазделыОтчета.ТекущаяСтрока);
		
		Если ЭтоЗаголовокРаздела Тогда
			
			Элементы.ОчиститьТекущуюСтраницу.Доступность = Ложь;
			
			Элементы.УдалитьСтраницу.Видимость = Ложь;
			
		ИначеЕсли Раздел.ПолучитьРодителя().ПолучитьЭлементы().Количество() = 1 Тогда
			
			Элементы.УдалитьСтраницу.Видимость = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ДобавитьСтроку.Видимость = Раздел.РазделМногострочный;
	Элементы.УдалитьСтроку.Видимость  = Раздел.РазделМногострочный;
	Элементы.ТабличныйДокументКонтекстноеМенюГруппаСтроки.Видимость = Раздел.РазделМногострочный;
	
	Элементы.Обновить.Доступность = (Раздел.КолонкаРазделыОтчетаСокрНаим = "Титульный");
	
	Элементы.СобратьДанные.Видимость = (Раздел.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Или Раздел.КолонкаРазделыОтчетаСокрНаим = "Раздел2");
	
	Элементы.ТабличныйДокумент.ТекущаяОбласть = ТабличныйДокумент.Область(1, 1);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодЭлементаСправочника(Элемент)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, "Код");
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораИФНСЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		ТабличныйДокумент.Области["КодИМНС"].Значение = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(РезультатВыбора.КодНО, 4);
		
		// ДЕНЬГИ
		//ЗаполнитьСведенияОПодписантах();
		// Конец ДЕНЬГИ
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораИФНС()
	
	КодИМНС = СокрЛП(ТабличныйДокумент.Области.КодИМНС.Значение);
	
	ЗначенияДляОтбора = Новый Массив;
	ЗначенияДляОтбора.Добавить(Новый Структура("КодНО, КПП", КодИМНС));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", СтруктураРеквизитовФормы.Организация);
	ПараметрыФормы.Вставить("ЗначенияДляОтбора", ЗначенияДляОтбора);
	
	ФормаВыбораНалоговогоОргана = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ФормаВыбораНалоговогоОргана", ПараметрыФормы, ЭтотОбъект);
	
	Если ФормаВыбораНалоговогоОргана.ТаблицаНО.Количество() <> 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораИФНСЗавершение", ЭтотОбъект);
		ФормаВыбораНалоговогоОргана.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВыбораНалоговогоОргана.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаВыбораНалоговогоОргана.Открыть();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(КодИМНС) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru = 'В реквизитах организации не указан налоговый орган'");
		
		Сообщение.КлючДанных = СтруктураРеквизитовФормы.Организация;
		
		Сообщение.Сообщить();
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Для выбора инспекции, необходимо завести соответствующую запись в справочнике ""Регистрации в налоговом органе"".'");
		
		Сообщение.КлючДанных = СтруктураРеквизитовФормы.Организация;
		
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьРаздел(ИмяРаздела, ИндексЛиста = 0) Экспорт
	
	Для Каждого Раздел Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если Раздел.КолонкаРазделыОтчетаСокрНаим = ИмяРаздела
			И Раздел.КолонкаНомерСтраницыРазделаОтчета = ИндексЛиста Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = Раздел.ПолучитьИдентификатор();
			РазделОтчетаПриИзменении(Раздел, Элементы.РазделыОтчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныйФункционал

&НаКлиенте
Процедура Подключаемый_ВыполнитьПроверкуПередОткрытием()
	
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередОткрытиемФормыРегламентированногоОтчета(
		Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект),
		ЭтотОбъект,
		Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	РегламентированнаяОтчетность.ПриЗакрытииРегламентированногоОтчета(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОрганизации()
	
	Отчеты.РегламентированныйОтчет3НДФЛ.ЗаполнитьТитульныйЛист(СтруктураДанныхТитульный, СтруктураРеквизитовФормы.Организация, ДатаПодписи);
	
	// ДЕНЬГИ
	//ЗаполнитьСведенияОПодписантах();
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПодписантах() Экспорт
	
	Отчеты.РегламентированныйОтчет3НДФЛ.ЗаполнитьСведенияОПодписантах(
		СтруктураДанныхТитульный, СтруктураРеквизитовФормы.Организация);
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		Для Каждого РеквизитТабличногоДокумента Из ТабличныйДокумент.Области Цикл
			Если РеквизитТабличногоДокумента.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник
				И Не РеквизитТабличногоДокумента.Защита Тогда
				СтруктураДанныхТитульный.Свойство(РеквизитТабличногоДокумента.Имя, РеквизитТабличногоДокумента.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьПеременныеМодуляНаСервере(ИмяПоказателя, ЗначениеПоказателя) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	ПеременныеМодуля.Вставить("мСтатусНалогоплательщика", СтруктураРеквизитовФормы.мСтатусНалогоплательщика);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	СтруктураРеквизитовФормы.мСтатусНалогоплательщика = ПеременныеМодуля.мСтатусНалогоплательщика;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиенте
Функция ОбновитьПеременныеМодуляНаКлиенте(ИмяПоказателя, ЗначениеПоказателя) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	ПеременныеМодуля.Вставить("мПредставительФизЛицо",  СтруктураРеквизитовФормы.мПредставительФизЛицо);
	ПеременныеМодуля.Вставить("мНазваниеПредставителя", СтруктураРеквизитовФормы.мНазваниеПредставителя);
	ПеременныеМодуля.Вставить("мДокументПредставителя", СтруктураРеквизитовФормы.мДокументПредставителя);
	ПеременныеМодуля.Вставить("мФамилияПредставителя",  СтруктураРеквизитовФормы.мФамилияПредставителя);
	ПеременныеМодуля.Вставить("мИмяПредставителя",      СтруктураРеквизитовФормы.мИмяПредставителя);
	ПеременныеМодуля.Вставить("мОтчествоПредставителя", СтруктураРеквизитовФормы.мОтчествоПредставителя);
	ПеременныеМодуля.Вставить("мСтатусНалогоплательщика", СтруктураРеквизитовФормы.мСтатусНалогоплательщика);
	
	флОбновитьПеременныеМодуля = ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля);
	
	СтруктураРеквизитовФормы.мПредставительФизЛицо  = ПеременныеМодуля.мПредставительФизЛицо;
	СтруктураРеквизитовФормы.мНазваниеПредставителя = ПеременныеМодуля.мНазваниеПредставителя;
	СтруктураРеквизитовФормы.мДокументПредставителя = ПеременныеМодуля.мДокументПредставителя;
	СтруктураРеквизитовФормы.мФамилияПредставителя  = ПеременныеМодуля.мФамилияПредставителя;
	СтруктураРеквизитовФормы.мИмяПредставителя      = ПеременныеМодуля.мИмяПредставителя;
	СтруктураРеквизитовФормы.мОтчествоПредставителя = ПеременныеМодуля.мОтчествоПредставителя;
	СтруктураРеквизитовФормы.мСтатусНалогоплательщика = ПеременныеМодуля.мСтатусНалогоплательщика;
	
	Возврат флОбновитьПеременныеМодуля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбновитьПеременныеМодуля(ИмяПоказателя, ЗначениеПоказателя, ПеременныеМодуля)
	
	ИзмененияПроизошли = Ложь;
	
	Если Лев(ИмяПоказателя, 1) = "_" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяПоказателя = "ПредставительФизЛицо" Тогда
		ПеременныеМодуля.мПредставительФизЛицо = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "НазваниеПредставителя" Тогда
		ПеременныеМодуля.мНазваниеПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ДокументПредставителя" Тогда
		ПеременныеМодуля.мДокументПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ФамилияПредставителя" Тогда
		ПеременныеМодуля.мФамилияПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ИмяПредставителя" Тогда
		ПеременныеМодуля.мИмяПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "ОтчествоПредставителя" Тогда
		ПеременныеМодуля.мОтчествоПредставителя = ЗначениеПоказателя;
		ИзмененияПроизошли = Истина;
	ИначеЕсли ИмяПоказателя = "СтатусНалогоплательщика" Тогда
		Если ЗначениеПоказателя = "1" Тогда
			ПеременныеМодуля.мСтатусНалогоплательщика = 1;
		ИначеЕсли ЗначениеПоказателя = "2" Тогда
			ПеременныеМодуля.мСтатусНалогоплательщика = 2;
		Иначе
			ПеременныеМодуля.мСтатусНалогоплательщика = 0;
		КонецЕсли;
	КонецЕсли;

	Возврат ИзмененияПроизошли;
	
КонецФункции

//Преобразовывает некоторые значения структуры из посимвольного представления в одно поле
//предназначена для совместимости с формами сохраненными в версии 2.0
&НаСервере
Процедура ПреобразоватьПосимвольныеДанныеВЗначения(Данные)
	
	Если Данные.Свойство("ИНН_1") Тогда
		
		ИНН = "";
		Для Поз = 1 По 12 Цикл
			ИНН = ИНН + Данные["ИНН_" + Поз];
			Данные.Удалить("ИНН_" + Поз);
		КонецЦикла;	
		Данные.Вставить("ИНН",ИНН);
	КонецЕсли;
	
	Если Данные.Свойство("ДатаПодписи1") Тогда
		
		мДатаПодписи = "" + Данные["ДатаПодписи5"]
		+ Данные["ДатаПодписи6"]
		+ Данные["ДатаПодписи7"]
		+ Данные["ДатаПодписи8"]
		+ Данные["ДатаПодписи3"]
		+ Данные["ДатаПодписи4"]
		+ Данные["ДатаПодписи1"]
		+ Данные["ДатаПодписи2"];
		
		Для Поз = 1 По 8 Цикл
			Данные.Удалить("ДатаПодписи" + Поз);
		КонецЦикла;
		
		Данные.Вставить("ДатаПодписи", ?(ЗначениеЗаполнено(мДатаПодписи), Дата(мДатаПодписи), РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"))));
		
	КонецЕсли;
	Если Данные.Свойство("НомСтр1_1") Тогда
			
		Для Поз = 1 По 3 Цикл
			Данные.Удалить("НомСтр1_" + Поз);
		КонецЦикла;	
		
	КонецЕсли;
	Если Данные.Свойство("НомерКорректировки1") Тогда	
		
		НомерКорректировки = "";
		Для Поз = 1 По 3 Цикл
			НомерКорректировки = НомерКорректировки + Данные["НомерКорректировки" + Поз];
			Данные.Удалить("НомерКорректировки" + Поз);
		КонецЦикла;	
		Данные.Вставить("НомерКорректировки", НомерКорректировки);
	
	КонецЕсли;
	Если Данные.Свойство("ОтчетГод1") Тогда
		
		ОтчетГод = "";
		Для Поз = 1 По 4 Цикл
			ОтчетГод = ОтчетГод + Данные["ОтчетГод" + Поз];
			Данные.Удалить("ОтчетГод" + Поз);
		КонецЦикла;	
		Данные.Вставить("ОтчетГод", ОтчетГод);
		
	КонецЕсли;
	Если Данные.Свойство("КодИМНС1") Тогда
		
		КодИМНС = "";
		Для Поз = 1 По 4 Цикл
			КодИМНС = КодИМНС + Данные["КодИМНС" + Поз];
			Данные.Удалить("КодИМНС" + Поз);
		КонецЦикла;	
		Данные.Вставить("КодИМНС", КодИМНС);
		
	КонецЕсли;
	Если Данные.Свойство("ПоМесту1") Тогда
		
		ПоМесту = "";
		Для Поз = 1 По 3 Цикл
			ПоМесту = ПоМесту + Данные["ПоМесту" + Поз];
			Данные.Удалить("ПоМесту" + Поз);
		КонецЦикла;	
		Данные.Вставить("ПоМесту", ПоМесту);
		
	КонецЕсли;
	Если Данные.Свойство("Период1") Тогда
		
		Период = "";
		Для Поз = 1 По 2 Цикл
			Период = Период + Данные["Период" + Поз];
			Данные.Удалить("Период" + Поз);
		КонецЦикла;	
		Данные.Вставить("Период", Период);
		
	КонецЕсли;
	Если Данные.Свойство("СоставленаНа1") Тогда
		
		СоставленаНа = "";
		Для Поз = 1 По 3 Цикл
			СоставленаНа = СоставленаНа + Данные["СоставленаНа" + Поз];
			Данные.Удалить("СоставленаНа" + Поз);
		КонецЦикла;	
		Данные.Вставить("СоставленаНа", СоставленаНа);
		
	КонецЕсли;
	Если Данные.Свойство("ДатаВыдачиДокумента1") Тогда	
		
		ДатаВыдачиДокумента = "" + Данные["ДатаВыдачиДокумента5"]
		+ Данные["ДатаВыдачиДокумента6"]
		+ Данные["ДатаВыдачиДокумента7"]
		+ Данные["ДатаВыдачиДокумента8"]
		+ Данные["ДатаВыдачиДокумента3"]
		+ Данные["ДатаВыдачиДокумента4"]
		+ Данные["ДатаВыдачиДокумента1"]
		+ Данные["ДатаВыдачиДокумента2"];

		Для Поз = 1 По 8 Цикл
			Данные.Удалить("ДатаВыдачиДокумента" + Поз);
		КонецЦикла;	
		
		Данные.Вставить("ДатаВыдачиДокумента", ?(ЗначениеЗаполнено(ДатаВыдачиДокумента), Дата(ДатаВыдачиДокумента), РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"))));
		
	КонецЕсли;
	Если Данные.Свойство("ДатаРождения1") Тогда
		
		ДатаРождения = "" + Данные["ДатаРождения5"]
		+ Данные["ДатаРождения6"]
		+ Данные["ДатаРождения7"]
		+ Данные["ДатаРождения8"]
		+ Данные["ДатаРождения3"]
		+ Данные["ДатаРождения4"]
		+ Данные["ДатаРождения1"]
		+ Данные["ДатаРождения2"];
		
		Для Поз = 1 По 8 Цикл
			Данные.Удалить("ДатаРождения" + Поз);
		КонецЦикла;	
		Данные.Вставить("ДатаРождения", ?(ЗначениеЗаполнено(ДатаРождения) , Дата(ДатаРождения), РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"))));
		
	КонецЕсли;	

КонецПроцедуры

// Процедура управляет показом в форме периода построения отчета.
//
&НаСервере
Процедура ПоказатьПериод()
	
	ПолеТабличногоДокументаТитульный = ТабличныйДокумент;
	
	Если СокрЛП(ПолеТабличногоДокументаТитульный.Области.Период.Значение) = "" ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
				
		// выводим признак периода на титульный лист
		КодОтчетногоПериода = "34";
		ПолеТабличногоДокументаТитульный.Области.Период.Значение = КодОтчетногоПериода;
	КонецЕсли; 
	
	// выводим год на титульный лист
	ОтчетныйГод = Формат(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ЧГ=");
	ПолеТабличногоДокументаТитульный.Области.ОтчетГод.Значение = ОтчетныйГод;
	
	// задаем заголовок формы
	СтруктураРеквизитовФормы.СтрПериодОтчета = ПредставлениеПериода(НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСменыЕдИзмеренияИТочности()
	
	ПроверитьТочность();
	
	УстановитьФорматВыводаВПоляхВводаНаКлиенте(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	РасчетНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура контролирует корректность установленной точности указания
// суммовых (денежных) показателей при выборе единицы измерения.
//
&НаКлиенте
Процедура ПроверитьТочность()
	
	Если СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 2 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в рублях точность не может превышать 2 знака'"), ЭтотОбъект.Заголовок);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 2;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 3 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в тысячах рублей точность не может превышать 3 знака'"), ЭтотОбъект.Заголовок);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 3;
			
		КонецЕсли;
		
	ИначеЕсли СтруктураРеквизитовФормы.ЕдиницаИзмерения = ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1000000 Тогда
		
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения > 6 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1: при выводе сумм в миллионах рублей точность не может превышать 6 знаков'"), ЭтотОбъект.Заголовок);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения = 6;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалютыНаДату(КодВалюты,ДатаКурса)
	
	 Валюта 	= Справочники.Валюты.НайтиПоКоду(КодВалюты);
	 Если Валюта <> Неопределено Тогда
		 Результат 	= РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта,ДатаКурса);	
		 Возврат Результат.Курс;
	 Иначе
		 Возврат 0;
	 КонецЕсли;
	 
КонецФункции

&НаКлиенте
Процедура Очистить(ВыполняемоеОповещение = Неопределено) Экспорт
	
	РегламентированнаяОтчетностьКлиент.Очистить(ЭтотОбъект, ВыполняемоеОповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтраницЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	ЗначениеАвторасчета = ДополнительныеПараметры.ЗначениеАвторасчета;
	ЗначениеЕдИзм = ДополнительныеПараметры.ЗначениеЕдИзм;
	ЗначениеЗпт = ДополнительныеПараметры.ЗначениеЗпт;
	НомерСтраницыРазделаОтчета = ДополнительныеПараметры.НомерСтраницыРазделаОтчета;
	ТекущийРазделОтчетаСокрНаим = ДополнительныеПараметры.ТекущийРазделОтчетаСокрНаим;
	
	РегламентированнаяОтчетностьКлиентСервер.ПоказатьКнопкиПечати(ЭтотОбъект);
	Модифицированность = Истина;
	
	флЗначенияИдентичны = Истина;
	
	Для Индекс = 0 По мДеревоСтраницОтчета.ПолучитьЭлементы().Количество() - 1 Цикл
		
		Если НЕ мДеревоСтраницОтчета.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу = мДеревоВыбранныхСтраниц.ПолучитьЭлементы()[Индекс].ПоказатьСтраницу Тогда
			флЗначенияИдентичны = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеАвторасчета <> СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет Тогда
		
		#Если ВебКлиент Тогда
			ИзменитьТаблицуВариантовЗаполненияНаСервере();
		#Иначе
			РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(ЭтотОбъект, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
		#КонецЕсли	
		
	КонецЕсли;
	
	Если ЗначениеЕдИзм <> СтруктураРеквизитовФормы.ЕдиницаИзмерения
		ИЛИ ЗначениеЗпт <> СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения Тогда
		ПослеСменыЕдИзмеренияИТочности();
	КонецЕсли;
	
	// Управляем видимостью страниц основной панели формы
	РегламентированнаяОтчетностьКлиент.ПоказатьСтраницыОтчетаНаКлиенте(ЭтотОбъект);
	
	Если НЕ флЗначенияИдентичны Тогда
		
		СформироватьДеревоРазделовОтчетаНаКлиенте();
		
		Если НЕ ТекущийРазделОтчетаСокрНаим = Неопределено Тогда
			
			// Пытаемся найти ранее запомненный раздел.
			НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(РазделыОтчета.ПолучитьЭлементы(), "КолонкаРазделыОтчетаСокрНаим", ТекущийРазделОтчетаСокрНаим);
			
			Если НЕ НайденнаяСтрока = Неопределено 
				И НЕ НомерСтраницыРазделаОтчета = Неопределено 
				И НайденнаяСтрока.ПолучитьЭлементы().Количество() > 0 Тогда
				
				НайденнаяСтрока = РегламентированнаяОтчетностьКлиентСервер.НайтиЭлементВДанныхФормыДерево(НайденнаяСтрока.ПолучитьЭлементы(), "КолонкаНомерСтраницыРазделаОтчета", НомерСтраницыРазделаОтчета);
				
			КонецЕсли;
			
			// В случае успешного поиска, устанавливаем курсор на найденный раздел.
			Если НЕ НайденнаяСтрока = Неопределено Тогда
				Элементы.РазделыОтчета.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтотОбъект);
	
	ДокументыОснования = Новый СписокЗначений;
	ДокументыОснования.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.СформироватьИЗаписать(ДокументыОснования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчетаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФормаВыгрузкиРеглОтчета = ПолучитьФорму("Документ.ВыгрузкаРегламентированныхОтчетов.Форма.ФормаДокумента", , ЭтотОбъект);
	
	СпДокОсн = Новый СписокЗначений;
	СпДокОсн.Добавить(СтруктураРеквизитовФормы.мСохраненныйДок);
	
	ФормаВыгрузкиРеглОтчета.Проверить(СпДокОсн);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаголовокРегламентированногоОтчета(ДатаНач, ДатаКон, Периодичность = Неопределено) Экспорт
		
	СтрПериодОтчета = ПредставлениеПериода( НачалоДня(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета), КонецДня(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ФП = Истина" );
		
	Если СтрНайти(ЭтотОбъект.Заголовок, СтрПериодОтчета) = 0 Тогда
		Возврат ЭтотОбъект.Заголовок + " за " + СтрПериодОтчета;
	Иначе
		Возврат ЭтотОбъект.Заголовок;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОтчетОбъект()

	Если ОбъектЭтогоОтчета = Неопределено Тогда
		ОбъектЭтогоОтчета = РеквизитФормыВЗначение("Отчет");
	КонецЕсли; 
	
	Возврат ОбъектЭтогоОтчета;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазделМногострочный(Форма, ИмяРаздела)
	
	МногострочностьВРазделе = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ИмяРаздела, "МногострочностьВРазделе");
	КоличествоМногострочныхЧастей = МногострочностьВРазделе.Количество();
	
	Возврат КоличествоМногострочныхЧастей > 0;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяГруппы(ИмяЯчейки)
	
	Возврат Лев(ИмяЯчейки, 10);
	
КонецФункции

#КонецОбласти

#Область РаботаСДаннымиВСтруктуреОтчета

&НаСервере
Процедура ЗаполнитьПустыеСтруктурыДанных()
	
	СохрТабличныйДокумент = Новый ТабличныйДокумент;
	СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		ИмяМакета = ИмяМакета(ИмяФормы, Раздел.ИмяСтраницы);
		
		Если Не Раздел.МногостраничностьВРазделе
			И ЭтотОбъект["СтруктураДанных" + Раздел.ИмяСтраницы].Количество() = 0 Тогда
			
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(ИмяМакета));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь);
			
		ИначеЕсли Раздел.МногостраничностьВРазделе
			И ЭтотОбъект[мСтруктураМногостраничныхРазделов[Раздел.ИмяСтраницы]][0].Данные.Количество() = 0 Тогда
			
			
			ТабличныйДокумент.Очистить();
			ТабличныйДокумент.Вывести(ОтчетОбъект().ПолучитьМакет(ИмяМакета));
			
			СохранитьДанныеРаздела(Раздел.ИмяСтраницы, Ложь, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеРаздела(НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность, ИзменятьАктивнуюСтраницу = Истина)
	
	// Многостраничные разделы.
	//
	Если НаимРаздела = "ЛистД1" 
		ИЛИ НаимРаздела = "ЛистВ" 
		ИЛИ НаимРаздела = "ЛистЕ2"
		ИЛИ НаимРаздела = "ЛистЖ"
		ИЛИ НаимРаздела = "Раздел1"
		ИЛИ НаимРаздела = "Раздел2"
		ИЛИ НаимРаздела = "ЛистЗ"
		ИЛИ НаимРаздела = "ЛистЗПродолжение"
		ИЛИ НаимРаздела = "ЛистЗПродолжение2"
		ИЛИ НаимРаздела = "ЛистЗПродолжение3"
		ИЛИ НаимРаздела = "ЛистЗПродолжение4"
		Тогда
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Область Из ТабличныйДокумент.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И Область.СодержитЗначение Тогда
				СтруктураДанных.Вставить(Область.Имя, Область.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		НаимТаблицыСтраницы = мСтруктураМногостраничныхРазделов[НаимРаздела];
		
		АктивныеСтраницы = ЭтотОбъект[НаимТаблицыСтраницы].НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если АктивныеСтраницы.Количество() > 0 Тогда
			
			АктивнаяСтраница = АктивныеСтраницы[0];
			АктивнаяСтраница.Данные.Очистить();
			АктивнаяСтраница.Данные.Добавить(СтруктураДанных);
			
			Для каждого Страница Из АктивныеСтраницы Цикл
				Страница.АктивнаяСтраница = Ложь;
			КонецЦикла;
			
			Страница.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли; 
		
		// Многостраничные и многострочные разделы.
		//
	ИначеЕсли НаимРаздела = "ЛистА" Или НаимРаздела = "ЛистБ" Или НаимРаздела = "РасчетДоходаОтПродажиНедвижимости" Тогда
		
		ТаблицаСтраницРаздела = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(НаимРаздела, ТаблицаСтраницРаздела);
		
		ТаблицаСтраницРаздела = ЭтотОбъект[ТаблицаСтраницРаздела];
		
		СтрТаблицыСтраниц = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
		
		Если СтрТаблицыСтраниц.Количество() > 0 Тогда
			
			СтрТаблицаСтраницы = СтрТаблицыСтраниц[0];
			
			// Сохраним данные активной страницы, с присвоением Представления страницы и с очистной многострочных частей (Истина)
			РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(ЭтотОбъект, НаимРаздела, ОчищатьРазделЕслиЕстьМногострочность);
			
			Для каждого СтрТаблица Из СтрТаблицыСтраниц Цикл
				СтрТаблица.АктивнаяСтраница = Ложь;
			КонецЦикла;
			
			СтрТаблицаСтраницы.АктивнаяСтраница = НЕ ИзменятьАктивнуюСтраницу;
			
		КонецЕсли;
		
	Иначе
		
		ЭтотОбъект["СтруктураДанных" + НаимРаздела] = СобратьДанныеТекущегоТаблПоля(ЭтотОбъект, "ТабличныйДокумент");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СобратьДанныеТекущегоТаблПоляНаСервере(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтотОбъект, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиенте
Функция СобратьДанныеТекущегоТаблПоляНаКлиенте(ИмяТабличногоПоля) Экспорт
	
	Возврат СобратьДанныеТекущегоТаблПоля(ЭтотОбъект, ИмяТабличногоПоля);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобратьДанныеТекущегоТаблПоля(Форма, ТабличноеПоле) Экспорт
	
	СтруктураДанныхПоля = Новый Структура;
	
	Для Каждого ТекущаяОбласть Из Форма[ТабличноеПоле].Области Цикл
		
		Если ТекущаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник И ТекущаяОбласть.СодержитЗначение = Истина Тогда
			
			СтруктураДанныхПоля.Вставить(ТекущаяОбласть.Имя, ТекущаяОбласть.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураДанныхПоля;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьДополнительныеСтрокиВСтруктуре(Форма, ИмяРаздела, Очищать = Ложь)

	Если ИмяРаздела = "ЛистА" Или ИмяРаздела = "ЛистБ" Или ИмяРаздела = "РасчетДоходаОтПродажиНедвижимости" Тогда
		// Сохраним данные активной страницы, с присвоением Представления страницы и с очистной многострочных частей (Истина)
		РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(Форма, ИмяРаздела, Очищать);
	КонецЕсли; 

КонецПроцедуры
 
// Обновляет структуру многострочнго раздела, заданного
// уникальным идентификатором. Заполняет таблицу значений
// многострочного раздела значениями соответствующих ячеек.
//
// Параметры:
//  ИмяГруппы - строка - идентификатор многострочного раздела.
//
&НаСервере
Процедура ОбновитьСтруктуруМногострочногоРазделаНаСервере(ИмяГруппы) Экспорт
	
	Перем ИмяСтруктурыГруппы;
	
	мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, ИмяСтруктурыГруппы);
	
	СтруктураГруппы = ЭтотОбъект[ИмяСтруктурыГруппы];
	
	СписокКолонок = ЭтотОбъект["СписокКолонок" + ИмяГруппы];
	
	Для Индекс = 0 По СтруктураГруппы.Количество() - 1 Цикл
		
		Для Каждого Колонка Из СписокКолонок Цикл
			
			ИмяКолонки = Колонка.Значение;
			
			Если Не СтруктураГруппы[0].Свойство(ИмяКолонки) Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяЯчейки = СтрШаблон("%1_%2", ИмяКолонки, Формат(Индекс + 1, "ЧГ=0"));
			
			ОбластьЯчейки = ТабличныйДокумент.Области.Найти(ИмяЯчейки);
			Если ОбластьЯчейки <> Неопределено Тогда
				СтруктураГруппы[Индекс][ИмяКолонки] = ?(ОбластьЯчейки.СодержитЗначение, ОбластьЯчейки.Значение, ОбластьЯчейки.Текст);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруМногострочногоРазделаНаКлиенте(ИмяГруппы) Экспорт
	
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(ЭтотОбъект, ИмяГруппы);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНеобходимоеКоличествоДопСтрокНаСервере(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИсходноеКоличествоСтрокГруппы, ТекущееКоличествоСтрокГруппы, ИмяГруппы, СтруктураГруппы, ВысотаСтроки) Экспорт
		
	ОбластьДопСтроки = ТекТабличноеПоле.ПолучитьОбласть("МногострочнаяЧасть");
	
	КоординатыОбластей = Новый Структура();
	
	Для Каждого Область Из ТекТабличноеПоле.Области Цикл
		
		Если СтрНайти(Область.Имя, "_") Тогда
			
			КоординатыОбластей.Вставить(Область.Имя, Область.Верх);
			
		КонецЕсли;
		
	КонецЦикла;
		
	МногострочнаяЧастьВерх = ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх;
	
	МногострочнаяЧастьНиз = ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ;
	
	ТекТабличноеПоле.ВставитьОбласть(ОбластьДопСтроки.Область(), ТекТабличноеПоле.Область(МногострочнаяЧастьНиз + 1, , МногострочнаяЧастьНиз + (ТекущееКоличествоСтрокГруппы - 1) * ВысотаСтроки), ТипСмещенияТабличногоДокумента.ПоВертикали);
		
	Для НомНовойСтроки = ИсходноеКоличествоСтрокГруппы По ТекущееКоличествоСтрокГруппы Цикл
						
		Для Каждого Область Из ОбластьДопСтроки.Области Цикл
			
			Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
			
				ОбластьТаблДок = ТекТабличноеПоле.Область(КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Лево, КоординатыОбластей[Область.Имя] + (ТекущееКоличествоСтрокГруппы - НомНовойСтроки) * ВысотаСтроки, Область.Право);
							
				Если ОбластьТаблДок.СодержитЗначение Тогда
					ОбластьТаблДок.Очистить();
				КонецЕсли;
				
				ОбластьТаблДок.Имя = Лев(Область.Имя, СтрНайти(Область.Имя, "_")) + Строка(ТекущееКоличествоСтрокГруппы - НомНовойСтроки + 1);
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;	
		
	ТекТабличноеПоле.Область(ТекТабличноеПоле.Области.МногострочнаяЧасть.Верх, , ТекТабличноеПоле.Области.МногострочнаяЧасть.Низ).Имя = "";
	
	ТекТабличноеПоле.Область(МногострочнаяЧастьВерх, , МногострочнаяЧастьНиз).Имя = "МногострочнаяЧасть";
	
КонецПроцедуры

&НаСервере
Процедура ВставитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено)
	
	Перем ТаблицаСтраницРаздела;
	Перем СтруктураДанныхДопСтрокРаздела;
	
	Если ИмяТекущейСтраницыПанели = Неопределено Тогда
		ИмяТекущейСтраницыПанели = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	КонецЕсли;
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела) Тогда
		Возврат;
	Иначе
		МаксКолвоЭкз = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(ЭтотОбъект, ИмяТекущейСтраницыПанели, "МаксКолвоЭкз", 0);
		Если МаксКолвоЭкз <> 0 И ЭтотОбъект[мСтруктураМногостраничныхРазделов[ИмяТекущейСтраницыПанели]].Количество() >= МаксКолвоЭкз Тогда
			ЗаголовокСтраницы = ИмяТекущейСтраницыПанели;
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В разделе ""%1"" максимальное количество экземпляров страниц равно %2.'"), ЗаголовокСтраницы, МаксКолвоЭкз);
			
			Сообщение.Сообщить();
			
			СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Истина;
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	ИмяТекТабличногоПоля     = "ТабличныйДокумент";
	ТекТабличноеПоле         = ЭтотОбъект[ИмяТекТабличногоПоля];
	
	СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
	
	ТаблицаСтраницРаздела = ЭтотОбъект[ТаблицаСтраницРаздела];
	
	// Найдем активную страницу
	СтрТаблицаСтраницы = ТаблицаСтраницРаздела.НайтиСтроки(Новый Структура ("АктивнаяСтраница", Истина));
	
	Если СтрТаблицаСтраницы.Количество() > 0 Тогда
		
		СтрТаблицаСтраницы = СтрТаблицаСтраницы[0];
		
		// Убираем активность у текущей страницы
		СтрТаблицаСтраницы.АктивнаяСтраница = Ложь;
		
	КонецЕсли;
	
	// Добавляем новую страницу
	СтрНоваяСтраница = ТаблицаСтраницРаздела.Добавить();
	
	// Присваиваем представление по умолчанию
	СтрНоваяСтраница.Представление      = "Страница N " + ТаблицаСтраницРаздела.Количество();
	СтрНоваяСтраница.АвтоматическоеПредставление      = Истина;
	
	// Ставим признак активной страницы
	СтрНоваяСтраница.АктивнаяСтраница = Истина;
	
	ПослеДобавленияДопСтрНаСервере(ИмяТекТабличногоПоля, ИмяТекущейСтраницыПанели);
	
	ВывестиМакетВТаблДокНаСервере(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела.Индекс(СтрНоваяСтраница) + 1);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеДобавленияДопСтрНаСервере(ИмяТекТабличногоПоля, ИмяТекущейСтраницыПанели)
	
	ОчиститьТабличноеПолеНаСервере(ИмяТекущейСтраницыПанели);
	
	СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели);
	
	ПослеВставкиДополнительнойСтраницыНаСервере(ИмяТекущейСтраницыПанели);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВставкиДополнительнойСтраницыНаСервере(ИмяТекущейСтраницы)
	
	РасчетНаСервере(ИмяТекущейСтраницы);
	
	РегламентированнаяОтчетность.ПослеВставкиДополнительнойСтраницыНаСервере(ЭтотОбъект, ИмяТекущейСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеМногостраничногоРазделаВактивнойСтраницеНаСервере(ИмяТекущейСтраницыПанели)
	
	//итоговые ячейки не очистились - необходимо провести расчет
	//для этого сохраним данные страницы
	РегламентированнаяОтчетностьКлиентСервер.СохранитьДанныеМногостраничногоРазделаВактивнойСтранице(ЭтотОбъект, ИмяТекущейСтраницыПанели, Истина);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтраницуНаСервере(ИмяТекущейСтраницыПанели = Неопределено, НомерУдаляемойСтраницы = Неопределено)
	
	Перем ТаблицаСтраницРаздела;
	Перем МассивВариантовЗаполненияСтраниц;
	
	РегламентированнаяОтчетность.УдалитьДополнительнуюСтраницуНаСервере(ЭтотОбъект, ИмяТекущейСтраницыПанели);
	
	Если НомерУдаляемойСтраницы <> Неопределено
		И мСтруктураМногостраничныхРазделов.Свойство(ИмяТекущейСтраницыПанели, ТаблицаСтраницРаздела)
		И мСтруктураВариантыЗаполнения.Свойство(ИмяТекущейСтраницыПанели, МассивВариантовЗаполненияСтраниц) Тогда
		
		ТаблицаСтраницРаздела = ЭтотОбъект[ТаблицаСтраницРаздела];
		МассивВариантовЗаполненияСтраниц = ЭтотОбъект["ТаблицаВариантыЗаполнения" + ИмяТекущейСтраницыПанели];
		
		МассивВариантовЗаполненияСтраниц.Удалить(НомерУдаляемойСтраницы);
		
		КолСтраниц = ТаблицаСтраницРаздела.Количество();
		КолВариантов = МассивВариантовЗаполненияСтраниц.Количество();
		
		Для Инд = КолСтраниц + 1 По КолВариантов Цикл
			
			МассивВариантовЗаполненияСтраниц.Удалить(МассивВариантовЗаполненияСтраниц.Количество() - 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	РасчетНаСервере();
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере(КолонкаРазделыОтчетаСокрНаим)
	
	ВставитьДополнительнуюСтроку(ЭтотОбъект, КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуНаКлиенте(КолонкаРазделыОтчетаСокрНаим)
	
	ВставитьДополнительнуюСтроку(ЭтотОбъект, КолонкаРазделыОтчетаСокрНаим);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВставитьДополнительнуюСтроку(Форма, ТекущаяСтраница)
	Перем СтруктураГруппы;
	Перем ИсходноеКоличествоСтрокГруппы;
	
	// Сначала выполним проверку на активную страницу панели формы,
	// которая содержит многострочный раздел
	
	#Если НаКлиенте Тогда
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ТекущаяСтраница);
	#Иначе
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ТекущаяСтраница);
	#КонецЕсли
	
	Если ИмяГруппы = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран многострочный раздел, в который необходимо добавить строку.'"));
		Возврат;
	КонецЕсли;
	
	// Исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	СтруктураГруппы = Форма[СтруктураГруппы];
	
	// определяем последнюю строку многострочной группы
	КолСтрок = СтруктураГруппы.Количество();
	
	КолСтрокСтр      = Формат(КолСтрок, "ЧГ=0");
	КолСтрокСтрНовое = Формат(КолСтрок + 1, "ЧГ=0");
	
	Для НомерПервойЯчейки = 1 По 10 Цикл
		ИмяПервойЯчейкиПоследнейСтроки = СтрШаблон("%1%2_%3", ИмяГруппы, Формат(НомерПервойЯчейки, "ЧЦ=3; ЧВН="), КолСтрокСтр);
		ОбластьПервойЯчейки = ТекТабличноеПоле.Области.Найти(ИмяПервойЯчейкиПоследнейСтроки);
		Если ОбластьПервойЯчейки <> Неопределено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ОбластьПервойЯчейки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
	ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
	
	// номера строк исходной области
	НомерВерхЯчейкиОбласти = ОбластьПервойЯчейки.Верх - 1;
	НомерНижнЯчейкиОбласти = НомерВерхЯчейкиОбласти + ВысотаСтроки - 1;
	СдвигСтрок = НомерНижнЯчейкиОбласти - НомерВерхЯчейкиОбласти + 1;
	
	РегламентированнаяОтчетностьВызовСервера.СпециальногоДобавленияСтроки(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИмяГруппы, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
	
	Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
	
	СписокКолонок = Форма["СписокКолонок" + ИмяГруппы];
	Для Каждого Колонка Из СписокКолонок Цикл
		
		ИмяКолонки = Колонка.Значение;
		
		ИмяОбластиЯчейки    = ИмяКолонки + "_" + КолСтрокСтр;
		ИмяНовОбластиЯчейки = ИмяКолонки + "_" + КолСтрокСтрНовое;
		
		ОбластьЯчейки = ТекТабличноеПоле.Области.Найти(ИмяОбластиЯчейки);
		Если ОбластьЯчейки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбластьЯчейки.Имя = ИмяНовОбластиЯчейки;
		
		// определяем границы ячейки исходной области
		НомерВерхСтрокиЯчейки  = ОбластьЯчейки.Верх - СдвигСтрок;
		НомерНижнСтрокиЯчейки  = ОбластьЯчейки.Низ  - СдвигСтрок;
		
		НомерЛевоКолонкиЯчейки = ОбластьЯчейки.Лево;
		НомерПравКолонкиЯчейки = ОбластьЯчейки.Право;
		
		// Назначаем имя ячейки исходной области,
		// (т.к. в результате вставки новой области оно было очищено)
		ОбластьЯчейкиИсходнойОбласти = ТекТабличноеПоле.Область(НомерВерхСтрокиЯчейки, НомерЛевоКолонкиЯчейки, НомерНижнСтрокиЯчейки, НомерПравКолонкиЯчейки);
		ОбластьЯчейкиИсходнойОбласти.Имя = ИмяОбластиЯчейки;
		
		Если Найти(ИмяПервойЯчейкиПоследнейСтроки, ИмяКолонки) = 1 Тогда
			ОбластьУдалитьСтроку = ТекТабличноеПоле.Области.Найти("УдалитьСтроку" + ИмяОбластиЯчейки);
			Если ОбластьУдалитьСтроку <> Неопределено Тогда
				ОбластьУдалитьСтроку.Имя = "УдалитьСтроку" + ИмяНовОбластиЯчейки;
				ТекТабличноеПоле.Область(ОбластьУдалитьСтроку.Верх - СдвигСтрок, ОбластьУдалитьСтроку.Лево, ОбластьУдалитьСтроку.Низ - СдвигСтрок, ОбластьУдалитьСтроку.Право).Имя  = "УдалитьСтроку" + ИмяОбластиЯчейки;
			КонецЕсли;
		КонецЕсли;
		
		// очищаем значения ячеек вставленной области
		Если ОбластьЯчейки.СодержитЗначение = Истина Тогда
			ОбластьЯчейки.Очистить();
		Иначе
			// порядековый номер последней строки перед вставкой
			ИсходныйНомер        = Число("0" + ОбластьЯчейки.Текст);
			НовыйПорядковыйНомер = ИсходныйНомер + 1;
			
			ОбластьЯчейки.Текст  = ? (НЕ НовыйПорядковыйНомер > ИсходноеКоличествоСтрокГруппы, Строка(НовыйПорядковыйНомер), "");
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Назначим текущей областью таблицы первую редактируемую ячейку добавленной строки.
	// Определяем текущую область таблицы
	ИмяТекущейОбласти = СтрШаблон("%1%2_%3", ИмяГруппы, Формат(НомерПервойЯчейки, "ЧЦ=3; ЧВН="), КолСтрокСтрНовое);
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	// установим фокус на поле табличн. документа
	Форма.ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	// добавляем в структуру многострочной группы новую строку
	НоваяСтрока = СтруктураГруппы.Добавить();
	
	// Заполним значениями по умолчанию
	ЗаполнитьПоказателиЗначениямиПоУмолчанию(Форма, ТекущаяСтраница);
	
	ОтрисоватьЗначкиУдаленияСтрок(ТекТабличноеПоле);
	
	СохранитьДополнительныеСтрокиВСтруктуре(Форма, ТекущаяСтраница, Ложь);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДополнительнуюСтрокуНаСервере(ТекущаяСтраница)
	
	УдалитьДополнительнуюСтроку(ЭтотОбъект, , , ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДополнительнуюСтрокуНаКлиенте(ТекущаяСтраница)
	
	УдалитьДополнительнуюСтроку(ЭтотОбъект, , , ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьДополнительнуюСтроку(Форма, СпециальноеДобавление = Ложь, ИмяКолонкиНомера = Неопределено, ТекущаяСтраница) Экспорт
	Перем ИсходноеКоличествоСтрокГруппы;
	Перем СтруктураГруппы;
	
	// Сначала выполним проверку на активную страницу панели формы,
	// которая содержит многострочный раздел
	#Если НаКлиенте Тогда
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаКлиенте(ТекущаяСтраница);
	#Иначе
		ИмяГруппы = Форма.ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ТекущаяСтраница);
	#КонецЕсли
	
	// исходное количество строк группы
	Форма.мСтруктураИсхКолвоСтрокРазделов.Свойство(ИмяГруппы, ИсходноеКоличествоСтрокГруппы);
	
	Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
	
	ТекТабличноеПолеИмя = "ТабличныйДокумент";
	
	ТекТабличноеПоле = Форма[ТекТабличноеПолеИмя];
	ТекущаяОбласть = Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть;
	ИмяЯчейки      = ТекущаяОбласть.Имя;
	
	#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИмяГруппы = РегламентированнаяОтчетностьКлиент.РазделТекущейОбласти(Форма, ТекущаяОбласть);
	#Иначе
		ИмяГруппы = РегламентированнаяОтчетностьВызовСервера.РазделТекущейОбластиНаСервере(Форма, ТекущаяОбласть);
	#КонецЕсли
	
	// предварительно обновим структуру многострочных разделов
	РегламентированнаяОтчетностьКлиентСервер.ОбновитьСтруктуруМногострочногоРаздела(Форма, ИмяГруппы);
	
	// номер строки многострочного раздела определим
	// по имени выделенной ячейки
	НомУдаляемойСтроки = Число( Сред( ИмяЯчейки, СтрНайти( ИмяЯчейки, "_") + 1));
	НомерСтрокиТаблицы = НомУдаляемойСтроки - 1; // нумерация строк в таблице значений начинается с нуля
	СтруктураГруппы = Форма[СтруктураГруппы];
	Если СтруктураГруппы.Количество() > ИсходноеКоличествоСтрокГруппы И СтруктураГруппы.Количество() > НомерСтрокиТаблицы Тогда
		// удаляется добавленная строка
		ИмяПервойЯчейкиУдаляемойСтроки = ИмяГруппы + "010_" + НомУдаляемойСтроки;
		
		// область первой ячейки удаляемой строки многострочного раздела
		ОбластьЯчейки = ТекТабличноеПоле.Области[ИмяПервойЯчейкиУдаляемойСтроки];
		
		НастройкиМнгЧ = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСвойствоРаздела(Форма, ТекущаяСтраница, "МногострочностьВРазделе").НайтиСтроки(Новый Структура("ИдГруппы", ИмяГруппы))[0];
		ВысотаСтроки = НастройкиМнгЧ.ВысотаСтроки;
		
		// номера строк удаляемой области
		НомерВерхЯчейкиОбласти = ОбластьЯчейки.Верх - 1;
		НомерНижнЯчейкиОбласти = НомерВерхЯчейкиОбласти + ВысотаСтроки - 1;  // первая область - контрол удаления строки
		
		РегламентированнаяОтчетностьВызовСервера.СпециальногоУдаленияСтроки(ТекТабличноеПоле, ТекТабличноеПолеИмя, ИмяГруппы, НомерВерхЯчейкиОбласти, НомерНижнЯчейкиОбласти);
		
		Форма[ТекТабличноеПолеИмя] = ТекТабличноеПоле;
		
		КолвоСдвигаемыхСтрок = СтруктураГруппы.Количество() - НомУдаляемойСтроки;
		
		// обновим имена ячеек сдвинутых строк
		Если КолвоСдвигаемыхСтрок > 0 Тогда
			
			Для НСтр = НомУдаляемойСтроки + 1 По СтруктураГруппы.Количество() Цикл
				
				ТекСтрока = СтруктураГруппы[НСтр-1];
				НСтрСтр = Формат(НСтр, "ЧГ=0");
				НСтрСтр1 = Формат(НСтр - 1, "ЧГ=0");
				
				
				Для НомерГрафы = 0 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
					
					Если НомерГрафы = 0 Тогда
						
						КолонкаИмя = "УдалитьСтроку" + ИмяГруппы + Формат( 1, "ЧЦ=2; ЧВН=") + "0";
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ИмяКолонкиНомера <> Неопределено Тогда
							Если ИмяКолонкиНомера = КолонкаИмя Тогда
								// обновляем порядковый номер строки
								
								СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
								НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
								ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер;
								
								// обновляем значение элемента таблицы значений
								ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					КолонкаИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=") + "0";
					
					Если СтруктураГруппы[0].Свойство(КолонкаИмя) Тогда
						
						ИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр;
						НовоеИмяСдвинутойЯчейки = КолонкаИмя + "_" + НСтрСтр1;
						
						ОбластьСдвинутойЯчейки     = ТекТабличноеПоле.Области[ИмяСдвинутойЯчейки];
						ОбластьСдвинутойЯчейки.Имя = НовоеИмяСдвинутойЯчейки;
						
						Если ОбластьСдвинутойЯчейки.СодержитЗначение <> Истина Тогда
							// обновляем порядковый номер строки
							
							СтарыйНомер = Число(ТекСтрока[КолонкаИмя]);
							НовыйПорядковыйНомер = Строка(Макс(СтарыйНомер - 1, 0));
							ОбластьСдвинутойЯчейки.Текст = НовыйПорядковыйНомер + ".";
							
							// обновляем значение элемента таблицы значений
							ТекСтрока[КолонкаИмя] = НовыйПорядковыйНомер;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
		// обновляем структуру многострочного раздела
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
	ИначеЕсли СтруктураГруппы.Количество() > НомерСтрокиТаблицы Тогда
		// строка не удаляется в форме табличного документа,
		// а должна осуществляться сдвиг строк
		
		// обновляем структуру многострочного раздела
		// методом удаления выбранной строки и добавления пустой строки
		СтруктураГруппы.Удалить(НомерСтрокиТаблицы);
		
		ДобавляемаяСтрока = СтруктураГруппы.Добавить();
		
		// обновляем порядковые номера строк, выводимых в табличный документ
		Для Каждого СтрокаТаблицы Из СтруктураГруппы Цикл
			
			НомерСтрокиВТаблице = СтруктураГруппы.Индекс(СтрокаТаблицы);
			НомерСтрокиВФормеТаблицы = Формат(НомерСтрокиВТаблице + 1, "ЧГ=0");
			
			Для НомерГрафы = 1 По Форма.мСтруктураКолвоКолонокРазделов[ИмяГруппы] Цикл
				КолонкаТаблицыИмя = ИмяГруппы + Формат(НомерГрафы, "ЧЦ=2; ЧВН=");
				
				Если СтруктураГруппы[0].Свойство(КолонкаТаблицыИмя) Тогда
					
					ИмяЯчейки                = КолонкаТаблицыИмя + "_" + НомерСтрокиВФормеТаблицы;
					ОбластьЯчейкиТаблицы     = ТекТабличноеПоле.Области[ИмяЯчейки];
					
					Если ОбластьЯчейкиТаблицы.СодержитЗначение <> Истина Тогда
						
						ПервыйНомерВГруппе = 1;
						
						// обновляем порядковый номер строки
						НовыйПорядковыйНомер = Строка(ПервыйНомерВГруппе + НомерСтрокиВТаблице);
						
						СтрокаТаблицы[КолонкаТаблицыИмя] = НовыйПорядковыйНомер;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		// Данные в многострочном блоке обновляются в декларациях!
		// Обновляем экранную форму табличного документа
		#Если НаКлиенте Тогда
			Форма.ВывестиРазделВТабличныйДокументНаКлиенте(ИмяГруппы, СтруктураГруппы);
		#Иначе
			Форма.ВывестиРазделВТабличныйДокументНаСервере(ИмяГруппы, СтруктураГруппы);
		#КонецЕсли
		
	КонецЕсли;
	
	// назначим текущей областью таблицы первую редактируемую ячейку
	// удаленной строки, если ее порядковый номер меньше кол-ва строк
	// многострочного раздела, или последней строки раздела в противном случае
	
	// определяем текущую область таблицы
	НомТекущейСтроки  = Мин( НомУдаляемойСтроки, СтруктураГруппы.Количество() );
	ИмяТекущейОбласти = ИмяГруппы + "010_" + НомТекущейСтроки;
	
	Форма.Элементы[ТекТабличноеПолеИмя].ТекущаяОбласть = ТекТабличноеПоле.Области[ИмяТекущейОбласти];
	
	ОтрисоватьЗначкиУдаленияСтрок(ТекТабличноеПоле);
	
	// установим фокус на поле табличн. документа
	ТекущийЭлемент = Форма.Элементы[ТекТабличноеПолеИмя];
	
	СохранитьДополнительныеСтрокиВСтруктуре(Форма, ТекущаяСтраница, Ложь);
	
	Расчет(Форма, ТекущаяСтраница);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТекущуюСтраницуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		
		ЗначениеКорректировки = ТабличныйДокумент.Области.НомерКорректировки.Значение;
		
		Если НЕ ЗначениеЗаполнено(ЗначениеКорректировки) Тогда
			ТабличныйДокумент.Области.НомерКорректировки.Значение = "0";
			ЗначениеКорректировки = 0;
		КонецЕсли;
		
		НомерКорректировки = ЗначениеКорректировки;
		СтруктураРеквизитовФормы.ВидДокумента = ?(ЗначениеКорректировки = 0, 0, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере() Экспорт
	
	СтруктураДанныхЛистД2.Очистить();
	СтруктураДанныхЛистЕ1.Очистить();
	СтруктураДанныхЛистГ.Очистить();
	СтруктураДанныхЛистИ.Очистить();
	СтруктураДанныхЛистИПродолжение.Очистить();
	
	НомерКорректировки = 0;
	ДатаПодписи = ТекущаяДатаСеанса();
	
	Для каждого ЭлементСтруктурыТаблицаСтраницы Из мСтруктураМногостраничныхРазделов Цикл
		
		ЭтотОбъект[ЭлементСтруктурыТаблицаСтраницы.Значение].Очистить();
		
	КонецЦикла;
	
	ИнициализацияМногостраничныхРазделов();
	
	Для Каждого мнгРаздел Из мСтруктураМногострочныхРазделов Цикл
		ЭтотОбъект[мнгРаздел.Ключ].Очистить();
	КонецЦикла;
	
	НачальныеОперацииСМногострочнымиБлоками();
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	Если НЕ СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		ОчиститьТабличноеПолеНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	КонецЕсли;
	
	ВывестиМакетСтраницыВТабличныйДокументНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	СпециальныеОперацииПослеОчисткиЛистаНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела);
	
	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура СохранитьЗначениеПоказателяВСтруктуреНаСервере(ИмяРаздела, ИмяПоказателя, Значение);
	
	СохранитьЗначениеПоказателяВСтруктуре(ЭтотОбъект, ИмяРаздела, ИмяПоказателя, Значение);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, ИмяПоказателя, ЗначениеПоказателя)
	
	МногостраничностьВРазделе = Ложь;
	КолМногострочныхЧастей = 0;
	СохранятьМногострКакТЗ = Истина;
	ИмяГруппы = "";
	Если ИмяРаздела = "Титульный" Тогда
		МногостраничностьВРазделе = Ложь;
	ИначеЕсли ИмяРаздела = "ЛистА" Тогда
		КолМногострочныхЧастей = 1;
		МногостраничностьВРазделе = Истина;
		ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппыА;
	ИначеЕсли ИмяРаздела = "ЛистБ" Тогда
		КолМногострочныхЧастей = 1;
		МногостраничностьВРазделе = Истина;
		ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдГруппыБ;
	ИначеЕсли ИмяРаздела = "ЛистГ" Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Ложь;
	ИначеЕсли ИмяРаздела = "Раздел1"
		ИЛИ ИмяРаздела = "Раздел2"
		ИЛИ ИмяРаздела = "ЛистВ"
		ИЛИ ИмяРаздела = "ЛистЕ2"
		ИЛИ ИмяРаздела = "ЛистД1"
		ИЛИ ИмяРаздела = "ЛистЖ"
		ИЛИ ИмяРаздела = "ЛистЗ"
		ИЛИ ИмяРаздела = "ЛистЗПродолжение"
		ИЛИ ИмяРаздела = "ЛистЗПродолжение2"
		ИЛИ ИмяРаздела = "ЛистЗПродолжение3"
		ИЛИ ИмяРаздела = "ЛистЗПродолжение4"
		Тогда
		КолМногострочныхЧастей = 0;
		МногостраничностьВРазделе = Истина;
	ИначеЕсли ИмяРаздела = "РасчетДоходаОтПродажиНедвижимости" Тогда
		КолМногострочныхЧастей = 1;
		МногостраничностьВРазделе = Истина;
		ИмяГруппы = Форма.СтруктураРеквизитовФормы.мИдРасчетаДоходаОтПродажиНедвижимости;
	КонецЕсли;
	
	ДанныеРаздела = Неопределено;
	ДанныеМногострочногоРаздела = Неопределено;
	
	Если ИмяРаздела <> "" Тогда
		
		Если МногостраничностьВРазделе Тогда  //Для многостраничных разделов
			
			ИмяТаблицыСтраницы = Неопределено;
			Если Форма.мСтруктураМногостраничныхРазделов.Свойство(ИмяРаздела, ИмяТаблицыСтраницы) Тогда
				
				ТаблицаСтраницы = Форма[ИмяТаблицыСтраницы];
				АктивныеСтраницы = ТаблицаСтраницы.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
				
				Если АктивныеСтраницы.Количество() > 0 Тогда
					
					ДанныеРазделаСписок = АктивныеСтраницы[0].Данные;
					Если ДанныеРазделаСписок.Количество() > 0 Тогда
						
						ДанныеРаздела = ДанныеРазделаСписок[0].Значение;
						ДанныеРазделаСписок[0].Пометка = Ложь; //Регистрируем для передачи на сервер (при редактировании таблицы значения не передаются)
						
					КонецЕсли;
					
					Если КолМногострочныхЧастей > 0 Тогда  // И многострочных разделов
						
						ДанныеДопСтрокРазделаСписок = АктивныеСтраницы[0].ДанныеДопСтрок;
						Если ДанныеДопСтрокРазделаСписок.Количество() > 0 Тогда
							
							ДанныеДопСтрокРаздела = ДанныеДопСтрокРазделаСписок[0].Значение;
							ДанныеДопСтрокРазделаСписок[0].Пометка = Ложь;
							
							СтруктураГруппы = Неопределено;
							Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
							
							ДанныеМногострочногоРаздела = Форма[СтруктураГруппы];
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		Иначе  //Для обычных разделов
			
			ДанныеРаздела = Форма["СтруктураДанных" + ИмяРаздела];
			
			Если КолМногострочныхЧастей > 0 Тогда  // И многострочных разделов
				
				СтруктураГруппы = Неопределено;
				Форма.мСтруктураМногострочныхРазделов.Свойство(ИмяГруппы, СтруктураГруппы);
				
				ДанныеМногострочногоРаздела = Форма[СтруктураГруппы];
				
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ДанныеМногострочногоРаздела = Неопределено Тогда
			Если ДанныеРаздела <> Неопределено Тогда
				Если ДанныеРаздела.Свойство(ИмяПоказателя) Тогда
					ДанныеРаздела[ИмяПоказателя] = ЗначениеПоказателя;
				Иначе
					ДанныеРаздела.Вставить(ИмяПоказателя, ЗначениеПоказателя);
				КонецЕсли
			КонецЕсли; 
		Иначе
			Если ИмяГруппы = ИмяГруппы(ИмяПоказателя) Тогда //Показатель входит в многострочную часть
				ИмяПок = Лев(ИмяПоказателя, 13);
				СтрИнд = Сред(ИмяПоказателя, 14);
				Если Лев(СтрИнд, 1)="_" Тогда
					СтрИнд = Сред(СтрИнд, 2);
				КонецЕсли;
				Инд = ?(ПустаяСтрока(СтрИнд), 0, Число(СтрИнд));
				Если (Инд > 0) И ДанныеМногострочногоРаздела.Количество() >= Инд Тогда
					ДанныеМногострочногоРаздела[Инд-1][ИмяПок] = ЗначениеПоказателя;
				КонецЕсли; 
				
				Если (Инд > 0) И ДанныеДопСтрокРаздела.Количество() >= Инд Тогда
					ДанныеДопСтрокРаздела[Инд-1][ИмяПок] = ЗначениеПоказателя;
				КонецЕсли; 
				
			КонецЕсли;
			
			Если ДанныеРаздела <> Неопределено Тогда
				Если ДанныеРаздела.Свойство(ИмяПоказателя) Тогда
					ДанныеРаздела[ИмяПоказателя] = ЗначениеПоказателя;
				Иначе
					ДанныеРаздела.Вставить(ИмяПоказателя, ЗначениеПоказателя);
				КонецЕсли
			КонецЕсли; 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСтруктуруПоказателей()
	
	мДанныеОтчета = Новый Структура;
	
	СохрСтруктура = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	ПоказателиОтчета = СохрСтруктура.ПоказателиОтчета;
	Для Каждого Раздел Из ПоказателиОтчета Цикл
		мДанныеОтчета.Вставить(СтрЗаменить(Раздел.Ключ, "ПолеТабличногоДокумента", ""), РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Раздел.Значение));
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры Из СохрСтруктура.ДанныеМногостраничныхРазделов Цикл
		
		НайденноеЗначение = Неопределено;
		
		мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, НайденноеЗначение);
		
		Если НЕ НайденноеЗначение = Неопределено Тогда
			
			НайденноеЗначение = ЭтотОбъект[НайденноеЗначение];
			
			ЗначениеВДанныеФормы(ЭлементСтруктуры.Значение, НайденноеЗначение);
			
			Если НайденноеЗначение[0].Свойство("Данные") Тогда
				
				Для Каждого СтрокаТаблЗнач Из НайденноеЗначение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
						
						СтрокаТаблЗнач.Данные.Очистить();
						СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[НайденноеЗначение.Индекс(СтрокаТаблЗнач)].Данные);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если НайденноеЗначение[0].Свойство("ДанныеДопСтрок") Тогда
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
						
						Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
							
							ТаблЗнач = ЭлСтруктуры.Значение;
							
							ЭлСтруктуры.Значение = ЭтотОбъект["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
							
							ЗначениеВДанныеФормы(ТаблЗнач, ЭлСтруктуры.Значение);
							
							НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(ЭлСтруктуры.Значение);
							
						КонецЦикла;
						
					ИначеЕсли ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("ТаблицаЗначений") Тогда
						
						СтрокаТаблЗначДанныеДопСтрок = ЭтотОбъект["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
						
						ЗначениеВДанныеФормы(СтрокаТаблЗнач.ДанныеДопСтрок, СтрокаТаблЗначДанныеДопСтрок);
						
						НайденноеЗначение[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
						
					КонецЕсли;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		ТаблицаЛистовРаздела = ЭтотОбъект[Раздел.Значение];
		Для Каждого Лист Из ТаблицаЛистовРаздела Цикл
			Лист.Данные[0].Значение = РегламентированнаяОтчетность.СвернутьДанныеТабличногоПоля(Лист.Данные[0].Значение);
		КонецЦикла;
		мДанныеОтчета.Вставить(Раздел.Ключ, ЭтотОбъект[Раздел.Значение]);
	КонецЦикла;
	
	Для Каждого ДанныеЛистаД1 Из мДанныеОтчета.ЛистД1 Цикл
		СтраницаЛистаД1 = ДанныеЛистаД1.Данные[0].Значение;
		Если СтраницаЛистаД1.Свойство("П000700001100_1") И СтраницаЛистаД1.Свойство("П000700001100_3")
			И ЗначениеЗаполнено(СтраницаЛистаД1.П000700001100_1) И ЗначениеЗаполнено(СтраницаЛистаД1.П000700001100_3) Тогда
			СтраницаЛистаД1.Вставить("П000700001100", СокрЛП(СтраницаЛистаД1.П000700001100_1) + "/" + СокрЛП(СтраницаЛистаД1.П000700001100_3));
		Иначе
			СтраницаЛистаД1.Вставить("П000700001100", "");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРазделыНаНаличиеИнформации(ДеревоВыгрузки, парамРазделы)
	
	Разделы = Новый Массив;
	Если ТипЗнч(парамРазделы) = Тип("Строка") Тогда
		Если СтрНайти(парамРазделы, ",") <> 0 Тогда
			СтрРазделы = Новый Структура(парамРазделы);
			Для Каждого Эл Из СтрРазделы Цикл
				Разделы.Добавить(Эл.Ключ);
			КонецЦикла;
		Иначе
			Разделы.Добавить(парамРазделы);
		КонецЕсли;
	КонецЕсли;
	
	РазделыПусты = Ложь;
	Для Каждого Раздел Из Разделы Цикл
		Если РазделПуст(ДеревоВыгрузки, Раздел) Тогда
			РазделыПусты = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат НЕ РазделыПусты;
	
КонецФункции

&НаСервере
Функция ПолучитьПоказателиРаздела(ДеревоВыгрузки, Раздел)
	
	ПоказателиРаздела = ДеревоВыгрузки.Строки.НайтиСтроки(Новый Структура("Раздел", Раздел), Истина);
	КоличествоСтрокРаздела = ПоказателиРаздела.Количество();
	Для ОбрИнд = 1 По КоличествоСтрокРаздела Цикл
		Инд = КоличествоСтрокРаздела - ОбрИнд;
		ТекСтр = ПоказателиРаздела[Инд];
		Если НЕ ЗначениеЗаполнено(ТекСтр.Ключ) Тогда
			ПоказателиРаздела.Удалить(Инд);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоказателиРаздела;
	
КонецФункции

&НаСервере
Функция ПоказательЗаполнен(Показатель, Значение)
	
	Возврат ЗначениеЗаполнено(Значение) И НЕ (СокрЛП(Показатель.Формат) = "N" И Показатель.МаксРазмерность = 15 И ТипЗнч(Значение) = Тип("Число") И Окр(Значение) = 0);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоказателиНеанализируемыеНаЗаполненность()
	ПоказателиНеанализируемыеНаЗаполненность= Новый Массив;
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001020");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001030");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001040");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001050");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001070");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001130");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000200001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001130");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001150");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001160");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001170");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000500001180");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001040");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001080");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001140");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001200");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000600001220");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001200");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001230");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000700001240");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001050");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001150");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001160");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000800001170");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000900001070");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П000900001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001000001100");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001100001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001103");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001104");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001106");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001107");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001108");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001109");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001111");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001114");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001200001115");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000904");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000607");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000508");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001300000112");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001303");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001304");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001314");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001315");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001400001323");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001403");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001404");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001409");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001500001410");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001523");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001524");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001527");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001528");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001529");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001530");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001531");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001532");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001600001533");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001041");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001050");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001060");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001110");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001120");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001170");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001700001180");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001230");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001240");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001290");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001300");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001330");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001340");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001350");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001360");
	ПоказателиНеанализируемыеНаЗаполненность.Добавить("П001800001370");
	
	Возврат ПоказателиНеанализируемыеНаЗаполненность;

КонецФункции 

&НаСервере
Функция СтраницаПуста(ДанныеСтраницы, Показатели, ДеревоВыгрузки, РодМногостр = Ложь)
	
	Если ТипЗнч(Показатели) = Тип("Строка") Тогда
		ПоказателиРаздела = ПолучитьПоказателиРаздела(ДеревоВыгрузки, Показатели);
	Иначе
		ПоказателиРаздела = Показатели;
	КонецЕсли;
	
	ПоказателиНеанализируемыеНаЗаполненность = ПоказателиНеанализируемыеНаЗаполненность();
	
	Для Каждого Пок Из ПоказателиРаздела Цикл
		Если ПоказателиНеанализируемыеНаЗаполненность.Найти(Пок.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Пок.Многострочность Или (РодМногостр И Пок.Родитель.Многострочность) Тогда
			ИндексСтроки = 1;
			ЗначениеПоказателя = Неопределено;
			Пока ДанныеСтраницы.Свойство(Пок.Ключ + "_" + Формат(ИндексСтроки, "ЧГ="), ЗначениеПоказателя) Цикл
				Если ПоказательЗаполнен(Пок, ЗначениеПоказателя) Тогда
					Возврат Ложь;
				КонецЕсли;
				ИндексСтроки = ИндексСтроки + 1;
			КонецЦикла;
		Иначе
			ЗначениеПоказателя = Неопределено;
			ДанныеСтраницы.Свойство(СтрЗаменить(Пок.Ключ,"_Ч",""), ЗначениеПоказателя);
			Если ПоказательЗаполнен(Пок, ЗначениеПоказателя) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция РазделПуст(ДеревоВыгрузки, Раздел)
	
	ПоказателиРаздела = ПолучитьПоказателиРаздела(ДеревоВыгрузки, Раздел);
	
	ДанныеРаздела = мДанныеОтчета[Раздел];
	РазделПуст = Истина;
	Если ТипЗнч(ДанныеРаздела) <> Тип("Структура") Тогда
		Для Каждого Стр Из ДанныеРаздела Цикл
			Если НЕ СтраницаПуста(Стр.Данные[0].Значение, ПоказателиРаздела, ДеревоВыгрузки) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если НЕ СтраницаПуста(ДанныеРаздела, ПоказателиРаздела, ДеревоВыгрузки) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ДеревоВыгрузки); // формируем точную структуру XML-макета
	ЗаполнитьДаннымиУзел(ДеревоВыгрузки, ПараметрыВыгрузки); // заполняем дерево данными
	
	ОтсечьНезаполненныеНеобязательныеУзлы(ДеревоВыгрузки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьУсловныеЭлементы(Знач ПараметрыВыгрузки, Узел)
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если Узел.Код = ПараметрыВыгрузки.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
			Возврат;
		КонецЕсли;
		РегламентированнаяОтчетность.ДополнитьСтруктуруПараметров(мДанныеОтчета, ПараметрыВыгрузки, Узел);
	КонецЕсли;
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		ТекСтр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		Если НЕ ПустаяСтрока(ТекСтр.Условие) Тогда
			Если НЕ РегламентированнаяОтчетность.УсловиеВыполнено(ЭтотОбъект, ПараметрыВыгрузки, ТекСтр.Условие) Тогда
				Узел.Строки.Удалить(ТекСтр);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ОбработатьУсловныеЭлементы(ПараметрыВыгрузки, ТекСтр);
	КонецЦикла;
	
КонецПроцедуры

// Процедура рассчитывает итоги по указанному листу (если лист не указан, рассчитываются итоги на всех листах)
//  Если лист помечен активным и в табличном документе на форме есть соответствующие итогам области, их значения будут обновлены
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтогиЛиста(Форма, ИмяЛиста = Неопределено)

	Если ИмяЛиста = "ЛистВ" Тогда
		
		Колонка110 = 0;  // общая сумма дохода
		Колонка120 = 0;  // общая сумма проф.вычета (факт или по норме)
		СтраницаИтогов = Неопределено;
		
		Для Каждого ЛистВ Из Форма.ТаблицаСтраницыЛистВ Цикл
			
			Если ЛистВ.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			Колонка110 = Колонка110 + ЛистВ.Данные[0].Значение.П000500001030;
			Колонка120 = Колонка120 + ЛистВ.Данные[0].Значение.П000500001040
									+ ЛистВ.Данные[0].Значение.П000500001100;
			СтраницаИтогов = ЛистВ;
			
		КонецЦикла;
		
		Если СтраницаИтогов <> Неопределено Тогда
			
			ЛистВ.Данные[0].Значение.Вставить("П000500001110", Колонка110);
			ЛистВ.Данные[0].Значение.Вставить("П000500001120", Колонка120);
			
			Если СтраницаИтогов.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000500001110") <> Неопределено Тогда
				Форма.ТабличныйДокумент.Области["П000500001110"].Значение = Колонка110;
				Форма.ТабличныйДокумент.Области["П000500001120"].Значение = Колонка120;
			КонецЕсли; 
			
		КонецЕсли; 
	
	ИначеЕсли ИмяЛиста = "ЛистГ" Тогда
		
		ПоказателиЛиста = Форма.СтруктураДанныхЛистГ;
		ПоказателиЛиста.П000600001200 = 
			ПоказателиЛиста.П000600001020 +
			ПоказателиЛиста.П000600001040 +
			ПоказателиЛиста.П000600001060 +
			ПоказателиЛиста.П000600001080 +
			ПоказателиЛиста.П000600001100 +
			ПоказателиЛиста.П000600001120 +
			ПоказателиЛиста.П000600001140 +
			ПоказателиЛиста.П000600001160 +
			ПоказателиЛиста.П000600001190;
			
		Если Форма.ТабличныйДокумент.Области.Найти("П000600001200") <> Неопределено Тогда
			Форма.ТабличныйДокумент.Области["П000600001200"].Значение = ПоказателиЛиста.П000600001200;
		КонецЕсли; 
		
	ИначеЕсли ИмяЛиста = "ЛистД1" Тогда
		
		// Формула определения суммы налоговой базы для определения имущественного вычета
		//ВсегоДоходПоСтавке13 (строка 010 Раздела 2) 
		// - пункт 10 Листа Г
		// - пункт 4 Листа Е1
		// - пункт 3 Листа Е2
		// - подпункты 11.3 Листа 3
		// - пункт 7.3 листа И
		// - подпункт 3.2 Листа В
		// - пункте 4 листа Д2
		// - подпункт 6.1 Листа Ж
		// - подпункт 2.5 Листа Д1
		// - подпункт 2.6 Листа Д1
		
		ЗаполнитьСводныеТаблицы(Форма);
		
		СуммаДохода           = СуммаДоходаДляИмущественногоВычета(Форма);
		
		СтраницаИтогов        = Неопределено;
		
		ВсегоНаПриобретение   = 0;
		ВсегоПоПроцентам      = 0;
		
		ОстатокВычетаНаПриобретение = 2000000;
		ОстатокВычетаПоПроцентам    = 3000000;
		
		// Вычет по нескольким объектам можно получить только по законодательству 2014 года.
		РассчитыватьПределПоПроцентам = Форма.ТаблицаСтраницыЛистД1.Количество() > 1;
		
		// Собираем информацию по вычетам по всем листам
		Для Каждого ЛистД1 Из Форма.ТаблицаСтраницыЛистД1 Цикл
			
			Если ЛистД1.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтраницаИтогов  = ЛистД1;
			ПоказателиЛиста = ЛистД1.Данные[0].Значение;
			
			Если ПоказателиЛиста.П000700001120 > ОстатокВычетаНаПриобретение Тогда
				ПоказателиЛиста.П000700001120 = ОстатокВычетаНаПриобретение;
				Если ЛистД1.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000700001120") <> Неопределено Тогда
					Форма.ТабличныйДокумент.Области["П000700001120"].Значение = ПоказателиЛиста.П000700001120;
				КонецЕсли; 
			КонецЕсли; 
			
			ВсегоНаПриобретение = ВсегоНаПриобретение + ПоказателиЛиста.П000700001120;
			ОстатокВычетаНаПриобретение = Макс(0, ОстатокВычетаНаПриобретение - ПоказателиЛиста.П000700001120);
			
			// Предел на вычет по процентам действует только для объектов недвижимости, приобретенных с 01.01.2014 
			Если НЕ РассчитыватьПределПоПроцентам Тогда
				РассчитыватьПределПоПроцентам = НЕ ЗначениеЗаполнено(ПоказателиЛиста.П000700001110) ИЛИ ПоказателиЛиста.П000700001110 >= 2014;
			КонецЕсли; 
			
			Если РассчитыватьПределПоПроцентам Тогда
				
				Если ПоказателиЛиста.П000700001130 > ОстатокВычетаПоПроцентам Тогда
					ПоказателиЛиста.П000700001130 = ОстатокВычетаПоПроцентам;
					Если ЛистД1.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000700001130") <> Неопределено Тогда
						Форма.ТабличныйДокумент.Области["П000700001130"].Значение = ПоказателиЛиста.П000700001130;
					КонецЕсли; 
				КонецЕсли; 
				
				ВсегоПоПроцентам         = ВсегоПоПроцентам + ПоказателиЛиста.П000700001130;
				ОстатокВычетаПоПроцентам = ОстатокВычетаПоПроцентам - ПоказателиЛиста.П000700001130;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		ВсегоНаПриобретение = Мин(ВсегоНаПриобретение, 2000000);
		
		// Заполняем итоги
		Если СтраницаИтогов <> Неопределено Тогда
			
			ПоказателиЛиста = СтраницаИтогов.Данные[0].Значение;
			
			// Сумма дохода - налоговая база, вычисленная по формуле
			ПоказателиЛиста.Вставить("П000700001200", СуммаДохода);
			
			// Рассчитываем вычет на приобретение
			
			Если НЕ ПоказателиЛиста.Свойство("П000700001140") Тогда
				ПоказателиЛиста.Вставить("П000700001140", 0);
			КонецЕсли;
			
			Если НЕ ПоказателиЛиста.Свойство("П000700001180") Тогда
				ПоказателиЛиста.Вставить("П000700001180", 0);
			КонецЕсли;
			
			// Определение суммы вычета, доступного в текущем периоде
			ОстатокВычетаНаПриобретение = Макс(ВсегоНаПриобретение - ПоказателиЛиста.П000700001140 - ПоказателиЛиста.П000700001180, 0);
			
			// Расчет принимаемой к вычету суммы:
			ПринимаемыйВычетНаПриобретение = Мин(СуммаДохода, ОстатокВычетаНаПриобретение);
			ПоказательП000700001210 = 0;
			Если ПоказателиЛиста.Свойство("П000700001210", ПоказательП000700001210) Тогда
				ПринимаемыйВычетНаПриобретение = Мин(ПринимаемыйВычетНаПриобретение, ПоказательП000700001210);
			КонецЕсли;
			ПоказателиЛиста.Вставить("П000700001210", ПринимаемыйВычетНаПриобретение);
			
			ПоказателиЛиста.Вставить("П000700001230", Макс(ОстатокВычетаНаПриобретение - ПринимаемыйВычетНаПриобретение, 0)); // остаток на будущие периоды
			
			// уменьшаем сумму дохода на сумму принятого вычета
			СуммаДохода = СуммаДохода - ПринимаемыйВычетНаПриобретение;
			
			// Рассчитываем вычет по процентам
			
			Если НЕ ПоказателиЛиста.Свойство("П000700001150") Тогда
				ПоказателиЛиста.Вставить("П000700001150", 0);
			КонецЕсли;
			
			Если НЕ ПоказателиЛиста.Свойство("П000700001190") Тогда
				ПоказателиЛиста.Вставить("П000700001190", 0);
			КонецЕсли;
			
			// Определение суммы вычета, доступного в текущем периоде
			Если РассчитыватьПределПоПроцентам Тогда
				ОстатокВычетаПоПроцентам = Макс(ВсегоПоПроцентам - ПоказателиЛиста.П000700001150 - ПоказателиЛиста.П000700001190, 0);
			Иначе
				ОстатокВычетаПоПроцентам = Мин(ПоказателиЛиста.П000700001130, 3000000);
			КонецЕсли;
			
			// Расчет принимаемой к вычету суммы:
			ПринимаемыйВычетПоПроцентам = Мин(СуммаДохода, ОстатокВычетаПоПроцентам);
			ПоказательП000700001220 = 0;
			Если ПоказателиЛиста.Свойство("П000700001220", ПоказательП000700001220) Тогда
				ПринимаемыйВычетПоПроцентам = Мин(ПринимаемыйВычетПоПроцентам, ПоказательП000700001220);
			КонецЕсли;
			
			ПоказателиЛиста.Вставить("П000700001220", ПринимаемыйВычетПоПроцентам);
			
			ПоказателиЛиста.Вставить("П000700001240", Макс(ОстатокВычетаПоПроцентам - ПринимаемыйВычетПоПроцентам, 0)); // остаток на будущие периоды
			
			Если СтраницаИтогов.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П000700001200") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П000700001200"].Значение = ПоказателиЛиста.П000700001200; // Сумма дохода
				
				Форма.ТабличныйДокумент.Области["П000700001210"].Значение = ПоказателиЛиста.П000700001210; // Принимаемый вычет
				
				Форма.ТабличныйДокумент.Области["П000700001220"].Значение = ПоказателиЛиста.П000700001220; // Принимаемый вычет
			
				Форма.ТабличныйДокумент.Области["П000700001230"].Значение = ПоказателиЛиста.П000700001230; // Остаток на будущее
				Форма.ТабличныйДокумент.Области["П000700001240"].Значение = ПоказателиЛиста.П000700001240; // Остаток на будущее
				
			КонецЕсли; 
			
		КонецЕсли; 
			
	ИначеЕсли ИмяЛиста = "ЛистД2" Тогда
		
		// Расчет итогов Листа Д2
		ПоказателиЛиста = Форма.СтруктураДанныхЛистД2;
		
		ПоказателиЛиста.П000800001210 = ПоказателиЛиста.П000800001020
			+ ПоказателиЛиста.П000800001040
			+ ПоказателиЛиста.П000800001060
			+ ПоказателиЛиста.П000800001080
			+ ПоказателиЛиста.П000800001100
			+ ПоказателиЛиста.П000800001120
			+ ПоказателиЛиста.П000800001140
			+ ПоказателиЛиста.П000800001160
			+ ПоказателиЛиста.П000800001180
			+ ПоказателиЛиста.П000800001200;
			
		Если Форма.ТабличныйДокумент.Области.Найти("П000800001210") <> Неопределено Тогда
			Форма.ТабличныйДокумент.Области["П000800001210"].Значение = ПоказателиЛиста.П000800001210;
		КонецЕсли;
		
	ИначеЕсли ИмяЛиста = "ЛистЕ1" Тогда
		
		// Расчет итогов Листа Е1
		ПоказателиЛиста = Форма.СтруктураДанныхЛистЕ1;
		
		// Пункт 1.7
		ПоказателиЛиста.П000900001070 = 
			  ПоказателиЛиста.П000900001010
			+ ПоказателиЛиста.П000900001020
			+ ПоказателиЛиста.П000900001030 
			+ ПоказателиЛиста.П000900001040
			+ ПоказателиЛиста.П000900001050
			+ ПоказателиЛиста.П000900001060;
		
		// Пункт 2.4
		ПоказателиЛиста.П000900001110 =
			  ПоказателиЛиста.П000900001080
			+ ПоказателиЛиста.П000900001090
			+ ПоказателиЛиста.П000900001100; 
		
		// Пункт 3.6
		ПоказателиЛиста.П000900001170 = Мин(120000,
			  ПоказателиЛиста.П000900001120
			+ ПоказателиЛиста.П000900001130
			+ ПоказателиЛиста.П000900001140
			+ ПоказателиЛиста.П000900001150
			+ ПоказателиЛиста.П000900001160);
		
		// Пункт 3.7
		ПоказателиЛиста.П000900001180 = Макс(ПоказателиЛиста.П000900001110 + ПоказателиЛиста.П000900001170 - ПоказателиЛиста.П000900001171, 0);
		
		// Пункт 4
		ПоказателиЛиста.П000900001190 = ПоказателиЛиста.П000900001070 + ПоказателиЛиста.П000900001180;
		
		Если Форма.ТабличныйДокумент.Области.Найти("П000900001080") <> Неопределено Тогда
			
			Форма.ТабличныйДокумент.Области["П000900001070"].Значение = ПоказателиЛиста.П000900001070;
			Форма.ТабличныйДокумент.Области["П000900001110"].Значение = ПоказателиЛиста.П000900001110;
			Форма.ТабличныйДокумент.Области["П000900001170"].Значение = ПоказателиЛиста.П000900001170;
			Форма.ТабличныйДокумент.Области["П000900001180"].Значение = ПоказателиЛиста.П000900001180;
			Форма.ТабличныйДокумент.Области["П000900001190"].Значение = ПоказателиЛиста.П000900001190;
			
		КонецЕсли; 
		
	ИначеЕсли ИмяЛиста = "ЛистЕ2" Тогда
		
		// Расчет итогов Листа Е2
		ВсегоУплачено      = 0;  // сумма, принимаемая к вычету
		ВсегоПринимается   = 0;  // сумма, принимаемая к вычету
		СтраницаИтогов     = Неопределено;
		
		Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЕ2 Цикл
			
			Если Лист.Данные.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтраницаИтогов  = Лист;
			ПоказателиЛиста = Лист.Данные[0].Значение;
			
			ВсегоУплачено    = ВсегоУплачено + ПоказателиЛиста.П001000001060 + ПоказателиЛиста.П001000001080;
			ВсегоПринимается = ВсегоПринимается + ПоказателиЛиста.П001000001070 + ПоказателиЛиста.П001000001090;
			ПоказателиЛиста.Вставить("П001000001100", 0);
			
		КонецЦикла;
		
		Если СтраницаИтогов <> Неопределено Тогда
			
			ПоказателиЛиста = СтраницаИтогов.Данные[0].Значение;
			ПоказателиЛиста.Вставить("П001000001100", ВсегоПринимается);
			
			// Обновим связанный показатель на странице Е1
			Форма.СтруктураДанныхЛистЕ1.П000900001150 = ПоказателиЛиста.П001000001100;
			
			Если СтраницаИтогов.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001000001100") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П001000001100"].Значение = ПоказателиЛиста.П001000001100;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли ИмяЛиста = "ЛистЖ" Тогда
		
		Для Каждого СтраницаЛистЖ Из Форма.ТаблицаСтраницыЛистЖ Цикл
			
			ПоказателиЛиста = СтраницаЛистЖ.Данные[0].Значение;
			
			ПоказателиЛиста.П001100001020 = Мин(ПоказателиЛиста.П001100001010, ПоказателиЛиста.П001100001020);
			
			ПоказателиЛиста.П001100001040 = Мин(ПоказателиЛиста.П001100001030, ПоказателиЛиста.П001100001040);
			
			ПоказателиЛиста.П001100001060 = Мин(ПоказателиЛиста.П001100001050, ПоказателиЛиста.П001100001060);
			
			ПоказателиЛиста.П001100001080 = Мин(ПоказателиЛиста.П001100001070, ПоказателиЛиста.П001100001080);
			
			ПоказателиЛиста.П001100001100 = Мин(ПоказателиЛиста.П001100001090, ПоказателиЛиста.П001100001100);
			
			ПоказателиЛиста.П001100001120 = Мин(ПоказателиЛиста.П001100001110, ПоказателиЛиста.П001100001120);
			
			ПоказателиЛиста.П001100001140 = Мин(ПоказателиЛиста.П001100001130, ПоказателиЛиста.П001100001140);
			
			ПоказателиЛиста.П001100001150 = ПоказателиЛиста.П001100001020
								+ ПоказателиЛиста.П001100001040
								+ ПоказателиЛиста.П001100001060
								+ ПоказателиЛиста.П001100001080
								+ ПоказателиЛиста.П001100001100
								+ ПоказателиЛиста.П001100001120
								+ ПоказателиЛиста.П001100001140;
			
			Если СтраницаЛистЖ.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001100001020") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П001100001020"].Значение = ПоказателиЛиста.П001100001020;
				Форма.ТабличныйДокумент.Области["П001100001040"].Значение = ПоказателиЛиста.П001100001040;
				Форма.ТабличныйДокумент.Области["П001100001060"].Значение = ПоказателиЛиста.П001100001060;
				Форма.ТабличныйДокумент.Области["П001100001080"].Значение = ПоказателиЛиста.П001100001080;
				Форма.ТабличныйДокумент.Области["П001100001100"].Значение = ПоказателиЛиста.П001100001100;
				Форма.ТабличныйДокумент.Области["П001100001120"].Значение = ПоказателиЛиста.П001100001120;
				Форма.ТабличныйДокумент.Области["П001100001140"].Значение = ПоказателиЛиста.П001100001140;
				Форма.ТабличныйДокумент.Области["П001100001150"].Значение = ПоказателиЛиста.П001100001150;
				
			КонецЕсли;
		
		КонецЦикла;
	
	ИначеЕсли ИмяЛиста = "ЛистЗ" ИЛИ ИмяЛиста = "ЛистЗПродолжение4" Тогда
		
		КлючВидаОперации = "П001200001100";
		
		// Для пересчета показателей листа З используем вспомогательную таблицу,
		// содежащую все показатели всех продолжений листа З в качастве колонок.
		Форма.ТаблицаПоказателейЛистаЗ.Очистить();
		
		// Добавим 2 строки во вспомогательную таблицу, по количеству видов опериции.
		ОперацииСИнвестиционнымСчетом = Форма.ТаблицаПоказателейЛистаЗ.Добавить();
		ОперацииСИнвестиционнымСчетом[КлючВидаОперации] = "1";
		
		ИныеОперации = Форма.ТаблицаПоказателейЛистаЗ.Добавить();
		ИныеОперации[КлючВидаОперации] = "2";
		
		// Соберем все данные всех продолжений листа З во вспомогательную таблицу.
		ПродолженияЛистаЗ = Новый Массив;
		ПродолженияЛистаЗ.Добавить(Форма.ТаблицаСтраницыЛистЗ);
		ПродолженияЛистаЗ.Добавить(Форма.ТаблицаСтраницыЛистЗПродолжение);
		ПродолженияЛистаЗ.Добавить(Форма.ТаблицаСтраницыЛистЗПродолжение2);
		ПродолженияЛистаЗ.Добавить(Форма.ТаблицаСтраницыЛистЗПродолжение3);
		ПродолженияЛистаЗ.Добавить(Форма.ТаблицаСтраницыЛистЗПродолжение4);
		
		Для Каждого ТаблицаСтраницыЛистЗ Из ПродолженияЛистаЗ Цикл
			
			Для Каждого СтраницаЛистЗ Из ТаблицаСтраницыЛистЗ Цикл
				
				ПоказателиЛиста = СтраницаЛистЗ.Данные[0].Значение;
				
				// В зависимости от вида операци, данные будут попадать в соответсвующую строку.
				// Листы, в которых не заполнен Вид операции, относятся к иным видам операции.
				Если ПоказателиЛиста[КлючВидаОперации] = "1" Тогда
					ЗаполнитьЗначенияСвойств(ОперацииСИнвестиционнымСчетом, ПоказателиЛиста, , КлючВидаОперации);
				Иначе
					ЗаполнитьЗначенияСвойств(ИныеОперации, ПоказателиЛиста, , КлючВидаОперации);
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
	
		Для Каждого ПоказателиЛистаЗ Из Форма.ТаблицаПоказателейЛистаЗ Цикл
			
			ПоказателиЛистаЗ.П001200001106 = ПоказателиЛистаЗ.П001200001102 
				+ ПоказателиЛистаЗ.П001200001103 
				+ ПоказателиЛистаЗ.П001200001104 
				+ ПоказателиЛистаЗ.П001200001105;
			
			ПоказателиЛистаЗ.П001200001107 = Макс(ПоказателиЛистаЗ.П001200001101 - ПоказателиЛистаЗ.П001200001106, 0);
			
			ПоказателиЛистаЗ.П001200001108 = Макс(ПоказателиЛистаЗ.П001200001106 - ПоказателиЛистаЗ.П001200001101, 0);
			
			ПоказателиЛистаЗ.П001200001115 = Макс(
				  ПоказателиЛистаЗ.П001200001108
				- ПоказателиЛистаЗ.П001200001113
				- ПоказателиЛистаЗ.П001200001114, 0);
			
			ПоказателиЛистаЗ.П001600001501 = ПоказателиЛистаЗ.П001600001502
				+ ПоказателиЛистаЗ.П001600001503
				+ ПоказателиЛистаЗ.П001600001504
				+ ПоказателиЛистаЗ.П001600001505
				+ ПоказателиЛистаЗ.П001600001506
				+ ПоказателиЛистаЗ.П001600001507
				+ ПоказателиЛистаЗ.П001600001508
				+ ПоказателиЛистаЗ.П001600001509
				+ ПоказателиЛистаЗ.П001600001510
				+ ПоказателиЛистаЗ.П001600001511;
			
			ПоказателиЛистаЗ.П001600001512 = ПоказателиЛистаЗ.П001600001513
				+ ПоказателиЛистаЗ.П001600001514
				+ ПоказателиЛистаЗ.П001600001515
				+ ПоказателиЛистаЗ.П001600001516
				+ ПоказателиЛистаЗ.П001600001517
				+ ПоказателиЛистаЗ.П001600001518
				+ ПоказателиЛистаЗ.П001600001519
				+ ПоказателиЛистаЗ.П001600001520
				+ ПоказателиЛистаЗ.П001600001521
				+ ПоказателиЛистаЗ.П001600001522;
			
			// 9.3. Налоговая база за отчетный налоговый период (пп. 1.7 Листа З)
			ПоказателиЛистаЗ.П001600001523 = ПоказателиЛистаЗ.П001200001107;
			
			// 9.4. Налоговая база за отчетный налоговый период (пп. 4.3 Листа З + пп. 5.3 Листа З)
			ПоказателиЛистаЗ.П001600001524 = ПоказателиЛистаЗ.П001400001303 + ПоказателиЛистаЗ.П001400001314;
			
			ПоказателиЛистаЗ.П001600001527 = Макс(ПоказателиЛистаЗ.П001600001501 - ПоказателиЛистаЗ.П001600001525, 0);
			
			ПоказателиЛистаЗ.П001600001528 = Макс(ПоказателиЛистаЗ.П001600001512 - ПоказателиЛистаЗ.П001600001526, 0);
			
			// 10.1. Сумма убытка по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг (пп. 1.15 + пп. 9.7)
			ПоказателиЛистаЗ.П001600001529 = ПоказателиЛистаЗ.П001200001115 + ПоказателиЛистаЗ.П001600001527;
			
			// 10.2. Сумма убытка по операциям с финансовыми инструментами срочных сделок, обращающимися на организованном рынке (пп. 4.11 + пп. 5.9 + пп. 9.8)
			ПоказателиЛистаЗ.П001600001530 = ПоказателиЛистаЗ.П001400001311 + ПоказателиЛистаЗ.П001400001320 + ПоказателиЛистаЗ.П001600001528;
			
			ПоказателиЛистаЗ.П001600001531 = ПоказателиЛистаЗ.П001200001101 
			+ ПоказателиЛистаЗ.П001300001201
			+ ПоказателиЛистаЗ.П001300001205
			+ ПоказателиЛистаЗ.П001400001301
			+ ПоказателиЛистаЗ.П001400001312
			+ ПоказателиЛистаЗ.П001400001321
			+ ПоказателиЛистаЗ.П001500001401
			+ ПоказателиЛистаЗ.П001500001407;
			
			ПоказателиЛистаЗ.П001600001532 = ПоказателиЛистаЗ.П001200001112 
			+ ПоказателиЛистаЗ.П001300001204
			+ ПоказателиЛистаЗ.П001300001212
			+ ПоказателиЛистаЗ.П001400001308
			+ ПоказателиЛистаЗ.П001400001318
			+ ПоказателиЛистаЗ.П001400001323
			+ ПоказателиЛистаЗ.П001500001403
			+ ПоказателиЛистаЗ.П001500001409;
			
			ПоказателиЛистаЗ.П001600001533 = Макс(ПоказателиЛистаЗ.П001600001531 - ПоказателиЛистаЗ.П001600001532, 0);
			
			Если Форма.ТабличныйДокумент.Области.Найти("П001600001533") <> Неопределено
				И Форма.ТабличныйДокумент.Области[КлючВидаОперации].Значение = ПоказателиЛистаЗ[КлючВидаОперации] Тогда
				
				Форма.ТабличныйДокумент.Области["П001600001501"].Значение = ПоказателиЛистаЗ.П001600001501;
				Форма.ТабличныйДокумент.Области["П001600001512"].Значение = ПоказателиЛистаЗ.П001600001512;
				Форма.ТабличныйДокумент.Области["П001600001523"].Значение = ПоказателиЛистаЗ.П001600001523;
				Форма.ТабличныйДокумент.Области["П001600001524"].Значение = ПоказателиЛистаЗ.П001600001524;
				Форма.ТабличныйДокумент.Области["П001600001527"].Значение = ПоказателиЛистаЗ.П001600001527;
				Форма.ТабличныйДокумент.Области["П001600001528"].Значение = ПоказателиЛистаЗ.П001600001528;
				Форма.ТабличныйДокумент.Области["П001600001529"].Значение = ПоказателиЛистаЗ.П001600001529;
				Форма.ТабличныйДокумент.Области["П001600001530"].Значение = ПоказателиЛистаЗ.П001600001530;
				Форма.ТабличныйДокумент.Области["П001600001531"].Значение = ПоказателиЛистаЗ.П001600001531;
				Форма.ТабличныйДокумент.Области["П001600001532"].Значение = ПоказателиЛистаЗ.П001600001532;
				Форма.ТабличныйДокумент.Области["П001600001533"].Значение = ПоказателиЛистаЗ.П001600001533;
				
			ИначеЕсли Форма.ТабличныйДокумент.Области.Найти("П001200001115") <> Неопределено
				И Форма.ТабличныйДокумент.Области[КлючВидаОперации].Значение = ПоказателиЛистаЗ[КлючВидаОперации] Тогда
				
				Форма.ТабличныйДокумент.Области["П001200001106"].Значение = ПоказателиЛистаЗ.П001200001106;
				Форма.ТабличныйДокумент.Области["П001200001107"].Значение = ПоказателиЛистаЗ.П001200001107;
				Форма.ТабличныйДокумент.Области["П001200001108"].Значение = ПоказателиЛистаЗ.П001200001108;
				Форма.ТабличныйДокумент.Области["П001200001115"].Значение = ПоказателиЛистаЗ.П001200001115;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ТаблицаСтраницыЛистЗ Из ПродолженияЛистаЗ Цикл
			Для Каждого СтраницаЛистЗ Из Форма.ТаблицаСтраницыЛистЗ Цикл
				
				ПоказателиЛиста = СтраницаЛистЗ.Данные[0].Значение;
				
				Если ПоказателиЛиста[КлючВидаОперации] = "1" Тогда
					ЗаполнитьЗначенияСвойств(ПоказателиЛиста, ОперацииСИнвестиционнымСчетом, , КлючВидаОперации);
				Иначе
					ЗаполнитьЗначенияСвойств(ПоказателиЛиста, ИныеОперации, , КлючВидаОперации);
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение" Тогда
		
		Для Каждого СтраницаЛистЗ Из Форма.ТаблицаСтраницыЛистЗПродолжение Цикл
			
			ЛистЗПродолжение = СтраницаЛистЗ.Данные[0].Значение;
			
			ЛистЗПродолжение.П001300001204 = Макс(ЛистЗПродолжение.П001300001201
			- ЛистЗПродолжение.П001300001202
			- ЛистЗПродолжение.П001300001203,0);
			
			ЛистЗПродолжение.П001300001211 = ЛистЗПродолжение.П001300001206
			+ ЛистЗПродолжение.П001300001207
			+ ЛистЗПродолжение.П001300001208
			+ ЛистЗПродолжение.П001300001209
			+ ЛистЗПродолжение.П001300001210;
			
			ЛистЗПродолжение.П001300001212 = Макс(ЛистЗПродолжение.П001300001205
			- ЛистЗПродолжение.П001300001211, 0);
			
			Если СтраницаЛистЗ.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001300001211") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П001300001211"].Значение = ЛистЗПродолжение.П001300001211;
				Форма.ТабличныйДокумент.Области["П001300001204"].Значение = ЛистЗПродолжение.П001300001204;
				Форма.ТабличныйДокумент.Области["П001300001212"].Значение = ЛистЗПродолжение.П001300001212;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение2" Тогда
		
		Для Каждого СтраницаЛистЗ Из Форма.ТаблицаСтраницыЛистЗПродолжение2 Цикл
			
			ЛистЗПродолжение2 = СтраницаЛистЗ.Данные[0].Значение;
			
			ЛистЗПродолжение2.П001400001303 = Макс(ЛистЗПродолжение2.П001400001301 - ЛистЗПродолжение2.П001400001302, 0);
			ЛистЗПродолжение2.П001400001304 = Макс(ЛистЗПродолжение2.П001400001302 - ЛистЗПродолжение2.П001400001301, 0);
			
			ЛистЗПродолжение2.П001400001314 = Макс(ЛистЗПродолжение2.П001400001312 - ЛистЗПродолжение2.П001400001313, 0);
			ЛистЗПродолжение2.П001400001315 = Макс(ЛистЗПродолжение2.П001400001313 - ЛистЗПродолжение2.П001400001312, 0);
			
			ЛистЗПродолжение2.П001400001323 = Макс(ЛистЗПродолжение2.П001400001321
			- ЛистЗПродолжение2.П001400001322, 0);
			
			Если СтраницаЛистЗ.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001400001303") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П001400001303"].Значение = ЛистЗПродолжение2.П001400001303;
				Форма.ТабличныйДокумент.Области["П001400001304"].Значение = ЛистЗПродолжение2.П001400001304;
				Форма.ТабличныйДокумент.Области["П001400001309"].Значение = ЛистЗПродолжение2.П001400001309;
				Форма.ТабличныйДокумент.Области["П001400001310"].Значение = ЛистЗПродолжение2.П001400001310;
				Форма.ТабличныйДокумент.Области["П001400001311"].Значение = ЛистЗПродолжение2.П001400001311;
				Форма.ТабличныйДокумент.Области["П001400001314"].Значение = ЛистЗПродолжение2.П001400001314;
				Форма.ТабличныйДокумент.Области["П001400001315"].Значение = ЛистЗПродолжение2.П001400001315;
				Форма.ТабличныйДокумент.Области["П001400001323"].Значение = ЛистЗПродолжение2.П001400001323;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяЛиста = "ЛистЗПродолжение3" Тогда
		
		Для Каждого СтраницаЛистЗ Из Форма.ТаблицаСтраницыЛистЗПродолжение3 Цикл
				
			ЛистЗПродолжение3 = СтраницаЛистЗ.Данные[0].Значение;
			
			ЛистЗПродолжение3.П001500001403 = Макс(ЛистЗПродолжение3.П001500001401 - ЛистЗПродолжение3.П001500001402, 0);
			ЛистЗПродолжение3.П001500001404 = Макс(ЛистЗПродолжение3.П001500001402 - ЛистЗПродолжение3.П001500001401, 0);
			
			ЛистЗПродолжение3.П001500001409 = Макс(ЛистЗПродолжение3.П001500001407 - ЛистЗПродолжение3.П001500001408, 0);
			ЛистЗПродолжение3.П001500001410 = Макс(ЛистЗПродолжение3.П001500001408 - ЛистЗПродолжение3.П001500001407, 0);
			
			Если СтраницаЛистЗ.АктивнаяСтраница И Форма.ТабличныйДокумент.Области.Найти("П001500001403") <> Неопределено Тогда
				
				Форма.ТабличныйДокумент.Области["П001500001403"].Значение = ЛистЗПродолжение3.П001500001403;
				Форма.ТабличныйДокумент.Области["П001500001404"].Значение = ЛистЗПродолжение3.П001500001404;
				Форма.ТабличныйДокумент.Области["П001500001409"].Значение = ЛистЗПродолжение3.П001500001409;
				Форма.ТабличныйДокумент.Области["П001500001410"].Значение = ЛистЗПродолжение3.П001500001410;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяЛиста = "ЛистИ" Тогда
		
		ЛистИ = Форма.СтруктураДанныхЛистИ;

		ЛистИ.П001700001041 = Макс(ЛистИ.П001700001010 - ЛистИ.П001700001020 - ЛистИ.П001700001030 - ЛистИ.П001700001040, 0);
		
		ЛистИ.П001700001050 = Макс(ЛистИ.П001700001041 - ЛистИ.П001700001042, 0);
		
		ЛистИ.П001700001060 = Макс(ЛистИ.П001700001020 + ЛистИ.П001700001030 - ЛистИ.П001700001010, 0);
		
		ЛистИ.П001700001110 = Макс(ЛистИ.П001700001070 - ЛистИ.П001700001080 - ЛистИ.П001700001090 - ЛистИ.П001700001100, 0);
		
		ЛистИ.П001700001120 = Макс(ЛистИ.П001700001090 + ЛистИ.П001700001080 - ЛистИ.П001700001070, 0);
		
		ЛистИ.П001700001170 = Макс(ЛистИ.П001700001130 - ЛистИ.П001700001140 - ЛистИ.П001700001150 - ЛистИ.П001700001160, 0);
		
		ЛистИ.П001700001180 = Макс(ЛистИ.П001700001140 + ЛистИ.П001700001150 - ЛистИ.П001700001130, 0);
		
		Если Форма.ТабличныйДокумент.Области.Найти("П001700001180") <> Неопределено Тогда
			
			Форма.ТабличныйДокумент.Области["П001700001041"].Значение = ЛистИ.П001700001041;
			Форма.ТабличныйДокумент.Области["П001700001050"].Значение = ЛистИ.П001700001050;
			Форма.ТабличныйДокумент.Области["П001700001060"].Значение = ЛистИ.П001700001060;
			Форма.ТабличныйДокумент.Области["П001700001110"].Значение = ЛистИ.П001700001110;
			Форма.ТабличныйДокумент.Области["П001700001120"].Значение = ЛистИ.П001700001120;
			Форма.ТабличныйДокумент.Области["П001700001170"].Значение = ЛистИ.П001700001170;
			Форма.ТабличныйДокумент.Области["П001700001180"].Значение = ЛистИ.П001700001180;
			
		КонецЕсли;
		
	ИначеЕсли ИмяЛиста = "ЛистИПродолжение" Тогда
		
		ЛистИ = Форма.СтруктураДанныхЛистИ;
		ЛистИПродолжение = Форма.СтруктураДанныхЛистИПродолжение;

		ЛистИПродолжение.П001800001230 = Макс(ЛистИПродолжение.П001800001190 - ЛистИПродолжение.П001800001200 - ЛистИПродолжение.П001800001210 - ЛистИПродолжение.П001800001220, 0);
		
		ЛистИПродолжение.П001800001240 = Макс(ЛистИПродолжение.П001800001200 + ЛистИПродолжение.П001800001210 - ЛистИПродолжение.П001800001190, 0);
		
		ЛистИПродолжение.П001800001290 = Макс(ЛистИПродолжение.П001800001250 - ЛистИПродолжение.П001800001260 - ЛистИПродолжение.П001800001270 - ЛистИПродолжение.П001800001280, 0);
		
		ЛистИПродолжение.П001800001300 = Макс(ЛистИПродолжение.П001800001260 + ЛистИПродолжение.П001800001270 - ЛистИПродолжение.П001800001250, 0);
		
		ЛистИПродолжение.П001800001330 = Макс(ЛистИПродолжение.П001800001310 - ЛистИПродолжение.П001800001320, 0);
		
		ЛистИПродолжение.П001800001340 = Макс(ЛистИПродолжение.П001800001320 - ЛистИПродолжение.П001800001310, 0);
		
		ЛистИПродолжение.П001800001350 = ЛистИ.П001700001010
										+ ЛистИ.П001700001070
										+ ЛистИ.П001700001130
										+ ЛистИПродолжение.П001800001190
										+ ЛистИПродолжение.П001800001250
										+ ЛистИПродолжение.П001800001310;
		
		ЛистИПродолжение.П001800001360 = ЛистИ.П001700001050
										+ ЛистИ.П001700001110
										+ ЛистИ.П001700001170
										+ ЛистИПродолжение.П001800001230
										+ ЛистИПродолжение.П001800001290
										+ ЛистИПродолжение.П001800001330;
		
		ЛистИПродолжение.П001800001370 = Макс(ЛистИПродолжение.П001800001350 - ЛистИПродолжение.П001800001360, 0);
		
		Если Форма.ТабличныйДокумент.Области.Найти("П001800001370") <> Неопределено Тогда
			
			Форма.ТабличныйДокумент.Области["П001800001230"].Значение = ЛистИПродолжение.П001800001230;
			Форма.ТабличныйДокумент.Области["П001800001240"].Значение = ЛистИПродолжение.П001800001240;
			Форма.ТабличныйДокумент.Области["П001800001290"].Значение = ЛистИПродолжение.П001800001290;
			Форма.ТабличныйДокумент.Области["П001800001300"].Значение = ЛистИПродолжение.П001800001300;
			Форма.ТабличныйДокумент.Области["П001800001330"].Значение = ЛистИПродолжение.П001800001330;
			Форма.ТабличныйДокумент.Области["П001800001340"].Значение = ЛистИПродолжение.П001800001340;
			Форма.ТабличныйДокумент.Области["П001800001350"].Значение = ЛистИПродолжение.П001800001350;
			Форма.ТабличныйДокумент.Области["П001800001360"].Значение = ЛистИПродолжение.П001800001360;
			Форма.ТабличныйДокумент.Области["П001800001370"].Значение = ЛистИПродолжение.П001800001370;
			
		КонецЕсли;
		
	ИначеЕсли Не ЗначениеЗаполнено(ИмяЛиста) Тогда
		
		РассчитатьИтогиЛиста(Форма, "ЛистБ");
		РассчитатьИтогиЛиста(Форма, "ЛистВ");
		РассчитатьИтогиЛиста(Форма, "ЛистГ");
		РассчитатьИтогиЛиста(Форма, "ЛистД2");
		РассчитатьИтогиЛиста(Форма, "ЛистЕ2");
		РассчитатьИтогиЛиста(Форма, "ЛистЕ1");
		РассчитатьИтогиЛиста(Форма, "ЛистЖ");
		РассчитатьИтогиЛиста(Форма, "ЛистЗ");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение2");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение3");
		РассчитатьИтогиЛиста(Форма, "ЛистЗПродолжение4");
		РассчитатьИтогиЛиста(Форма, "ЛистИ");
		РассчитатьИтогиЛиста(Форма, "ЛистИПродолжение");
		РассчитатьИтогиЛиста(Форма, "ЛистД1");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСводныеТаблицы(Форма)

	//Очищаем покатазети
	Форма.СводДоходов.Очистить();
	Форма.СводВычетов.Очистить();
	ОКТМОналогоплательщика = "";
	
	// Перебираем строки Листа А:
	//
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистА Цикл
		
		Если Лист.Данные.Количество() = 0 ИЛИ Лист.ДанныеДопСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		Для Каждого СтрокаЛиста Из Лист.ДанныеДопСтрок[0].Значение Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛиста.П000300001070) Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокаДохода = Форма.СводДоходов.Добавить();
			Если СтрокаЛиста.П000300001020 = ВидДоходаОтНалоговогоАгента() ИЛИ СтрокаЛиста.П000300001020 = ВидДоходаОтОперацийСЦБ()
				ИЛИ СтрокаЛиста.П000300001100 <> 0 Тогда
				СтрокаДохода.КБК = КБКДоходовОтНалоговогоАгента(); //доход от налогового агента
			Иначе
				СтрокаДохода.КБК = КБКДоходовССамостоятельнымИсчислением(); //доход с самостоятельным исчислением и уплатой налога
			КонецЕсли; 
			СтрокаДохода.ОКТМО            = СтрокаЛиста.П000300001050;
			СтрокаДохода.Ставка           = СтрокаЛиста.П000300001010;
			
			Если СтрокаЛиста.П000300001020 = ВидДоходаВВидеДивидендов() Тогда
				// с 2015-го года доходы в виде сумм прибыли контролируемых иностранных компаний должны считаться отдельно
				СтрокаДохода.ВидДохода = Дивиденды();
			Иначе
				СтрокаДохода.ВидДохода = ОбычныйДоход();
			КонецЕсли;
			
			СтрокаДохода.СуммаДохода      = СтрокаЛиста.П000300001070;
			СтрокаДохода.НачисленоНалога  = СтрокаЛиста.П000300001090;
			СтрокаДохода.УдержаноНалога   = СтрокаЛиста.П000300001100;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Перебираем строки Листа Б:
	//
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистБ Цикл
		
		Если Лист.Данные.Количество() = 0 ИЛИ Лист.ДанныеДопСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтавкаНалога = Лист.Данные[0].Значение.П000400001001;
		
		Для Каждого СтрокаЛиста Из Лист.ДанныеДопСтрок[0].Значение Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаЛиста.П000400001070) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДохода        = Форма.СводДоходов.Добавить();
			СтрокаДохода.КБК    = КБКДоходовССамостоятельнымИсчислением(); // доход с самостоятельным исчислением и уплатой налога
			СтрокаДохода.ОКТМО  = ОКТМОналогоплательщика;
			СтрокаДохода.Ставка = СтавкаНалога;
			
			Если Строка(СтрокаЛиста.П000400001031) = КодДоходаКонтролируемыхКомпаний() Тогда
				СтрокаДохода.ВидДохода = ДоходыКонтролируемыхКомпаний();
			Иначе
				СтрокаДохода.ВидДохода = ОбычныйДоход();
			КонецЕсли;
			
			СтрокаДохода.СуммаДохода     = СтрокаЛиста.П000400001070;
			СтрокаДохода.НачисленоНалога = СтрокаЛиста.П000400001120;
			
			СтрокаДохода.НалогПринимаемыйКУчету   = СтрокаЛиста.П000400001130;
			
			Если СтрокаЛиста.П000400001071 <> 0 Тогда
				
				СтрокаВычета                        = Форма.СводВычетов.Добавить();
				СтрокаВычета.ВидВычета              = "ЛистБ.071";
				СтрокаВычета.Ставка                 = СтавкаНалога;
				СтрокаВычета.СуммаВычетаДляРаздела2 = СтрокаЛиста.П000400001071;
				
				Если Строка(СтрокаЛиста.П000400001031) = КодДоходаКонтролируемыхКомпаний() Тогда
					СтрокаВычета.ВидДохода = ДоходыКонтролируемыхКомпаний();
				Иначе
					СтрокаВычета.ВидДохода = ОбычныйДоход();
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтрокаЛиста.П000400001072 <> 0 Тогда
				
				СтрокаВычета                         = Форма.СводВычетов.Добавить();
				СтрокаВычета.ВидВычета               = "ЛистБ.072";
				СтрокаВычета.Ставка                  = СтавкаНалога;
				СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000400001072;
				Если Строка(СтрокаЛиста.П000400001031) = КодДоходаКонтролируемыхКомпаний() Тогда
					СтрокаВычета.ВидДохода = ДоходыКонтролируемыхКомпаний();
				Иначе
					СтрокаВычета.ВидДохода = ОбычныйДоход();
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Перебираем строки Листа В:
	//
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистВ Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		Если СтрокаЛиста.П000500001030 = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаДохода = Форма.СводДоходов.Добавить();
		СтрокаДохода.КБК = КБКДоходовОтПредпринимательскойДеятельности(); // доход от предпринимательской деятельности
		СтрокаДохода.ОКТМО            = ОКТМОналогоплательщика;
		СтрокаДохода.Ставка           = 13;
		СтрокаДохода.СуммаДохода      = СтрокаЛиста.П000500001030;
		СтрокаДохода.НачисленоНалога  = Окр((СтрокаДохода.СуммаДохода - СтрокаЛиста.П000500001040 - СтрокаЛиста.П000500001100) * 0.13, 0);
		СтрокаДохода.ВидДохода = ОбычныйДоход();
		
		// Добавляем строку вычета по каждому виду деятельности
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистВ.120";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000500001100 + СтрокаЛиста.П000500001040;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
		
		
		Если СтрокаЛиста.Свойство("П000500001140") Тогда
			// Итоговые показатели находятся только на последнем листе
			СтрокаДохода.УплаченоНалога   = СтрокаЛиста.П000500001140;
		КонецЕсли; 
		
	КонецЦикла;
	
	// - пункт 9 Листа Г
	Если Форма.СтруктураДанныхЛистГ.П000600001200 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистГ.200";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистГ.П000600001200;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
		
	КонецЕсли; 
	
	// - пункт 10.2 Листа Г
	Если Форма.СтруктураДанныхЛистГ.П000600001220 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистГ.220";
		СтрокаВычета.Ставка                  = 35;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистГ.П000600001220;
		СтрокаВычета.СуммаВычетаДляД1        = 0;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
	КонецЕсли;
	
	// - пункт 3.6.1 Листа Е1
	Если Форма.СтруктураДанныхЛистЕ1.П000900001171 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЕ1.171";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистЕ1.П000900001171;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
	КонецЕсли;
	
	// - пункт 4 Листа Е1
	Если Форма.СтруктураДанныхЛистЕ1.П000900001190 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЕ1.190";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистЕ1.П000900001190;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
	КонецЕсли;
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЕ2 Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		// сумма вычета
		// 3.1. Сумма инвестиционного налогового вычета, предусмотренного подпунктом 2 пункта 1 статьи 219.1 Налогового кодекса 
		//	Российской Федерации
		Если СтрокаЛиста.Свойство("П001000001110") И СтрокаЛиста.П001000001110 <> 0 Тогда
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистЕ2.110";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П001000001110;
			СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
			СтрокаВычета.ВидДохода               = ОбычныйДоход();
		КонецЕсли;
		
		// Добавляем к доходам сумму инвестиционного вычета, подлежащему возмещению
		// 3.2. Сумма предоставленного в предшествующих налоговых периодах инвестиционного налогового вычета, предусмотренного подпунктом 2 
		//	пункта 1 статьи 219.1 Налогового кодекса Российской Федерации, подлежащая восстановлению
		Если СтрокаЛиста.Свойство("П001000001120") И СтрокаЛиста.П001000001120 <> 0 Тогда
			СтрокаДохода = Форма.СводДоходов.Добавить();
			СтрокаДохода.КБК = КБКДоходовССамостоятельнымИсчислением(); //доход с самостоятельным исчислением и уплатой налога
			СтрокаДохода.ОКТМО            = ОКТМОналогоплательщика;
			СтрокаДохода.Ставка           = 13;
			СтрокаДохода.СуммаДохода      = СтрокаЛиста.П001000001120;
			СтрокаДохода.НачисленоНалога  = Окр((СтрокаДохода.СуммаДохода) * 0.13, 0);
			СтрокаДохода.ВидДохода = ОбычныйДоход();
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистД1 Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		// Итоговые показатели есть только на последнем листе, если есть один,
		// то есть и остальные, в противном случае пропускаем эту страницу
		Если СтрокаЛиста.Свойство("П000700001180") Тогда
			// - подпункт 2.5 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.180";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001180;
			СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
			СтрокаВычета.ВидДохода               = ОбычныйДоход();
			
			// - подпункт 2.6 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.190";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001190;
			СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
			СтрокаВычета.ВидДохода               = ОбычныйДоход();

			// - подпункт 2.8 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.210";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001210;
			СтрокаВычета.СуммаВычетаДляД1        = 0;
			СтрокаВычета.ВидДохода               = ОбычныйДоход();
			
			// - подпункт 2.9 Листа Д1
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистД1.220";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П000700001220;
			СтрокаВычета.СуммаВычетаДляД1        = 0;
			СтрокаВычета.ВидДохода               = ОбычныйДоход();

		КонецЕсли;
		
	КонецЦикла;
	
	// - пункт 4 листа Д2
	Если Форма.СтруктураДанныхЛистД2.П000800001210 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистД2.210";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистД2.П000800001210;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
	КонецЕсли;
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЖ Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтрокаЛиста = Лист.Данные[0].Значение;
		
		// - подпункт 6.1 Листа Ж
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистЖ.150";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = СтрокаЛиста.П001100001150;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
		
	КонецЦикла;
	
	Для Каждого Лист Из Форма.ТаблицаСтраницыЛистЗПродолжение4 Цикл
		
		Если Лист.Данные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли; 
			
		СтрокаЛиста = Лист.Данные[0].Значение;
			
		// - подпункты 11.3 Листа 3
		Если СтрокаЛиста.П001600001533 <> 0 Тогда
			
			СтрокаВычета                         = Форма.СводВычетов.Добавить();
			СтрокаВычета.ВидВычета               = "ЛистЗ.533";
			СтрокаВычета.Ставка                  = 13;
			СтрокаВычета.СуммаВычетаДляРаздела2  =СтрокаЛиста.П001600001533;
			СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
			СтрокаВычета.ВидДохода               = ОбычныйДоход();
			
		КонецЕсли;
		
	КонецЦикла;
	
	// - пункт 7.3 листа И
	Если Форма.СтруктураДанныхЛистИПродолжение.П001800001370 <> 0 Тогда
		СтрокаВычета                         = Форма.СводВычетов.Добавить();
		СтрокаВычета.ВидВычета               = "ЛистИ.370";
		СтрокаВычета.Ставка                  = 13;
		СтрокаВычета.СуммаВычетаДляРаздела2  = Форма.СтруктураДанныхЛистИПродолжение.П001800001370;
		СтрокаВычета.СуммаВычетаДляД1        = СтрокаВычета.СуммаВычетаДляРаздела2;
		СтрокаВычета.ВидДохода               = ОбычныйДоход();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СуммаДоходаДляИмущественногоВычета(Форма)

	Результат = 0;
	
	// Определяем сумму обычного дохода по ставке 13%
	СтрокиДохода = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка, ВидДохода", 13, ОбычныйДоход()));
	Для Каждого СтрокаДохода Из СтрокиДохода Цикл
		Результат = Результат + СтрокаДохода.СуммаДохода;
	КонецЦикла;
	
	// Вычитаем суммы вычетов, принимаемых до имущественного вычета 
	Результат = Результат - Форма.СводВычетов.Итог("СуммаВычетаДляД1");

	Возврат Макс(Результат, 0);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СуммаОблагаемогоДоходаПоСтавке(Форма, Ставка)

	// Вычисляет и возвращает сумму, соответствующую п. 3 раздела 2
	Результат = 0;
	
	СтрокиДохода = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка", Ставка));
	Для Каждого СтрокаДохода Из СтрокиДохода Цикл
		Результат = Результат + СтрокаДохода.СуммаДохода;
	КонецЦикла; 
	
	Если Ставка = 13 Тогда
		
		Для Каждого СтрокаВычета Из Форма.СводВычетов Цикл
			Если Лев(СтрокаВычета.ВидВычета, 5) = "ЛистГ" Тогда
				Результат = Результат - СтрокаВычета.СуммаВычетаДляРаздела2;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат Макс(Результат, 0);

КонецФункции

&НаКлиенте
Процедура РасчетНаКлиенте(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт
	
	Расчет(ЭтотОбъект, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

&НаСервере
Процедура РасчетНаСервере(ИмяСтраницыПанели = "", ОбластьИмя = "") Экспорт 
	
	Расчет(ЭтотОбъект, ИмяСтраницыПанели, ОбластьИмя);
	
КонецПроцедуры

// Выполняет провреку значений и пересчет зависимых показателей на заданной странице отчета
// Параметры:
//  Форма - управляемая форма - форма этого отчета
//	ИмяОбласти - Строка - имя раздела или листа декларации
//
&НаКлиентеНаСервереБезКонтекста
Процедура Расчет(Форма, ИмяРаздела = "", ИмяОбласти = "")
	
	Перем ТаблицаБлока, ТаблицаРаздела;
	
	Если (Форма.СтруктураРеквизитовФормы.мРежимПечати) Тогда
		Возврат; // служебный вызов в процессе печати
	КонецЕсли;
	
	Если (Форма.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет) Тогда
		Возврат; // отключен режим авторасчета
	КонецЕсли;
	
	ИмяОбласти13 = Лев(ИмяОбласти, 13); // имя области без номера строки
	
	// Если пересчитывается текущий раздел, нужно обновить значения в табличном документе
	ОбновитьТабличныйДокумент = Форма.СтруктураРеквизитовФормы.НаимТекущегоРаздела = ИмяРаздела;
	
	// Проверки значений и пересчет связанных НЕ итоговых реквизитов
	Если ИмяРаздела = "ЛистА" Тогда
		
		НомерСтрокиСтрокой  = Сред(ИмяОбласти, 15);
		
		// При изменении ставки или суммы облагаемого дохода пересчитываем сумму налога
		Если ИмяОбласти13 = "П000300001010" ИЛИ ИмяОбласти13 = "П000300001080" Тогда
			
			П000300001090 = Окр(Форма.ТабличныйДокумент.Области["П000300001080_" + НомерСтрокиСтрокой].Значение
						* Форма.ТабличныйДокумент.Области["П000300001010_" + НомерСтрокиСтрокой].Значение / 100, 0); 
						
			Форма.ТабличныйДокумент.Области["П000300001090_" + НомерСтрокиСтрокой].Значение = П000300001090;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000300001090_" + НомерСтрокиСтрокой, П000300001090);
			
		КонецЕсли; 
		
	ИначеЕсли ИмяРаздела = "ЛистБ" Тогда
		
		НомерСтрокиСтрокой  = Сред(ИмяОбласти, 15);
		
		// Проверка необходимости пересчитать сумму дохода из валюты в рубли
		ПересчитыватьДоходВруб = ИмяОбласти13 = "П000400001030" // Код валюты
			Или ИмяОбласти13 = "П000400001040" // дата получения дохода
			Или ИмяОбласти13 = "П000400001050" // курс валюты на дату получения дохода
			Или ИмяОбласти13 = "П000400001060"; // сумма дохода в валюте
			
		Если ПересчитыватьДоходВруб Тогда
			
			Курс         = Форма.ТабличныйДокумент.Области["П000400001050_" + НомерСтрокиСтрокой].Значение;
			СуммаВВалюте = Форма.ТабличныйДокумент.Области["П000400001060_" + НомерСтрокиСтрокой].Значение;
			
			Если ЗначениеЗаполнено(Курс) И ЗначениеЗаполнено(СуммаВВалюте) Тогда
				ДоходВРублях = Окр(СуммаВВалюте * Курс, 2);
				Форма.ТабличныйДокумент.Области["П000400001070_" + НомерСтрокиСтрокой].Значение = ДоходВРублях;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001070_" + НомерСтрокиСтрокой, ДоходВРублях);
			КонецЕсли; 
			
		КонецЕсли; 
		
		// Проверка необходимости пересчитать сумму налога из валюты в рубли
		ПересчитыватьНалогВРуб = ИмяОбласти13 = "П000400001030" // Код валюты
			Или ИмяОбласти13 = "П000400001080" // дата уплаты налога
			Или ИмяОбласти13 = "П000400001090" // курс валюты на дату уплаты налога
			Или ИмяОбласти13 = "П000400001100"; // сумма налога в валюте
			
		Если ПересчитыватьНалогВРуб Тогда
			
			Курс         = Форма.ТабличныйДокумент.Области["П000400001090_" + НомерСтрокиСтрокой].Значение;
			СуммаВВалюте = Форма.ТабличныйДокумент.Области["П000400001100_" + НомерСтрокиСтрокой].Значение;
			
			Если ЗначениеЗаполнено(Курс) И ЗначениеЗаполнено(СуммаВВалюте) Тогда
				НалогВРублях = Окр(СуммаВВалюте * Курс, 2); 
				Форма.ТабличныйДокумент.Области["П000400001110_" + НомерСтрокиСтрокой].Значение = НалогВРублях;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001110_" + НомерСтрокиСтрокой, НалогВРублях);
			КонецЕсли; 
			
		КонецЕсли; 
		
		// Расчет суммы налога, начисленного в РФ.
		СтавкаНалога = Форма.ТабличныйДокумент.Области["П000400001001"].Значение;
		
		Если ИмяОбласти13 = "П000400001001" Тогда // Ставка налога на листе
			
			// Пересчитываем все суммы налогов на текущем листе
			АктивныеСтраницы = Форма.ТаблицаСтраницыЛистБ.НайтиСтроки(Новый Структура("АктивнаяСтраница", Истина));
			АктивнаяСтраница = ?(АктивныеСтраницы.Количество() = 0, Неопределено, АктивныеСтраницы[0]);
			
			Если АктивнаяСтраница <> Неопределено Тогда
				
				Для Каждого ЗначениеДобСтрок Из АктивнаяСтраница.ДанныеДопСтрок Цикл
					
					СчетчикСтрок = 0;
					Для Каждого ЭлементСтроки Из ЗначениеДобСтрок.Значение Цикл
						
						СчетчикСтрок = СчетчикСтрок + 1;
						НалогВРФ = Окр(ЭлементСтроки.П000400001070 * СтавкаНалога / 100, 2);
						Форма.ТабличныйДокумент.Области["П000400001120_" + СчетчикСтрок].Значение = НалогВРФ;
						СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001120_" + СчетчикСтрок, НалогВРФ);
						
						// Сумма принимаемого налога не может превышать сумму уплаченного
						Если ЭлементСтроки.П000400001130 > 0 Тогда
							ПринимаемаяСумма = Мин(ЭлементСтроки.П000400001120, ЭлементСтроки.П000400001110);
							Форма.ТабличныйДокумент.Области["П000400001130_" + СчетчикСтрок].Значение = ПринимаемаяСумма;
							СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001130_" + СчетчикСтрок, ПринимаемаяСумма);
						КонецЕсли; 
						
					КонецЦикла; 
					
				КонецЦикла; 
				
			КонецЕсли;
			
		ИначеЕсли ПересчитыватьДоходВруб ИЛИ ИмяОбласти13 = "П000400001070" Тогда
			
			НалогВРФ = Окр(Форма.ТабличныйДокумент.Области["П000400001070_" + НомерСтрокиСтрокой].Значение * СтавкаНалога / 100, 2);
			Форма.ТабличныйДокумент.Области["П000400001120_" + НомерСтрокиСтрокой].Значение = НалогВРФ;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001120_" + НомерСтрокиСтрокой, НалогВРФ);
			
		КонецЕсли; 

		Если (ПересчитыватьДоходВруб ИЛИ ПересчитыватьНалогВРуб ИЛИ ИмяОбласти13 = "П000400001130" ИЛИ ИмяОбласти13 = "П000400001120" ИЛИ ИмяОбласти13 = "П000400001070")
				И НомерСтрокиСтрокой <> "" И Форма.ТабличныйДокумент.Области["П000400001130_" + НомерСтрокиСтрокой].Значение > 0 Тогда
			
			Значение = Мин(Форма.ТабличныйДокумент.Области["П000400001130_" + НомерСтрокиСтрокой].Значение, Форма.ТабличныйДокумент.Области["П000400001120_" + НомерСтрокиСтрокой].Значение);
			
			Форма.ТабличныйДокумент.Области["П000400001130_" + НомерСтрокиСтрокой].Значение = Значение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000400001130_" + НомерСтрокиСтрокой, Значение);
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = "ЛистВ" Тогда
		
		ОбновлятьФактическиеРасходы = ИмяОбласти13 = "П000500001050" // Матер. расходы
									Или ИмяОбласти13 = "П000500001060" // амморт. начилсения
									Или ИмяОбласти13 = "П000500001070" // выплаты физлицам
									Или ИмяОбласти13 = "П000500001090"; // прочие расходы
		
		Если ИмяОбласти13 = "П000500001040" И Форма.ТабличныйДокумент.Области["П000500001040"].Значение = 0 Тогда 
			
			// очищаем фактические расходы
			Форма.ТабличныйДокумент.Области["П000500001050"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001050", 0);
			Форма.ТабличныйДокумент.Области["П000500001060"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			Форма.ТабличныйДокумент.Области["П000500001070"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			Форма.ТабличныйДокумент.Области["П000500001080"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			Форма.ТабличныйДокумент.Области["П000500001090"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001060", 0);
			ОбновлятьФактическиеРасходы = Истина;
			
		ИначеЕсли ИмяОбласти13 = "П000500001080" Тогда // Выплаты по трудовым договорам
			
			// Проверим сумму общих выплат физическим лицам
			Если Форма.ТабличныйДокумент.Области["П000500001070"].Значение < Форма.ТабличныйДокумент.Области["П000500001080"].Значение Тогда
				
				Форма.ТабличныйДокумент.Области["П000500001070"].Значение = Форма.ТабличныйДокумент.Области["П000500001080"].Значение;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001070", Форма.ТабличныйДокумент.Области["П000500001070"].Значение);
				ОбновлятьФактическиеРасходы = Истина;
				
			КонецЕсли; 
			
		ИначеЕсли ИмяОбласти13 = "П000500001070" Тогда // все выплаты физическим лицам
			
			// Проверим сумму выплат по трудовым договорам
			Если Форма.ТабличныйДокумент.Области["П000500001070"].Значение < Форма.ТабличныйДокумент.Области["П000500001080"].Значение Тогда
				
				Форма.ТабличныйДокумент.Области["П000500001080"].Значение = Форма.ТабличныйДокумент.Области["П000500001070"].Значение;
				СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001080", Форма.ТабличныйДокумент.Области["П000500001080"].Значение);
				
			КонецЕсли; 
			
		ИначеЕсли ИмяОбласти13 = "П000500001160" И Форма.ТабличныйДокумент.Области["П000500001160"].Значение > Форма.ТабличныйДокумент.Области["П000500001030"].Значение Тогда // все выплаты физическим лицам
			
			// сумма вычета фермерского хозяйства
			Форма.ТабличныйДокумент.Области["П000500001160"].Значение 
					= Мин(Форма.ТабличныйДокумент.Области["П000500001160"].Значение, Форма.ТабличныйДокумент.Области["П000500001030"].Значение);
			
		КонецЕсли; 
		
		ВсегоФактРасходы = Форма.ТабличныйДокумент.Области["П000500001050"].Значение + Форма.ТабличныйДокумент.Области["П000500001060"].Значение
					+ Форма.ТабличныйДокумент.Области["П000500001070"].Значение + Форма.ТабличныйДокумент.Области["П000500001090"].Значение;
					
		Если ОбновлятьФактическиеРасходы ИЛИ 
				ИмяОбласти13 = "П000500001040" И Форма.ТабличныйДокумент.Области["П000500001040"].Значение < ВсегоФактРасходы Тогда

			Форма.ТабличныйДокумент.Области["П000500001040"].Значение = ВсегоФактРасходы;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001040", ВсегоФактРасходы);
			
			
		КонецЕсли; 
		
		ВсегоФактРасходы = Макс(ВсегоФактРасходы, Форма.ТабличныйДокумент.Области["П000500001040"].Значение);
		
		Если ВсегоФактРасходы = 0 Тогда
			
			// Если не указаны фактические расходы, то считаем расходы по норме
			Форма.ТабличныйДокумент.Области["П000500001100"].Значение = 
					Окр(Форма.ТабличныйДокумент.Области["П000500001030"].Значение * 0.2, 2);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001100", Форма.ТабличныйДокумент.Области["П000500001100"].Значение);
			
		ИначеЕсли Форма.ТабличныйДокумент.Области["П000500001100"].Значение <> 0 Тогда
			
			// Если указаны фактические расходы, расходы по норме обнуляем
			Форма.ТабличныйДокумент.Области["П000500001100"].Значение = 0;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000500001100", 0);
			
		КонецЕсли; 
		
	ИначеЕсли ИмяРаздела = "ЛистГ" Тогда
		
		Если (ИмяОбласти13 = "П000600001010" ИЛИ  ИмяОбласти13 = "П000600001020") // Мат.помощь на рождение
				И Форма.ТабличныйДокумент.Области["П000600001020"].Значение > Форма.ТабличныйДокумент.Области["П000600001010"].Значение Тогда
				
			Форма.ТабличныйДокумент.Области["П000600001020"].Значение = Форма.ТабличныйДокумент.Области["П000600001010"].Значение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001020", Форма.ТабличныйДокумент.Области["П000600001020"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001030" ИЛИ ИмяОбласти13 = "П000600001040" 
				И Форма.ТабличныйДокумент.Области["П000600001040"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001030"].Значение, 4000) Тогда // Мат.помощь на выход на пенсию
			
			Форма.ТабличныйДокумент.Области["П000600001040"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001030"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001040", Форма.ТабличныйДокумент.Области["П000600001040"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001050" ИЛИ ИмяОбласти13 = "П000600001060"
				И Форма.ТабличныйДокумент.Области["П000600001060"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001050"].Значение, 4000) Тогда // Мат.помощь от обществ. организаций инвалидов
			
			Форма.ТабличныйДокумент.Области["П000600001060"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001050"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001060", Форма.ТабличныйДокумент.Области["П000600001060"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001070" ИЛИ ИмяОбласти13 = "П000600001080"
				И Форма.ТабличныйДокумент.Области["П000600001080"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001070"].Значение, 4000) Тогда // Подарки от ИП и организаций
			
			Форма.ТабличныйДокумент.Области["П000600001080"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001070"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001080", Форма.ТабличныйДокумент.Области["П000600001080"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001090" ИЛИ ИмяОбласти13 = "П000600001100"
				И Форма.ТабличныйДокумент.Области["П000600001100"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001090"].Значение, 4000)Тогда //Призы на конкурсах и соревнованиях по решениям правительства РФ
			
			Форма.ТабличныйДокумент.Области["П000600001100"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001090"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001100", Форма.ТабличныйДокумент.Области["П000600001100"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001110" ИЛИ ИмяОбласти13 = "П000600001120"
				И Форма.ТабличныйДокумент.Области["П000600001120"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001110"].Значение, 4000) Тогда // Стоимость медикаментов
			
			Форма.ТабличныйДокумент.Области["П000600001120"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001110"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001120", Форма.ТабличныйДокумент.Области["П000600001120"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001130" ИЛИ ИмяОбласти13 = "П000600001140"
				И Форма.ТабличныйДокумент.Области["П000600001140"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001130"].Значение, 10000) Тогда // Помощь ветеранам ВОВ
			
			Форма.ТабличныйДокумент.Области["П000600001140"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001130"].Значение, 10000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001140", Форма.ТабличныйДокумент.Области["П000600001140"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001150" ИЛИ ИмяОбласти13 = "П000600001160"
				И Форма.ТабличныйДокумент.Области["П000600001160"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001150"].Значение, 12000) Тогда // Доп.взносы на накопительную часть пенсии
			
			Форма.ТабличныйДокумент.Области["П000600001160"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001150"].Значение, 12000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001160", Форма.ТабличныйДокумент.Области["П000600001160"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001210" ИЛИ ИмяОбласти13 = "П000600001220"
				И Форма.ТабличныйДокумент.Области["П000600001220"].Значение > 
					Мин(Форма.ТабличныйДокумент.Области["П000600001210"].Значение, 4000) Тогда // Выигрыши
			
			Форма.ТабличныйДокумент.Области["П000600001220"].Значение = 
					Мин(Форма.ТабличныйДокумент.Области["П000600001210"].Значение, 4000);
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001220", Форма.ТабличныйДокумент.Области["П000600001220"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000600001170" И Форма.ТабличныйДокумент.Области["П000600001170"].Значение > 12 Тогда // Кол-во месяцев
			
			Форма.ТабличныйДокумент.Области["П000600001170"].Значение = 12;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001170", 12);
			
		ИначеЕсли ИмяОбласти13 = "П000600001190" И Форма.ТабличныйДокумент.Области["П000600001190"].Значение > Форма.ТабличныйДокумент.Области["П000600001180"].Значение Тогда // Не подлежит налогообложению доход в натуральной форме
			
			Форма.ТабличныйДокумент.Области["П000600001190"].Значение = Форма.ТабличныйДокумент.Области["П000600001180"].Значение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000600001190", Форма.ТабличныйДокумент.Области["П000600001190"].Значение);
			
		КонецЕсли; 
		
	ИначеЕсли ИмяРаздела = "ЛистД1" Тогда
		
		// Для определения допустимых пределов вычетов подсчитаем расходы, указанные на других (неактивных) страницах
		ПоказателиНеактивныхЛистов = Новый Структура("НаПриобретение, НаПроценты", 0, 0);
		Для Каждого СтраницаЛистД1 Из Форма.ТаблицаСтраницыЛистД1 Цикл
			
			Если СтраницаЛистД1.АктивнаяСтраница Тогда
				Продолжить;
			КонецЕсли; 
			
			ЛистД1 = СтраницаЛистД1.Данные[0].Значение;
			
			ПоказателиНеактивныхЛистов.НаПриобретение = ПоказателиНеактивныхЛистов.НаПриобретение + ЛистД1.П000700001120;
			
			// Предел на вычет по процентам действует только для объектов недвижимости, приобретенных с 01.01.2014 
			Если НЕ ЗначениеЗаполнено(ЛистД1.П000700001070) И НЕ ЗначениеЗаполнено(ЛистД1.П000700001080)
				ИЛИ ЗначениеЗаполнено(ЛистД1.П000700001070) И Год(ЛистД1.П000700001070) = 2014
				ИЛИ ЗначениеЗаполнено(ЛистД1.П000700001080) И Год(ЛистД1.П000700001080) = 2014 Тогда
				ПоказателиНеактивныхЛистов.НаПроценты = ПоказателиНеактивныхЛистов.НаПроценты + ЛистД1.П000700001130;
			КонецЕсли; 
			
		КонецЦикла; 
		
		ОстатокПределаНаПриобретение = Макс(2000000 - ПоказателиНеактивныхЛистов.НаПриобретение, 0);
		
		// Предел на вычет по процентам действует только для объектов недвижимости, приобретенных с 01.01.2014 
		Если Форма.ТаблицаСтраницыЛистД1.Количество() > 1 ИЛИ НЕ ЗначениеЗаполнено(Форма.ТабличныйДокумент.Области["П000700001110"].Значение) 
					ИЛИ Форма.ТабличныйДокумент.Области["П000700001110"].Значение >= 2014 Тогда
			ОстатокПределаНаПроценты     = Макс(3000000 - ПоказателиНеактивныхЛистов.НаПроценты, 0);
		Иначе
			ОстатокПределаНаПроценты = 0;
		КонецЕсли; 
		
		
		Если ИмяОбласти13 = "П000700001120"  // сумма раходов на приобретение
				И Форма.ТабличныйДокумент.Области["П000700001120"].Значение > ОстатокПределаНаПриобретение Тогда
				
			// суммма фактических расходов не может превышать установленный законом предел
			Форма.ТабличныйДокумент.Области["П000700001120"].Значение = ОстатокПределаНаПриобретение;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000700001120", Форма.ТабличныйДокумент.Области["П000700001120"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000700001130"  // сумма раходов на приобретение
				И ОстатокПределаНаПроценты > 0 И Форма.ТабличныйДокумент.Области["П000700001130"].Значение > ОстатокПределаНаПроценты Тогда
			
			// суммма фактически уплаченных процентов не может превышать установленный законом предел
			Форма.ТабличныйДокумент.Области["П000700001130"].Значение = ОстатокПределаНаПроценты;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000700001130", Форма.ТабличныйДокумент.Области["П000700001130"].Значение);
			
		КонецЕсли; 
		
	ИначеЕсли ИмяРаздела = "ЛистД2" Тогда
		
		ПределНормыВычетаНедвижимости     = 1000000;
		ПределНормыВычетаПрочегоИмущества =  250000;
		//
		Если ИмяОбласти13 = "П000800001010" // Доход от продажи недвижимости, находившейся в собственности менее 3 лет
			ИЛИ ИмяОбласти13 = "П000800001020"  // Вычет из доходов от продажи недвижимости, находившейся в собственности менее 3 лет
				И Форма.ТабличныйДокумент.Области["П000800001020"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001010"].Значение, ПределНормыВычетаНедвижимости) Тогда 
			// п. 1.1
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001010"].Значение, ПределНормыВычетаНедвижимости);
			Форма.ТабличныйДокумент.Области["П000800001020"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001020", СуммаВычета);
			
		ИначеЕсли ИмяОбласти13 = "П000800001030" // Доход от продажи долей недвижимости, находившейся в собственности менее 3 лет
			ИЛИ ИмяОбласти13 = "П000800001040"  // Вычет из доходов от продажи долей недвижимости, находившейся в собственности менее 3 лет
				И Форма.ТабличныйДокумент.Области["П000800001040"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001030"].Значение, ПределНормыВычетаНедвижимости) Тогда
			// п. 1.2
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001030"].Значение, ПределНормыВычетаНедвижимости);
			Форма.ТабличныйДокумент.Области["П000800001040"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001040", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001050" // Доход от продажи недвижимости для учета фактических расходов
			ИЛИ ИмяОбласти13 = "П000800001060")  // Фактические расходы на проданную недвижимость
				И Форма.ТабличныйДокумент.Области["П000800001060"].Значение > Форма.ТабличныйДокумент.Области["П000800001050"].Значение Тогда
			// п. 1.3
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001050"].Значение, Форма.ТабличныйДокумент.Области["П000800001060"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001060"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001060", СуммаВычета);
			
		ИначеЕсли ИмяОбласти13 = "П000800001070" ИЛИ ИмяОбласти13 = "П000800001080"  // Иное недвижимое имущество для расчета вычета в 250000 руб
				И Форма.ТабличныйДокумент.Области["П000800001080"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001070"].Значение, ПределНормыВычетаПрочегоИмущества) Тогда
			// п. 2.1
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001070"].Значение, ПределНормыВычетаПрочегоИмущества);
			Форма.ТабличныйДокумент.Области["П000800001080"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001080", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001090" // Доход от продажи прочей недвижимости для вычета фактических затрат
			ИЛИ ИмяОбласти13 = "П000800001100")  // Фактические расходы на проданную недвижимость
				И Форма.ТабличныйДокумент.Области["П000800001100"].Значение > Форма.ТабличныйДокумент.Области["П000800001090"].Значение Тогда
			// п. 2.2
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001090"].Значение, Форма.ТабличныйДокумент.Области["П000800001100"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001100"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001100", СуммаВычета);
			
		ИначеЕсли ИмяОбласти13 = "П000800001110" // Доход от продажи прочего имущества для вычета по норме
			ИЛИ ИмяОбласти13 = "П000800001120"  // Вычет по норме из доходов от продажи прочего имущества 
				И Форма.ТабличныйДокумент.Области["П000800001120"].Значение > Мин(Форма.ТабличныйДокумент.Области["П000800001110"].Значение, ПределНормыВычетаПрочегоИмущества) Тогда
		// п. 2.3 
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001110"].Значение, ПределНормыВычетаПрочегоИмущества);
			Форма.ТабличныйДокумент.Области["П000800001120"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001120", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001130" ИЛИ ИмяОбласти13 = "П000800001140") // Фактические расходы по проданному прочему имуществу
				И Форма.ТабличныйДокумент.Области["П000800001140"].Значение > Форма.ТабличныйДокумент.Области["П000800001130"].Значение Тогда
		// п. 2.4
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001130"].Значение, Форма.ТабличныйДокумент.Области["П000800001140"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001140"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001140", СуммаВычета);
			
		ИначеЕсли (ИмяОбласти13 = "П000800001150" ИЛИ ИмяОбласти13 = "П000800001160") // Доход от изъятия имущества для гос.нужд
				И Форма.ТабличныйДокумент.Области["П000800001160"].Значение > Форма.ТабличныйДокумент.Области["П000800001150"].Значение Тогда
		// п. 3.2
			
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001150"].Значение, Форма.ТабличныйДокумент.Области["П000800001160"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001160"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001160", СуммаВычета);
			
		ИначеЕсли ИмяОбласти13 = "П000800001180" Тогда
			СуммаВычета = Мин(Форма.ТабличныйДокумент.Области["П000800001170"].Значение, Форма.ТабличныйДокумент.Области["П000800001180"].Значение);
			Форма.ТабличныйДокумент.Области["П000800001180"].Значение = СуммаВычета;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000800001180", СуммаВычета);
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = "ЛистЕ1" Тогда
		
		Если ИмяОбласти13 = "П000900001010" // 3000 х кол-во месяцев
				И Форма.ТабличныйДокумент.Области["П000900001010"].Значение > 36000 Тогда 
				
			Форма.ТабличныйДокумент.Области["П000900001010"].Значение = 36000;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000900001010", Форма.ТабличныйДокумент.Области["П000900001010"].Значение);
			
		ИначеЕсли ИмяОбласти13 = "П000900001020" // 500 х кол-во месяцев
				И Форма.ТабличныйДокумент.Области["П000900001020"].Значение > 6000 Тогда 
				
			Форма.ТабличныйДокумент.Области["П000900001020"].Значение = 6000;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П000900001020", Форма.ТабличныйДокумент.Области["П000900001020"].Значение);
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = "РасчетДоходаОтПродажиНедвижимости" Тогда
		
		НомерСтрокиСтрокой  = Сред(ИмяОбласти, 15);
		
		// При изменении суммы дохода исходя из цены договора или исходя из кадастровой стоимости
		Если ИмяОбласти13 = "П001900001030" ИЛИ ИмяОбласти13 = "П001900001040" Тогда
			
			П001900001050 = Макс(
				Форма.ТабличныйДокумент.Области["П001900001030_" + НомерСтрокиСтрокой].Значение,
				Форма.ТабличныйДокумент.Области["П001900001040_" + НомерСтрокиСтрокой].Значение);
			П001900001050 = Макс(П001900001050, 0);
			
			Форма.ТабличныйДокумент.Области["П001900001050_" + НомерСтрокиСтрокой].Значение = П001900001050;
			СохранитьЗначениеПоказателяВСтруктуре(Форма, ИмяРаздела, "П001900001050_" + НомерСтрокиСтрокой, П001900001050);
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = "Раздел2" Тогда
	
		// Пересчет выполняется при выводе листа или при изменении ставки
		
		ЗаполнитьСводныеТаблицы(Форма);
		
		ТаблицаСтраницыРаздел2 = Форма.ТаблицаСтраницыРаздел2;
		Для Каждого ЛистСтраницы Из ТаблицаСтраницыРаздел2 Цикл
			Если ЗначениеЗаполнено(ЛистСтраницы.Данные[0].Значение.П000200001001) Тогда
				РасчитатьИтогиСтраницыРаздела2(ЛистСтраницы.Данные[0].Значение);
			КонецЕсли;
			Если ЛистСтраницы.АктивнаяСтраница Тогда
				АктивнаяСтраница = ЛистСтраницы;
			КонецЕсли;
		КонецЦикла;
		
		Ставка = Форма.ТабличныйДокумент.Области.П000200001001.Значение;
		ВидДохода = Форма.ТабличныйДокумент.Области.П000200001002.Значение;
		ОчиститьЗначенияСтраницы(Форма, АктивнаяСтраница.Данные[0].Значение, "Раздел2", Ложь);
		ЗаполнитьРасчетныеДанныеРаздела2(Форма, АктивнаяСтраница, ?(ЗначениеЗаполнено(Ставка), Число(Ставка), 0), ВидДохода, Истина);
		
	КонецЕсли;
	
	// Пересчет итогов листа
	РассчитатьИтогиЛиста(Форма, ИмяРаздела);
	
	// Обновляем сводные таблицы
	ЗаполнитьСводныеТаблицы(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанныеВРаздел2()
	
	//Пересчитываем итоги всех листов
	РассчитатьИтогиЛиста(ЭтотОбъект, Неопределено);
	
	// Заполняем сводные таблицы итогов
	ЗаполнитьСводныеТаблицы(ЭтотОбъект);
	
	// Сначала в разделе 2 рассчитываются результаты в разрезе ставок
	ПодготовитьДанныеРаздела2(ЭтотОбъект);
	
	// Обновляем дерево разделов
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
	// Выводим макет в табличный документ
	ВывестиМакетВТаблДокНаСервере("Раздел2", 1, , , Истина);
	
	// Активизируем строку раздела в дереве
	Для Каждого СтрокаРаздела Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если СтрокаРаздела.КолонкаРазделыОтчетаСокрНаим = "Раздел2" Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = СтрокаРаздела.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Заполняет страницу расчетными данными по указанной ставке
&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРасчетныеДанныеРаздела2(Форма, СтраницаРаздела, Ставка, ВидДохода, ОбновлятьТабличныйДокумент = Ложь)

	ДанныеСтраницы = СтраницаРаздела.Данные[0].Значение;
	
	ОКТМОНАлогоплательщика = Форма.СтруктураРеквизитовФормы.Октмо;
	
	// Устанавливаем ставку налога и вид дохода
	ДанныеСтраницы.П000200001001 = Число(Ставка);
	ДанныеСтраницы.П000200001002 = ВидДохода;
	
	Если ЗначениеЗаполнено(Ставка) Тогда
		
		Если ЗначениеЗаполнено(ВидДохода) Тогда
			
			// Находим строки доходов по указанной ставке
			СтрокиДоходов = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка, ВидДохода", Число(Ставка), Число(ВидДохода)));
			
			Если СтрокиДоходов.Количество() > 0 Тогда
				
				// Заполняем суммами полученного дохода и уплаченных (удержанных) налогов
				Для Каждого СтрокаДохода Из СтрокиДоходов Цикл
					
					Если Не ОбновлятьТабличныйДокумент Тогда
						// поля, достуные для редактирования обновляем только при атоматическом заполнении (без обновления табличного документа)
					КонецЕсли;
					ДанныеСтраницы.П000200001080 = ДанныеСтраницы.П000200001080 + СтрокаДохода.УдержаноНалога;
					ДанныеСтраницы.П000200001100 = ДанныеСтраницы.П000200001100 + СтрокаДохода.УплаченоНалога;
					ДанныеСтраницы.П000200001120 = ДанныеСтраницы.П000200001120 + СтрокаДохода.НалогПринимаемыйКУчету;
					
					Если СтрокаДохода.ВидДохода = ДоходыКонтролируемыхКомпаний() Тогда
						ДанныеСтраницы.П000200001051 = ДанныеСтраницы.П000200001051 + СтрокаДохода.СуммаДохода;
					Иначе
						ДанныеСтраницы.П000200001010 = ДанныеСтраницы.П000200001010 + СтрокаДохода.СуммаДохода;
					КонецЕсли;
					
				КонецЦикла;
				
				
				// Заполняем суммами вычетов
				СтрокиВычетов = Форма.СводВычетов.НайтиСтроки(Новый Структура("Ставка, ВидДохода", Число(Ставка), Число(ВидДохода)));
				Для Каждого СтрокаВычета Из СтрокиВычетов Цикл
					
					Если СтрокаВычета.ВидВычета = "ЛистГ.200" 
						ИЛИ СтрокаВычета.ВидВычета = "ЛистГ.220"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистБ.071"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистБ.072"
						Тогда
						
						ДанныеСтраницы.П000200001020 = ДанныеСтраницы.П000200001020 + СтрокаВычета.СуммаВычетаДляРаздела2;
						
					ИначеЕсли СтрокаВычета.ВидВычета = "ЛистВ.120"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.180"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.190"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.210"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистД1.220"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистД2.210"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистЕ1.190"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистЕ1.171"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистЕ2.110"
						ИЛИ СтрокаВычета.ВидВычета = "ЛистЖ.150"
						Тогда
						
						ДанныеСтраницы.П000200001040 = ДанныеСтраницы.П000200001040 + СтрокаВычета.СуммаВычетаДляРаздела2;
						
					ИначеЕсли СтрокаВычета.ВидВычета = "ЛистЗ.533" ИЛИ СтрокаВычета.ВидВычета = "ЛистИ.370" Тогда
						
						ДанныеСтраницы.П000200001050 = ДанныеСтраницы.П000200001050 + СтрокаВычета.СуммаВычетаДляРаздела2;
						
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		// Итоги и результаты рассчитываем независимо от наличия доходов и вычетов, т.к. в любом случае могли быть налоговые платежи по патентам и т.п. 
		РасчитатьИтогиСтраницыРаздела2(ДанныеСтраницы);
	
	КонецЕсли;
	
	// Если страница активна, заполняем ячейки табличного документа
	ТабличныйДокумент = Форма.ТабличныйДокумент;
	Если ОбновлятьТабличныйДокумент И ТабличныйДокумент.Области.Найти("П000200001001") <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ДанныеСтраницы Цикл
			ТабличныйДокумент.Области[КлючИЗначение.Ключ].Значение = КлючИЗначение.Значение;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьИтогиСтраницыРаздела2(ДанныеСтраницы)
	
	// 3. Общая сумма дохода, подлежащая налогообложению
	ДанныеСтраницы.П000200001030 = Макс(0, ДанныеСтраницы.П000200001010 - ДанныеСтраницы.П000200001020);
	
	// Проверяем: Общая сумма налоговых вычетов (строка 040) и сумма расходов, принимаемая в уменьшение полученных доходов (строка 050), 
	//	в совокупности не может превышать значение показателя строки 030
	СуммаРазницы = ДанныеСтраницы.П000200001040 + ДанныеСтраницы.П000200001050 - ДанныеСтраницы.П000200001030;
	Если СуммаРазницы > 0 Тогда
		
		// Сначала уменьшаем сумму вычета по листам З и И - убытки могут быть перенесены на следующие годы
		ДанныеСтраницы.П000200001050 = Макс(0, ДанныеСтраницы.П000200001050 - СуммаРазницы);
		СуммаРазницы = ДанныеСтраницы.П000200001040 + ДанныеСтраницы.П000200001050 - ДанныеСтраницы.П000200001030;
		
		Если СуммаРазницы > 0 Тогда
			// Если вычетов все равно больше, уменьшаем сумму вычетов по строке 040
			ДанныеСтраницы.П000200001040 = Макс(0, ДанныеСтраницы.П000200001040 - СуммаРазницы);
		КонецЕсли;
		
	КонецЕсли;
	
	// 6. Налоговая база для исчисления налога
	ДанныеСтраницы.П000200001060 = Макс(0, ДанныеСтраницы.П000200001030 + ДанныеСтраницы.П000200001051 
	- ДанныеСтраницы.П000200001040 - ДанныеСтраницы.П000200001050);
	
	// 7. Общая сумма налога, исчисленная к уплате
	ДанныеСтраницы.П000200001070 = Окр(ДанныеСтраницы.П000200001060 * ДанныеСтраницы.П000200001001 / 100, 0); // Начислено налога
	
	// 13. Сумма налога, исчисленная к уплате (доплате) в бюджет
	ДанныеСтраницы.П000200001121 = Макс(0,
	ДанныеСтраницы.П000200001070
	- ДанныеСтраницы.П000200001080
	- ДанныеСтраницы.П000200001090
	- ДанныеСтраницы.П000200001091
	- ДанныеСтраницы.П000200001100
	- ДанныеСтраницы.П000200001110
	- ДанныеСтраницы.П000200001120);
	
	// 13.3. Сумма налога, подлежащая уплате (доплате) в бюджет
	ДанныеСтраницы.П000200001130 = Макс(0, ДанныеСтраницы.П000200001121 - ДанныеСтраницы.П000200001122);
	
	// 14. Сумма налога, подлежащая возврату из бюджета
	
	МаксимумСтроки140 = ДанныеСтраницы.П000200001080 + ДанныеСтраницы.П000200001090 + ДанныеСтраницы.П000200001100;
	
	РасчетнаяСуммаСтроки140 = ДанныеСтраницы.П000200001080
	+ ДанныеСтраницы.П000200001090
	+ ДанныеСтраницы.П000200001091
	+ ДанныеСтраницы.П000200001100
	+ ДанныеСтраницы.П000200001110
	- ДанныеСтраницы.П000200001070;
	
	ДанныеСтраницы.П000200001140 = Макс(0, Мин(МаксимумСтроки140, РасчетнаяСуммаСтроки140));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьЗначенияСтраницы(Форма, СтраницаРаздела, ИмяСтраницы, ОчиститьВсе = Ложь)

	Если ОчиститьВсе Тогда
		
		// обнуляем значения всех показателей страницы
		Для каждого КлючИЗначение Из СтраницаРаздела Цикл
			ОчиститьПоказательСтраницы(СтраницаРаздела[КлючИЗначение.Ключ]);
		КонецЦикла;
		
	Иначе
		
		// Обнуляем только показатели, рассчтываемые автоматически
		#Если НаКлиенте Тогда
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьКлиент.ПолучитьТаблицуВариантовЗаполненияНаКлиенте(Форма, ИмяСтраницы);
		#Иначе
			ТаблицаВариантыЗаполнения = РегламентированнаяОтчетностьВызовСервера.ПолучитьТаблицуВариантовЗаполненияНаСервере(Форма, ИмяСтраницы);
		#КонецЕсли
		Для Каждого СтрокаПоказателя Из ТаблицаВариантыЗаполнения Цикл
			
			Если СтрокаПоказателя.ВариантЗаполнения = 4 И СтраницаРаздела.Свойство(СтрокаПоказателя.КодПоказателя) Тогда
				ОчиститьПоказательСтраницы(СтраницаРаздела[СтрокаПоказателя.КодПоказателя]);
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьПоказательСтраницы(ЗначениеПоказателя)

	Если ТипЗнч(ЗначениеПоказателя) = Тип("Число") Тогда
		ЗначениеПоказателя = 0;
	ИначеЕсли ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
		ЗначениеПоказателя = '00010101';
	ИначеЕсли ТипЗнч(ЗначениеПоказателя) = Тип("Строка") Тогда
		ЗначениеПоказателя = "";
	Иначе
		ЗначениеПоказателя = Неопределено;
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция Дивиденды()

	Возврат 1;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ОбычныйДоход()

	Возврат 3;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция ДоходыКонтролируемыхКомпаний()

	Возврат 2;

КонецФункции 

&НаКлиентеНаСервереБезКонтекста
Функция КодДоходаКонтролируемыхКомпаний()

	Возврат "1";

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КБКДоходовОтНалоговогоАгента()
	
	Возврат "18210102010011000110"; //доход от налогового агента
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КБКДоходовССамостоятельнымИсчислением()
	
	Возврат "18210102030011000110"; //доход с самостоятельным исчислением и уплатой налога
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КБКДоходовОтПредпринимательскойДеятельности()
	
	Возврат "18210102020011000110";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидДоходаОтНалоговогоАгента()
	
	Возврат "06"; // Доход, полученный на основании трудового (гражданско-правового) договора, налог с которого удержан налоговым агентом.
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидДоходаОтОперацийСЦБ()
	
	Возврат "03"; // Доход от операций с ценными бумагами.
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидДоходаВВидеДивидендов()
	
	Возврат "08"; // Доходы от долевого участия в деятельности организаций в виде дивидендов.
	
КонецФункции

// Перезаполняет страницы Раздела 2
//	Для каждой ставки в сводной таблице доходов создаем отдельную страницу раздела 2, в которой вычисляем 
//	результат (к доплате или к возмещению).
//	Полученный результат распределяем в колонке "РезультатРасчетов" таблицы "СводДоходов" по строкам с рассчитанной ставкой,
//	т.к. Раздел 2 должен заполняться уже не по ставкам, а по сочетанию КБК и ОКТМО
&НаКлиентеНаСервереБезКонтекста
Процедура ПодготовитьДанныеРаздела2(Форма)
	
	ТаблицаСтраницыРаздел2 = Форма.ТаблицаСтраницыРаздел2;
	
	ОбразецСтруктуры = Новый Структура(Новый ФиксированнаяСтруктура(ТаблицаСтраницыРаздел2[0].Данные[0].Значение));
	Для Каждого ЭлементСтруктуры Из ОбразецСтруктуры Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Число") Тогда
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = 0;
		Иначе
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = "";
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаСтраницыРаздел2.Очистить();
	
	ВидыДоходов = Новый Массив;
	ВидыДоходов.Добавить(ОбычныйДоход());
	ВидыДоходов.Добавить(ДоходыКонтролируемыхКомпаний());
	ВидыДоходов.Добавить(Дивиденды());
	
	Для Каждого ВидДохода Из ВидыДоходов Цикл
		
		Для Каждого СтрокаСтавки Из Форма.мСтавкиНалога Цикл
			
			Если ПустаяСтрока(СтрокаСтавки.Код) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокиДохода = Форма.СводДоходов.НайтиСтроки(Новый Структура("Ставка, ВидДохода", Число(СтрокаСтавки.Код), ВидДохода));
			
			Если СтрокиДохода.Количество() > 0 Тогда
				
				СтраницаРаздела = ТаблицаСтраницыРаздел2.Добавить();
				СтраницаРаздела.Представление               = СтрокаСтавки.Код + " %";
				СтраницаРаздела.АвтоматическоеПредставление = Истина;
				СтраницаРаздела.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
				
				ЗаполнитьРасчетныеДанныеРаздела2(Форма, СтраницаРаздела, Число(СтрокаСтавки.Код), ВидДохода);
				
			КонецЕсли;
			
		КонецЦикла; 
			
	КонецЦикла;
	
	Если ТаблицаСтраницыРаздел2.Количество() = 0 Тогда
		// Добавляем пустую страницу со значениями по умолчанию.
		
		СтраницаРаздела = ТаблицаСтраницыРаздел2.Добавить();
		СтраницаРаздела.Представление               = "Новая страница";
		СтраницаРаздела.АктивнаяСтраница            = Истина;
		СтраницаРаздела.АвтоматическоеПредставление = Истина;
		
		СтрокиСтавка13 = Форма.мСтавкиНалога.НайтиСтроки(Новый Структура("Код", "13"));
		Если СтрокиСтавка13.Количество() > 0 Тогда
			Ставка13 = СтрокиСтавка13[0];
			СтраницаРаздела.Представление               = Ставка13.Код + " %";
			СтраницаРаздела.АвтоматическоеПредставление = Истина;
			СтраницаРаздела.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
			ЗаполнитьРасчетныеДанныеРаздела2(Форма, СтраницаРаздела, Число(Ставка13.Код), ОбычныйДоход());
		Иначе
			СтраницаРаздела.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
		КонецЕсли;
		
	Иначе
		
		ТаблицаСтраницыРаздел2[0].АктивнаяСтраница  = Истина;
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьДанныеВРаздел1()
	
	СобратьДанныеВРаздел1Сервер();
	
	// Обновляем дерево разделов
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
	// Выводим макет в табличный документ
	ВывестиМакетВТаблДокНаСервере("Раздел1", 1, , , Истина);
	
	// Активизируем строку раздела в дереве
	Для Каждого СтрокаРаздела Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если СтрокаРаздела.КолонкаРазделыОтчетаСокрНаим = "Раздел1" Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = СтрокаРаздела.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СобратьДанныеВРаздел1Сервер()
	
	// Итоги пересчитываем только в том случае, если не заполнена таблица свода доходов
	Если СводДоходов.Количество() = 0 Тогда
		РассчитатьИтогиЛиста(ЭтотОбъект, Неопределено);
		ЗаполнитьСводныеТаблицы(ЭтотОбъект);
	КонецЕсли;
	
	ОКТМОНАлогоплательщика = СтруктураРеквизитовФормы.Октмо;
	
	// Сначала распределим результаты расчета Раздела 2 по своду доходов
	Для Каждого СтраницаРаздела Из ТаблицаСтраницыРаздел2 Цикл
		
		Если СтраницаРаздела.Данные.Количество() = 0
			ИЛИ СтраницаРаздела.Данные[0].Значение.П000200001001 = 0
			ИЛИ СтраницаРаздела.Данные[0].Значение.П000200001010 
				+ СтраницаРаздела.Данные[0].Значение.П000200001051 = 0
			Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтраницы = СтраницаРаздела.Данные[0].Значение;
		
		ОстатокКУплате     = Число(ДанныеСтраницы.П000200001130);
		ОстатокКВозмещению = Число(ДанныеСтраницы.П000200001140);
		ПоследняяСтрока    = Неопределено;
		
		// Находим строки доходов по указанной ставке
		СтрокиДоходов = СводДоходов.НайтиСтроки(Новый Структура("Ставка", Число(СтраницаРаздела.Данные[0].Значение.П000200001001)));
		Для Каждого СтрокаДохода Из СтрокиДоходов Цикл
		
			Если ОстатокКУплате > 0 Тогда
				СтрокаДохода.ОКТМО             = ОКТМОНАлогоплательщика; // доплата налога всегда по месту регистрации налогоплательщика
				СтрокаДохода.РезультатРасчетов = Мин(ОстатокКУплате, СтрокаДохода.НачисленоНалога - СтрокаДохода.УдержаноНалога);
				ОстатокКУплате                 = Макс(0, ОстатокКУплате - СтрокаДохода.РезультатРасчетов);
			КонецЕсли;
			
			Если ОстатокКВозмещению > 0 Тогда
				НалогУплачен = СтрокаДохода.УплаченоНалога + СтрокаДохода.УдержаноНалога + СтрокаДохода.НалогПринимаемыйКУчету; // возмещается только то, что уплачено или удержано
				СтрокаДохода.РезультатРасчетов = - Мин(ОстатокКВозмещению, НалогУплачен); // пишем со знаком минус для получения итоговой суммы при сворачивании по КБК и ОКТМО
				ОстатокКВозмещению             = Макс(0, ОстатокКВозмещению + СтрокаДохода.РезультатРасчетов);
			КонецЕсли;
			
			Если СтрокаДохода.РезультатРасчетов <> 0 Тогда
				ПоследняяСтрока = СтрокаДохода;
			КонецЕсли;
			
		КонецЦикла;
		
		// Убеждаемся, что распределен весь результат расчетов
		Если ПоследняяСтрока <> Неопределено Тогда
			Если ОстатокКУплате > 0 Тогда
				ПоследняяСтрока.РезультатРасчетов = ПоследняяСтрока.РезультатРасчетов + ОстатокКУплате;
			КонецЕсли;
			Если ОстатокКВозмещению > 0 Тогда
				ПоследняяСтрока.РезультатРасчетов = ПоследняяСтрока.РезультатРасчетов - ОстатокКВозмещению;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// Свернем таблицу доходов по КБК и ОКТМО, чтобы получить итоги расчетов
	ТаблицаРасчетов = СводДоходов.Выгрузить();
	ТаблицаРасчетов.Свернуть("КБК,ОКТМО", "РезультатРасчетов");
	
	// Сохраним образец структуры реквизитов для заполнения добавленный страниц
	ОбразецСтруктуры = Новый Структура(Новый ФиксированнаяСтруктура(ТаблицаСтраницыРаздел1[0].Данные[0].Значение));
	Для Каждого ЭлементСтруктуры Из ОбразецСтруктуры Цикл
		Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Число") Тогда
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = 0;
		Иначе
			ОбразецСтруктуры[ЭлементСтруктуры.Ключ] = "";
		КонецЕсли; 
	КонецЦикла; 
	
	// очистим страницы раздела
	ТаблицаСтраницыРаздел1.Очистить();
	
	// Для каждой пары КБК+ОКТМО создаем страницу раздела 1
	Для Каждого СтрокаРасчета Из ТаблицаРасчетов Цикл
		
		СтраницаРасчета = ТаблицаСтраницыРаздел1.Добавить();
		СтраницаРасчета.Представление               = "Страница N " + ТаблицаСтраницыРаздел1.Количество();
		СтраницаРасчета.АвтоматическоеПредставление = Истина;
		СтраницаРасчета.Данные.Добавить(Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры)));
		ДанныеСтраницыРасчета = СтраницаРасчета.Данные[0].Значение;
		
		ДанныеСтраницыРасчета.П000100001020 = СтрокаРасчета.КБК;
		
		Если ЗначениеЗаполнено(СтрокаРасчета.ОКТМО) Тогда
			ДанныеСтраницыРасчета.П000100001030 = СтрокаРасчета.ОКТМО;
		Иначе
			ДанныеСтраницыРасчета.П000100001030 = ОКТМОНАлогоплательщика;
		КонецЕсли;
	
		Если СтрокаРасчета.РезультатРасчетов > 0 Тогда
			
			ДанныеСтраницыРасчета.П000100001010 = "1";
			ДанныеСтраницыРасчета.П000100001040 = СтрокаРасчета.РезультатРасчетов;
			ДанныеСтраницыРасчета.П000100001050 = 0;
			
		ИначеЕсли СтрокаРасчета.РезультатРасчетов < 0 Тогда
			
			ДанныеСтраницыРасчета.П000100001010 = "2";
			ДанныеСтраницыРасчета.П000100001040 = 0;
			ДанныеСтраницыРасчета.П000100001050 = - СтрокаРасчета.РезультатРасчетов;
			
		Иначе
			
			ДанныеСтраницыРасчета.П000100001010 = "3";
			ДанныеСтраницыРасчета.П000100001040 = 0;
			ДанныеСтраницыРасчета.П000100001050 = 0;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Если не оказалось новых страниц раздела, добавим пустую
	Если ТаблицаСтраницыРаздел1.Количество() = 0 Тогда
		СтраницаРаздела = ТаблицаСтраницыРаздел1.Добавить();
		СтраницаРаздела.Представление               = "Новая страница";
		СтраницаРаздела.АктивнаяСтраница            = Истина;
		СтраницаРаздела.АвтоматическоеПредставление = Истина;
		
		ДанныеСтраницыРасчета = Новый Структура(Новый ФиксированнаяСтруктура(ОбразецСтруктуры));
		ДанныеСтраницыРасчета.П000100001030 = ОКТМОНАлогоплательщика;
		ДанныеСтраницыРасчета.П000100001010 = "3";
		ДанныеСтраницыРасчета.П000100001020 = КБКДоходовОтПредпринимательскойДеятельности();
		СтраницаРаздела.Данные.Добавить(ДанныеСтраницыРасчета);
		
	Иначе
		
		ТаблицаСтраницыРаздел1[0].АктивнаяСтраница  = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаКС

&НаСервере
Функция ПроверитьКонтрольныеСоотношенияВОтчете() Экспорт
	
	Возврат Отчеты.РегламентированныйОтчет3НДФЛ.НовыйРезультатПроверкиКонтрольныхСоотношений();
	
КонецФункции

#КонецОбласти

#Область ЧтениеСохранениеВыводОтчета

// Восстанавливает сохраненные данные отчета.
//
&НаСервере
Процедура ВосстановитьСохраненныеДанные()
	Перем ДанныеМногострочныхРазделов;
	Перем ДанныеМногостраничныхРазделов;
	Перем ДанныеВариановАвтоЗаполнения;
	Перем ПоказателиОтчета;
	Перем Автозаполнение;
	Перем ТаблицаМногостраничногоДокумента;
	
	Если НЕ ЗначениеЗаполнено(СтруктураРеквизитовФормы.Организация) Тогда
		СтруктураРеквизитовФормы.Организация =	СтруктураРеквизитовФормы.мСохраненныйДок.Организация;
	КонецЕсли;
	
	ДатаПодписи = СтруктураРеквизитовФормы.мСохраненныйДок.ДатаПодписи;
	Комментарий = СтруктураРеквизитовФормы.мСохраненныйДок.Комментарий;
	
	// восстанавливаем сохраненные данные отчета
	СписокСохранения = СтруктураРеквизитовФормы.мСохраненныйДок.ДанныеОтчета.Получить();
	
	// список листов, выводимых на печать
	ДеревоНастройкиСтраниц = СтруктураРеквизитовФормы.мСохраненныйДок.ДеревоНастройкиСтраниц.Получить();
	
	ЗначениеВРеквизитФормы(ДеревоНастройкиСтраниц.Скопировать(), "мДеревоСтраницОтчета");
	
	СписокСохранения.Свойство("ПоказателиОтчета", ПоказателиОтчета);
	
	// восстанавливаем сохраненные данные многострочных разделов
	Если СписокСохранения.Свойство( "ДанныеМногострочныхРазделов", ДанныеМногострочныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногострочныхРазделов Цикл
			
			ИдентификаторМногострочнойГруппы = "";
			Если Не мСтруктураМногострочныхРазделов.Свойство(ЭлементСтруктуры.Ключ, ИдентификаторМногострочнойГруппы) Тогда
				Продолжить;
			КонецЕсли;
			
			МногострочнаяГруппа = ЭтотОбъект[ИдентификаторМногострочнойГруппы];
			МногострочнаяГруппа.Очистить();
			Для каждого СтрокаДанных Из ЭлементСтруктуры.Значение Цикл
				ЗаполнитьЗначенияСвойств(МногострочнаяГруппа.Добавить(), СтрокаДанных);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// восстанавливаем сохраненные данные вариантов автозаполнения ячеек
	Если СписокСохранения.Свойство("ДанныеВариантовАвтоЗаполнения", ДанныеВариановАвтоЗаполнения) И ДанныеВариановАвтоЗаполнения <> Неопределено Тогда
		
		мСтруктураВариантыЗаполнения.Очистить();
		
		Для Каждого ЭлементСтруктуры Из ДанныеВариановАвтоЗаполнения Цикл
			
			мСтруктураВариантыЗаполнения.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Ключ);
			
			ЭтотОбъект["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Очистить();
			
			Для Каждого ЭлементМассива Из ЭлементСтруктуры.Значение Цикл
				
				ТаблВарЗаполнения = ЭтотОбъект["ТаблицаВариантыЗаполнения" + ЭлементСтруктуры.Ключ].Добавить().ТаблицаВариантовЗаполнения;
				
				ЗначениеВДанныеФормы(ЭлементМассива, ТаблВарЗаполнения);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// восстанавливаем сохраненные данные многостраничных разделов
	Если СписокСохранения.Свойство("ДанныеМногостраничныхРазделов", ДанныеМногостраничныхРазделов) Тогда
		
		Для Каждого ЭлементСтруктуры Из ДанныеМногостраничныхРазделов Цикл
			
			ИдентификаторМногостраничногоРаздела = "";
			Если Не мСтруктураМногостраничныхРазделов.Свойство(ЭлементСтруктуры.Ключ, ИдентификаторМногостраничногоРаздела) Тогда
				Продолжить;
			КонецЕсли;
			
			МногостраничныйРаздел = ЭтотОбъект[ИдентификаторМногостраничногоРаздела];
			
			Если ЭлементСтруктуры.Значение.Колонки.Найти("ДанныеДопСтрок") = Неопределено Тогда
				ЭлементСтруктуры.Значение.Колонки.Добавить("ДанныеДопСтрок");
			КонецЕсли;
			
			МногостраничныйРаздел.Очистить();
			Для Каждого СтрокаДанных Из ЭлементСтруктуры.Значение Цикл
				ЗаполнитьЗначенияСвойств(МногостраничныйРаздел.Добавить(), СтрокаДанных);
			КонецЦикла;
			
			Если МногостраничныйРаздел.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если МногостраничныйРаздел[0].Свойство("Данные") Тогда
				
				Для Каждого СтрокаТаблЗнач Из МногостраничныйРаздел Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.Данные) = Тип("СписокЗначений") Тогда
						
						ПреобразоватьПосимвольныеДанныеВЗначения(ЭлементСтруктуры.Значение[МногостраничныйРаздел.Индекс(СтрокаТаблЗнач)].Данные);
						СтрокаТаблЗнач.Данные.Очистить();
						СтрокаТаблЗнач.Данные.Добавить(ЭлементСтруктуры.Значение[МногостраничныйРаздел.Индекс(СтрокаТаблЗнач)].Данные);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если МногостраничныйРаздел[0].Свойство("ДанныеДопСтрок") Тогда
				
				Ном = 0;
				
				Для Каждого СтрокаТаблЗнач Из ЭлементСтруктуры.Значение Цикл
					
					Если ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("Структура") Тогда
						
						Для Каждого ЭлСтруктуры Из СтрокаТаблЗнач.ДанныеДопСтрок Цикл
							
							ТаблЗнач = ЭлСтруктуры.Значение;
							
							ЭлСтруктуры.Значение = ЭтотОбъект["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
							
							ЗначениеВДанныеФормы(ТаблЗнач, ЭлСтруктуры.Значение);
							
							МногостраничныйРаздел[Ном].ДанныеДопСтрок.Добавить(ЭлСтруктуры.Значение);
							
						КонецЦикла;
						
					ИначеЕсли ТипЗнч(СтрокаТаблЗнач.ДанныеДопСтрок) = Тип("ТаблицаЗначений") Тогда
						
						СтрокаТаблЗначДанныеДопСтрок = ЭтотОбъект["Хранилище" + ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ЭлементСтруктуры.Ключ)].Добавить().Таблица;
						
						ЗначениеВДанныеФормы(СтрокаТаблЗнач.ДанныеДопСтрок, СтрокаТаблЗначДанныеДопСтрок);
						
						МногостраничныйРаздел[Ном].ДанныеДопСтрок.Добавить(СтрокаТаблЗначДанныеДопСтрок, "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела");
						
					КонецЕсли;
					
					Ном = Ном + 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	Для Каждого Раздел Из мСтруктураМногостраничныхРазделов Цикл
		Для Каждого Страница Из ЭтотОбъект[Раздел.Значение] Цикл
			Страница.АктивнаяСтраница = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	СписокСохранения.Свойство("ФлПодсчетСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	
	Если НЕ СписокСохранения.Свойство("ФлОтклВыборЗначений", СтруктураРеквизитовФормы.мАвтоВыборКодов) Тогда
		СтруктураРеквизитовФормы.мАвтоВыборКодов = Ложь;
	КонецЕсли;
		
	Если НЕ СписокСохранения.Свойство("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки) Тогда
		СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки = Ложь;
	КонецЕсли;
	
	СтатусНалогоплательщика = Неопределено;
	Если СписокСохранения.ПоказателиОтчета.Свойство("ПолеТабличногоДокументаТитульный")
		И СписокСохранения.ПоказателиОтчета.ПолеТабличногоДокументаТитульный.Свойство("СтатусНалогоплательщика", СтатусНалогоплательщика) Тогда
		ОбновитьПеременныеМодуляНаСервере("СтатусНалогоплательщика", СтатусНалогоплательщика);
	КонецЕсли;

	СписокСохранения.Свойство("Автозаполнение", Автозаполнение);
	СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет = Автозаполнение;
	
	Если НЕ СписокСохранения.Свойство("ПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена) Тогда
		СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена = Ложь;
	КонецЕсли;
	
	СформироватьДеревоРазделовОтчетаНаСервере();
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл	
		
		Если НЕ Раздел.МногостраничностьВРазделе Тогда
			ПреобразоватьПосимвольныеДанныеВЗначения(ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы]);
			ЭтотОбъект["СтруктураДанных" + Раздел.ИмяСтраницы] = ПоказателиОтчета[Префикс + Раздел.ИмяСтраницы];
		КонецЕсли;
		
	КонецЦикла;
	
	ИмяТекРаздела = "Титульный";
	
	Для Каждого ЭлСтруктуры Из ЭтотОбъект["СтруктураДанных" + ИмяТекРаздела] Цикл
		Если ТабличныйДокумент.Области.Найти(ЭлСтруктуры.Ключ) <> Неопределено Тогда
			ТабличныйДокумент.Области[ЭлСтруктуры.Ключ].Значение = ЭлСтруктуры.Значение;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураРеквизитовФормы.мПоМесту = ТабличныйДокумент.Области.ПоМесту.Значение;
	
	РегламентированнаяОтчетность.ОперацииПриВосстановленииРегламентированногоОтчета(ЭтотОбъект);
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, мДеревоВыбранныхСтраниц);
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПередСохранением(КодИФНС, КПП, ПодобныйОтчетСуществует, Вариант, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, Автосохранение, НаимТекРаздела, УдалитьДанныеПомощника)
	
	Если РегламентированнаяОтчетность.БылиИзмененыКлючевыеРеквизитыОтчета(ЭтотОбъект, КодИФНС, КПП)
		И РегламентированнаяОтчетность.СуществуетДокументСАналогичнымиРеквизитами(ЭтотОбъект, КодИФНС) Тогда
		
		ПодобныйОтчетСуществует = Истина;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мЗаписываетсяНовыйДокумент = (СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено);
	
	Если Вариант <> Неопределено И ((СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено) ИЛИ (СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено) ИЛИ (Вариант <> СтруктураРеквизитовФормы.мВариант)) Тогда
		
		Если СтруктураРеквизитовФормы.мСохраненныйДок = Неопределено ИЛИ СтруктураРеквизитовФормы.мСкопированаФорма <> Неопределено Тогда
			
		ИначеЕсли Вариант <> СтруктураРеквизитовФормы.мВариант Тогда
			
			ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПодобныйОтчетСуществует
		ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Сохранить(Автосохранение, КодИФНС, КПП, Вариант, Ложь, НаимТекРаздела, УдалитьДанныеПомощника);
	
КонецФункции

// Формирует структуру данных отчета и помещает в реквизит типа ХранилищеЗначения
// документа РегламентированныйОтчет.
// 
// При первом сохранении данных отчета создает новый документ этого вида.
// Структура данных отчета состоит из элементов:
//   - значения редактируемых реквизитов отчета;
//   - данные по многострочным разделам отчета;
//   - данные по  многостраничным разделам отчета;
//   - данные по вариантам заполнения реквизитов,
//     участвующих в автозаполнении.
//
&НаСервере
Функция Сохранить(Автосохранение = Ложь, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен = Ложь, НаимТекРаздела, УдалитьДанныеПомощника = Ложь) Экспорт
	
	Если ВидДокументаНомерКорректировкиИзменен Тогда
		РазблокироватьДанныеДляРедактирования(СтруктураРеквизитовФормы.мСохраненныйДок, УникальныйИдентификатор);
	КонецЕсли;
	
	Если СтруктураРеквизитовФормы.НужноРассчитатьОтчетНаСервере Тогда
		РасчетНаСервере();
	КонецЕсли;
	
	СтруктураРеквизитовФормы.Вставить("мВариант", Вариант);
	СтруктураРеквизитовФормы.Вставить("ДатаПодписи", ДатаПодписи);
	СтруктураРеквизитовФормы.Вставить("Комментарий", Комментарий);
	СтруктураРеквизитовФормы.Вставить("УдалитьДанныеПомощника", УдалитьДанныеПомощника);
	
	СохранитьДанныеРаздела(НаимТекРаздела, Ложь, Ложь);
	
	ЗаполнитьПустыеСтруктурыДанных();
	
	// ДЕНЬГИ
	ОбновитьСсылкуОрганизации(СтруктураРеквизитовФормы, СтруктураДанныхТитульный, КодИФНС);
	ОргСтр = " (" + СтруктураРеквизитовФормы.НаимОрганизации + ")";
	Заголовок = "Декларация 3-НДФЛ " + СтруктураРеквизитовФормы.СтрПериодОтчета + ОргСтр;
	// Конец ДЕНЬГИ
	
	СвойстваРазделовДекларации = РеквизитФормыВЗначение("мСвойстваРазделовДекларации", Тип("ДеревоЗначений"));
	
	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("ПоказателиОтчета", Отчеты.РегламентированныйОтчет3НДФЛ.ПоказателиОтчета(
		СвойстваРазделовДекларации, ЭтотОбъект));
	ДанныеФормы.Вставить("ДанныеМногострочныхРазделов", Отчеты.РегламентированныйОтчет3НДФЛ.ДанныеМногострочныхРазделов(
		мСтруктураМногострочныхРазделов, ЭтотОбъект));
	ДанныеФормы.Вставить("ДанныеМногостраничныхРазделов", Отчеты.РегламентированныйОтчет3НДФЛ.ДанныеМногостраничныхРазделов(
		СвойстваРазделовДекларации, мСтруктураМногостраничныхРазделов, ЭтотОбъект));
	ДанныеФормы.Вставить("ДеревоНастройкиСтраниц", РеквизитФормыВЗначение("мДеревоСтраницОтчета"));
	ДанныеФормы.Вставить("ДанныеВариантовАвтоЗаполнения",
		Отчеты.РегламентированныйОтчет3НДФЛ.ДанныеВариантовАвтоЗаполнения(мСтруктураВариантыЗаполнения, ЭтотОбъект));
	
	ОтчетЗаписан = Отчеты.РегламентированныйОтчет3НДФЛ.ЗаписатьДанныеФормы(
		ДанныеФормы, СтруктураРеквизитовФормы, КодИФНС, Автосохранение, ВидДокументаНомерКорректировкиИзменен);
	
	Если ОтчетЗаписан Тогда
		// ДЕНЬГИ
		//РегламентированнаяОтчетность.СохранитьСтатусОтправкиРеглОтчета(ЭтотОбъект);
		// Конец ДЕНЬГИ
		Модифицированность = Ложь;
	КонецЕсли;
	
	Возврат ОтчетЗаписан;
	
КонецФункции

&НаСервере
Функция ПоказателиОтчета()
	
	ПоказателиОтчета = Новый Структура();
	
	Префикс = "ПолеТабличногоДокумента";
	
	Для Каждого Раздел Из мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		Если Не Раздел.МногостраничностьВРазделе Тогда
			ПоказателиОтчета.Вставить(Префикс + Раздел.ИмяСтраницы, ЭтотОбъект["СтруктураДанных" + Раздел.ИмяСтраницы]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоказателиОтчета;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаКлиенте(Знач ИмяРаздела) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

&НаСервере
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделуНаСервере(Знач ИмяРаздела) Экспорт
	
	ПеременныеМодуля = Новый Структура;
	
	ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(ИмяРаздела, ПеременныеМодуля);
	
КонецПроцедуры

// ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу()
// Процедура обнуляем переменные модуля, используемые для отображения в квадратиках
// в разделе 1
// запускается при добавлении новой страницы, а также при инициализации формы
//
&НаКлиентеНаСервереБезКонтекста
Процедура ОбнулитьПеременныеМодуляХранящиеЗначенияКвадратногоПредставленияПоРазделу(Знач ИмяРаздела, ПеременныеМодуля)
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеЗначенийВКвадратикахНаКлиенте(Знач ИмяСтраницы) Экспорт
	
	ЗаполнениеЗначенийВКвадратиках(ЭтотОбъект, ИмяСтраницы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеЗначенийВКвадратикахНаСервере(Знач ИмяСтраницы) Экспорт
	
	ЗаполнениеЗначенийВКвадратиках(ЭтотОбъект, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнениеЗначенийВКвадратиках(Форма, Знач ИмяСтраницы)
	
	Возврат;
	
КонецПроцедуры

// Процедура очищает содержимое редактируемых и вычисляемых ячеек
// поля табличного документа, переданного параметром ВыбТабличноеПоле.
//
// Параметры:
//  ВыбТабличноеПоле - поле табличного документа.
//
&НаСервере
Процедура ОчиститьТабличноеПолеСпец(ИмяТекущегоРаздела, ОбновитьСтавки = Истина) Экспорт
	
	//для очистки защищенных областей итоговых ячеек
	//получим список итоговых ячеек, снимая с них защиту), а после очищения вернем защиту
	СписокИтоговыхЯчеек = Новый СписокЗначений;
	
	Для каждого Область Из ТабличныйДокумент.Области Цикл
		Если Область.ЦветФона = СтруктураРеквизитовФормы.ЦветЗаполняетсяАвтоАрифметика И Область.Защита Тогда
			Область.Защита = Ложь;
			СписокИтоговыхЯчеек.Добавить(Область.Имя);
		КонецЕсли;
	КонецЦикла;
	
	РегламентированнаяОтчетностьКлиентСервер.ОчиститьТабличноеПоле(ЭтотОбъект, ИмяТекущегоРаздела);
	
	НомерКорректировки = 0;
	ДатаПодписи = ТекущаяДатаСеанса();
	
	СохранитьДанныеРаздела(ИмяТекущегоРаздела, Истина, Ложь);
	
	Для каждого КодИтоговогоПоказателя Из СписокИтоговыхЯчеек Цикл
		ОбластьПоказателя=ТабличныйДокумент.Области.Найти(КодИтоговогоПоказателя.Значение);
		Если ОбластьПоказателя <> Неопределено Тогда
			ОбластьПоказателя.Защита = Истина;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоказателиОтчетаЗаполняемыеИзИБНаСервере(ИмяСтраницы)
	
	ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(ЭтотОбъект, ИмяСтраницы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьПоказателиОтчетаЗаполняемыеИзИБ(Форма, НазванияМногостраничныхРазделовДляУдаления = "") Экспорт
	
	Если НЕ ПустаяСтрока(НазванияМногостраничныхРазделовДляУдаления) Тогда
		НазванияМнгостраничныхРазделов = Новый Структура(НазванияМногостраничныхРазделовДляУдаления);
	Иначе
		НазванияМнгостраничныхРазделов = Новый Структура;
	КонецЕсли;
	
	Для каждого СтрокаУровня1 из Форма.мСвойстваРазделовДекларации.ПолучитьЭлементы() Цикл
		
		НазваниеСтраницы           = СтрокаУровня1.ИмяСтраницы;
		МногостраничностьВРазделе  = СтрокаУровня1.МногостраничностьВРазделе;
		РазделАвтозаполняется = СтрокаУровня1.РазделЯвляетсяАвтозаполняемым;
		
		Если НазваниеСтраницы = "Титульный" Тогда
			Продолжить;
		КонецЕсли;
		
		мРазделИмя = "ТабличныйДокумент";
		мРаздел    = Форма[мРазделИмя];
		Если НазванияМнгостраничныхРазделов.Свойство(НазваниеСтраницы) Тогда
			// Очистим текущий лист.
			#Если НаКлиенте Тогда
				Форма.ОчиститьТабличноеПолеНаКлиенте(НазваниеСтраницы);
			#Иначе
				Форма.ОчиститьТабличноеПолеНаСервере(НазваниеСтраницы);
			#КонецЕсли
			
			ТаблицаСтраницРаздела = Неопределено;
			Форма.мСтруктураМногостраничныхРазделов.Свойство(НазваниеСтраницы, ТаблицаСтраницРаздела);
			
			ТаблицаСтраницРаздела = Форма[ТаблицаСтраницРаздела];
			
			ИндексСтраницы = 0;
			Пока Не (ИндексСтраницы > (ТаблицаСтраницРаздела.Количество()-1)) Цикл
				СтрокаТаблицы = ТаблицаСтраницРаздела[ИндексСтраницы];
				Если НЕ СтрокаТаблицы.АктивнаяСтраница Тогда
					// удаляем дополнительную страницу
					ТаблицаСтраницРаздела.Удалить(СтрокаТаблицы);
					Продолжить;
				КонецЕсли;
				ИндексСтраницы = ИндексСтраницы + 1;
			КонецЦикла;
			
			// Варианты заполнения установим в один массив. Все варианты возьмем из Эталона.
			// Цвет ячеек перерисуется в показе статика многостраничного раздела, ниже.
			РегламентированнаяОтчетностьКлиентСервер.ОчиститьВариантыЗаполнения(Форма, НазваниеСтраницы, Ложь);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Открывает форму документа ФормаНастройкиОтчета с целью выбора 
// выводимых на печать листов отчета.
//
// Параметры:
//   ВариантВыбора - строка, назначение выбора страниц.
//
&НаКлиенте
Процедура ОткрытьФормуВыбораСтраниц(ВариантВыбора)
	Перем ТекущийРазделОтчетаСокрНаим;
	Перем НомерСтраницыРазделаОтчета;
	
	// Запоминаем текущий раздел, установленный в дереве разделов отчета.
	Если НЕ Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		ТекущийРазделОтчетаСокрНаим = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
		НомерСтраницыРазделаОтчета  = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаНомерСтраницыРазделаОтчета;
	КонецЕсли;
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ПроверкаСоотношений", Ложь);
	мПараметры.Вставить("Автосохранение", Ложь);
	мПараметры.Вставить("ИмеетсяРеквизитДеревоВыбранныхСтраниц", Истина);
	мПараметры.Вставить("РазрешитьВстроеннуюПечать", Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФлажокОтклАвтоРасчет", СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	ПараметрыФормы.Вставить("мПечатьБезШтрихкодаРазрешена", СтруктураРеквизитовФормы.мПечатьБезШтрихкодаРазрешена);
	ПараметрыФормы.Вставить("мСчетчикСтраниц", СтруктураРеквизитовФормы.мСчетчикСтраниц);
	ПараметрыФормы.Вставить("мАвтоВыборКодов", СтруктураРеквизитовФормы.мАвтоВыборКодов);
	ПараметрыФормы.Вставить("мПроверятьСоотношенияПриПечатиИВыгрузки", СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки);
	ПараметрыФормы.Вставить("мПараметры", мПараметры);
	
	ФормаНастройкиОтчета = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("НастройкиОтчета", ПараметрыФормы, ЭтотОбъект);
	
	мДеревоВыбранныхСтраниц.ПолучитьЭлементы().Очистить();
	
	КопироватьДанныеФормы(мДеревоСтраницОтчета, ФормаНастройкиОтчета.Дерево);
	
	ЗначениеАвторасчета = СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет;
	ЗначениеЕдИзм       = СтруктураРеквизитовФормы.ЕдиницаИзмерения;
	ЗначениеЗпт         = СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения;
	
	ДополнительныеПараметры = Новый Структура("ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим", ЗначениеАвторасчета, ЗначениеЕдИзм, ЗначениеЗпт, НомерСтраницыРазделаОтчета, ТекущийРазделОтчетаСокрНаим);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуВыбораСтраницЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ФормаНастройкиОтчета.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаНастройкиОтчета.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаНастройкиОтчета.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьТаблицуВариантовЗаполненияНаСервере()
	
	РегламентированнаяОтчетностьКлиентСервер.ИзменитьТаблицуВариантовЗаполнения(ЭтотОбъект, НЕ СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет);
	
	РегламентированнаяОтчетность.ПолучитьСведенияОПоказателяхОтчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаОтчетЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	// ДЕНЬГИ
	Возврат;
	//РегламентированнаяОтчетностьЗагрузкаКлиент.ЗагрузитьИзФайлаОтчет(ЭтотОбъект);
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузкаОтчетаИзФайла(ДанныеДляЗагрузки) Экспорт
	
	Если Модифицированность Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(НСтр("ru='Отчет ""%1"" не сохранен.'"), ЭтотОбъект.Заголовок);
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗагрузкаОтчетаИзФайлаНаСервере(ДанныеДляЗагрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЗагрузкаОтчетаИзФайлаНаСервере(ДанныеДляЗагрузки)
	// ДЕНЬГИ
	Возврат Ложь;
	// Конец ДЕНЬГИ 
КонецФункции

&НаКлиенте
Процедура ВыгрузитьЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОтчет() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьОтчетЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьВыгрузкуОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыгрузкуОтчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВыгрузкуОтчетаЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		СохранитьНаКлиенте(,ОписаниеОповещения);
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПоказатели() Экспорт
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = Отчеты.РегламентированныйОтчет3НДФЛ.ПараметрыВыгрузки(
		СтруктураРеквизитовФормы.мВыбраннаяФорма, мДанныеОтчета.Титульный);
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	Если НЕ ВыгрузкаВозможна(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	Если НЕ ПроверитьДанные(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция УниверсальнаяВыгрузка(ТекстВыгрузки = Неопределено, ПроверятьБлокировки = Истина) Экспорт
	
	Перем ПараметрыВыгрузки;
	
	Если Модифицированность Тогда

		ТекстЗаголовка = ЗаголовокРегламентированногоОтчета(СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета, СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
		
		ОргСтр = " (" + СтруктураРеквизитовФормы.Организация + ")";
		Если СтрНайти(ТекстЗаголовка, ОргСтр) = 0 Тогда
			ТекстЗаголовка = ТекстЗаголовка + ОргСтр;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отчет """ + ТекстЗаголовка + """ не сохранен.";
		Сообщение.Сообщить();
		
		Возврат Ложь;
	КонецЕсли;
	
	Если Открыта() Тогда
		Если СтруктураРеквизитовФормы.ЕдиницаИзмерения <> ПорядкиОкругленияОтчетности.ПеречислениеПорядкиОкругленияОтчетностиОкр1 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Перед выгрузкой необходимо установить единицу измерения ""в рублях"".'");
			
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
		Если СтруктураРеквизитовФормы.ТочностьЕдиницыИзмерения <> 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			
			Сообщение.Текст = НСтр("ru='Перед выгрузкой необходимо установить точность ""0"".'");
			
			Сообщение.Сообщить();
			
			Возврат Ложь;
			
		КонецЕсли;
	КонецЕсли;
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтотОбъект, ОбработкаКС);
	КонецЕсли;
	Если НЕ УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция УниверсальнаяВыгрузкаXMLНаСервере(ТекстВыгрузки, ПараметрыВыгрузки)
	
	СформироватьСтруктуруПоказателей();
	ПараметрыВыгрузки = Отчеты.РегламентированныйОтчет3НДФЛ.ПараметрыВыгрузки(
		СтруктураРеквизитовФормы.мВыбраннаяФорма, мДанныеОтчета.Титульный);
	ДеревоВыгрузки = ИзвлечьСтруктуруXML();
	
	Если НЕ ВыгрузкаВозможна(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаполнитьДанными(ДеревоВыгрузки, ПараметрыВыгрузки);
	Если НЕ ПроверитьДанные(ДеревоВыгрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстВыгрузки = ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ИзвлечьСтруктуруXML()
	
	ДеревоСтруктуры = Новый ДеревоЗначений;
	ДеревоСтруктуры.Колонки.Добавить("Код");
	ДеревоСтруктуры.Колонки.Добавить("Тип");
	ДеревоСтруктуры.Колонки.Добавить("Формат");
	ДеревоСтруктуры.Колонки.Добавить("МинРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("МаксРазмерность");
	ДеревоСтруктуры.Колонки.Добавить("Обязательность");
	ДеревоСтруктуры.Колонки.Добавить("Многостраничность");
	ДеревоСтруктуры.Колонки.Добавить("Многострочность");
	ДеревоСтруктуры.Колонки.Добавить("Раздел");
	ДеревоСтруктуры.Колонки.Добавить("Ключ");
	ДеревоСтруктуры.Колонки.Добавить("Условие");
	ДеревоСтруктуры.Колонки.Добавить("ЗначениеПоУмолчанию");
	ДеревоСтруктуры.Колонки.Добавить("Значение");
	ДеревоСтруктуры.Колонки.Добавить("Представление");
	ДеревоСтруктуры.Колонки.Добавить("Показатели");
	
	Макет = ОтчетОбъект().ПолучитьМакет("СтруктураXML512");
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	
	УчтенныеГруппы = Новый Соответствие;
	
	Для Уровень = 0 По Макет.КоличествоУровнейГруппировокСтрок() - 1 Цикл
		Макет.ПоказатьУровеньГруппировокСтрок(Уровень);
		Для НомерСтроки = 2 По ВысотаТаблицы Цикл
			НомСтр = ВысотаТаблицы - НомерСтроки + 2;
			Если Макет.Область(НомСтр, 0, НомСтр, 0).Видимость = Истина И УчтенныеГруппы.Получить(НомСтр) = Неопределено Тогда
				
				РодительскийУзел = ДеревоСтруктуры;
				Если Уровень <> 0 Тогда
					Для Инд = 1 По НомСтр - 2 Цикл
						Узел = УчтенныеГруппы.Получить(НомСтр - Инд);
						Если Узел <> Неопределено Тогда
							РодительскийУзел = Узел;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				НовСтр = РодительскийУзел.Строки.Вставить(0);
				НовСтр.Код = СокрЛП(Макет.Область(НомСтр, 1, НомСтр, 1).Текст);
				НовСтр.Раздел = СокрЛП(Макет.Область(НомСтр, 2, НомСтр, 2).Текст);
				НовСтр.Ключ = СокрЛП(Макет.Область(НомСтр, 3, НомСтр, 3).Текст);
				НовСтр.Тип = СокрЛП(Макет.Область(НомСтр, 4, НомСтр, 4).Текст);
				НовСтр.Формат = СокрЛП(Макет.Область(НомСтр, 5, НомСтр, 5).Текст);
				МинРазмерность = СокрЛП(Макет.Область(НомСтр, 6, НомСтр, 6).Текст);
				НовСтр.МинРазмерность = ?(ПустаяСтрока(МинРазмерность), ?(НовСтр.Формат = "N", 99999, 0), Число(МинРазмерность));
				МаксРазмерность = СокрЛП(Макет.Область(НомСтр, 7, НомСтр, 7).Текст);
				НовСтр.МаксРазмерность = ?(ПустаяСтрока(МаксРазмерность), 99999, Число(МаксРазмерность));
				НовСтр.Обязательность = СокрЛП(Макет.Область(НомСтр, 8, НомСтр, 8).Текст);
				НовСтр.Многостраничность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 9, НомСтр, 9).Текст);
				НовСтр.Многострочность = НЕ ПустаяСтрока(Макет.Область(НомСтр, 10, НомСтр, 10).Текст);
				НовСтр.Условие = СокрЛП(Макет.Область(НомСтр, 11, НомСтр, 11).Текст);
				НовСтр.ЗначениеПоУмолчанию = СокрЛП(Макет.Область(НомСтр, 12, НомСтр, 12).Текст);
				НовСтр.Представление = СокрЛП(Макет.Область(НомСтр, 13, НомСтр, 13).Текст);
				
				УчтенныеГруппы.Вставить(НомСтр, НовСтр);
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДеревоСтруктуры;
	
КонецФункции

&НаСервере
Функция ВыгрузкаВозможна(ДеревоВыгрузки)
	
	Если Не ПроверитьРазделыНаНаличиеИнформации(ДеревоВыгрузки, "Раздел1, Раздел2") Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
			НСтр("ru = 'Должны быть заполнены разделы 1 и 2.'"),
			"Раздел1");
		Возврат Ложь;
	КонецЕсли;
	
	Для Индекс = 0 По мДанныеОтчета.Раздел1.Количество() - 1 Цикл
		ДанныеСтраницы = мДанныеОтчета.Раздел1[Индекс].Данные[0].Значение;
		Если Не СтраницаПуста(ДанныеСтраницы, "Раздел1", ДеревоВыгрузки) Тогда
			ПроверитьСтраницуРаздела1(ДанныеСтраницы, Индекс + 1);
		КонецЕсли;
	КонецЦикла;
	
	Для Индекс = 0 По мДанныеОтчета.ЛистА.Количество() - 1 Цикл
		ДанныеСтраницы = мДанныеОтчета.ЛистА[Индекс].Данные[0].Значение;
		Если Не СтраницаПуста(ДанныеСтраницы, "ЛистА", ДеревоВыгрузки) Тогда
			ПроверитьСтраницуЛистаА(ДанныеСтраницы, Индекс + 1);
		КонецЕсли;
	КонецЦикла;
	
	Для Индекс = 0 По мДанныеОтчета.ЛистБ.Количество() - 1 Цикл
		ДанныеСтраницы = мДанныеОтчета.ЛистБ[Индекс].Данные[0].Значение;
		Если Не СтраницаПуста(ДанныеСтраницы, "ЛистБ", ДеревоВыгрузки) Тогда
			ПроверитьСтраницуЛистаБ(ДанныеСтраницы, Индекс + 1);
		КонецЕсли;
	КонецЦикла;
	
	Для Индекс = 0 По мДанныеОтчета.ЛистД1.Количество() - 1 Цикл
		ДанныеСтраницы = мДанныеОтчета.ЛистД1[Индекс].Данные[0].Значение;
		Если Не СтраницаПуста(ДанныеСтраницы, "ЛистД1", ДеревоВыгрузки) Тогда
			ПроверитьСтраницуЛистаД1(ДанныеСтраницы, Индекс + 1);
		КонецЕсли;
	КонецЦикла;
	
	Если Не СтраницаПуста(мДанныеОтчета.ЛистЕ1, "ЛистЕ1", ДеревоВыгрузки) Тогда
		ПроверитьЛистЕ1(мДанныеОтчета.ЛистЕ1);
	КонецЕсли;
	
	Для Индекс = 0 По мДанныеОтчета.ЛистЕ2.Количество() - 1 Цикл
		ДанныеСтраницы = мДанныеОтчета.ЛистЕ2[Индекс].Данные[0].Значение;
		Если Не СтраницаПуста(ДанныеСтраницы, "ЛистЕ2", ДеревоВыгрузки) Тогда
			ПроверитьСтраницуЛистаЕ2(ДанныеСтраницы, Индекс + 1);
		КонецЕсли;
	КонецЦикла;
	
	Для Индекс = 0 По мДанныеОтчета.РасчетДоходаОтПродажиНедвижимости.Количество() - 1 Цикл
		ДанныеСтраницы = мДанныеОтчета.РасчетДоходаОтПродажиНедвижимости[Индекс].Данные[0].Значение;
		Если Не СтраницаПуста(ДанныеСтраницы, "РасчетДоходаОтПродажиНедвижимости", ДеревоВыгрузки) Тогда
			ПроверитьСтраницуРасчетаДоходаОтПродажиНедвижимости(ДанныеСтраницы, Индекс + 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат (ТаблицаСообщений.Количество() = 0);
	
КонецФункции

&НаСервере
Процедура ПроверитьСтраницуРаздела1(ДанныеСтраницы, НомерСтраницы)
	
	// Код ОКТМО
	Если ПустаяСтрока(ДанныеСтраницы.П000100001030) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
			СтрШаблон("На странице %1 Раздела 1 не указан код ОКТМО!", НомерСтраницы),
			"Раздел1",
			"П000100001030",
			НомерСтраницы);
	Иначе
		ДлинаОКТМО = СтрДлина(СокрЛП(ДанныеСтраницы.П000100001030));
		Если ДлинаОКТМО <> 8 И ДлинаОКТМО <> 11 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 Раздела 1 указан код ОКТМО некорректной длины!", НомерСтраницы),
				"Раздел1",
				"П000100001030",
				НомерСтраницы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтраницуЛистаА(ДанныеСтраницы, НомерСтраницы)
	
	НомерСтроки = 1;
	
	Пока ДанныеСтраницы.Свойство("П000300001030_" + НомерСтроки) Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеСтраницы["П000300001010_" +НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект, 
				СтрШаблон("На странице %1 Листа А в строке %2 не указана ставка налога", НомерСтраницы, НомерСтроки),
				"ЛистА",
				"П000300001010_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		ДлинаИНН = СтрДлина(СокрЛП(ДанныеСтраницы["П000300001030_" +НомерСтроки])); //ИНН
		ДлинаКПП = СтрДлина(СокрЛП(ДанныеСтраницы["П000300001040_" + НомерСтроки])); //КПП
		
		Если ДлинаИНН > 0 И ДлинаИНН <> 12 И  ДлинаИНН <> 10  Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект, 
				СтрШаблон("На странице %1 листа А в строке %2 указан ИНН некорректной длины!", НомерСтраницы, НомерСтроки),
				"ЛистА",
				"П000300001030_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если ДлинаИНН = 10 И ДлинаКПП <> 9  Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект, 
				СтрШаблон("На странице %1 листа А в строке %2 указан КПП некорректной длины!", НомерСтраницы, НомерСтроки),
				"ЛистА",
				"П000300001040_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СокрЛП(ДанныеСтраницы["П000300001060_" + НомерСтроки])) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект, 
				СтрШаблон("На странице %1 листа А в строке %2 не указано Наименование источника выплаты дохода", НомерСтраницы, НомерСтроки),
				"ЛистА",
				"П000300001060_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000300001070_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект, 
				СтрШаблон("На странице %1 листа А в строке %2 не указана сумма дохода", НомерСтраницы, НомерСтроки),
				"ЛистА",
				"П000300001070_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтраницуЛистаБ(ДанныеСтраницы, НомерСтраницы)
	
	Если Не ЗначениеЗаполнено(ДанныеСтраницы.П000400001001) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
			СтрШаблон("На странице %1 Лист Б не указана ставка налога", НомерСтраницы),
			"ЛистБ",
			"П000400001001",
			НомерСтраницы);
	КонецЕсли;
	
	НомерСтроки = 1;
	
	Пока ДанныеСтраницы.Свойство("П000400001010_" + НомерСтроки) Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001010_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указан код страны по классификатору ОКСМ", НомерСтраницы, НомерСтроки),
				"ЛистБ",
				"П000400001010_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СокрЛП(ДанныеСтраницы["П000400001020_" + НомерСтроки])) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указано Наименование источника выплаты дохода", НомерСтраницы, НомерСтроки),
				"ЛистБ",
				"П000400001020_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001030_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указан код валюты", НомерСтраницы, НомерСтроки),
				"ЛистБ",
				"П000400001030_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001040_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указана дата получения дохода", НомерСтраницы, НомерСтроки),
				"ЛистБ",
				"П000400001040_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001050_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указан курс иностранной валюты", НомерСтраницы, НомерСтроки),
				"ЛистБ", "П000400001050_" + НомерСтроки, НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001060_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указана сумма дохода, полученная в иностранной валюте", НомерСтраницы, НомерСтроки),
				"ЛистБ",
				"П000400001060_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтраницы["П000400001070_" + НомерСтроки]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Б в строке %2 не указана сумма дохода, полученная в иностранной валюте в пересчете в рубли", НомерСтраницы, НомерСтроки),
				"ЛистБ",
				"П000400001070_" + НомерСтроки,
				НомерСтраницы);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтраницуЛистаД1(ДанныеСтраницы, НомерСтраницы)
	
	Если ПустаяСтрока(ДанныеСтраницы.П000700001050) Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
			СтрШаблон("На странице %1 Лист Д1 не указан код номера объекта (50)", НомерСтраницы),
			"ЛистД1",
			"П000700001050",
			НомерСтраницы);
	ИначеЕсли НомерОбъектаНедвижимостиОтсутствует(ДанныеСтраницы.П000700001050) Тогда
		// Если отсутствует номер объекта, обязательно указывается его адрес
		Если ПустаяСтрока(ДанныеСтраницы.П000700001052) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 Лист Д1 не указаны сведения о местонахождении объекта (52)", НомерСтраницы),
				"ЛистД1",
				"П000700001052",
				НомерСтраницы);
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(ДанныеСтраницы.П000700001051) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 Лист Д1 не указан номер объекта (51)", НомерСтраницы),
				"ЛистД1",
				"П000700001051",
				НомерСтраницы);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСтраницы.П000700001110 = 0 Или ДанныеСтраницы.П000700001110 = "0001" Тогда
		РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
			СтрШаблон("На странице %1 Лист Д1 не указан год начала использования налогового вычета", НомерСтраницы),
			"ЛистД1",
			"П000700001110",
			НомерСтраницы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НомерОбъектаНедвижимостиОтсутствует(КодНомераОбъекта)
	
	Возврат (КодНомераОбъекта = "4");
	
КонецФункции

&НаСервере
Процедура ПроверитьЛистЕ1(ДанныеСтраницы)
	
	Если ДанныеСтраницы.П000900001080 <> 0 Тогда
		СуммаОблагаемогоДоходаПоСтавке13 = СуммаОблагаемогоДоходаПоСтавке(ЭтотОбъект, 13);
		Если ДанныеСтраницы.П000900001080 > Окр(СуммаОблагаемогоДоходаПоСтавке13 * 0.25, 2) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("Сумма вычета в виде пожертвований превышает 25%% от общей суммы дохода %1", СуммаОблагаемогоДоходаПоСтавке13),
				"ЛистЕ1",
				"П000900001080");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтраницуЛистаЕ2(ДанныеСтраницы, НомерСтраницы)
	
	Если ДанныеСтраницы.П001000001060 <> 0 Тогда
		
		ДлинаИНН 			= СтрДлина(СокрЛП(ДанныеСтраницы.П001000001010)); //ИНН
		ДлинаКПП 			= СтрДлина(СокрЛП(ДанныеСтраницы.П001000001020)); //КПП
		ДлинаНомераДоговора = СтрДлина(СокрЛП(ДанныеСтраницы.П001000001050));
		
		Если ДлинаИНН <> 10 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Е2 указан ИНН некорректной длины!", НомерСтраницы),
				"ЛистЕ2",
				"П001000001010",
				НомерСтраницы);
		КонецЕсли;
		
		Если ДлинаКПП <> 9 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Е2 указан КПП некорректной длины!", НомерСтраницы),
				"ЛистЕ2",
				"П001000001020",
				НомерСтраницы);
		КонецЕсли;
		
		Если ДлинаНомераДоговора = 0 Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 листа Е2 указан номер договора некорректной длины!", НомерСтраницы),
				"ЛистЕ2",
				"П001000001050",
				НомерСтраницы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСтраницуРасчетаДоходаОтПродажиНедвижимости(ДанныеСтраницы, НомерСтраницы)
	
	НомерСтроки = 1;
	Пока ДанныеСтраницы.Свойство(СтрШаблон("П001900001010_%1", НомерСтроки)) Цикл
		
		ИмяПоля = СтрШаблон("П001900001010_%1", НомерСтроки);
		Если Не ЗначениеЗаполнено(ДанныеСтраницы[ИмяПоля]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 Приложения в строке %2 не указан кадастровый номер", НомерСтраницы, НомерСтроки),
				"РасчетДоходаОтПродажиНедвижимости",
				ИмяПоля,
				НомерСтраницы);
		КонецЕсли;
		
		ИмяПоля = СтрШаблон("П001900001020_%1", НомерСтроки);
		Если Не ЗначениеЗаполнено(ДанныеСтраницы[ИмяПоля]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 Приложения в строке %2 не указана кадастровая стоимость", НомерСтраницы, НомерСтроки),
				"РасчетДоходаОтПродажиНедвижимости",
				ИмяПоля,
				НомерСтраницы);
		КонецЕсли;
		
		ИмяПоля = СтрШаблон("П001900001030_%1", НомерСтроки);
		Если Не ЗначениеЗаполнено(ДанныеСтраницы[ИмяПоля]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект, 
				СтрШаблон("На странице %1 Приложения в строке %2 не указана сумма дохода исходя из цены договора", НомерСтраницы, НомерСтроки),
				"РасчетДоходаОтПродажиНедвижимости",
				ИмяПоля,
				НомерСтраницы);
		КонецЕсли;
		
		ИмяПоля = СтрШаблон("П001900001040_%1", НомерСтроки);
		Если Не ЗначениеЗаполнено(ДанныеСтраницы[ИмяПоля]) Тогда
			РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
				СтрШаблон("На странице %1 Приложения в строке %2 не указана кадастровая стоимость с учетом коэффициента", НомерСтраницы, НомерСтроки),
				"РасчетДоходаОтПродажиНедвижимости",
				ИмяПоля,
				НомерСтраницы);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиенте(Автосохранение = Ложь, ВыполняемоеОповещение = Неопределено) Экспорт
	
	Если СтруктураРеквизитовФормы.НаимТекущегоРаздела = "Титульный" Тогда
		СтруктураДанныхТитульный.Вставить("КодИМНС", ТабличныйДокумент.Области.КодИМНС.Значение);
		Если ТабличныйДокумент.Области.НомерКорректировки.Значение = "" Тогда
			ТабличныйДокумент.Области.НомерКорректировки.Значение = "0";
		КонецЕсли;
		Вариант = Число(ТабличныйДокумент.Области.НомерКорректировки.Значение);
	Иначе
		Вариант = Число(СтруктураДанныхТитульный.НомерКорректировки);
	КонецЕсли;
	
	КодИФНС = СтруктураДанныхТитульный.КодИМНС;
	КПП 	= "";

	// ДЕНЬГИ
	ОбновитьСсылкуОрганизации(СтруктураРеквизитовФормы, СтруктураДанныхТитульный, КодИФНС);
	// Конец ДЕНЬГИ
	
	Если НЕ РегламентированнаяОтчетностьКлиент.ПриЗаписиРегламентированногоОтчетаНаКлиенте(ЭтотОбъект, КодИФНС, Автосохранение, Вариант) Тогда
		Возврат;
	КонецЕсли;
	
	ПодобныйОтчетСуществует = Ложь;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = Ложь;
			
	Если Элементы.РазделыОтчета.ТекущиеДанные = Неопределено Тогда
		НаименованиеТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	Иначе
		НаименованиеТекущегоРаздела = Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим;
	КонецЕсли;
	
	УдалитьДанныеПомощника = Модифицированность И ОтчетСозданИзПомощника;
	Если УдалитьДанныеПомощника Тогда
		// Скрываем плашку про отчет из помощника при сохранении в случае, 
		// если отчет был модифицирован.
		Элементы.ГруппаОтчетИзПомощника.Видимость = Ложь;
		Оповестить("ЗакрытьПомощникЗаполнения3НДФЛ", СтруктураРеквизитовФормы.мСохраненныйДок);
	КонецЕсли;
	
	РезультатСохранения = ПередСохранением(
		КодИФНС, 
		КПП,
		ПодобныйОтчетСуществует,
		Вариант,
		ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,
		Автосохранение,
		НаименованиеТекущегоРаздела,
		УдалитьДанныеПомощника);
		
	ВидДокументаНомерКорректировкиИзменен = Неопределено;
	
	Если ПодобныйОтчетСуществует И Автосохранение Тогда
		Возврат;
	КонецЕсли;
	
	НуженВопросПередСохранением = (ПодобныйОтчетСуществует ИЛИ ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки);
	
	Если НуженВопросПередСохранением Тогда
		
		СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП);
		
	Иначе
		
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросом(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, ПодобныйОтчетСуществует, КодИФНС, КПП)
	
	Если ПодобныйОтчетСуществует Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Сохранить");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Отмена");
		
		// ДЕНЬГИ
		ТекстВопроса = НСтр("ru = 'Для налогоплательщика %1 за %2 год уже существует декларация с номером корректировки %3.
				|Сохранить еще один экземпляр декларации?'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, СтруктураРеквизитовФормы.Организация,
					Формат(Год(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета), "ЧДЦ=; ЧГ="), Вариант);
		//ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Отчет с видом %1 уже существует.
		//	|Сохранить отчет с таким же видом?'"), ?(Вариант = 0, """Первичный""", """Корректирующий/" + Вариант + """"));
		// Конец ДЕНЬГИ
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросСохранитьОтчетСТакимЖеВидомЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки.Получить(1).Значение);
		
	Иначе
		
		СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьОтчетСТакимЖеВидомЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки = ДополнительныеПараметры.ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки,КодИФНС, КПП);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНаКлиентеСВопросомПродолжение(Автосохранение, Вариант, ВыполняемоеОповещение, ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки, КодИФНС, КПП)
	
	Если ОткрытьФормуВопросаПриИзмененииВидаДокументаНомераКорректировки Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВидОтчета", Вариант);
		
		ФормаВопроса = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ВопросПриИзмененииВидаДокументаНомераКорректировки", ПараметрыФормы);
		ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ДополнительныеПараметры = Новый Структура("Автосохранение, Вариант, ВыполняемоеОповещение, КодИФНС, КПП", Автосохранение, Вариант, ВыполняемоеОповещение,КодИФНС, КПП );
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииВидаДокументаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
		ФормаВопроса.Открыть();
	Иначе
		Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраняется %1...'"), ЭтотОбъект.Заголовок), , , БиблиотекаКартинок.Записать);
		РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, Ложь, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
		ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииВидаДокументаЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	
	Автосохранение = ДополнительныеПараметры.Автосохранение;
	Вариант = ДополнительныеПараметры.Вариант;
	ВыполняемоеОповещение = ДополнительныеПараметры.ВыполняемоеОповещение;
	КодИФНС = ДополнительныеПараметры.КодИФНС;
	КПП = ДополнительныеПараметры.КПП;
	Если КодВозврата = КодВозвратаДиалога.Да
		ИЛИ КодВозврата = КодВозвратаДиалога.Нет Тогда
		ВидДокументаНомерКорректировкиИзменен = ?(КодВозврата = КодВозвратаДиалога.Да, Истина, Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сохраняется %1...'"), ЭтотОбъект.Заголовок), , , БиблиотекаКартинок.Записать);
	РезультатСохранения = Сохранить(Автосохранение, КодИФНС, КПП, Вариант, ВидДокументаНомерКорректировкиИзменен, Элементы.РазделыОтчета.ТекущиеДанные.КолонкаРазделыОтчетаСокрНаим);
	ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСохраненияНаКлиенте(ВыполняемоеОповещение, РезультатСохранения)
	
	КлючУникальности = СтруктураРеквизитовФормы.мСохраненныйДок;
	
	Если РезультатСохранения Тогда
		
		РегламентированнаяОтчетностьКлиент.ПослеЗаписиРегламентированногоОтчета(ЭтотОбъект);
		
		Если ВыполняемоеОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ВыполняемоеОповещение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезПредставителяЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиЧерезПредставителяВРегламентированномОтчете(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВИнтернетеЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПроверитьВИнтернете(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВывестиПоказательВXML(Узел, ЗначениеПоказателя)
	
	МинШирина = Узел.МинРазмерность;
	МаксШирина = Узел.МаксРазмерность;
	
	Если Узел.Код = "ОКВЭД" Тогда
		// Для ОКВЭД нужно убрать точки в конце
		ЗначениеПоказателя = СтрЗаменить(СокрЛП(СтрЗаменить(ЗначениеПоказателя, ".", " ")) ," ", ".");
	ИначеЕсли Узел.Код = "Тлф" Тогда
		ЗначениеПоказателя = Отчеты.РегламентированныйОтчет3НДФЛ.ТелефонДляОтчета(ЗначениеПоказателя);
	ИначеЕсли Узел.Код = "НомОбъект" Или Узел.Код = "СвМестОбъект" Или Узел.Код = "НомКадОтчуждОНИ" Тогда
		ЗначениеПоказателя = СтрЗаменить(ЗначениеПоказателя, Символы.ПС, " ");
	КонецЕсли;
	
	Если Узел.Формат = "T" ИЛИ Узел.Формат = "Т" Тогда // учтем оба варианта: кириллицу и латиницу
		Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			Узел.Значение = ?(МаксШирина < СтрДлина(СокрЛП(ЗначениеПоказателя)), СокрЛП(Лев(СокрЛП(ЗначениеПоказателя), МаксШирина)), СокрЛП(ЗначениеПоказателя));
		Иначе
			Узел.Значение = Неопределено;
		КонецЕсли;
	ИначеЕсли Узел.Формат = "N" Тогда
		СтрокаФормата = "ЧРД=.; ЧН=0; ЧГ=";
		Если Узел.МаксРазмерность <> 0 И Узел.МаксРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧЦ=" + Формат(Узел.МаксРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Если Узел.МинРазмерность <> 99999 Тогда
			СтрокаФормата = СтрокаФормата + "ЧДЦ=" + Формат(Узел.МинРазмерность, "ЧГ=") + ";";
		КонецЕсли;
		Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, СтрокаФормата));
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Если ТипЗнч(ЗначениеПоказателя) = Тип("Дата") Тогда
			Если ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
				Узел.Значение = СокрЛП(Формат(ЗначениеПоказателя, "ДФ=гггг"));
			Иначе
				Узел.Значение = Неопределено;
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(ЗначениеПоказателя) Тогда
			// Пустое значение для gYear
			Узел.Значение = "0001";
		ИначеЕсли ТипЗнч(ЗначениеПоказателя) = Тип("Число") Тогда
			
			Узел.Значение = Прав(СокрЛП(Формат(ЗначениеПоказателя, "ЧГ=")), 4);
			
		Иначе
			Узел.Значение = Прав(СокрЛП(ЗначениеПоказателя), 4);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДаннымиУзел(Узел, ДанныеРаздела = Неопределено, НомерСтроки = Неопределено, ТолькоАтрибуты = Ложь)
	
	Если Узел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Получаем данные конкретного раздела
	Если ДанныеРаздела = Неопределено Тогда
		ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	КонецЕсли;
	
	СтрокиУзла = Новый Массив;
	Для Каждого Стр Из Узел.Строки Цикл
		СтрокиУзла.Добавить(Стр);
	КонецЦикла;
	
	Для Каждого Стр из СтрокиУзла Цикл
		Если (Стр.Тип = "С" ИЛИ Стр.Тип = "C") И Не ТолькоАтрибуты Тогда // учтем оба варианта: кириллицу и латиницу
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеРаздела, "ИмяКлючевогоУзлаСодержательнойЧасти")
				И Стр.Код = ДанныеРаздела.ИмяКлючевогоУзлаСодержательнойЧасти Тогда
				ЗаполнитьСодержательнуюЧасть(Стр);
			ИначеЕсли Стр.Многострочность Тогда
				//Особенность декларации, многострочные подузлы
				Если Стр.Родитель.Многострочность Тогда
					Если Стр.Код = "ИстЮЛ" Или Стр.Код = "ИстФЛИн" Или Стр.Код = "СведИст" Или Стр.Код = "СвОрг" Или Стр.Код = "СвФЛ" Тогда
						Если УсловиеЮр_Физ(ДанныеРаздела, Стр, НомерСтроки) Тогда
							ЗаполнитьДаннымиУзел(Стр, ДанныеРаздела, НомерСтроки);
						КонецЕсли;
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				НомСтр = 1;
				ПодчиненныйЭлемент = ПолучитьПервыйПодчиненныйУзелСЗаполненнымКлючом(Стр);
				КлючПодчиненногоЭлемента = ПодчиненныйЭлемент.Ключ;
				Пока РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеРаздела, КлючПодчиненногоЭлемента + "_" + Формат(НомСтр, "ЧГ=")) Цикл
					УзелСоответствующийСтроке = СкопироватьУзел(Узел, Стр);
					ЗаполнитьДаннымиУзел(УзелСоответствующийСтроке, ДанныеРаздела, НомСтр);
					НомСтр = НомСтр + 1;
				КонецЦикла;
			Иначе
				Если Стр.Код = "ИстЮЛ" Или Стр.Код = "ИстФЛИн" Или Стр.Код = "СведИст" Или Стр.Код = "СвОрг" Или Стр.Код = "СвФЛ" Тогда
					Если УсловиеЮр_Физ(ДанныеРаздела, Стр, НомерСтроки) Тогда
						ЗаполнитьДаннымиУзел(Стр, ДанныеРаздела, НомерСтроки);
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Стр.Раздел) И Не Стр.Многостраничность Тогда
					ЗаполнитьДаннымиУзел(Стр, , НомерСтроки);
				Иначе
					ЗаполнитьДаннымиУзел(Стр, ДанныеРаздела, НомерСтроки);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ПустаяСтрока(Стр.ЗначениеПоУмолчанию) Тогда
				Если НЕ ПустаяСтрока(Стр.Ключ) Тогда
					ПолныйКодПоказателя = Стр.Ключ + ?(ЗначениеЗаполнено(НомерСтроки), "_" + Формат(НомерСтроки, "ЧГ="), "");
					Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(ДанныеРаздела, ПолныйКодПоказателя) Тогда
						ЗначениеПоказателя = ?(ДанныеРаздела[ПолныйКодПоказателя] = 0,Стр.ЗначениеПоУмолчанию , ДанныеРаздела[ПолныйКодПоказателя]);
						ЗначениеПоказателя = ?(ЗначениеПоказателя = "" И Стр.Формат = "N", "0" + Сред(Формат(1, "ЧРД=.; ЧЦ= " + (Стр.МинРазмерность + 1) + "; ЧДЦ=" + Стр.МинРазмерность + ";"), 2) , ЗначениеПоказателя);
						ВывестиПоказательВXML(Стр, ЗначениеПоказателя);
					Иначе
						ВывестиПоказательВXML(Стр, "");
					КонецЕсли;
				Иначе
					Стр.Значение = "";
				КонецЕсли;
			ИначеЕсли Лев(Стр.ЗначениеПоУмолчанию, 1) = "&" Тогда
				ВывестиПоказательВXML(Стр, ДанныеРаздела[Сред(Стр.ЗначениеПоУмолчанию, 2)]);
			Иначе
				Стр.Значение = Стр.ЗначениеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УсловиеЮр_Физ(Параметры, Узел, НомерСтроки = Неопределено)
	
	//проверка на длину ИНН для заполнения соответствующей ветки
	Результат = Ложь;
	ЗначениеПоказателя = Неопределено;
	Если Узел.Код = "ИстЮЛ" ИЛИ Узел.Код = "СведИст" ИЛИ Узел.Код = "СвОрг" Тогда
		КлючПодчиненногоЭлемента = Узел.Строки.Найти("ИННЮЛ").Ключ;
		ПолныйКодПоказателя = КлючПодчиненногоЭлемента + ?(ЗначениеЗаполнено(НомерСтроки), "_" + Формат(НомерСтроки, "ЧГ="), "");
		Если Параметры.Свойство(ПолныйКодПоказателя, ЗначениеПоказателя) Тогда
			Если НЕ ЗначениеЗаполнено(ЗначениеПоказателя) ИЛИ СтрДлина(СокрЛП(ЗначениеПоказателя)) > 10 Тогда
				РегламентированнаяОтчетность.УдалитьУзел(Узел);
				Результат = Ложь;
			Иначе
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Узел.Код = "ИстФЛИн" ИЛИ Узел.Код = "СвФЛ" Тогда
		КлючПодчиненногоЭлемента = Узел.Строки.Найти("ИННФЛ").Ключ;
		ПолныйКодПоказателя = КлючПодчиненногоЭлемента + ?(ЗначениеЗаполнено(НомерСтроки), "_" + Формат(НомерСтроки, "ЧГ="), "");
		Если Параметры.Свойство(ПолныйКодПоказателя, ЗначениеПоказателя) Тогда
			Если ЗначениеЗаполнено(ЗначениеПоказателя) И СтрДлина(СокрЛП(ЗначениеПоказателя)) < 12 Тогда
				РегламентированнаяОтчетность.УдалитьУзел(Узел);
				Результат = Ложь;
			Иначе
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЗначениеСоответствуетФормату(Стр)
	
	СтатусПроверки = Истина;
	
	Если Стр.Формат = "Т" ИЛИ Стр.Формат = "T"  ИЛИ Стр.Формат = "S" Тогда // учтем оба варианта: кириллицу и латиницу
		ДлинаЗначения = СтрДлина(Стр.Значение);
		Если ДлинаЗначения < Стр.МинРазмерность Тогда
			СтатусПроверки = Ложь;
			Если ЗначениеЗаполнено(Стр.Раздел) И ЗначениеЗаполнено(Стр.Ключ) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
					"Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """ (" + Стр.Код+ ") меньше минимально возможной (" + ДлинаЗначения
					+ " < " + Стр.МинРазмерность + ") (" + Стр.Раздел + ")", Стр.Раздел, Стр.Ключ, "");
			Иначе
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
					"Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """ (" + Стр.Код+ ") меньше минимально возможной (" + ДлинаЗначения
					+ " < " + Стр.МинРазмерность + ") (" + Стр.Раздел + ")", "Титульный", "");
			КонецЕсли;
		КонецЕсли;
		Если ДлинаЗначения > Стр.МаксРазмерность Тогда
			СтатусПроверки = Ложь;
			Если ЗначениеЗаполнено(Стр.Раздел) И ЗначениеЗаполнено(Стр.Ключ) Тогда
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
					"Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """  (" + Стр.Код+ ") больше максимально возможной (" + ДлинаЗначения
					+ " > " + Стр.МаксРазмерность + ") (" + Стр.Раздел + ")", Стр.Раздел, Стр.Ключ, "");
			Иначе
				РегламентированнаяОтчетность.СообщитьВТаблицуСообщений(ЭтотОбъект,
					"Длина значения показателя """
					+ РегламентированнаяОтчетность.ПредставлениеПоказателя(Стр)
					+ """  (" + Стр.Код+ ") больше максимально возможной (" + ДлинаЗначения
					+ " > " + Стр.МаксРазмерность + ") (" + Стр.Раздел + ")", "Титульный", "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ПроверитьДанные(Узел)
	
	СтатусПроверки = Истина;
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если НЕ ЗначениеСоответствуетФормату(Узел) Тогда
			СтатусПроверки = Ложь;
		КонецЕсли;
	КонецЕсли;
	Для Каждого Стр из Узел.Строки Цикл
		СтатусПроверки = (ПроверитьДанные(Стр) И СтатусПроверки); // именно в указанном порядке для выдачи всех ошибок
	КонецЦикла;
	Возврат СтатусПроверки;
	
КонецФункции

&НаСервере
Функция ВыгрузитьДеревоВXML(ДеревоВыгрузки, ПараметрыВыгрузки)
	
	ПотокXML = РегламентированнаяОтчетность.СоздатьНовыйПотокXML("windows-1251"); // создаем новый поток для записи
	ЗаписатьУзелДереваВXML(ДеревоВыгрузки, ПотокXML, ПараметрыВыгрузки); // пишем дерево в поток
	ТекстДляЗаписи = ПотокXML.Закрыть(); // получаем текст XML
	Возврат ТекстДляЗаписи;
	
КонецФункции

&НаСервере
Функция СкопироватьУзел(Родитель, Узел)
	
	// находим узел с максимальным индексом и с тем же кодом, что и у копируемого, и добавляем новый сразу после найденного
	СтрокиСТемЖеКодом = Родитель.Строки.НайтиСтроки(Новый Структура("Код", Узел.Код), Ложь);
	МаксИндекс = -1;
	Для Каждого СтрокаСТемЖеКодом Из СтрокиСТемЖеКодом Цикл
		ТекИндекс = Родитель.Строки.Индекс(СтрокаСТемЖеКодом);
		Если ТекИндекс > МаксИндекс Тогда
			МаксИндекс = ТекИндекс;
		КонецЕсли;
	КонецЦикла;
	
	ИндексСоздаваемогоУзла = МаксИндекс + 1;
	Если ИндексСоздаваемогоУзла >= Родитель.Строки.Количество() ИЛИ ИндексСоздаваемогоУзла = 0 Тогда // если аналогичный узел не найден или найденный узел - последний
		НовыйУзел = Родитель.Строки.Добавить();
	Иначе
		НовыйУзел = Родитель.Строки.Вставить(ИндексСоздаваемогоУзла);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйУзел, Узел, , "Родитель, Строки");
	Для Каждого Стр из Узел.Строки Цикл
		СкопироватьУзел(НовыйУзел, Стр);
	КонецЦикла;
	Возврат НовыйУзел;
	
КонецФункции

&НаСервере
Функция ПолучитьПодчиненныйЭлемент(Узел, КодЭлемента)
	
	ЧислоВместоКодаЭлемента = (ТипЗнч(КодЭлемента) = Тип("Число"));
	Если ТипЗнч(КодЭлемента) = Тип("Число") Тогда
		Если Узел.Строки.Количество() > КодЭлемента Тогда
			Возврат Узел.Строки.Получить(КодЭлемента);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Для Каждого Стр Из Узел.Строки Цикл
			Если Стр.Код = КодЭлемента Тогда
				Возврат Стр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСодержательнуюЧасть(УзелСодержательнойЧасти)
	
	Если УзелСодержательнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Создаем Родительский узел - эталон, структура будет определеяться по эталонному узлу.
	// После цикла по всем элементам эталонного узла, он должен быть удален.
	Эталон = СкопироватьУзел(УзелСодержательнойЧасти.Родитель, УзелСодержательнойЧасти);
	
	// Очищаем все подчиненные узлы родительского узла.
	// По мере необходимости эти узлы будут создаваться.
	УзелСодержательнойЧасти.Строки.Очистить();
	
	Для Каждого ПодчиненныйУзел Из Эталон.Строки Цикл
		
		Если ПодчиненныйУзел.Многостраничность Тогда
			ЗаполнитьДаннымиУзелМногостраничногоРаздела(УзелСодержательнойЧасти, ПодчиненныйУзел);
		Иначе
			ЗаполнитьДаннымиУзелРаздела(УзелСодержательнойЧасти, ПодчиненныйУзел);
		КонецЕсли;
		
	КонецЦикла;
	
	// Удаляем эталон из дерева выгрузки.
	Эталон.Родитель.Строки.Удалить(Эталон);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелРаздела(Родитель, Узел)
	
	Если СтраницаПуста(мДанныеОтчета[Узел.Раздел], Узел.Раздел, Родитель.Владелец(), Узел.Многострочность) Тогда
		Возврат;
	КонецЕсли;
	
	ЭкземплярУзла = СкопироватьУзел(Родитель, Узел);
	ЗаполнитьДаннымиУзел(ЭкземплярУзла);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелМногостраничногоРаздела(Родитель, Узел)
	
	Если Узел.Код = "ДоходИстИно" Тогда
		ЗаполнитьДаннымиУзелМногостраничногоРаздела_ДоходИстИно(Родитель, Узел);
		Возврат;
	КонецЕсли;
	
	Если Узел.Код = "ДоходПредпр" Тогда
		ЗаполнитьДаннымиУзелМногостраничногоРаздела_ДоходПредпр(Родитель, Узел);
		Возврат;
	КонецЕсли;
	
	Если Узел.Код = "ВычСоцИнв219" Тогда
		ЗаполнитьДаннымиУзелМногостраничногоРаздела_ВычСоцИнв219(Родитель, Узел);
		Возврат;
	КонецЕсли;
	
	Если Узел.Код = "ИмущНалВычНов" Тогда
		ЗаполнитьДаннымиУзелМногостраничногоРаздела_ИмущНалВычНов(Родитель, Узел);
		Возврат;
	КонецЕсли;
	
	Если Узел.Код = "ДохОперЦБ" Тогда
		ЗаполнитьДаннымиУзелМногостраничногоРаздела_ДохОперЦБ(Родитель, Узел);
		Возврат;
	КонецЕсли;
	
	Для Каждого СтраницаРаздела Из мДанныеОтчета[Узел.Раздел] Цикл
		
		ДанныеСтраницы = СтраницаРаздела.Данные[0].Значение;
		
		// Проверим заполненность страницы раздела.
		Если СтраницаПуста(ДанныеСтраницы, Узел.Раздел, Родитель.Владелец(), Узел.Многострочность) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Узел.Раздел = "ЛистА" Или Узел.Раздел = "РасчетДоходаОтПродажиНедвижимости" Тогда
			// Требуется особая обрабока, т.к. каждая строка листа соответствует отдельному элементу в структуре выгрузки.
			Для Каждого СтрокаМногострочнойЧасти Из СтраницаРаздела.ДанныеДопСтрок[0].Значение Цикл
				ЭкземплярУзла = СкопироватьУзел(Родитель, Узел);
				ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтрокаМногострочнойЧасти);
			КонецЦикла;
		Иначе
			ЭкземплярУзла = СкопироватьУзел(Родитель, Узел);
			ЗаполнитьДаннымиУзел(ЭкземплярУзла, ДанныеСтраницы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелМногостраничногоРаздела_ДоходИстИно(Родитель, Узел)
	
	ДеревоВыгрузки = Родитель.Владелец();
	
	ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	
	СтавкиИУзлы = Новый Соответствие;
	
	ЭталонСтрокиЛистаБ = ПолучитьПодчиненныйЭлемент(Узел, "РасчДохНалИно");
	
	Для Каждого СтраницаЛистаБ Из ДанныеРаздела Цикл
		
		// Проверим заполненность страницы раздела
		Если НЕ СтраницаПуста(СтраницаЛистаБ.Данные[0].Значение, Узел.Раздел, ДеревоВыгрузки) Тогда
			СтавкаЛиста = Неопределено;
			Если СтраницаЛистаБ.Данные[0].Значение.Свойство("П000400001001", СтавкаЛиста) Тогда
				
				ЭкземплярУзла = СтавкиИУзлы.Получить(СтавкаЛиста);
				Если ЭкземплярУзла = Неопределено Тогда
					ЭкземплярУзла = СкопироватьУзел(Родитель, Узел);
					СтавкиИУзлы.Вставить(СтавкаЛиста, ЭкземплярУзла);
				КонецЕсли;
				Для Каждого СтрокаЛистаБ Из СтраницаЛистаБ.ДанныеДопСтрок[0].Значение Цикл
					ЭкземплярСтроки = СкопироватьУзел(ЭкземплярУзла, ЭталонСтрокиЛистаБ);
					ЗаполнитьДаннымиУзел(ЭкземплярСтроки, СтрокаЛистаБ);
				КонецЦикла;
				ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтраницаЛистаБ.Данные[0].Значение,, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелМногостраничногоРаздела_ДоходПредпр(Родитель, Узел)
	
	// ЛистВ обратываем по особенному
	// Итоги на последнем листе являются атрибутами всего раздела
	// а данные о видах деятельности подразделами
	// отдельным разделом является информация о крестьянском фермерском хозяйстве
	
	ДеревоВыгрузки = Родитель.Владелец();
	
	ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	
	// Создаем узел раздела, в него будем добавлять подузлы для видов деятельности
	УзелЛистаВ = СкопироватьУзел(Родитель, Узел);
	
	УзелВидаДеятельности = ПолучитьПодчиненныйЭлемент(Узел, "РасчВидДеят");
	Если УзелВидаДеятельности = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого СтраницаЛистаВ Из ДанныеРаздела  Цикл
		
		// Проверим заполненность страницы раздела
		Если НЕ СтраницаПуста(СтраницаЛистаВ.Данные[0].Значение, Узел.Раздел, ДеревоВыгрузки) Тогда
			
			ЭкземплярУзла = СкопироватьУзел(УзелЛистаВ, УзелВидаДеятельности);
			ЗаполнитьДаннымиУзел(ЭкземплярУзла, СтраницаЛистаВ.Данные[0].Значение);
			
		КонецЕсли;
	КонецЦикла;
	
	// Последняя страница - итоговая, на ней находятся итоговые данные по всему узлу
	// данные о крестьянском фермерском хозяйстве и о корректировке
	УзелКФХ = ПолучитьПодчиненныйЭлемент(УзелЛистаВ, "СведКФХ");
	Если УзелКФХ <> Неопределено Тогда
		ЗаполнитьДаннымиУзел(УзелКФХ, СтраницаЛистаВ.Данные[0].Значение);
	КонецЕсли;
	
	УзелНБКор105_3 = ПолучитьПодчиненныйЭлемент(УзелЛистаВ, "НБКор105.3");
	Если УзелНБКор105_3 <> Неопределено Тогда
		ЗаполнитьДаннымиУзел(УзелНБКор105_3, СтраницаЛистаВ.Данные[0].Значение);
	КонецЕсли;
	
	ЗаполнитьДаннымиУзел(УзелЛистаВ, СтраницаЛистаВ.Данные[0].Значение, , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелМногостраничногоРаздела_ВычСоцИнв219(Родитель, Узел)
	
	ДеревоВыгрузки = Родитель.Владелец();
	
	ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	
	// Создаем новый Лист Е2
	ЭкземплярУзлаЕ2 = СкопироватьУзел(Родитель, Узел);
	
	// Получаем подчиненные элементы листа Е2 п. 1 и 3
	Экземпляр_РасчПенсВзнос = ПолучитьПодчиненныйЭлемент(ЭкземплярУзлаЕ2, "РасчПенсВзнос");
	Экземпляр_РасчИнвВыч = ПолучитьПодчиненныйЭлемент(ЭкземплярУзлаЕ2, "РасчИнвВыч");
	
	// Получаем эталонный элемент пункта 1, будем использовать его для получения эталонов элементов 1.1 и 1.2
	Эталон_РасчПенсВзнос = ПолучитьПодчиненныйЭлемент(Узел, "РасчПенсВзнос");
	// Получаем эталонный элемент для п. 1.1
	Эталон_РасчПСВВыч = ПолучитьПодчиненныйЭлемент(Эталон_РасчПенсВзнос, "РасчПСВВыч");
	// Получаем эталонный элемент для п. 1.2
	Эталон_РасчДопСВВыч = ПолучитьПодчиненныйЭлемент(Эталон_РасчПенсВзнос, "РасчДопСВВыч");
	
	ИтогиЛистаЕ2 = Новый ТаблицаЗначений;
	ИменаКолонок = "";
	Для Каждого СтраницаЛистаЕ2 Из ДанныеРаздела Цикл
		// Проверим заполненность страницы раздела
		Если НЕ СтраницаПуста(СтраницаЛистаЕ2.Данные[0].Значение, Узел.Раздел, ДеревоВыгрузки) Тогда
			
			Если ИтогиЛистаЕ2.Колонки.Количество() = 0 Тогда
				Для Каждого КлючИЗначение Из СтраницаЛистаЕ2.Данные[0].Значение Цикл
					ИтогиЛистаЕ2.Колонки.Добавить(КлючИЗначение.Ключ);
					ИменаКолонок = ИменаКолонок + КлючИЗначение.Ключ + ",";
				КонецЦикла;
			КонецЕсли;
			ИменаКолонок = Сред(ИменаКолонок,0 , СтрДлина(ИменаКолонок));
			СтрокаИтогов = ИтогиЛистаЕ2.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИтогов, СтраницаЛистаЕ2.Данные[0].Значение);
			
			// Создаем подчиненный узел п 1.1 из эталона
			Экземпляр_РасчПСВВыч = СкопироватьУзел(Экземпляр_РасчПенсВзнос, Эталон_РасчПСВВыч);
			
			// Создаем подчиненный узел п 1.2 из эталона
			Экземпляр_РасчДопСВВыч = СкопироватьУзел(Экземпляр_РасчПенсВзнос, Эталон_РасчДопСВВыч);
			
			// Заполняем созданные узлы даннымм
			ЗаполнитьДаннымиУзел(Экземпляр_РасчПСВВыч, СтраницаЛистаЕ2.Данные[0].Значение);
			ЗаполнитьДаннымиУзел(Экземпляр_РасчДопСВВыч, СтраницаЛистаЕ2.Данные[0].Значение);
			
		КонецЕсли;
	КонецЦикла;
	
	Если ИтогиЛистаЕ2.Количество() > 0 Тогда
		ИтогиЛистаЕ2.Колонки.Добавить("КолонкаСвертки");
		ИтогиЛистаЕ2.Свернуть("КолонкаСвертки", ИменаКолонок);
		ЗаполнитьДаннымиУзел(Экземпляр_РасчПенсВзнос,  ИтогиЛистаЕ2[0], , Истина);
		ЗаполнитьДаннымиУзел(Экземпляр_РасчИнвВыч, ИтогиЛистаЕ2[0], , Истина);
	КонецЕсли;
	
	ЗаполнитьДаннымиУзел(ЭкземплярУзлаЕ2, СтраницаЛистаЕ2.Данные[0].Значение, , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелМногостраничногоРаздела_ИмущНалВычНов(Родитель, Узел)
	
	ДеревоВыгрузки = Родитель.Владелец();
	
	ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	
	ЭкземплярУзлаД1 = СкопироватьУзел(Родитель, Узел);
	
	Экземпляр_РасчИмущВыч = ПолучитьПодчиненныйЭлемент(ЭкземплярУзлаД1, "РасчИмущВыч");
	Эталон_РасчИмущВыч = ПолучитьПодчиненныйЭлемент(Узел, "РасчИмущВыч");
	Эталон_СвОбъектРасх = ПолучитьПодчиненныйЭлемент(Эталон_РасчИмущВыч, "СвОбъектРасх");
	Экземпляр_СвОбъектРасх = ПолучитьПодчиненныйЭлемент(Экземпляр_РасчИмущВыч, "СвОбъектРасх");
	Экземпляр_СвОбъектРасх.Родитель.Строки.Удалить(Экземпляр_СвОбъектРасх);
	
	НужноЗаполнитьИтог = Ложь;
	Для Каждого СтраницаЛистаД1 Из ДанныеРаздела Цикл
		// Проверим заполненность страницы раздела
		Если НЕ СтраницаПуста(СтраницаЛистаД1.Данные[0].Значение, Узел.Раздел, ДеревоВыгрузки) Тогда
			
			Экземпляр_СвОбъектРасх = СкопироватьУзел(Экземпляр_РасчИмущВыч, Эталон_СвОбъектРасх);
			ЗаполнитьДаннымиУзел(Экземпляр_СвОбъектРасх, СтраницаЛистаД1.Данные[0].Значение);
			НужноЗаполнитьИтог = Истина;
		КонецЕсли;
	КонецЦикла;
	Если НужноЗаполнитьИтог Тогда
		ЗаполнитьДаннымиУзел(Экземпляр_РасчИмущВыч, СтраницаЛистаД1.Данные[0].Значение, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиУзелМногостраничногоРаздела_ДохОперЦБ(Родитель, Узел)
	
	// Лист З особенный, у него 4 продолжения, на основе которых заполняются 10 узлов выгрузки.
	// Каждое из продолжений, как и сам лист З, может иметь 2 страницы по разыным видам операции
	
	ДеревоВыгрузки = Родитель.Владелец();
	
	ДанныеРаздела = мДанныеОтчета[Узел.Раздел];
	
	// Создаем 2 узла раздела, один для операций индивидуального инвестиционного счета,
	// другой для иных операций.
	УзелЛистаЗСПродолжениямиИИС = СкопироватьУзел(Родитель, Узел);
	УзелЛистаЗСПродолжениямиИные = СкопироватьУзел(Родитель, Узел);
	
	ПоказатьИтоговыйРазделИИС = Ложь;
	ПоказатьИтоговыйРазделИные = Ложь;
	
	// Лист З
	Для Каждого СтраницаЛистаЗ Из ДанныеРаздела Цикл
		
		Узел = Неопределено;
		Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
			ПоказатьИтоговыйРазделИИС = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохОперЦБОрг");
		ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
			ПоказатьИтоговыйРазделИные = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохОперЦБОрг");
		КонецЕсли;
		
		Если ПоказатьИтоговыйРазделИИС ИЛИ ПоказатьИтоговыйРазделИные Тогда
			ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	// Продолжение Листа З
	Для Каждого СтраницаЛистаЗ Из мДанныеОтчета.ЛистЗПродолжение Цикл
		
		Узел = Неопределено;
		Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
			ПоказатьИтоговыйРазделИИС = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохОперЦБОргНеОрг");
		ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
			ПоказатьИтоговыйРазделИные = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохОперЦБОргНеОрг");
		КонецЕсли;
		
		// Если у узла заполнен вид опеации. то считаем его заполненным
		Если Узел <> Неопределено Тогда
			
			ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			
			Узел = Неопределено;
			Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохОперЦБНеОрг");
			ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохОперЦБНеОрг");
			КонецЕсли;
			
			Если Узел <> Неопределено Тогда
				ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Продолжение 2 Листа З
	
	Для Каждого СтраницаЛистаЗ Из мДанныеОтчета.ЛистЗПродолжение2 Цикл
		
		Узел = Неопределено;
		Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
			ПоказатьИтоговыйРазделИИС = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохПФИОргЦБ");
		ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
			ПоказатьИтоговыйРазделИные = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохПФИОргЦБ");
		КонецЕсли;
		
		Если Узел <> Неопределено Тогда
			
			ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			
			Узел = Неопределено;
			Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохПФИОргНеЦБ");
			ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохПФИОргНеЦБ");
			КонецЕсли;
			
			Если Узел <> Неопределено Тогда
				ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			КонецЕсли;
			
			Узел = Неопределено;
			Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохПФИНеОрг");
			ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохПФИНеОрг");
			КонецЕсли;
			
			Если Узел <> Неопределено Тогда
				ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Продолжение 3 Листа З
	
	Для Каждого СтраницаЛистаЗ Из мДанныеОтчета.ЛистЗПродолжение3 Цикл
		
		Узел = Неопределено;
		Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
			ПоказатьИтоговыйРазделИИС = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохРЕПО");
		ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
			ПоказатьИтоговыйРазделИные = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохРЕПО");
		КонецЕсли;
		
		Если Узел <> Неопределено Тогда
			ПоказатьИтоговыйРаздел = Истина;
			
			ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			
			Узел = Неопределено;
			Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ДохЗаймЦБ");
			ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ДохЗаймЦБ");
			КонецЕсли;
			
			Если Узел <> Неопределено Тогда
				ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Продолжение 4 Листа З
	
	Для Каждого СтраницаЛистаЗ Из мДанныеОтчета.ЛистЗПродолжение4 Цикл
		
		Узел = Неопределено;
		Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" Тогда
			ПоказатьИтоговыйРазделИИС = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "УбытПредПер");
		ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" Тогда
			ПоказатьИтоговыйРазделИные = Истина;
			Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "УбытПредПер");
		КонецЕсли;
		
		Если Узел <> Неопределено Тогда
			
			ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			
			Узел = Неопределено;
			Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" И ПоказатьИтоговыйРазделИИС Тогда
				ЗаполнитьДаннымиУзел(УзелЛистаЗСПродолжениямиИИС, СтраницаЛистаЗ.Данные[0].Значение, , Истина);
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "УбытПрхПер");
			ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2" И ПоказатьИтоговыйРазделИные Тогда
				ЗаполнитьДаннымиУзел(УзелЛистаЗСПродолжениямиИные, СтраницаЛистаЗ.Данные[0].Значение, , Истина);
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "УбытПрхПер");
			КонецЕсли;
			
			Если Узел <> Неопределено Тогда
				ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			КонецЕсли;
			
			Узел = Неопределено;
			Если СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "1" И ПоказатьИтоговыйРазделИИС Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИИС, "ИтогСовОпер");
			ИначеЕсли СтраницаЛистаЗ.Данные[0].Значение.П001200001100 = "2"  И ПоказатьИтоговыйРазделИные Тогда
				Узел = ПолучитьПодчиненныйЭлемент(УзелЛистаЗСПродолжениямиИные, "ИтогСовОпер");
			КонецЕсли;
			
			Если Узел <> Неопределено Тогда
				ЗаполнитьДаннымиУзел(Узел, СтраницаЛистаЗ.Данные[0].Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПоказатьИтоговыйРазделИИС Тогда
		УзелЛистаЗСПродолжениямиИИС.Родитель.Строки.Удалить(УзелЛистаЗСПродолжениямиИИС);
	КонецЕсли;
	
	Если Не ПоказатьИтоговыйРазделИные Тогда
		УзелЛистаЗСПродолжениямиИные.Родитель.Строки.Удалить(УзелЛистаЗСПродолжениямиИные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНулямиНезаполненныеАтрибуты(Узел, Знач Исключения = Неопределено)
	
	Если Исключения = Неопределено Тогда
		Исключения = Новый Структура;
	КонецЕсли;
	
	Если (Узел.Тип = "А" ИЛИ Узел.Тип = "A") И НЕ ЗначениеЗаполнено(Узел.Значение) Тогда
		ЗначениеАтрибута = Неопределено;
		Узел.Значение = ?(Исключения.Свойство(Узел.Код, ЗначениеАтрибута), ЗначениеАтрибута, "0");
	КонецЕсли;
	
	Для Каждого Стр Из Узел.Строки Цикл
		ЗаполнитьНулямиНезаполненныеАтрибуты(Стр, Исключения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьПустойУзелРаздела(УзелРодитель, СтруктураПустогоРаздела, ТолькоПервыйУровень = Ложь, ИндексУзла = Неопределено, УзелРаздела = Неопределено)
	
	Если ТолькоПервыйУровень Тогда
		
		Если УзелРаздела = Неопределено Тогда
			Если ИндексУзла = Неопределено Тогда
				УзелРаздела = УзелРодитель.Строки.Добавить();
			Иначе
				УзелРаздела = УзелРодитель.Строки.Вставить(ИндексУзла);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(УзелРаздела, СтруктураПустогоРаздела);
		КонецЕсли;
		
		Для Каждого Стр Из СтруктураПустогоРаздела.Строки Цикл
			Если (Стр.Тип = "А" ИЛИ Стр.Тип = "A") И УзелРаздела.Строки.Найти(Стр.Код, "Код") = Неопределено Тогда
				
				// ищем первое вхождение сложного элемента и вставляем на его место новый атрибут
				СложныйЭлемент = УзелРаздела.Строки.Найти("С", "Тип");
				Если СложныйЭлемент = Неопределено Тогда
					НовСтр = УзелРаздела.Строки.Добавить();
				Иначе
					НовСтр = УзелРаздела.Строки.Вставить(УзелРаздела.Строки.Индекс(СложныйЭлемент));
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НовСтр, Стр);
				
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Если УзелРаздела = Неопределено Тогда
			Если ИндексУзла = Неопределено Тогда
				УзелРаздела = УзелРодитель.Строки.Добавить();
			Иначе
				УзелРаздела = УзелРодитель.Строки.Вставить(ИндексУзла);
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(УзелРаздела, СтруктураПустогоРаздела);
		
		Для Каждого Стр Из СтруктураПустогоРаздела.Строки Цикл
			ЗагрузитьПустойУзелРаздела(УзелРаздела, Стр, ТолькоПервыйУровень);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат УзелРаздела;
	
КонецФункции

&НаСервере
Процедура ОтсечьНезаполненныеНеобязательныеУзлы(Узел)
	
	КоличествоСтрок = Узел.Строки.Количество();
	Для Инд = 1 По КоличествоСтрок Цикл
		Стр = Узел.Строки.Получить(КоличествоСтрок - Инд);
		ОтсечьНезаполненныеНеобязательныеУзлы(Стр);
	КонецЦикла;
	
	Если ТипЗнч(Узел) <> Тип("ДеревоЗначений") Тогда
		Если (СтрНайти(Узел.Обязательность, "Н") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "H") <> 0) И УзелПуст(Узел) Тогда // учтем оба варианта: кириллицу и латиницу
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		ИначеЕсли (СтрНайти(Узел.Обязательность, "М") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "M") <> 0) // учтем оба варианта: кириллицу и латиницу
			И УзелПуст(Узел)
			И ?(СтрНайти(Узел.Обязательность, "О") <> 0 ИЛИ СтрНайти(Узел.Обязательность, "O") <> 0, РегламентированнаяОтчетность.ИмеютсяАналогичныеСоседниеУзлыКлюч(Узел), Истина) Тогда
			РегламентированнаяОтчетность.УдалитьУзел(Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УзелПуст(Узел)

	Для Каждого Стр из Узел.Строки Цикл
		Если НЕ УзелПуст(Стр) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Узел.Формат = "S" Тогда
		Возврат Истина;
		
	ИначеЕсли Узел.Формат = "N" Тогда
		
		ПустойПоказатель = "0" + Сред(Формат(1, "ЧРД=.; ЧЦ= " + (Узел.МинРазмерность + 1) + "; ЧДЦ=" + Узел.МинРазмерность + ";"), 2);
		Возврат Узел.Значение = ПустойПоказатель ИЛИ НЕ ЗначениеЗаполнено(Узел.Значение);
		
	ИначеЕсли Узел.Формат = "gYear" Тогда
		Возврат Узел.Значение = "0001";
		
	Иначе
		Возврат НЕ ЗначениеЗаполнено(Узел.Значение);
		
	КонецЕсли;

КонецФункции

&НаСервере
Функция ЗаписатьУзелДереваВXML(СтрокаДерева, ПотокXML, ПараметрыВыгрузки) Экспорт
	
	Если ТипЗнч(СтрокаДерева) = Тип("ДеревоЗначений") Тогда
		ПотокXML.ЗаписатьНачалоЭлемента("Файл");
		ПотокXML.ЗаписатьАтрибут("xmlns:xsi", "http://www.w3.org/2001/XMLSchema-instance");
		Для каждого Стр Из СтрокаДерева.Строки Цикл
			ЗаписатьУзелДереваВXML(Стр, ПотокXML, ПараметрыВыгрузки);
		КонецЦикла;
		ПотокXML.ЗаписатьКонецЭлемента();
	Иначе
		Если СтрокаДерева.Тип = "А" ИЛИ СтрокаДерева.Тип = "A" Тогда 
			ПотокXML.ЗаписатьАтрибут(СтрокаДерева.Код, Строка(СтрокаДерева.Значение));
		Иначе
			ПотокXML.ЗаписатьНачалоЭлемента(СтрокаДерева.Код);
			Для каждого Лист из СтрокаДерева.Строки Цикл
				ЗаписатьУзелДереваВXML(Лист, ПотокXML, ПараметрыВыгрузки);
			КонецЦикла;
			ПотокXML.ЗаписатьТекст(Строка(СтрокаДерева.Значение));
			ПотокXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланкЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Команда = ДополнительныеПараметры.Команда;
		
	Печать(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(ВидПечати, НеИзФормыОтчета = Ложь) Экспорт
	
	Состояние(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1. Формируется печатная форма...'"), ЭтотОбъект.Заголовок), , , БиблиотекаКартинок.Печать);
	
	Если СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки <> Неопределено И СтруктураРеквизитовФормы.мПроверятьСоотношенияПриПечатиИВыгрузки Тогда
		РегламентированнаяОтчетностьКлиент.ПроверитьКонтрольныеСоотношения(ЭтотОбъект, ОбработкаКС);
	КонецЕсли;
	
	Если НЕ ПечатьНаСервере(ВидПечати) Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ЭтотОбъект, ВидПечати, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	СтруктураРеквизитовФормы.мРежимПечати = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(ВидПечати)
	
	// Запомним текущий раздел и страницу, чтобы к ним вернутся
	НаимТекущегоРаздела = СтруктураРеквизитовФормы.НаимТекущегоРаздела;
	НомерТекущейСтраницы = СтруктураРеквизитовФормы.НомерТекущейСтраницы;
	
	Если НЕ РегламентированнаяОтчетность.ПринтерДоступен() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		
		Сообщение.Текст = НСтр("ru='Перед формированием печатных форм необходимо определить в системе принтер и задать его в качестве используемого по умолчанию!'");
		
		Сообщение.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(мДеревоВыбранныхСтраниц) <> Тип("ДанныеФормыДерево") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	СтруктураРеквизитовФормы.мПечатныеФормы.Очистить();
	СтруктураРеквизитовФормы.мРежимПечати = Истина;
	
	
	СохранитьДанныеРаздела(СтруктураРеквизитовФормы.НаимТекущегоРаздела, Ложь, Ложь);
	
	Если СтруктураРеквизитовФормы.НужноРассчитатьОтчетНаСервере Тогда
		РасчетНаСервере();
	КонецЕсли; 
	
	сохрТаблДок = ТабличныйДокумент.ПолучитьОбласть();
	
	СтрПоля = "ПолеСверху, ПолеСправа, ПолеСнизу, ПолеСлева";
	ВремПоля = Новый Структура(СтрПоля);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	
	ВывестиМакетВТаблДокНаСервере("Титульный", 0);
	
	ОбщиеРеквизитыРазделов = ПолучитьОбщиеРеквизитыСТитульногоЛиста();
	
	Для Каждого СтрокаУровня1 Из мДеревоВыбранныхСтраниц.ПолучитьЭлементы() Цикл
		
		Если СтрокаУровня1.ВыводНаПечать = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НаименованиеЛиста",  СтрЗаменить(СтрокаУровня1.Представление, Символы.ПС, " "));
		СтруктураПараметров.Вставить("ОриентацияЛиста",    СтрокаУровня1.ОриентацияСтраницы);
		СтруктураПараметров.Вставить("ИмяСтраницы",        СтрокаУровня1.ИмяСтраницы);
		СтруктураПараметров.Вставить("ИмяОбластиТаблПоля", СтрокаУровня1.ИмяОбластиТабличногоПоля);
		СтруктураПараметров.Вставить("ВидПечати",          ВидПечати);
		СтруктураПараметров.Вставить("НомСтр", 				1);
		СтруктураПараметров.Вставить("Количество",          1);
		
		Если НЕ мСтруктураМногостраничныхРазделов.Свойство(СтрокаУровня1.ИмяСтраницы) Тогда
			
			ВывестиМакетВТаблДокНаСервере(СтрокаУровня1.ИмяСтраницы, 0);
			ВывестиНаПечатьЛист(СтруктураПараметров, ОбщиеРеквизитыРазделов, СтрПоля);
			
		Иначе
			
			СтруктураПараметров.Вставить("ИмяСтраницыПанели", СтрокаУровня1.ИмяСтраницы);
			
			ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметров, ОбщиеРеквизитыРазделов);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Возвращаем текущий раздел и страницу
	ВывестиМакетВТаблДокНаСервере(НаимТекущегоРаздела, НомерТекущейСтраницы);
	
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(сохрТаблДок);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
		
	РегламентированнаяОтчетностьКлиентСервер.ПроставлениеНомеровЛистов(ЭтотОбъект, , СтруктураРеквизитовФормы.СписокПечатаемыхЛистов);
	
	КопироватьДанныеФормы(мДеревоВыбранныхСтраниц, мДеревоСтраницОтчета);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ВывестиНаПечатьЛист(ПараметрыПечати, ОбщиеРеквизитыРазделов, СтрПоля = Неопределено)
	
	СоответствиеРазделовМакетам = Новый Соответствие;
	
	СоответствиеРазделовМакетам.Вставить("Титульный",         "МЧБ_2018Кв1_Титульный");
	СоответствиеРазделовМакетам.Вставить("Раздел1",           "МЧБ_2018Кв1_Раздел1");
	СоответствиеРазделовМакетам.Вставить("Раздел2",           "МЧБ_2018Кв1_Раздел2");
	СоответствиеРазделовМакетам.Вставить("ЛистА",             "МЧБ_2018Кв1_ЛистА");
	СоответствиеРазделовМакетам.Вставить("ЛистБ",             "МЧБ_2018Кв1_ЛистБ");
	СоответствиеРазделовМакетам.Вставить("ЛистВ",             "МЧБ_2018Кв1_ЛистВ");
	СоответствиеРазделовМакетам.Вставить("ЛистГ",             "МЧБ_2018Кв1_ЛистГ");
	СоответствиеРазделовМакетам.Вставить("ЛистД1",            "МЧБ_2018Кв1_ЛистД1");
	СоответствиеРазделовМакетам.Вставить("ЛистД2",            "МЧБ_2018Кв1_ЛистД2");
	СоответствиеРазделовМакетам.Вставить("ЛистЕ1",            "МЧБ_2018Кв1_ЛистЕ1");
	СоответствиеРазделовМакетам.Вставить("ЛистЕ2",            "МЧБ_2018Кв1_ЛистЕ2");
	СоответствиеРазделовМакетам.Вставить("ЛистЖ",             "МЧБ_2018Кв1_ЛистЖ");
	СоответствиеРазделовМакетам.Вставить("ЛистЗ",             "МЧБ_2018Кв1_ЛистЗ");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение",  "МЧБ_2018Кв1_ЛистЗПродолжение");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение2", "МЧБ_2018Кв1_ЛистЗПродолжение2");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение3", "МЧБ_2018Кв1_ЛистЗПродолжение3");
	СоответствиеРазделовМакетам.Вставить("ЛистЗПродолжение4", "МЧБ_2018Кв1_ЛистЗПродолжение4");
	СоответствиеРазделовМакетам.Вставить("ЛистИ",             "МЧБ_2018Кв1_ЛистИ");
	СоответствиеРазделовМакетам.Вставить("ЛистИПродолжение",  "МЧБ_2018Кв1_ЛистИПродолжение");
	СоответствиеРазделовМакетам.Вставить("РасчетДоходаОтПродажиНедвижимости",             "МЧБ_2018Кв1_РасчетДоходаОтПродажиНедвижимости");
	
	МЧБРаздела = СоответствиеРазделовМакетам[ПараметрыПечати.ИмяСтраницы];
	
	МакетМЧБ = ОтчетОбъект().ПолучитьМакет(МЧБРаздела);
	МакетМЧБ.ПолеСверху = 5;
	МакетМЧБ.ПолеСправа = 5;
	МакетМЧБ.ПолеСнизу = 5;
	МакетМЧБ.ПолеСлева = 5;
	
	ВремПоля = Новый Структура(СтрПоля);
	
	//Специальный алгоритм для многострочных разделов
	//Определение: является ли раздел многострочным 
	ИдГруппы = ОпределитьИдМногострочногоРазделаПоАктивнойСтраницеНаСервере(ПараметрыПечати.ИмяСтраницы);
	
	Если ИдГруппы <> Неопределено Тогда
		
		ИсхКолвоСтрокБлока = 0;
		
		//определение исходного количества строк на листе МЧБ
		Если ПараметрыПечати.ИмяСтраницы = "ЛистА" Или ПараметрыПечати.ИмяСтраницы = "РасчетДоходаОтПродажиНедвижимости" Тогда
			ИсхКолвоСтрокБлока = 3;
		ИначеЕсли ПараметрыПечати.ИмяСтраницы = "ЛистБ" Тогда
			ИсхКолвоСтрокБлока = 2;
		КонецЕсли;
		
		СохрТабличныйДокумент = Новый ТабличныйДокумент;
		СохрТабличныйДокумент.Вывести(ТабличныйДокумент);
		
		ТекКолвоСтрокБлока = ЭтотОбъект[мСтруктураМногострочныхРазделов[ИдГруппы]].Количество();
		Если ТекКолвоСтрокБлока > ИсхКолвоСтрокБлока И ИсхКолвоСтрокБлока > 0 Тогда
			//Добавляли строки - значит будут доп. листы МЧБ
			//Определение общего количества листов МЧБ
			КолвоЛистовМЧБ = Цел(ТекКолвоСтрокБлока / ИсхКолвоСтрокБлока);
			КолвоСтрокНаПоследнемЛисте = ТекКолвоСтрокБлока % ИсхКолвоСтрокБлока;
			Если КолвоСтрокНаПоследнемЛисте <> 0 Тогда
				КолвоЛистовМЧБ = КолвоЛистовМЧБ + 1;	
			КонецЕсли;
			
			//заполнение строки имен показателей (для проверки перед переименованием)
			СтрИменаПоказателей = "";
			
			Колонки = ДанныеФормыВЗначение(ЭтотОбъект[мСтруктураМногострочныхРазделов[ИдГруппы]], Тип("ТаблицаЗначений")).Колонки;
			
			Для каждого КолонкаСтруктуры Из Колонки Цикл
				СтрИменаПоказателей = СтрИменаПоказателей + КолонкаСтруктуры.Имя;
			КонецЦикла;
			
			//Заполнение списка листов МЧБ
			СписокЛистовМЧБ = Новый СписокЗначений;
			Для Сч = 1 По КолвоЛистовМЧБ Цикл
				//переименование (начиная со второго листа)
				Если Сч > 1 Тогда
					СписокОчищаемыхОбластей = Новый Массив;
					СписокОбластейПереименования = Новый СписокЗначений;
					Для каждого ТекущаяОбласть Из МакетМЧБ.Области Цикл
						ИмяЯчейки = ТекущаяОбласть.Имя;
						
						Если СтрДлина(ИмяЯчейки) < 13 ИЛИ СтрНайти(СтрИменаПоказателей, Лев(ИмяЯчейки, 13)) = 0 Тогда
							//проверка на вхождение в данную многострочную часть
							Продолжить;
						КонецЕсли;
						
						//определение и обрасывание НомерЯчейки
						ПоказательИНомерСтрокиСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Истина); // ВМЕСТЕ с разделителем
						ПоказательИНомерСтроки = Лев(ПоказательИНомерСтрокиСРазделителем,СтрДлина(ПоказательИНомерСтрокиСРазделителем) - 1);
						НомерЯчейки = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ИмяЯчейки, Ложь);
						//определение СмысловаяЧасть и ТекущийСчетчик
						СмысловаяЧастьСРазделителем = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Истина); // ВМЕСТЕ с разделителем
						СмысловаяЧасть = Лев(СмысловаяЧастьСРазделителем,СтрДлина(СмысловаяЧастьСРазделителем) - 1);
						ТекущийСчетчик = РегламентированнаяОтчетностьКлиентСервер.ПолучитьСмысловуюЧастьИмениЯчейки(ПоказательИНомерСтроки, Ложь);
						
						СмысловаяЧастьСРазделителем = ?(ЗначениеЗаполнено(СмысловаяЧастьСРазделителем),СмысловаяЧастьСРазделителем, ПоказательИНомерСтрокиСРазделителем);
						СмысловаяЧасть = ?(ЗначениеЗаполнено(СмысловаяЧасть),СмысловаяЧасть, ПоказательИНомерСтроки);
						ТекущийСчетчик = ?(ЗначениеЗаполнено(ТекущийСчетчик),ТекущийСчетчик, НомерЯчейки);
						
						//Окончательная проверка на вхождение в данную многострочную часть
						Если СтрНайти(СтрИменаПоказателей,СмысловаяЧасть) = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						НовыйСчетчик = Число(ТекущийСчетчик) + ИсхКолвоСтрокБлока;
						Если НовыйСчетчик > ТекКолвоСтрокБлока Тогда
							//очищение происходит после этого цикла
							СписокОчищаемыхОбластей.Добавить(ТекущаяОбласть);
							Продолжить;
						КонецЕсли;
						
						//Подготовка к переименованию
						//заполнение списка: значение - область, представление - будущее имя
						СписокОбластейПереименования.Добавить(ТекущаяОбласть, СмысловаяЧасть + "_" + НовыйСчетчик + "_" + НомерЯчейки);
					КонецЦикла;
					
					//Очищение
					Для каждого ОбластьСписка Из СписокОчищаемыхОбластей Цикл
						ОбластьСписка.Имя = "";
						ОбластьСписка.Текст = "-";
					КонецЦикла;
					
					//Переименование
					Для каждого ЭлСпискаОбластей Из СписокОбластейПереименования Цикл
						ЭлСпискаОбластей.Значение.Имя = ЭлСпискаОбластей.Представление;
					КонецЦикла;
					
				КонецЕсли; 
				//переименование
				//
				СписокЛистовМЧБ.Добавить(МакетМЧБ.ПолучитьОбласть());
			КонецЦикла;
			
			Для каждого элЛистМЧБ Из СписокЛистовМЧБ Цикл
				
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(СохрТабличныйДокумент);
				
				ЛистМЧБ = элЛистМЧБ.Значение;
				
				ЗаполнитьМакетМЧБ(ПараметрыПечати, ЛистМЧБ, ОбщиеРеквизитыРазделов);
				
				Если СписокЛистовМЧБ.Индекс(элЛистМЧБ)<СписокЛистовМЧБ.Количество() - 1 Тогда
					//Выводится не последний лист многострочной серии листов МЧБ
					//Необходимо обнулить итоговые показатели
					ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ЛистМЧБ);
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
				ТабличныйДокумент.Очистить();
				ТабличныйДокумент.Вывести(ЛистМЧБ);
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ЛистМЧБ, СтрПоля, "Макет");
				
				РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтотОбъект.Заголовок, ПараметрыПечати, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
				
				ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ВремПоля, СтрПоля);
			КонецЦикла;
			Возврат;
			
			
			//Не добавляли строки - продолжение выполнения
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьМакетМЧБ(ПараметрыПечати, МакетМЧБ, ОбщиеРеквизитыРазделов);
	
	ЗаполнитьЗначенияСвойств(ВремПоля, ТабличныйДокумент, СтрПоля);
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(МакетМЧБ);
	ЗаполнитьЗначенияСвойств(ТабличныйДокумент, МакетМЧБ, СтрПоля, "Макет");
	
	РегламентированнаяОтчетность.ВывестиНаПечатьЛистОбщая(ЭтотОбъект.Заголовок, ПараметрыПечати, ТабличныйДокумент, СтруктураРеквизитовФормы.мПечатныеФормы);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиНаПечатьДополнительныеСтраницы(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов)
	Перем ИмяСтраницы;
	Перем ТаблицаСтраницРаздела;
	
	СтруктураПараметровСтраницы.Свойство("ИмяСтраницыПанели", ИмяСтраницы);
	
	Если Не мСтруктураМногостраничныхРазделов.Свойство(ИмяСтраницы, ТаблицаСтраницРаздела) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСтраницРаздела = ЭтотОбъект[ТаблицаСтраницРаздела];
	СтруктураПараметровСтраницы.Вставить("Количество", ТаблицаСтраницРаздела.Количество());
	Для Каждого Страница Из ТаблицаСтраницРаздела Цикл
		// выводим на печать каждую страницу многостраничного раздела
		ТекущийИндекс = ТаблицаСтраницРаздела.Индекс(Страница);
		СохрАктивнаяСтраница = ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница;
		ВывестиМакетВТаблДокНаСервере(ИмяСтраницы, ТекущийИндекс + 1);
		ТаблицаСтраницРаздела[ТекущийИндекс].АктивнаяСтраница = СохрАктивнаяСтраница;
		СтруктураПараметровСтраницы.Вставить("НомСтр", ТекущийИндекс + 1);
		ВывестиНаПечатьЛист(СтруктураПараметровСтраницы, ОбщиеРеквизитыРазделов);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМакетМЧБ(Параметры, МакетМЧБ, ОбщиеРеквизитыРазделов)
	
	Если МакетМЧБ.Области.Найти("ИНН") <> Неопределено Тогда
		МакетМЧБ.Области.ИНН.Текст = ОбщиеРеквизитыРазделов.СтрИНН;
	КонецЕсли;
	
	Если МакетМЧБ.Области.Найти("Фамилия") <> Неопределено Тогда
		МакетМЧБ.Области.Фамилия.Текст = ОбщиеРеквизитыРазделов.СтрФамилия;
	КонецЕсли;
	Если МакетМЧБ.Области.Найти("ИнициалИмя") <> Неопределено Тогда
		МакетМЧБ.Области.ИнициалИмя.Текст = Лев(СокрЛП(ОбщиеРеквизитыРазделов.СтрИмя),1);
	КонецЕсли; 
	Если МакетМЧБ.Области.Найти("ИнициалОтчество") <> Неопределено Тогда
		МакетМЧБ.Области.ИнициалОтчество.Текст = Лев(СокрЛП(ОбщиеРеквизитыРазделов.СтрОтчество),1);
	КонецЕсли; 
	
	Если МакетМЧБ.Области.Найти("ДатаПодписи1") <> Неопределено Тогда
		Для Счетчик = 1 По 8 Цикл
			МакетМЧБ.Области["ДатаПодписи" + Счетчик].Текст = ОбщиеРеквизитыРазделов.ДатаПодписи[Счетчик - 1];
		КонецЦикла; 
	КонецЕсли;
	
	// Аккуратно переносим значения из табличного документа в макет МЧБ
	ИсходныйМакет = ТабличныйДокумент;
	
	Для Каждого Область Из ИсходныйМакет.Области Цикл
		
		Если Область.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник ИЛИ НЕ Область.СодержитЗначение Тогда
			Продолжить;
		КонецЕсли; 
		
		ИмяОбластиМЧБ = Область.Имя; // По умолчанию имена областей в МЧБ и в макете заполнения совпадают
		
		// Сначала обработаем нестандартные ситуации определеня значений
		Если Параметры.ИмяСтраницы = "Титульный" И Область.Имя = "МестоРождения" Тогда 
			
			ОбластьНазначения = МакетМЧБ.Области.Найти("МестоРождения");
			Если ОбластьНазначения <> Неопределено Тогда
				ОбластьНазначения.Текст = ОбщиеРеквизитыРазделов.МестоРождения.МестоРождения;
			КонецЕсли; 
			
			ОбластьНазначения = МакетМЧБ.Области.Найти("МестоРождения2");
			Если ОбластьНазначения <> Неопределено Тогда
				ОбластьНазначения.Текст = ОбщиеРеквизитыРазделов.МестоРождения.МестоРождения2;
			КонецЕсли; 
			
			Продолжить;
			
		ИначеЕсли Параметры.ИмяСтраницы = "ЛистД1" И Лев(Область.Имя, 15) = "П000700001100_1" Тогда
			
			Если НЕ ЗначениеЗаполнено(ИсходныйМакет.Области.П000700001100_1.Значение) И НЕ ЗначениеЗаполнено(ИсходныйМакет.Области.П000700001100_3.Значение)  Тогда
				ЗначениеОбласти = ""; // Доля с 2014 года не указывается
			Иначе
				ЗначениеОбласти = СокрЛП(ИсходныйМакет.Области.П000700001100_1.Значение) + "/" + СокрЛП(ИсходныйМакет.Области.П000700001100_3.Значение);
			КонецЕсли; 
			ИмяОбластиМЧБ = "П000700001100";
			
		ИначеЕсли Параметры.ИмяСтраницы = "ЛистД1" И (Область.Имя = "П000700001051" Или Область.Имя = "П000700001052") Тогда
			
			// В исходном макете значение в одной ячейке, но в макете назначения строка разбита на несколько
			Если Область.Имя = "П000700001051" Тогда
				МаксимальноеЧислоСтрокВМакете = 2;
			ИначеЕсли Область.Имя = "П000700001052" Тогда
				МаксимальноеЧислоСтрокВМакете = 5;
			Иначе
				МаксимальноеЧислоСтрокВМакете = 1;
			КонецЕсли;
			
			ЗначениеОбласти = СокрЛП(Область.Значение);
			Для НомерСтроки = 1 По Мин(СтрЧислоСтрок(ЗначениеОбласти), МаксимальноеЧислоСтрокВМакете) Цикл
				ОбластьНазначения = МакетМЧБ.Области.Найти(СтрШаблон(Область.Имя + "_%1", НомерСтроки));
				Если ОбластьНазначения <> Неопределено Тогда
					ОбластьНазначения.Текст = СтрПолучитьСтроку(ЗначениеОбласти, НомерСтроки);
				КонецЕсли;
			КонецЦикла;
			
			Продолжить;
			
		ИначеЕсли Параметры.ИмяСтраницы = "ЛистВ" И Лев(Область.Имя, 13) = "П000500001150" Тогда
			
			ЗначениеОбласти = ?(Область.Значение = 0, "", Область.Значение);
			
		ИначеЕсли Параметры.ИмяСтраницы = "РасчетДоходаОтПродажиНедвижимости" И Лев(Область.Имя, 13) = "П001900001010" Тогда
			
			// В исходном макете значение в одной ячейке, но в макете назначения строка разбита на несколько
			МаксимальноеЧислоСтрокВМакете = 2;
			
			ЗначениеОбласти = СокрЛП(Область.Значение);
			Для НомерСтроки = 1 По Мин(СтрЧислоСтрок(ЗначениеОбласти), МаксимальноеЧислоСтрокВМакете) Цикл
				ОбластьНазначения = МакетМЧБ.Области.Найти(СтрШаблон(Область.Имя + "_%1", НомерСтроки));
				Если ОбластьНазначения <> Неопределено Тогда
					ОбластьНазначения.Текст = СтрПолучитьСтроку(ЗначениеОбласти, НомерСтроки);
				КонецЕсли;
			КонецЦикла;
			
			Продолжить;
			
		Иначе
			
			// Для стандартных значений просто получим значение обсласти
			ЗначениеОбласти = Область.ТипЗначения.ПривестиЗначение(Область.Значение);
			
		КонецЕсли; 
		
		ТипЗначенияОбласти = ТипЗнч(ЗначениеОбласти);
		
		ОбластьНазначения = МакетМЧБ.Области.Найти(ИмяОбластиМЧБ);
		Если ОбластьНазначения <> Неопределено Тогда
			
			Если ТипЗначенияОбласти = Тип("Число") Тогда
				
				// выводим число с учетом разрядности
				СтрокаФормата = "ЧЦ=" +  Область.ТипЗначения.КвалификаторыЧисла.Разрядность + 
								"; ЧДЦ=" + Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти + 
								"; ЧГ=; ЧРД=.; ЧН=0" + 
								?(Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти = 0, 
											"", 
											Лев(".00000000", Область.ТипЗначения.КвалификаторыЧисла.РазрядностьДробнойЧасти + 1));
				ОбластьНазначения.Текст = Формат(ЗначениеОбласти, СтрокаФормата); 
				
			ИначеЕсли ТипЗначенияОбласти = Тип("Дата") Тогда
				
				ОбластьНазначения.Текст = Формат(ЗначениеОбласти, "ДФ=дд.ММ.гггг"); 
				
			Иначе
				
				ОбластьНазначения.Текст = ЗначениеОбласти; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбщиеРеквизитыСТитульногоЛиста()
	
	МассивИНН         = Новый Массив(12);
	МассивКПП         = Новый Массив(9);
	МассивДатаПодписи = Новый Массив(8);
	МассивФамилия     = Новый Массив(32);
	МассивИмя         = Новый Массив(32);
	МассивОтчество    = Новый Массив(32);
	
	ИсходныйМакет = ТабличныйДокумент;
	
	Область = ИсходныйМакет.Области.Найти("ИНН");
	СтрИНН = "";
	Если НЕ Область = Неопределено Тогда
		
		СтрИНН = Область.Значение;
		
		Если СтрДлина(СтрИНН) = 10 Тогда
			СтрИНН = СтрИНН + "--";
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрИНН) Цикл
			
			МассивИНН[Ном - 1] = Сред(СтрИНН, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Область = ИсходныйМакет.Области.Найти("ДатаПодписи");
	
	Если НЕ Область = Неопределено Тогда
		
		Если ЗначениеЗаполнено(Область.Значение) Тогда
			СтрДатаПодписи = Лев(СтрЗаменить(Область.Значение, ".", ""), 8);
		Иначе
			// Если дата подписи не заполнена подставим пустую строку соответствующей длины
			СтрДатаПодписи = "        ";
		КонецЕсли;
		
		Для Ном = 1 По СтрДлина(СтрДатаПодписи) Цикл
			
			МассивДатаПодписи[Ном - 1] = Сред(СтрДатаПодписи, Ном, 1);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = ИсходныйМакет.Области.Найти("Фамилия");
	СтрФамилия = "";
	Если НЕ Область = Неопределено Тогда
		СтрФамилия = Область.Значение;
		ДлинаФамилии = СтрДлина(СтрФамилия);
		
		Для Ном = 1 По Мин(ДлинаФамилии, МассивФамилия.Количество()) Цикл
			
			МассивФамилия[Ном - 1] = Сред(СтрФамилия, Ном, 1);
			
		КонецЦикла;
		
		Для Ном = Макс(ДлинаФамилии, 1) По МассивФамилия.Количество() Цикл
			
			МассивФамилия[Ном - 1] = "-";
			
		КонецЦикла;
		
	КонецЕсли;

	Область = ИсходныйМакет.Области.Найти("Имя");
	СтрИмя = "";
	Если НЕ Область = Неопределено Тогда
		СтрИмя = Область.Значение;
		ДлинаИмени = СтрДлина(СтрИмя);
		Для Ном = 1 По Мин(ДлинаИмени, МассивИмя.Количество()) Цикл
			
			МассивИмя[Ном - 1] = Сред(СтрИмя, Ном, 1);
			
		КонецЦикла;
		
		Для Ном = Макс(ДлинаИмени, 1) По МассивИмя.Количество() Цикл
			
			МассивИмя[Ном - 1] = "-";
			
		КонецЦикла;
		
	КонецЕсли;
	
	Область = ИсходныйМакет.Области.Найти("Отчество");
	СтрОтчество = "";
	Если НЕ Область = Неопределено Тогда
		СтрОтчество = Область.Значение;
		ДлинаОтчества = СтрДлина(СтрОтчество);
		Для Ном = 1 По Мин(ДлинаОтчества, МассивОтчество.Количество()) Цикл
			
			МассивОтчество[Ном - 1] = Сред(СтрОтчество, Ном, 1);
			
		КонецЦикла;
		
		Для Ном = Макс(ДлинаОтчества, 1) По МассивОтчество.Количество() Цикл
			
			МассивОтчество[Ном - 1] = "-";
			
		КонецЦикла;
		
	КонецЕсли;
	
	//Место рождения
	Область = ИсходныйМакет.Области.Найти("МестоРождения");
	МестоРожденияПоСловам = СтрРазделить(Область.Значение, " ", Ложь);
	
	ДлинаВСимволах = 0;
	МестоРожденияВ21Строки = Новый Структура("МестоРождения, МестоРождения2", "", "");
	Для Каждого Слово Из МестоРожденияПоСловам Цикл
		
		ДлинаВСимволах = ДлинаВСимволах + СтрДлина(Слово);
		
		Если ДлинаВСимволах > 18 Тогда
			
			МестоРожденияВ21Строки.МестоРождения2 = МестоРожденияВ21Строки.МестоРождения2+ Слово+ " ";
			
		Иначе
			
			МестоРожденияВ21Строки.МестоРождения = МестоРожденияВ21Строки.МестоРождения + Слово + " ";
			
		КонецЕсли;
		
	КонецЦикла;

	МестоРожденияВ21Строки.МестоРождения = СокрЛП(МестоРожденияВ21Строки.МестоРождения);
	МестоРожденияВ21Строки.МестоРождения2 = СокрЛП(МестоРожденияВ21Строки.МестоРождения2);
	
	ОбщиеРеквизитыРазделов = Новый Структура;
	
	ОбщиеРеквизитыРазделов.Вставить("ИНН", МассивИНН);
	ОбщиеРеквизитыРазделов.Вставить("КПП", МассивКПП);
	ОбщиеРеквизитыРазделов.Вставить("ДатаПодписи", МассивДатаПодписи);
	ОбщиеРеквизитыРазделов.Вставить("Фамилия", МассивФамилия);
	ОбщиеРеквизитыРазделов.Вставить("Имя", МассивИмя);
	ОбщиеРеквизитыРазделов.Вставить("Отчество", МассивОтчество);
	ОбщиеРеквизитыРазделов.Вставить("СтрИНН", СтрИНН);
	
	ОбщиеРеквизитыРазделов.Вставить("СтрФамилия", СтрФамилия);
	ОбщиеРеквизитыРазделов.Вставить("СтрИмя", СтрИмя);
	ОбщиеРеквизитыРазделов.Вставить("СтрОтчество", СтрОтчество);
	ОбщиеРеквизитыРазделов.Вставить("МестоРождения", МестоРожденияВ21Строки);
	Возврат ОбщиеРеквизитыРазделов;
	
КонецФункции

&НаСервере
Процедура ОбнулитьИтоговыеПоказателиНаЛистеМЧБ(ТаблДок)
	
	ОбластьИтоговыеПоказатели = ТаблДок.Области.Найти("ИтоговыеПоказатели");
	Если ОбластьИтоговыеПоказатели <> Неопределено Тогда
		
		ОбластьИтоговыеПоказателиВерх = ОбластьИтоговыеПоказатели.Верх;
		ОбластьИтоговыеПоказателиНиз = ОбластьИтоговыеПоказатели.Низ;
		
		Для Каждого Обл Из ТаблДок.Области Цикл
			Если Обл.Верх >= ОбластьИтоговыеПоказателиВерх
				И Обл.Низ <= ОбластьИтоговыеПоказателиНиз
				И Обл.ГраницаСлева.ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Точечная
				Тогда
				Обл.Текст = "-";
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ДЕНЬГИ
	Модифицированность = Истина;
	// Конец ДЕНЬГИ
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоРазделовПослеавтоЗаполнения()

	СтруктураРеквизитовФормы.ВыводитьСтраницуВТаблДокНаСервере = Ложь;
	
	РегламентированнаяОтчетностьКлиент.ОбновитьДеревоРазделовВФормеОтчета(ЭтотОбъект);
	
	Если Элементы.РазделыОтчета.ТекущиеДанные <> Неопределено И Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя() <> Неопределено Тогда
		Элементы.РазделыОтчета.ТекущаяСтрока = Элементы.РазделыОтчета.ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьАвтоНаСервере()
	
	// ДЕНЬГИ
	Возврат Ложь;
	// Конец ДЕНЬГИ
	
КонецФункции

&НаСервере
Функция СведенияМногостраничногоРазделаВТаблице(ИмяСтруктурыДанных)
	
	ОписаниеТиповНеопределено = Новый ОписаниеТипов("Неопределено");
	
	ТаблицаЗначенийСДанными = ДанныеФормыВЗначение(ЭтотОбъект[ИмяСтруктурыДанных], Тип("ТаблицаЗначений"));
	
	Если ТаблицаЗначенийСДанными <> Неопределено Тогда
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("Данные") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("Данные");
			ТаблицаЗначенийСДанными.Колонки.Добавить("Данные", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				СтрокаТаблицыЗначений.Данные = ЭтотОбъект[ИмяСтруктурыДанных][Ном].Данные;
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
		Если ТаблицаЗначенийСДанными.Колонки.Найти("ДанныеДопСтрок") <> Неопределено Тогда
			ТаблицаЗначенийСДанными.Колонки.Удалить("ДанныеДопСтрок");
			ТаблицаЗначенийСДанными.Колонки.Добавить("ДанныеДопСтрок", ОписаниеТиповНеопределено);
			
			Ном = 0;
			Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначенийСДанными Цикл
				
				Если ЭтотОбъект[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок.Количество() > 0
				   И ЭтотОбъект[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Представление = "ДанныеФормыКоллекцияТаблицаДопСтрокРаздела" Тогда
					СтрокаТаблицыЗначений.ДанныеДопСтрок = ДанныеФормыВЗначение(ЭтотОбъект[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок[0].Значение, Тип("ТаблицаЗначений"));
					
					Ном = Ном + 1;
					Продолжить;
				КонецЕсли;
				
				СтруктураДанныхДопСтрок = Новый Структура;
				
				Для Каждого ЭлСтруктуры Из ЭтотОбъект[ИмяСтруктурыДанных][Ном].ДанныеДопСтрок Цикл
					СтруктураДанныхДопСтрок.Вставить(ДанныеФормыВЗначение(ЭлСтруктуры.Значение, Тип("ТаблицаЗначений")));
				КонецЦикла;
				
				СтрокаТаблицыЗначений.ДанныеДопСтрок = СтруктураДанныхДопСтрок;
				
				Ном = Ном + 1;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаЗначенийСДанными;
	
КонецФункции

&НаСервере
Процедура ВосстановитьМногостраничныйРазделИзТаблицы(ИмяРаздела, ТаблицаСДанными)
	
	ИмяРеквизитаФормы = Неопределено;
	Если НЕ мСтруктураМногостраничныхРазделов.Свойство(ИмяРаздела, ИмяРеквизитаФормы) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитФормы = ЭтотОбъект[ИмяРеквизитаФормы];
	ЗначениеВДанныеФормы(ТаблицаСДанными, РеквизитФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Контейнер = ПолучитьИзВременногоХранилища(СтруктураРеквизитовФормы.АдресВоВременномХранилище);
	
	Если ТипЗнч(Контейнер) = Тип("Структура") Тогда
		Для Каждого ЭлементСтруктуры Из Контейнер Цикл
			ИмяЭлемента = ЭлементСтруктуры.Ключ;
			
			Если мСтруктураМногостраничныхРазделов.Свойство(ИмяЭлемента) Тогда
				ВосстановитьМногостраничныйРазделИзТаблицы(ИмяЭлемента, ЭлементСтруктуры.Значение);
			Иначе
				ЭтотОбъект["СтруктураДанных" + ИмяЭлемента] = ЭлементСтруктуры.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РасчетНаСервере();
	
	ПодготовитьДанныеРаздела2(ЭтотОбъект);
	
	СобратьДанныеВРаздел1Сервер();
	
	// Обновляем дерево разделов
	СформироватьДеревоРазделовОтчета(ЭтотОбъект);
	
	ВывестиМакетВТаблДокНаСервере(СтруктураРеквизитовФормы.НаимТекущегоРаздела, 1);
	
	// Активизируем строку раздела в дереве
	Для Каждого СтрокаРаздела Из РазделыОтчета.ПолучитьЭлементы() Цикл
		Если СтрокаРаздела.КолонкаРазделыОтчетаСокрНаим = СтруктураРеквизитовФормы.НаимТекущегоРаздела Тогда
			Элементы.РазделыОтчета.ТекущаяСтрока = СтрокаРаздела.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли; 
	КонецЦикла; 
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			
			ОбновитьДеревоРазделовПослеавтоЗаполнения();
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			Возврат;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(СтруктураРеквизитовФормы.ИдентификаторЗадания) Тогда 
		ЗагрузитьПодготовленныеДанные();
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПервыйПодчиненныйУзелСЗаполненнымКлючом(Родитель)
	
	Для Каждого Стр из Родитель.Строки Цикл
		Если ЗначениеЗаполнено(Стр.Ключ) Тогда
			Возврат Стр;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаВозможностиВыгрузкиРегламентированногоОтчетаПередОтправкой(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьВКонтролирующийОрганЗавершение", ЭтотОбъект);
	ОнлайнСервисыРегламентированнойОтчетностиКлиент.ПередВыгрузкойРегламентированногоОтчета(ОписаниеОповещения, ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВКонтролирующийОрганЗавершение(Отказ, ДополнительныеПараметры) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ПриНажатииНаКнопкуОтправкиВКонтролирующийОрган(ЭтотОбъект, "ФНС");
	
КонецПроцедуры

&НаСервере
Функция СформироватьИдФайл(ПараметрыВыгрузки)
	
		Возврат ПараметрыВыгрузки.ПрефиксИмениФайлаВыгрузки
				+ "_" + ПараметрыВыгрузки.КодИФНС
				+ "_" + ПараметрыВыгрузки.КодИФНС
				// ДЕНЬГИ
				// Если ИНН не указан, нужно заполнять 12-ю нулями
				//+ "_" + СокрЛП(ПараметрыВыгрузки.ИННФЛ)
				+ "_" + ?(ПустаяСтрока(ПараметрыВыгрузки.ИННФЛ), "000000000000", СокрЛП(ПараметрыВыгрузки.ИННФЛ))
				// Конец ДЕНЬГИ
				+ "_" + Формат(ТекущаяДатаСеанса(), "ДФ=ггггММдд")
				+ "_" + Строка(Новый УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

#Область РасширенныйНалоговыйПериод

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьПоясненияКПериодуОтчета(Форма)
	
	Элементы = Форма.Элементы;
	СтруктураРеквизитовФормы = Форма.СтруктураРеквизитовФормы;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовФормы.Организация)
		И ЗначениеЗаполнено(СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета) Тогда
		ТекстПояснения = ТекстПоясненияРасширенныйНалоговыйПериод(
			СтруктураРеквизитовФормы.Организация,
			СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПояснения) Тогда
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Видимость = Истина;
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Заголовок = ТекстПояснения;
	Иначе
		Элементы.ПояснениеРасширенныйНалоговыйПериод.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстПоясненияРасширенныйНалоговыйПериод(Знач Организация, Знач КонецПериода)
	
	Возврат Отчеты.РегламентированныйОтчет3НДФЛ.ТекстПоясненияРасширенныйНалоговыйПериод(Организация, КонецПериода);
	
КонецФункции

#КонецОбласти


// ДЕНЬГИ

&НаСервереБезКонтекста
Процедура ОбновитьСсылкуОрганизации(СтруктураРеквизитовФормы, Знач СтруктураДанныхТитульный, Знач КодИФНС)

	СтруктураРеквизитовФормы.Организация =  Обработки.ПомощникЗаполнения3НДФЛ_2016.ПолучитьСсылкуНалогоплательщика(
					СтруктураДанныхТитульный.Фамилия,
					СтруктураДанныхТитульный.Имя,
					СтруктураДанныхТитульный.Отчество,
					СтруктураДанныхТитульный.ИНН,
					КодИФНС, "", Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, Неопределено);
	СтруктураРеквизитовФормы.НаимОрганизации = Строка(СтруктураРеквизитовФормы.Организация);

КонецПроцедуры


// Конец ДЕНЬГИ

#КонецОбласти