
//////////////////////////////////////////////////////////////////////////////////////////
// Интерфейс инструментов управления и работы с REST-провайдерами, использующих OAuth 2.0
// 
//////////////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс


// Открывает форму авторизации для заданного провайдера
//
//Параметры:
//	Провайдер - ПеречислениеСсылка.ТипыПровайдеровREST - Провайдер, у которого проверяется авторизация
//
Процедура ОткрытьФормуАвторизации(Провайдер, ОповещениеОЗакрытии = Неопределено) Экспорт
	
	Если Провайдер = Неопределено Тогда
		Провайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Провайдер", Провайдер);
	ОткрытьФорму("ОбщаяФорма.АвторизацияOAUTH", ПараметрыФормы, , Провайдер, , , ОповещениеОЗакрытии);
	
КонецПроцедуры

// Открывает форму авторизации для заданного провайдера
//
//Параметры:
//	Провайдер - ПеречислениеСсылка.ТипыПровайдеровREST - Провайдер, у которого проверяется авторизация
//
Процедура ОткрытьФормуОтменыАвторизации(Провайдер, ОповещениеОЗакрытии = Неопределено) Экспорт
	
	Если Провайдер = Неопределено Тогда
		Провайдер = RESTСлужебныйВызовСервера.ПровайдерИзПараметраСеанса();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтменаАвторизации", Истина);
	ПараметрыФормы.Вставить("Провайдер", Провайдер);
	ОткрытьФорму("ОбщаяФорма.АвторизацияOAUTH", ПараметрыФормы, , Провайдер, , , ОповещениеОЗакрытии);
	
КонецПроцедуры

// Возвращает значение параметра из строки URL
//
// Параметры:
//  URL			 - Строка - Обрабатываемый URL
//  ИмяПараметра - Строка - Имя требуемого параметра
// 
// Возвращаемое значение:
//  * Строка - Данные искомого параметра
//  * Неопределено - Если параметр в URL не найден
//
Функция ПолучитьЗначениеПараметраИзURL(Знач URL, Знач ИмяПараметра) Экспорт
	
	Ключ = Нрег(ИмяПараметра)+"=";
	Н = Найти(Нрег(URL), Ключ);
	Если Н = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Н = Н + СтрДлина(Ключ);
	Токен = Сред(URL, Н, СтрДлина(URL));
	
	Н = Найти(Токен, "&");	
	Токен = Сред(Токен, 1, Н-1);
	Возврат Токен;
	
КонецФункции

#КонецОбласти

