&НаКлиенте
Процедура УчетТоваров_ЗагрузитьЧекиИзНалоговойПосле(Команда)
	
    ЗагрузитьЧекиНаСервере(); 
	Сообщить("Данные загружены!");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЧекиНаСервере()
		
	//Можно ввести признак "Обработан", для тех чеков, у которых не заполнен QR, и которые уже обрабатывались ранее
	//чтобы не делать повторную проверку
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расход.Ссылка КАК Ссылка,
	|	Расход.QRКод КАК QRКод
	|ИЗ
	|	Документ.Расход КАК Расход
	|ГДЕ
	|	НЕ Расход.ПометкаУдаления
	|	И Расход.Проведен
	|	И НЕ Расход.УчетТоваров_ЗагруженИзНалоговой";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Сначала перенесем QR коды из комментариев, если таковые имеются
		Если НЕ ЗначениеЗаполнено(Выборка.QRКод) Тогда
			ПроверитьQRКодВКомментарииИПеренести(Выборка.Ссылка);				
		КонецЕсли;
		
		//Затем загрузим чеки
		Если НЕ ЗначениеЗаполнено(Выборка.Ссылка.QRКод) Тогда
			Продолжить;			
		КонецЕсли;     
		
		Документ = Выборка.Ссылка.ПолучитьОбъект();
		Документ.ЗагрузитьДанныеЧекаИзНалоговой();
	КонецЦикла;	                                   
			
КонецПроцедуры

&НаСервере
Процедура ПроверитьQRКодВКомментарииИПеренести(Ссылка)
	
	QRКод = "";
	
	Для Каждого Стр Из Ссылка.Расходы Цикл
		Если СтрНайти(Стр.КомментарийСтроки, "t=") > 0 Тогда
			QRКод = Стр.КомментарийСтроки;			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(QRКод) Тогда
		Документ = Ссылка.ПолучитьОбъект();
		Документ.QRКод = QRКод;
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры