
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РС.Шаблон,
	|	РС.Операция
	|ИЗ
	|	РегистрСведений.ОперацииШаблонов КАК РС
	|ГДЕ
	|	РС.Шаблон.Ссылка ЕСТЬ NULL
	|	ИЛИ РС.Операция.Ссылка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Шаблон) Или Не ЗначениеЗаполнено(Выборка.Операция) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
			Набор.Отбор.Шаблон.Установить(Выборка.Шаблон);
			Набор.Отбор.Операция.Установить(Выборка.Операция);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить записи операций шаблонов для шаблона ""%1"" и операции ""%2""
				|%3", Выборка.Шаблон, Выборка.Операция, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли